Repository: tarantool/doc
Catalog: locale/*/LC_MESSAGES/reference/reference_lua/box_null.po
Languages: ru

source: Constant `box.NULL`
ru: Константа `box.NULL`

source: There are some major problems with using Lua **nil** values in tables. For example: you can't correctly assess the length of a table that is not a sequence. (Learn more about data types in `Lua <https://www.lua.org/manual/5.1/manual.html#2.2>`__ and `LuaJIT <http://luajit.org/ext_ffi_semantics.html>`__.)
ru: Имеется целый ряд серьезных проблем при использовании значения **nil** из Lua в таблицах. Например: вы не можете корректно оценить длину таблицы, не являющейся последовательностью. (Узнайте больше о типах данных в `Lua <https://www.lua.org/manual/5.1/manual.html#2.2>`__ и `LuaJIT <http://luajit.org/ext_ffi_semantics.html>`__.)

source: **Example:**
ru: **Пример:**

source: The console output of ``t`` processes **nil** values in the middle and at the end of the table differently. This is due to undefined behavior.
ru: Вывод в консоль ``t`` обрабатывает значения **nil** в середине и в конце таблицы по-разному. Это вызвано неопределённым поведением.

source: Trying to find the length for sparse arrays in LuaJIT leads to another scenario of `undefined behavior <https://www.lua.org/manual/5.2/manual.html#3.4.6>`_.
ru: Попытка найти длину для разреженного массива в LuaJIT приводит к другому случаю `неопределённого поведения <https://www.lua.org/manual/5.2/manual.html#3.4.6>`_.

source: To avoid this problem, use Tarantool's ``box.NULL`` constant instead of **nil**. ``box.NULL`` is a placeholder for a **nil** value in tables to preserve a key without a value.
ru: Для избежания этой проблемы используйте имеющуюся в Tarantool константу ``box.NULL`` вместо значения **nil**. ``box.NULL`` является местозаполнителем для значения **nil** в таблицах с целью сохранения ключа без значения.

source: Using box.NULL
ru: Использование box.NULL

source: ``box.NULL`` is a value of the `cdata <http://luajit.org/ext_ffi_semantics.html>`__ type representing a NULL pointer. It is similar to ``msgpack.NULL``, ``json.NULL`` and ``yaml.NULL``. So it is some not **nil** value, even if it is a pointer to NULL.
ru: ``box.NULL`` является значением типа cdata, представляющим нулевой указатель (NULL pointer). Оно подобно ``msgpack.NULL``, ``json.NULL`` и ``yaml.NULL``. Таким образом, оно является некоторым не **nil** значением, даже если является указателем на NULL.

source: Use ``box.NULL`` only with capitalized NULL (``box.null`` is incorrect).
ru: Используйте ``box.NULL`` только с NULL, написанным заглавными буквами (``box.null`` является ошибкой).

source: Technically speaking, ``box.NULL`` equals to ``ffi.cast('void *', 0)``.
ru: Технически, ``box.NULL`` соответствует ``ffi.cast('void *', 0)``.

source: Notice that ``t[2]`` shows the same ``null`` output in both examples. However in this example ``t[2]`` and ``t[5]`` are of the cdata type, while in the previous example their type was **nil**.
ru: Заметьте, что ``t[2]`` демонстрирует один и тот же вывод ``null`` в обоих примерах. Однако, в данном примере ``t[2]`` и ``t[5]`` являются типом cdata, в то время как в предыдущем примере их тип был **nil**.

source: Avoid using implicit comparisons with nullable values when using ``box.NULL``. Due to `Lua behavior <https://www.lua.org/manual/5.1/manual.html#2.4.4>`_, returning anything except **false** or **nil** from a condition expression is considered as **true**. And, as it was mentioned earlier, ``box.NULL`` is a pointer by design.
ru: Избегайте использования неявных сравнений с обнуляемыми (nullable) значениями при использовании ``box.NULL``. В связи со `штатным поведением Lua <https://www.lua.org/manual/5.1/manual.html#2.4.4>`_, возвращение любого результата, кроме **false** (ложь) или **nil** (ничто), из выражения условия считается возвращением **true** (истина). Как и упоминалось ранее, ``box.NULL`` является указателем.

source: That is why the expression ``box.NULL`` will always be considered **true** in case it is used as a condition in a comparison. This means that the code
ru: Поэтому выражение ``box.NULL`` всегда будет расцениваться как **true** (истина) в случае использования в качестве условия в сравнении. Это означает, что код

source: will always execute the function ``func()`` (because the condition ``box.NULL`` will always be neither **false** nor **nil**).
ru: всегда будет выполнять функцию ``func()`` (потому, что условие ``box.NULL`` всегда будет не **false** (ложь) и не **nil** (ничто)).

source: Distinction of nil and `box.NULL`
ru: Различение nil и `box.NULL`

source: Use the expression ``if x == nil`` to check if the ``x`` is either a **nil** or a ``box.NULL``.
ru: Используйте выражение ``x == nil`` для проверки того, является ли ``x`` **nil** или ``box.NULL``.

source: To check whether ``x`` is a **nil** but not a ``box.NULL``, use the following condition expression:
ru: Для выяснения того, является ли ``x`` в действительности **nil**, но не ``box.NULL``, используйте следующее условие:

source: If it's **true**, then ``x`` is a **nil**, but not a ``box.NULL``.
ru: Если оно истинно (**true**), то ``x`` -- это **nil**, но не``box.NULL``.

source: You can use the following for ``box.NULL``:
ru: Вы можете использовать следующее выражение для ``box.NULL``:

source: If the expression above is **true**, then ``x`` is a ``box.NULL``.
ru: Если вышеуказанное выражение истинно (**true**), то ``x`` -- это ``box.NULL``.

source: By converting data to different formats (JSON, YAML, msgpack), you shall expect that it is possible that **nil** in sparse arrays will be converted to ``box.NULL``. And it is worth mentioning that such conversion might be unexpected (for example: by sending data via :ref:`net.box <net_box-module>` or by obtaining data from :ref:`spaces <box_space>` etc.).
ru: Конвертируя данные в различные форматы (JSON, YAML, msgpack), вы должны ожидать возможного преобразования всех **nil** в разреженных массивах в ``box.NULL``. Стоит ответить, что конвертация может происходить неожиданно (например: при отправке данных через :ref:`net.box <net_box-module>` или при получении данных из :ref:`спейсов <box_space>` и т.п.).

source: You must anticipate such behavior and use a proper condition expression. Use the explicit comparison ``x == nil`` for checking for NULL in nullable values. It will detect both **nil** and ``box.NULL``.
ru: Вы должны ожидать подобное поведение и использовать соответствующее выражение условия. Используйте явное сравнение ``x == nil`` для проверки на отсутствующее значение (NULL) в обнуляемых (nullable) переменных. Оно позволит обнаружить как **nil**, так и ``box.NULL``.
