Repository: tarantool/doc
Catalog: locale/*/LC_MESSAGES/reference/reference_lua/box_error.po
Languages: ru

source: Submodule `box.error`
ru: Вложенный модуль `box.error`

source: Overview
ru: Общие сведения

source: The ``box.error`` function is for raising an error. The difference between this function and Lua's built-in `error <https://www.lua.org/pil/8.3.html>`_ function is that when the error reaches the client, its error code is preserved. In contrast, a Lua error would always be presented to the client as :errcode:`ER_PROC_LUA`.
ru: Функция ``box.error`` предназначена для вызова ошибки. Разница между этой функцией и встроенной Lua-функцией `error <https://www.lua.org/pil/8.3.html>`_ в том, что когда клиент получает ошибку, код ошибки сохраняется. В отличие от этого, ошибки в Lua всегда передаются на клиент в виде :errcode:`ER_PROC_LUA`.

source: Index
ru: Указатель

source: Below is a list of all ``box.error`` functions.
ru: Ниже приведен перечень всех функций модуля ``box.error``.

source: Name
ru: Имя

source: Use
ru: Назначение

source: Throw an error
ru: Вызов ошибки

source: Get a description of the last error
ru: Получение описания последней ошибки

source: Clear the record of errors
ru: Очистка записи об ошибках

source: Create an error but do not throw
ru: Создание ошибки без выдачи

source: Set an error as ``box.error.last()``
ru: Запись ошибки в ``box.error.last()``

source: Return the previous error
ru: Возврат предыдущей ошибки

source: Set the previous error
ru: Установка предыдущей ошибки

source: Create a custom error type
ru: Создание пользовательского типа ошибок

source: When called with a Lua-table argument, the code and reason have any user-desired values. The result will be those values.
ru: При вызове с аргументом из Lua-таблицы значения параметров code и reason будут любыми по желанию пользователя. Результатом будут эти значения.

source: Parameters
ru: Параметры

source: description of an error, defined by user
ru: (строка) описание ошибки, задается пользователем

source: numeric code for this error, defined by user
ru: (целое число) числовой код ошибки, задается пользователем

source: When called without arguments, ``box.error()`` re-throws whatever the last error was.
ru: При вызове без аргументов ``box.error()`` повторно вызывает последнюю ошибку.

source: Emulate a request error, with text based on one of the pre-defined Tarantool errors defined in the file `errcode.h <https://github.com/tarantool/tarantool/blob/2.1/src/box/errcode.h>`_ in the source tree. Lua constants which correspond to those Tarantool errors are defined as members of ``box.error``, for example ``box.error.NO_SUCH_USER == 45``.
ru: Моделирование ошибки запроса с текстом на основе одной из ошибок Tarantool'а, заданных в файле `errcode.h <https://github.com/tarantool/tarantool/blob/2.1/src/box/errcode.h>`_ в исходном дереве. Lua-постоянные, которые соответствуют этим ошибкам в Tarantool'е, определяются как элементы ``box.error``, например ``box.error.NO_SUCH_USER == 45``.

source: number of a pre-defined error
ru: номер предварительно заданной ошибки

source: part of the message which will accompany the error
ru: часть сообщения, которое сопровождает ошибку

source: For example:
ru: Пример:

source: the ``NO_SUCH_USER`` message is "``User '%s' is not found``" -- it includes one "``%s``" component which will be replaced with errtext. Thus a call to ``box.error(box.error.NO_SUCH_USER, 'joe')`` or ``box.error(45, 'joe')`` will result in an error with the accompanying message "``User 'joe' is not found``".
ru: сообщение ``NO_SUCH_USER`` = "``User '%s' is not found``" (пользователь не найден) -- оно включает в себя компонент "``%s``", который будет заменен значением параметра errtext. Таким образом, вызов ``box.error(box.error.NO_SUCH_USER, 'joe')`` или ``box.error(45, 'joe')`` приведет к ошибке с сообщением "``User 'joe' is not found``" (пользователь 'joe' не найден).

source: except
ru: Исключение

source: whatever is specified in errcode-number.
ru: то, что указано в номере errcode.

source: ``box.error()`` accepts two sets of arguments:
ru: ``box.error()`` может принимать два типа аргументов:

source: error code and reason (``box.error{code = 555, reason = 'Arbitrary message'}``), or
ru: код ошибки и ее причину (``box.error{code = 555, reason = 'Arbitrary message'}``),

source: error object (``box.error(err)``).
ru: либо объект ошибки (``box.error(err)``).

source: In both cases the error is promoted as the last error.
ru: В обоих случаях ошибка будет записана как последняя системная ошибка.

source: **Example:**
ru: **Пример:**

source: Returns a description of the last error, as a Lua table with five members: "line" (number) Tarantool source file line number, "code" (number) error's number, "type", (string) error's C++ class, "message" (string) error's message, "file" (string) Tarantool source file. Additionally, if the error is a system error (for example due to a failure in socket or file io), there may be a sixth member: "errno" (number) C standard error number.
ru: Возвращает описание последней ошибки в виде Lua-таблицы с 5 элементами: "line" (число) -- номер строки в исходном файле Tarantool'а, "code" (число) -- номер ошибки, "type" (строка) -- C++ класс ошибки, "message" (строка) -- сообщение об ошибке, "file" (строка) -- исходный файл Tarantool'а. Кроме того, если ошибка является системной (например, по причине ошибки в сокете или файловом вводы-выводе), может быть дополнительный шестой элемент: "errno" (число) стандартный номер ошибки на языке C.

source: rtype: table
ru: Тип возвращаемого значения: таблица

source: Clears the record of errors, so functions like `box.error()` or `box.error.last()` will have no effect.
ru: Очистка записи об ошибках, то есть функции `box.error()` или `box.error.last()` не сработают.

source: Create an error object, but doesn't throw it as :ref:`box.error() <box_error-error>` does. This is useful when error information should be saved for later retrieval. To set an error as the last explicitly use :ref:`box.error.set() <box_error-set>`.
ru: Создает объект ошибки, но не выдает ее, как это делает :ref:`box.error() <box_error-error>`. Это полезно, когда информацию об ошибке нужно сохранить, чтобы вернуться к ней позже. Чтобы явно отправить ошибку в область диагностики, используйте :ref:`box.error.set() <box_error-set>`.

source: Set an error as the last system error explicitly. Accepts an error object and makes it available via :ref:`box.error.last() <box_error-last>`.
ru: Явно записывает ошибку как последнюю. Принимает объект ошибки и делает его доступным через :ref:`box.error.last() <box_error-last>`.

source: Errors can be organized into lists. To achieve this, a Lua table representing an error object has ``.prev`` field and ``e:set_prev(err)`` method.
ru: Ошибки можно записывать в списки. Для этого у Lua-таблицы, представляющей объект ошибки, есть поле ``.prev`` и метод ``e:set_prev(err)``.

source: Return a previous error, if any.
ru: Возврат предыдущей ошибки, если она существует.

source: Set an error as the previous error. Accepts an ``error object`` or ``nil``.
ru: Установка ошибки в качестве предыдущей. Принимает объект ошибки или ``nil``.

source: Cycles are not allowed for error lists:
ru: Циклы для списков ошибок недопустимы:

source: Setting the previous error does not erase its own previous members:
ru: Установка предыдущей ошибки подтягивает за ней ее собственные предыдущие ошибки:

source: The iProto protocol also supports stacked diagnostics. See details in :ref:`MessagePack extensions - The ERROR type <msgpack_ext-error>`.
ru: Протокол IProto тоже поддерживает диагностику с помощью стека ошибок. Подробнее в разделе :ref:`MessagePack extensions - The ERROR type <msgpack_ext-error>`.

source: Custom error types
ru: Пользовательские типы ошибок

source: From above you know that errors can be created in two ways: with ``box.error.new()`` and with ``box.error()``.
ru: Объекты ошибок могут быть созданы двумя способами: с помощью ``box.error.new()`` и с помощью ``box.error()``.

source: Both methods can take arguments either as a list (``code, reason, <reason string args>``):
ru: Оба метода принимают аргументы либо перечислением (``code, reason, <reason string args>``):

source: ...or as a table (``{code = code, reason = reason, ...}``):
ru: ...либо Lua-таблицей (``{code = code, reason = reason, ...}``):

source: It is also possible to specify your own type of errors instead of pre-defined ones. Put a string with your type in the ``type`` field if you pass arguments as a table, or instead of the ``code`` parameter if you use listing:
ru: Также можно определить свой собственный тип ошибок вместо встроенных. Для этого поместите строку со своим типом в поле ``type``, если вы передаетеаргументы таблицей, или вместо параметра ``code`` при перечислении:

source: Or a no-throw version:
ru: Или вариант без выдачи ошибки:

source: When a custom type is specified, it is reported in the ``err.type`` attribute. When it is not specified, ``err.type`` reports one of built-in errors such as ``'ClientError'``, ``'OurOfMemory'``, etc.
ru: При указании пользовательского типа он отображается в атрибуте ``err.type``. Когда он не указан, ``err.type`` показывает одну из встроенных ошибок, таких как ``'ClientError'``, ``'OurOfMemory'`` и др.

source: The maximum name length for a custom type is *63 bytes*. Everything longer than this limit is truncated.
ru: Ограничение по длине имени для пользовательского типа составляет *63 байта*. Все, что длиннее этого ограничения, отсекается.

source: The original error type can be checked using the ``err.base_type`` member, although normally it should not be used. For user-defined types, the base type is ``'CustomError'``.
ru: Исходный тип ошибки можно проверить, используя член ``err.base_type``, хотя, как правило, его не следует использовать. Для пользовательских типов базовым типом является ``'CustomError'``.

source: You can also use a format string to compose an error message for the ``'CustomError'`` type.
ru: Также можно использовать format string для составления сообщения об ошибке для типа ``'CustomError'``.
