Repository: tarantool/doc
Catalog: locale/*/LC_MESSAGES/reference/reference_lua/buffer.po
Languages: ru_ru

source: Module `buffer`
ru_ru: Модуль `buffer`

source: The ``buffer`` module returns a dynamically resizable buffer which is solely for optional use by methods of the :ref:`net.box module <net_box-module>` or the :ref:`msgpack module <msgpack-module>`.
ru_ru: Модуль ``buffer`` возвращает буфер, допускающий динамическое изменение размера, который используется только в качестве опции для методов :ref:`модуля net.box <net_box-module>` или :ref:`модуля msgpack <msgpack-module>`.

source: Ordinarily the ``net.box`` methods return a Lua table. If a ``buffer`` option is used, then the ``net.box`` methods return a :ref:`raw MsgPack string <msgpack-definitions>`. This saves time on the server, if the client application has its own routine for decoding raw MsgPack strings.
ru_ru: Как правило, модуль ``net.box`` возвращает Lua-таблицу. Если используется опция ``buffer``, то методы модуля ``net.box`` возвращают неформатированную строку :ref:`строку MsgPack <msgpack-definitions>`. Это экономит время работы на сервере, если в клиентском приложении есть собственная процедура декодирования MsgPack-строк.

source: The buffer uses four pointers to manage its capacity:
ru_ru: Буфер использует четыре указателя для управления его мощностью:

source: ``buf`` -- a pointer to the beginning of the buffer
ru_ru: ``buf`` -- указатель на начало буфера

source: ``rpos`` -- a pointer to the beginning of the range; available for reading data ("read position")
ru_ru: ``rpos`` -- указатель на начало участка памяти, доступного для чтения данных ("read position")

source: ``wpos`` -- a pointer to the end of the range; available for reading data, and to the beginning of the range for writing new data ("write position")
ru_ru: ``wpos`` -- указатель на конец участка памяти для чтения и начало участка для записи данных ("write position")

source: ``epos`` -- a pointer to the end of the range; available for writing new data ("end position")
ru_ru: ``epos`` -- указатель на конец участка для записи данных ("end position")

source: Create a new buffer.
ru_ru: Создать новый буфер.

source: **Example:**
ru_ru: **Пример:**

source: In this example we will show that using buffer allows you to keep the data in the format that you get from the server. So if you get the data only for sending it somewhere else, buffer fastens this a lot.
ru_ru: В этом примере мы покажем, что использование буфера позволит вам сохранить данные в том же формате, в котором они пришли с сервера. Так что если получить данные с сервера нужно только для отправки куда-то дальше, то с буфером это будет гораздо быстрее.

source: The result of the final request looks like this:
ru_ru: Результат последнего запроса выглядит следующим образом:

source: Before Tarantool version 1.7.7, the function to use for this case is ``msgpack.ibuf_decode(ibuf.rpos)``. Starting with Tarantool version 1.7.7, ``ibuf_decode`` is deprecated.
ru_ru: До версии 1.7.7 Tarantool'а в данном случае следует использовать функцию ``msgpack.ibuf_decode(ibuf.rpos)``. Начиная с версии 1.7.7 Tarantool'а , ``ibuf_decode`` объявлена устаревшей.

source: Allocate ``size`` bytes for ``buffer_object``.
ru_ru: Аллоцировать ``size`` байтов для ``buffer_object``'а.

source: Parameters
ru_ru: Параметры

source: memory in bytes to allocate
ru_ru: количество байтов для аллоцирования

source: return
ru_ru: возвращает

source: Return the capacity of the ``buffer_object``.
ru_ru: Вернуть мощность ``buffer_object``'а.

source: Check if ``size`` bytes are available for reading in ``buffer_object``.
ru_ru: Проверить, доступно ли ``size`` байтов для чтения из ``buffer_object``'а.

source: memory in bytes to check
ru_ru: память в байтах для проверки

source: Return the size of the range occupied by data.
ru_ru: Вернуть размер участка, занятого данными.

source: Read ``size`` bytes from buffer.
ru_ru: Прочитать ``size`` байтов из буфера.

source: Clear the memory slots allocated by ``buffer_object``.
ru_ru: Очистить слоты памяти, выделенные для ``buffer_object``'а.

source: Clear the memory slots used by ``buffer_object``. This method allows to keep the buffer but remove data from it. It is useful when you want to use the buffer further.
ru_ru: Очистить слоты памяти, использованные ``buffer_object``'ом. Этот метод позволяет сохранить буфер, но убрать из него все данные. Это полезно, если вы собираетесь использовать буфер дальше.

source: Reserve memory for ``buffer_object``. Check if there is enough memory to write ``size`` bytes after ``wpos``. If not, ``epos`` shifts until ``size`` bytes will be available.
ru_ru: Зарезервировать память для ``buffer_object``. Проверить, достаточно ли памяти, чтобы записать ``size`` байтов после ``wpos``. Если нет, ``epos`` будет сдвигаться, пока ``size`` байтов не будет доступно.

source: Return a range, available for reading data.
ru_ru: Вернуть участок, доступный для чтения данных.

source: Return a range for writing data.
ru_ru: Вернуть участок, доступный для записи данных.

source: **Module buffer and skip_header**
ru_ru: **Модуль buffer и skip_header**

source: The example in the previous section
ru_ru: В примере из предыдущего раздела

source: showed that, ordinarily, the response from net.box includes a header -- 48 (hexadecimal 30) that is the :ref:`key <internals-unified_packet_structure>` for IPROTO_DATA. But in some situations, for example when passing the buffer to a C function that expects a MsgPack byte array without a header, the header can be skipped. This is done by specifying ``skip_header=true`` as an option to :ref:`conn.space.space-name:select{...} <conn-select>` or :ref:`conn.space.space-name:insert{...} <conn-insert>` or :ref:`conn.space.space-name:replace{...} <conn-replace>` or :ref:`conn.space.space-name:update{...} <conn-update>` or :ref:`conn.space.space-name:upsert{...} <conn-upsert>` or :ref:`conn.space.space-name:delete{...} <conn-delete>`. The default is ``skip_header=false``.
ru_ru: было показано, что обычно net.box ответ включает в себя заголовок -- 48 (в шестнадцатиричной системе -- 30), который является :ref:`ключом <internals-unified_packet_structure>` для IPROTO_DATA. Но в некоторых ситуациях, например, при передаче буфера в функцию C, которая ожидает массив байт MsgPack без заголовка, заголовок можно пропустить. Это делается путем указания ``skip_header=true`` в качестве опции :ref:`conn.space.space-name:select{...} <conn-select>` или :ref:`conn.space.space-name:insert{...} <conn-insert>` или :ref:`conn.space.space-name:replace{...} <conn-replace>` или :ref:`conn.space.space-name:update{...} <conn-update>` или :ref:`conn.space.space-name:upsert{...} <conn-upsert>` или :ref:`conn.space.space-name:delete{...} <conn-delete>`. По умолчанию ``skip_header=false``.

source: Now here is the end of the same example, except that ``skip_header=true`` is used.
ru_ru: Ниже приведен конец того же примера, но с использованием ``skip_header=true``.

source: tarantool> msgpack.decode_unchecked(ibuf.rpos) --- - [['ABCDE', 12345]] - 'cdata<char *>: 0x7f8fd102803f' ...
ru_ru: tarantool> msgpack.decode_unchecked(ibuf.rpos) --- - {48: [['ABCDE', 12345]]} - 'cdata<char *>: 0x7f97ba10c041' ...

source: Notice that the IPROTO_DATA header (48) is gone.
ru_ru: Заметьте, что заголовок IPROTO_DATA (48) ушел.

source: The result is still inside an array, as is clear from the fact that it is shown inside square brackets. It is possible to skip the array header too, with :ref:`msgpack.decode_array_header() <msgpack-decode_array_header>`.
ru_ru: Результат остается внутри массива, что видно из того, что он заключен в квадратные скобки. Пропустить заголовок массива можно и функцией ``msgpack.decode_array_header()``.
