Repository: tarantool/doc
Catalog: locale/*/LC_MESSAGES/reference/reference_lua/json_paths.po
Languages: ru

source: Since version 2.3 Tarantool supports JSON path updates. Now you can update/upsert formatted :doc:`tuple </reference/reference_lua/box_tuple/update>` / :ref:`space <box_space-update>` / :doc:`index </reference/reference_lua/box_index/update>` fields by name (not only by field number). Updates of nested structures are also supported.
ru: Начиная с версии 2.3, Tarantool поддерживает обновление с помощью JSON-пути. Теперь можно делать обновление/обновление со вставкой отформатированных полей :doc:`кортежа </reference/reference_lua/box_tuple/update>` /:ref:`спейса <box_space-update>` /:doc:`индекса </reference/reference_lua/box_index/update>` по имени (а не только по номеру поля). Обновления вложенных структур также поддерживаются.

source: **Example:**
ru: **Пример:**

source: Notice that field names that look like JSON paths are processed similarly to :doc:`accessing tuple fields by JSON </reference/reference_lua/box_tuple/field_path>`: first, the whole path is interpreted as a field name; if such a name does not exist, then it is treated as a path.
ru: Обратите внимание, что имена полей, которые выглядят как JSON-пути, обрабатываются аналогично :doc:`доступу к полям кортежа через JSON </reference/reference_lua/box_tuple/field_path>`: сначала весь путь интерпретируется как имя поля; если такого имени не существует, то оно обрабатывается как путь.

source: For example, for a field name ``field.name.like.json``, this update
ru: Например, для имя поля ``field.name.like.json``, это обновление

source: will update this field instead of keys ``field`` -> ``name`` -> ``like`` -> ``json``. If you need such a name as part of a bigger path, then you should wrap it in quotes ``""`` and brackets ``[]``:
ru: обновит именно это поле целиком, а не ключи ``field`` -> ``name`` -> ``like`` -> ``json``. Если это имя нужно вам как часть большего пути, то его нужно обернутьв кавычки ``""`` или квадратные скобки ``[]``:

source: **There are some rules for JSON updates:**
ru: **Есть несколько правил для обновления через JSON:**

source: Operation ``'!'`` can't be used to create all intermediate nodes of a path. For example, ``{'!', 'field1[1].field3', ...}`` can't create fields ``'field1'`` and ``'[1]'``, they should exist.
ru: Операция ``'!'`` не может быть использована для создания всех промежуточных узлов пути.Например, ``{'!', 'field1[1].field3', ...}`` не может создать поля ``'field1'`` и ``'[1]'``, они должны существовать.

source: Operation ``'#'``, when applied to maps, can't delete more than one key at once. That is, its argument should be always 1 for maps.
ru: Операция ``'#'``, при применении к ассоциативным массивам, не может удалить сразу несколько ключей. Поэтому для ассоциативных массивов ее аргумент всегда должен быть 1.

source: ``{'#', 'field1.field2', 1}`` is allowed;
ru: ``{'#', 'field1.field2', 1}`` -- разрешено;

source: ``{'#', 'field1.field2', 10}`` is not.
ru: ``{'#', 'field1.field2', 10}`` -- не разрешено.

source: This limitation originates from the problem that keys in a map are not ordered anyhow, and ``'#'`` with more than 1 key would lead to undefined behavior.
ru: Это ограничение возникает из-за проблемы, что ключи на ассоциативном массиве все равно не упорядочены, а ``'#'`` с более чем 1 ключом приведет к неопределенному поведению.

source: Operation ``'!'`` on maps can't create a key, if it exists already.
ru: Операция ``'!'`` на ассоциативных массивах не может создать ключ, если он уже существует.

source: If a map contains non-string keys (booleans, numbers, maps, arrays - anything), then these keys can't be updated via JSON paths. But it is still allowed to update string keys in such a map.
ru: Если ассоциативный массив содержит нестроковые ключи (булеаны, цифры, ассоциативные массивы, массивы - все что угодно), то эти ключи не могут быть обновлены с помощью JSON-путей. Но в таком ассоциативном массиве все равно разрешено обновлять строковые ключи.

source: **Why JSON updates are good, and should be preferred when only a part of a tuple needs to be updated:**
ru: **Почему обновления с помощью JSON-путей хороши, и их следует предпочитать, когда нужно обновить только часть кортежа:**

source: They consume less space in WAL, because for an update only its keys, operations, and arguments are stored. It is cheaper to store an update of one deep field than of the whole tuple.
ru: Они расходуют меньше места в WAL, потому что для обновления хранятся только ключи, операции и аргументы. Обновление одного труднодоступного поля дешевле, чем всего обновление всего кортежа.

source: They are faster. Firstly, this is because they are implemented in C, and have no problems with Lua GC and dynamic typing. Secondly, some cases of JSON paths are highly optimized. For example, an update with a single JSON path costs O(1) memory regardless of how deep that path goes (not counting update arguments).
ru: Они быстрее. Во-первых, это потому, что они реализованы на C, и у них нет проблем с Lua GC и динамическим набором текста. Во-вторых, некоторые случаи использования JSON-путей хорошо оптимизированы. Например, обновление одним JSON-путем стоит O(1) памяти, независимо от того, насколько глубоко этот путь проходит (не считая аргументов обновления).

source: They are available from remote clients, as well as any other DML. Before JSON updates became available in Tarantool, to update one deep part of a tuple, it was necessary to download that tuple, update it in memory, and send it back -- 2 network hops. With JSON paths, it can be 1 hop when the update can be described in paths.
ru: Они доступны с удаленных клиентов, а также с любого другого DML. До того, как обновления с помощью JSON-путей стали доступны в Tarantool, чтобы обновить одну глубокую часть кортежа, нужно было скачать этот кортеж, обновить его в памяти и отправить обратно - 2 сетевых скачка. С помощью JSON-путей, это может быть 1 скачок, когда обновление может быть описано в путях.
