Repository: tarantool/doc
Catalog: locale/*/LC_MESSAGES/reference/reference_lua/key_def.po
Languages: ru

source: Module key_def
ru: Модуль key_def

source: The `key_def` module has a function for defining the field numbers and types of a tuple. The definition is usually used with an index definition to extract or compare the index key values.
ru: В модуле `key_def` есть функция, позволяющая создавать определение номеров и типов полей кортежа. Это определение обычно используется вместе с определением индекса, чтобы извлекать или сравнивать значения ключей индекса.

source: Create a new key_def instance.
ru: Создание нового экземпляра key_def.

source: Parameters
ru: Параметры

source: field numbers and types. There must be at least one part. Every part must contain the attributes ``type`` and ``fieldno``/``field``. Other attributes are optional.
ru: типы и номера полей. В таблице ``parts`` должен быть хотя бы один элемент. Для каждого элемента обязательны только атрибуты ``type`` и ``fieldno``/``field``.

source: returns
ru: возвращает

source: :ref:`a key_def object <key_def-object>`
ru: :ref:`объект key_def <key_def-object>`

source: ``fieldno`` (integer), for example, ``fieldno = 1``. It is legal to use ``field`` instead of ``fieldno``.
ru: ``fieldno`` (целое число), например ``fieldno = 1``. Вместо ``fieldno`` можно использовать ``field``.

source: ``type`` (string), for example, ``type = 'string'``.
ru: ``type`` (строка), например ``type = 'string'``.

source: Other components are optional.
ru: Остальные компоненты необязательны.

source: Example: ``key_def.new({{type = 'unsigned', fieldno = 1}})``
ru: Пример №1: ``key_def.new({{type = 'unsigned', fieldno = 1}})``

source: Example: ``key_def.new({{type = 'string', collation = 'unicode', field = 2}})``
ru: Пример №2: ``key_def.new({{type = 'string', collation = 'unicode', field = 2}})``

source: A key_def object is an object returned by :ref:`key_def.new() <key_def-new>`. It has methods :ref:`extract_key() <key_def-extract_key>`, :ref:`compare() <key_def-compare>`, :ref:`compare_with_key() <key_def-compare_with_key>`, :ref:`merge() <key_def-merge>`, :ref:`totable() <key_def-totable>`.
ru: Объект key_def возвращается функцией :ref:`key_def.new() <key_def-new>`. У него есть следующие методы: :ref:`extract_key() <key_def-extract_key>`, :ref:`compare() <key_def-compare>`, :ref:`compare_with_key() <key_def-compare_with_key>`, :ref:`merge() <key_def-merge>`, :ref:`totable() <key_def-totable>`.

source: Return a tuple containing only the fields of the ``key_def`` object.
ru: Получение кортежа, содержащего только поля объекта ``key_def``.

source: tuple or Lua table with field contents
ru: кортеж или Lua-таблица с содержимым поля

source: return
ru: возвращает

source: the fields defined for the ``key_def`` object
ru: поля, определенные для объекта ``key_def``,

source: **Example #1:**
ru: **Пример №1:**

source: -- Suppose an item has five fields -- 1, 99.5, 'X', nil, 99.5 -- and the fields that we care about are -- #3 (a string) and #1 (an integer). -- We can define those fields with k = key_def.new -- and extract the values with k:extract_key. tarantool> key_def = require('key_def') --- ... tarantool> k = key_def.new({{type = 'string', fieldno = 3}, > {type = 'unsigned', fieldno = 1}}) --- ... tarantool> k:extract_key({1, 99.5, 'X', nil, 99.5}) --- - ['X', 1] ...
ru: -- Предположим, что у некоторого элемента пять полей: -- 1, 99.5, 'X', nil, 99.5 -- Нас интересуют только два из них: -- третье (строка) и первое (целое число). -- Мы можем определить эти поля инструкцией k = key_def.new -- и извлечь значения командой k:extract_key. tarantool> key_def = require('key_def') --- ... tarantool> k = key_def.new({{type = 'string', fieldno = 3}, > {type = 'unsigned', fieldno = 1}}) --- ... tarantool> k:extract_key({1, 99.5, 'X', nil, 99.5}) --- - ['X', 1] ...

source: **Example #2**
ru: **Пример №2**

source: -- Now suppose the item is a tuple in a space with -- an index on field #3 plus field #1. -- We can use key_def.new with the index definition -- instead of filling it out (Example #1). -- The result will be the same. key_def = require('key_def') box.schema.space.create('T') i = box.space.T:create_index('I', {parts={3, 'string', 1, 'unsigned'}}) box.space.T:insert{1, 99.5, 'X', nil, 99.5} k = key_def.new(i.parts) k:extract_key(box.space.T:get({'X', 1}))
ru: -- Теперь предположим, что элемент является кортежем в спейсе. -- У спейса есть составной индекс, построенный по полям 3 и 1. -- Мы можем передать определение индекса в качестве аргумента функции key_def.new, -- а не заполнять определение, как в примере №1. -- Результат будет тот же. key_def = require('key_def') box.schema.space.create('T') i = box.space.T:create_index('I', {parts={3, 'string', 1, 'unsigned'}}) box.space.T:insert{1, 99.5, 'X', nil, 99.5} k = key_def.new(i.parts) k:extract_key(box.space.T:get({'X', 1}))

source: **Example #3**
ru: **Пример №3**

source: -- Iterate through the tuples in a secondary non-unique index -- extracting the tuples' primary-key values, so they could be deleted -- using a unique index. This code should be a part of a Lua function. local key_def_lib = require('key_def') local s = box.schema.space.create('test') local pk = s:create_index('pk') local sk = s:create_index('test', {unique = false, parts = { {2, 'number', path = 'a'}, {2, 'number', path = 'b'}}}) s:insert{1, {a = 1, b = 1}} s:insert{2, {a = 1, b = 2}} local key_def = key_def_lib.new(pk.parts) for _, tuple in sk:pairs({1})) do local key = key_def:extract_key(tuple) pk:delete(key) end
ru: -- Проходим по всем кортежам во вторичном неуникальном индексе -- и извлекаем из них значения по первичному ключу. -- Затем удаляем значения, используя уникальный индекс. -- Этот код должен входить в Lua-функцию. local key_def_lib = require('key_def') local s = box.schema.space.create('test') local pk = s:create_index('pk') local sk = s:create_index('test', {unique = false, parts = { {2, 'number', path = 'a'}, {2, 'number', path = 'b'}}}) s:insert{1, {a = 1, b = 1}} s:insert{2, {a = 1, b = 2}} local key_def = key_def_lib.new(pk.parts) for _, tuple in sk:pairs({1})) do local key = key_def:extract_key(tuple) pk:delete(key) end

source: Compare the key fields of ``tuple_1`` with the key fields of ``tuple_2``. It is a tuple-by-tuple comparison so users do not have to write code that compares one field at a time. Each field's type and collation will be taken into account. In effect it is a comparison of ``extract_key(tuple_1)`` with ``extract_key(tuple_2)``.
ru: Сравнение полей кортежей ``tuple_1`` и ``tuple_2`` по определённому ключу. Пользователю не нужно писать код для сравнения отдельных полей. Учитываются типы полей и параметры сортировки. Фактически сравниваются значения ``extract_key(tuple_1)`` и ``extract_key(tuple_2)``.

source: > 0 if tuple_1 key fields > tuple_2 key fields, = 0 if tuple_1 key fields = tuple_2 key fields, < 0 if tuple_1 key fields < tuple_2 key fields
ru: положительное число, если значения полей tuple_1 больше значений полей tuple_2 по ключу; 0, если они равны; отрицательное число, если значения полей tuple_1 меньше значений полей tuple_2 по ключу

source: **Example:**
ru: **Пример:**

source: -- This will return 0 key_def = require('key_def') k = key_def.new({{type = 'string', fieldno = 3, collation = 'unicode_ci'}, {type = 'unsigned', fieldno = 1}}) k:compare({1, 99.5, 'X', nil, 99.5}, {1, 99.5, 'x', nil, 99.5})
ru: -- Результат этого кода будет 0 key_def = require('key_def') k = key_def.new({{type = 'string', fieldno = 3, collation = 'unicode_ci'}, {type = 'unsigned', fieldno = 1}}) k:compare({1, 99.5, 'X', nil, 99.5}, {1, 99.5, 'x', nil, 99.5})

source: Compare the key fields of ``tuple_1`` with all the fields of ``tuple_2``. This is the same as :ref:`key_def_object:compare() <key_def-compare>` except that ``tuple_2`` contains only the key fields. In effect it is a comparison of ``extract_key(tuple_1)`` with ``tuple_2``.
ru: Сравнение полей кортежей ``tuple_1`` с полями кортежа ``tuple_2`` по заданному ключу. Аналогично :ref:`key_def_object:compare() <key_def-compare>`, за исключением того, что ``tuple_2`` содержит только поля ключа. Фактически это сравнение ``extract_key(tuple_1)`` с ``tuple_2``.

source: > 0 if tuple_1 key fields > tuple_2 fields, = 0 if tuple_1 key fields = tuple_2 fields, < 0 if tuple_1 key fields < tuple_2 fields
ru: положительное число, если значения полей tuple_1 больше значений полей tuple_2 по ключу; 0, если они равны; отрицательное число, если значения полей tuple_1 меньше значений полей tuple_2 по ключу

source: -- Returns 0 key_def = require('key_def') k = key_def.new({{type = 'string', fieldno = 3, collation = 'unicode_ci'}, {type = 'unsigned', fieldno = 1}}) k:compare_with_key({1, 99.5, 'X', nil, 99.5}, {'x', 1})
ru: -- Результат этого кода будет 0 key_def = require('key_def') k = key_def.new({{type = 'string', fieldno = 3, collation = 'unicode_ci'}, {type = 'unsigned', fieldno = 1}}) k:compare_with_key({1, 99.5, 'X', nil, 99.5}, {'x', 1})

source: Combine the main ``key_def_object`` with ``other_key_def_object``. The return value is a new ``key_def_object`` containing all the fields of the main ``key_def_object``, then all the fields of ``other_key_def_object`` which are not in the main ``key_def_object``.
ru: Объединение основного объекта ``key_def_object`` с другим объектом ``other_key_def_object``. Возвращает новый объект ``key_def_object``, содержащий сначала все поля основного объекта ``key_def_object``, а потом те поля объекта ``other_key_def_object``, которых не было в основном объекте ``key_def_object``.

source: definition of fields to add
ru: определение полей, которые нужно добавить

source: -- Returns a key definition with fieldno = 3 and fieldno = 1. key_def = require('key_def') k = key_def.new({{type = 'string', fieldno = 3}}) k2= key_def.new({{type = 'unsigned', fieldno = 1}, {type = 'string', fieldno = 3}}) k:merge(k2)
ru: -- Результатом этого кода будет определение ключа -- по полям с fieldno = 3 и fieldno = 1 key_def = require('key_def') k = key_def.new({{type = 'string', fieldno = 3}}) k2= key_def.new({{type = 'unsigned', fieldno = 1}, {type = 'string', fieldno = 3}}) k:merge(k2)

source: Returns a table containing the fields of the ``key_def_object``. This is the reverse of ``key_def.new()``:
ru: Возвращает таблицу с содержимым ``key_def_object``. Функция противоположна функции ``key_def.new()``:

source: ``key_def.new()`` takes a table and returns a ``key_def`` object,
ru: ``key_def.new()`` принимает таблицу, а возвращает объект ``key_def``.

source: ``key_def_object:totable()`` takes a ``key_def`` object and returns a table.
ru: ``key_def_object:totable()`` принимает объект ``key_def``, а возвращает таблицу.

source: This is useful for input to ``_serialize`` methods.
ru: Это удобно при подготовке входных данных для методов сериализации (``_serialize``).

source: table
ru: таблица

source: -- Returns a table with type = 'string', fieldno = 3 key_def = require('key_def') k = key_def.new({{type = 'string', fieldno = 3}}) k:totable()
ru: -- Результатом этого кода будет таблица с type = 'string', fieldno = 3 key_def = require('key_def') k = key_def.new({{type = 'string', fieldno = 3}}) k:totable()
