Repository: tarantool/doc
Catalog: locale/*/LC_MESSAGES/reference/reference_lua/popen.po
Languages: ru

source: Module `popen`
ru: Модуль `popen`

source: Overview
ru: Общие сведения

source: Since version :doc:`2.4.1 </release/2.4.1>`, Tarantool has the ``popen`` built-in module that supports execution of external programs. It is similar to Python's `subprocess() <https://docs.python.org/3.8/library/subprocess.html>`_ or Ruby's `Open3 <https://docs.ruby-lang.org/en/2.0.0/Open3.html>`_. However, Tarantool's ``popen`` module does not have all the helpers that those languages provide, it provides only basic functions. ``popen`` uses the `vfork() <https://pubs.opengroup.org/onlinepubs/009695399/functions/vfork.html>`_ system call to create an object, so the caller thread is blocked until execution of a child process begins.
ru: Начиная с версии :doc:`2.4.1 </release/2.4.1>` в Tarantool есть встроенный модуль ``popen``, предназначенный для выполнения внешних программ. Он работает аналогично модулю `subprocess() <https://docs.python.org/3.8/library/subprocess.html>`_ в Python или `Open3 <https://docs.ruby-lang.org/en/2.0.0/Open3.html>`_ в Ruby. Однако в ``popen`` нет вспомогательных средств, которые предоставляют эти языки; он предоставляет только базовые функции. Для создания объекта ``popen`` использует системный вызов `vfork() <https://pubs.opengroup.org/onlinepubs/009695399/functions/vfork.html>`_, поэтому вызывающий поток блокируется до тех пор, пока не начинается выполнение дочернего процесса.

source: The ``popen`` module provides two functions to create the popen object:
ru: В модуле ``popen`` есть две функции для создания объекта popen:

source: :ref:`popen.shell <popen-shell>` which is similar to the libc `popen <https://www.gnu.org/software/libc/manual/html_node/Pipe-to-a-Subprocess.html>`_ syscall
ru: :ref:`popen.shell <popen-shell>`, аналогичная системному вызову `popen <https://www.gnu.org/software/libc/manual/html_node/Pipe-to-a-Subprocess.html>`_ из libc;

source: :ref:`popen.new <popen-new>` to create a popen object with more specific options
ru: :ref:`popen.new <popen-new>` для создания объекта popen с более специфическими параметрами.

source: Either function returns a handle which we will call ``popen_handle`` or ``ph``. With the handle one can execute methods.
ru: Обе функции возвращают дескриптор, который мы будем называть ``popen_handle`` или ``ph``. Через дескриптор вы можете выполнять методы.

source: Index
ru: Указатель

source: Below is a list of all ``popen`` functions and handle methods.
ru: Ниже приведен перечень всех функций ``popen`` и методов дескриптора ``ph``.

source: Name
ru: Имя

source: Use
ru: Назначение

source: Execute a shell command
ru: Выполнение shell-команды

source: Execute a child program in a new process
ru: Выполнение дочерней программы в новом процессе

source: Read data from a child peer
ru: Считывание данных из дочернего процесса

source: Write a string to stdin stream of a child process
ru: Запись строки в поток stdin дочернего процесса

source: Close parent's ends of std* fds
ru: Закрытие канала с std* со стороны родителя

source: Send SIGTERM signal to a child process
ru: Отправка сигнала SIGTERM дочернему процессу

source: Send SIGKILL signal to a child process
ru: Отправка сигнала SIGKILL дочернему процессу

source: Send signal to a child process
ru: Отправка сигнала дочернему процессу

source: Return information about the popen handle
ru: Получение информации о дескрипторе popen

source: Wait until a child process gets exited or signaled
ru: Ожидание, пока дочерний процесс не завершится или не получит сигнал

source: Close a popen handle
ru: Закрытие дескриптора popen

source: :ref:`Module constants <popen-constants>`
ru: :ref:`Константы модуля <popen-constants>`

source: Module constants
ru: Константы модуля

source: :ref:`Handle fields <popen-handle_fields>`
ru: :ref:`Поля дескриптора <popen-handle_fields>`

source: Handle fields
ru: Поля дескриптора

source: Execute a shell command.
ru: Выполнение shell-команды.

source: Parameters
ru: Параметры

source: a command to run, mandatory
ru: имя выполняемой команды, обязательно

source: communication mode, optional
ru: режим передачи данных, необязательно

source: return
ru: возвращает

source: (if success) a popen handle, which we will call ``popen_handle`` or ``ph``
ru: (при успешном выполнении) дескриптор объекта popen, который мы будем называть ``popen_handle`` или ``ph``

source: (if failure) ``nil, err``
ru: (при неудачном выполнении) ``nil, err``

source: Possible errors: if a parameter is incorrect, the result is IllegalParams: incorrect type or value of a parameter. For other possible errors, see :ref:`popen.new() <popen-new>`.
ru: Возможные ошибки: если один из параметров задан некорректно, функция возвращает IllegalParams: неправильно задан тип или значение параметра. Другие возможные ошибки смотрите в разделе :ref:`popen.new() <popen-new>`.

source: The possible ``mode`` values are:
ru: Возможные значения режима передачи данных ``mode``:

source: ``'w'`` which enables :ref:`popen_handle:write() <popen-write>`
ru: ``'w'`` --- разрешает :ref:`popen_handle:write() <popen-write>`

source: ``'r'`` which enables :ref:`popen_handle:read() <popen-read>`
ru: ``'r'`` --- разрешает :ref:`popen_handle:read() <popen-read>`

source: ``'R'`` which enables :ref:`popen_handle:read({stderr = true}) <popen-read>`
ru: ``'R'`` --- разрешает :ref:`popen_handle:read({stderr = true}) <popen-read>`

source: ``'nil'`` which means inherit parent's std* file descriptors
ru: ``'nil'`` --- означает наследование родительских std*-дескрипторов файла

source: Several mode characters can be set together, for example ``'rw'``, ``'rRw'``.
ru: Разные значения режима передачи данных можно использовать вместе, например ``'rw'``, ``'rRw'``.

source: The ``shell`` function is just a shortcut for :ref:`popen.new({command}, opts) <popen-new>` with ``opts.shell.setsid`` and ``opts.shell.group_signal`` both set to `true`, and with ``opts.stdin`` and ``opts.stdout`` and ``opts.stderr`` all set based on the ``mode`` parameter.
ru: Функция ``shell`` --- это сокращение для :ref:`popen.new({command}, opts) <popen-new>` с ``opts.shell.setsid`` и ``opts.shell.group_signal``, установленными в `true`, и значениями ``opts.stdin``, ``opts.stdout`` и ``opts.stderr``, установленными на основе параметра ``mode``.

source: All std* streams are inherited from the parent by default unless it is changed using mode: ``'r'`` for stdout, ``'R'`` for stderr, or ``'w'`` for stdin.
ru: Все потоки std* по умолчанию наследуются от родительских, если не задано значение режима передачи данных (mode): ``'r'`` для stdout, ``'R'`` для stderr или ``'w'`` для stdin.

source: **Example:**
ru: **Пример:**

source: This is the equivalent of the ``sh -c date`` command. It starts a process, runs ``'date'``, reads the output, and closes the popen object (``ph``).
ru: В этом примере выполняется аналог команды ``sh -c date``. Происходит запуск процесса, выполняется ``'date'``, считывается результат и объект popen (``ph``) закрывается.

source: local popen = require('popen') -- Run the program and save its handle. local ph = popen.shell('date', 'r') -- Read program's output, strip trailing newline. local date = ph:read():rstrip() -- Free resources. The process is killed (but 'date' -- exits itself anyway). ph:close() print(date)
ru: local popen = require('popen') -- Запуск программы и сохранение ее дескриптора. local ph = popen.shell('date', 'r') -- Считывание вывода программы и удаление следующей строки. local date = ph:read():rstrip() -- Освобождение ресурсов. Процесс принудительно завершается (но 'date' -- все равно завершает работу). ph:close() print(date)

source: Unix defines a text file as a sequence of lines. Each line is terminated by a newline (``\\n``) symbol. The same convention is usually applied for text output of a command. So, when it is redirected to a file, the file will be correct.
ru: Unix определяет текстовый файл как последовательность строк. Каждая строка заканчивается символом новой строки (``\\n``). Аналогичные правила обычно применяются к выводу команды. Поэтому при перенаправлении вывода команды в файл его содержимое будет корректным.

source: However, internally an application usually operates on strings, which are *not* terminated by newline (for example literals for error messages). The newline is usually added just before a string is written for the outside world (stdout, console or log). That is why the example above contains ``rstrip()``.
ru: Однако внутри приложение обычно работает со строками, которые *не* завершаются символом новой строки (например, строки сообщений об ошибках). Символ новой строки обычно добавляется прямо перед записью строки в stdout, консоль или лог. Поэтому в примере выше был использован метод ``rstrip()``.

source: Execute a child program in a new process.
ru: Выполнение дочерней программы в новом процессе.

source: an array of a program to run with command line options, mandatory; absolute path to the program is required when ``opts.shell`` is false (default)
ru: массив, состоящий из запускаемой программы и параметров командной строки, обязательный аргумент; если поле ``opts.shell`` установлено в false (по умолчанию), то необходимо задать абсолютный путь к программе

source: table of options, optional
ru: таблица параметров, необязательно

source: Possible raised errors are:
ru: Возможные ошибки:

source: IllegalParams: incorrect type or value of a parameter
ru: IllegalParams: некорректный тип или значение параметра

source: IllegalParams: group signal is set, while setsid is not
ru: IllegalParams: групповой сигнал задан, а setsid --- нет

source: Possible error reasons when ``nil, err`` is returned are:
ru: Возможные причины ошибок, когда возвращается ``nil, err``:

source: SystemError: dup(), fcntl(), pipe(), vfork() or close() fails in the parent process
ru: SystemError: dup(), fcntl(), pipe(), vfork() или close() завершились с ошибкой в родительском процессе

source: SystemError: (temporary restriction) the parent process has closed stdin, stdout or stderr
ru: SystemError: (временное ограничение) родительский процесс закрыл stdin, stdout или stderr

source: OutOfMemory: unable to allocate the handle or a temporary buffer
ru: OutOfMemory: невозможно выделить память для дескриптора или временного буфера

source: Possible ``opts`` items are:
ru: Возможные элементы ``opts``:

source: ``opts.stdin`` (action on STDIN_FILENO)
ru: ``opts.stdin`` (действие над STDIN_FILENO)

source: ``opts.stdout`` (action on STDOUT_FILENO)
ru: ``opts.stdout`` (действие над STDOUT_FILENO)

source: ``opts.stderr`` (action on STDERR_FILENO)
ru: ``opts.stderr`` (действие над STDERR_FILENO)

source: The ``opts`` table file descriptor actions may be:
ru: Возможные действия файлового дескриптора в таблице ``opts``:

source: ``popen.opts.INHERIT`` (== ``'inherit'``) [default] inherit the fd from the parent
ru: ``popen.opts.INHERIT`` (== ``'inherit'``) [default] унаследовать файловый дескриптор от родительского процесса

source: ``popen.opts.DEVNULL`` (== ``'devnull'``) open /dev/null on the fd
ru: ``popen.opts.DEVNULL`` (== ``'devnull'``) открыть /dev/null для файлового дескриптора

source: ``popen.opts.CLOSE`` (== ``'close'``) close the fd
ru: ``popen.opts.CLOSE`` (== ``'close'``) закрыть файловый дескриптор

source: ``popen.opts.PIPE`` (== ``'pipe'``) feed data from fd to parent, or from parent to fd, using a pipe
ru: ``popen.opts.PIPE`` (== ``'pipe'``) перенаправить данные из файлового дескриптора в родительский процесс или из родительского процесса в файловый дескриптор через канал (pipe)

source: The ``opts`` table may contain an ``env`` table of environment variables to be used inside a process. Each ``opts.env`` item may be a key-value pair (key is a variable name, value is a variable value).
ru: Таблица ``opts`` может содержать таблицу ``env`` переменных среды для использования внутри процесса. Каждый элемент ``opts.env`` может быть парой ключ-значение (где ключ --- имя переменной, а значение --- значение переменной).

source: If ``opts.env`` is not set then the current environment is inherited.
ru: Если ``opts.env`` не установлено, то наследуется текущая среда.

source: If ``opts.env`` is an empty table, then the environment will be dropped.
ru: Если ``opts.env`` является пустой таблицей, то среда будет сброшена.

source: If ``opts.env`` is set to a non-empty table, then the environment will be replaced.
ru: Если ``opts.env`` является непустой таблицей, то среда будет заменена.

source: The ``opts`` table may contain these boolean items:
ru: Таблица ``opts`` может содержать следующие элементы типа boolean:

source: Default
ru: Значение по умолчанию

source: If true, then run a child process via ``sh -c "${opts.argv}"``. If false, then call the executable directly.
ru: При значении true выполняется запуск дочернего процесса через ``sh -c "${opts.argv}"``. При значении false исполняемый процесс вызывается напрямую.

source: If true, then run the program in a new session. If false, then run the program in the Tarantool instance's session and process group.
ru: При значении true программа запускается в новой сессии. При значении false программа запускается в сессии и группе процессов экземпляра Tarantool.

source: If true, then close all inherited fds from the parent. If false, then do not close all inherited fds from the parent.
ru: При значении true закрываются все унаследованные родительские файловые дескрипторы. При значении false унаследованные родительские файловые дескрипторы не закрываются.

source: If true, then reset all signal actions modified in the parent's process. If false, then inherit all signal actions modified in the parent's process.
ru: При значении true сбрасываются все действия сигналов, измененные в родительском процессе. При значении false все действия сигналов, измененные в родительском процессе, наследуются.

source: If true, then send signal to a child process group, if and only if ``opts.setsid`` is enabled. If false, then send signal to a child process only.
ru: При значении true отправляется сигнал в группу дочерних процессов, но только при условии, что установлено поле ``opts.setsid``. При значении false сигнал отправляется только одному дочернему процессу.

source: If true, then do not send SIGKILL to a child process (or to a process group if ``opts.group_signal`` true). If false, then do send SIGKILL to a child process (or to a process group if ``opts.group_signal`` is true) at :ref:`popen_handle:close() <popen-close>` or when Lua GC collects the handle.
ru: При значении true дочернему процессу (или группе процессов, если поле ``opts.group_signal`` установлено в true) не отправляется сигнал SIGKILL. При значении false дочернему процессу (или группе процессов, если поле ``opts.group_signal`` установлено в true) отправляется сигнал SIGKILL при выполнении :ref:`popen_handle:close() <popen-close>` или когда Lua GC собирает дескрипторы.

source: The returned ``ph`` handle provides a :ref:`popen_handle:close() <popen-close>` method for explicitly releasing all occupied resources, including the child process itself if ``opts.keep_child`` is not set). However, if the ``close()`` method is not called for a handle during its lifetime, the Lua GC will trigger the same freeing actions.
ru: Возвращаемый дескриптор ``ph`` дает доступ к методу :ref:`popen_handle:close() <popen-close>` для явного освобождения всех занятых ресурсов, включая сам дочерний процесс, если не установлено поле ``opts.keep_child``. Однако, если метод ``close()`` не вызывается для дескриптора в течение его жизни, Lua GC запустит то же самое действие по освобождению ресурсов.

source: Tarantool recommends using ``opts.setsid`` plus ``opts.group_signal`` if a child process may spawn its own children and if they should all be killed together.
ru: Tarantool рекомендует использовать ``opts.setsid`` вместе с ``opts.group_signal``, если дочерний процесс может создать собственные дочерние процессы и их все нужно будет завершить одновременно.

source: A signal will not be sent if the child process is already dead. Otherwise we might kill another process that occupies the same PID later. This means that if the child process dies before its own children die, then the function will not send a signal to the process group even when ``opts.setsid`` and ``opts.group_signal`` are set.
ru: Сигнал не будет отправлен, если дочерний процесс уже был завершен. В противном случае мы можем случайно завершить другой процесс, который имеет тот же идентификатор процесса после освобождения его предыдущим. Это означает, что если дочерний процесс завершается до того, как завершаются его дочерние процессы, то функция не будет отправлять сигнал группе процессов, даже когда установлены ``opts.setsid`` и ``opts.group_signal``.

source: Use :ref:`os.environ() <os-environ>` to pass a copy of the current environment with several replacements (see example 2 below).
ru: Используйте :ref:`os.environ() <os-environ>`, чтобы передать копию текущей среды с несколькими заменами (см. Пример 2 ниже).

source: **Example 1**
ru: **Пример 1**

source: This is the equivalent of the ``sh -c date`` command. It starts a process, runs 'date', reads the output, and closes the popen object (``ph``).
ru: В этом примере выполняется аналог команды ``sh -c date``. Происходит запуск процесса, выполняется ``'date'``, считывается результат и объект popen (``ph``) закрывается.

source: local popen = require('popen') local ph = popen.new({'/bin/date'}, { stdout = popen.opts.PIPE, }) local date = ph:read():rstrip() ph:close() print(date) -- e.g. Thu 16 Apr 2020 01:40:56 AM MSK
ru: local popen = require('popen') local ph = popen.new({'/bin/date'}, { stdout = popen.opts.PIPE, }) local date = ph:read():rstrip() ph:close() print(date) -- например, Thu 16 Apr 2020 01:40:56 AM MSK

source: **Example 2**
ru: **Пример 2**

source: Example 2 is quite similar to Example 1, but sets an environment variable and uses the shell builtin ``'echo'`` to show it.
ru: Пример 2 во многом похож на Пример 1. Отличие в том, что в нем задается переменная среды и используется встроенная команда оболочки ``'echo'`` для ее отображения.

source: **Example 3**
ru: **Пример 3**

source: Example 3 demonstrates how to capture a child's stderr.
ru: Пример 3 показывает, как перехватить дочерний поток stderr.

source: **Example 4**
ru: **Пример 4**

source: Example 4 demonstrates how to run a stream program (like ``grep``, ``sed`` and so on), write to its stdin and read from its stdout.
ru: Пример 4 показывает, как запустить потоковую программу (например, ``grep``, ``sed`` и т.д.), записать данные в ее поток stdin и считать данные из stdout.

source: The example assumes that input data are small enough to fit in a pipe buffer (typically 64 KiB, but this depends on the platform and its configuration).
ru: В этом примере предполагается, что входные данные достаточно малы, чтобы поместиться в буфер канала (обычно его размер равен 64 КиБ, но это зависит от конкретной платформы и ее конфигурации).

source: If a process writes lengthy data, it will get stuck in :ref:`popen_handle:write() <popen-write>`. To handle this case: call :ref:`popen_handle:read() <popen-read>` in a loop in another fiber (start it before the first ``:write()``).
ru: Если процесс записывает большое количество данных, он приостановится при выполнении :ref:`popen_handle:write() <popen-write>`. Для разрешения этой проблемы вызывайте :ref:`popen_handle:read() <popen-read>` в цикле в другом файбере (запустите его перед первым вызовом ``:write()``).

source: If a process writes lengthy text to stderr, it may get stick in ``write()`` because the stderr pipe buffer becomes full. To handle this case: read stderr in a separate fiber.
ru: Если процесс записывает длинный текст в stderr, он может приостановиться при выполнении ``write()``, потому что буфер канала stderr заполнился. Для решения этой проблемы считывайте из stderr в отдельном файбере.

source: local function call_jq(input, filter) -- Start jq process, connect to stdin, stdout and stderr. local jq_argv = {'/usr/bin/jq', '-M', '--unbuffered', filter} local ph, err = popen.new(jq_argv, { stdin = popen.opts.PIPE, stdout = popen.opts.PIPE, stderr = popen.opts.PIPE, }) if ph == nil then return nil, err end -- Write input data to child's stdin and send EOF. local ok, err = ph:write(input) if not ok then return nil, err end ph:shutdown({stdin = true}) -- Read everything until EOF. local chunks = {} while true do local chunk, err = ph:read() if chunk == nil then ph:close() return nil, err end if chunk == '' then break end -- EOF table.insert(chunks, chunk) end -- Read diagnostics from stderr if any. local err = ph:read({stderr = true}) if err ~= '' then ph:close() return nil, err end -- Glue all chunks, strip trailing newline. return table.concat(chunks):rstrip() end
ru: local function call_jq(input, filter) -- Запуск процесса jq, соединение с stdin, stdout и stderr. local jq_argv = {'/usr/bin/jq', '-M', '--unbuffered', filter} local ph, err = popen.new(jq_argv, { stdin = popen.opts.PIPE, stdout = popen.opts.PIPE, stderr = popen.opts.PIPE, }) if ph == nil then return nil, err end -- Запись входных данных в дочерний stdin и отправка EOF. local ok, err = ph:write(input) if not ok then return nil, err end ph:shutdown({stdin = true}) -- Считывание всех данных до EOF. local chunks = {} while true do local chunk, err = ph:read() if chunk == nil then ph:close() return nil, err end if chunk == '' then break end -- EOF table.insert(chunks, chunk) end -- Считывание данных диагностики из stderr (при наличии). local err = ph:read({stderr = true}) if err ~= '' then ph:close() return nil, err end -- Соединение всех частей вместе, обрезка символа конца строки. return table.concat(chunks):rstrip() end

source: popen handle methods
ru: методы дескриптора popen

source: Read data from a child peer.
ru: Считывание данных из дочернего процесса.

source: handle of a child process created with :ref:`popen.new() <popen-new>` or :ref:`popen.shell() <popen-shell>`
ru: дескриптор дочернего процесса, созданный через :ref:`popen.new() <popen-new>` или :ref:`popen.shell() <popen-shell>`

source: options
ru: параметры

source: Possible errors, raised on incorrect parameters or when the fiber is cancelled:
ru: Возможные ошибки при некорректно заданных параметрах или при отмене файбера:

source: IllegalParams: incorrect type or value of a parameter
ru: IllegalParams: некорректный тип или значение параметра

source: IllegalParams: called on a closed handle
ru: IllegalParams: вызов дескриптора, который уже был закрыт

source: IllegalParams: opts.stdout and opts.stderr are both set
ru: IllegalParams: одновременно установлены opts.stdout и opts.stderr

source: IllegalParams: a requested IO operation is not supported by the handle (stdout / stderr is not piped)
ru: IllegalParams: запрашиваемая операция ввода-вывода не поддерживается дескриптором (вывод stdout / stderr не перенаправлен)

source: IllegalParams: attempt to operate on a closed file descriptor
ru: IllegalParams: попытка произвести операцию над закрытым файловым дескриптором

source: FiberIsCancelled: cancelled by an outside code
ru: FiberIsCancelled: файбер отменен во внешней программе

source: ``true`` on success, ``false`` on error
ru: ``true`` при успешном выполнении, ``false`` при ошибке

source: rtype
ru: возвращаемое значение

source: (if success) string with read value, empty string if EOF
ru: (при успешном выполнении) строка со считанным значением, пустая строка при EOF

source: ``opts.stdout`` (boolean, default ``true``, if ``true`` then read from stdout)
ru: ``opts.stdout`` (boolean, значение по умолчанию --- ``true``, при значении ``true`` выполняется считывание из stdout)
