Repository: tarantool/doc
Catalog: locale/*/LC_MESSAGES/reference/reference_lua/popen.po
Languages: ru

source: ``opts.stderr`` (boolean, default ``false``, if ``true`` then read from stderr)
ru: ``opts.stderr`` (boolean, значение по умолчанию --- ``false``, при значении ``true`` выполняется считывание из stderr)

source: ``opts.timeout`` (number, default 100 years, time quota in seconds)
ru: ``opts.timeout`` (число, значение по умолчанию --- 100 лет, временная квота в секундах)

source: In other words: by default ``read()`` reads from stdout, but reads from stderr if one sets ``opts.stderr`` to ``true`` (it is not legal to set both ``opts.stdout`` and ``opts.stderr`` to ``true``).
ru: Другими словами: по умолчанию ``read()`` выполняет считывание из stdout, но если установить ``opts.stderr`` в ``true``, то считывание происходит из stderr (нельзя одновременно установить ``opts.stdout`` и ``opts.stderr`` в ``true``).

source: SocketError: an IO error occurs at read()
ru: SocketError: ошибка ввода-вывода при выполнении read()

source: TimedOut: exceeded the opts.timeout quota
ru: TimedOut: превышение квоты opts.timeout

source: OutOfMemory: no memory space for a buffer to read into
ru: OutOfMemory: недостаточно памяти для считывания в буфер

source: LuajitError: ("not enough memory"): no memory space for the Lua string
ru: LuajitError: ("not enough memory"): недостаточно памяти для строки Lua

source: Write string ``str`` to stdin stream of a child process.
ru: Запись строки ``str`` в поток stdin дочернего процесса.

source: string to write
ru: строка для записи

source: (if success) boolean = true
ru: (при успешном выполнении) boolean = true

source: Possible ``opts`` items are: ``opts.timeout`` (number, default 100 years, time quota in seconds).
ru: Возможные элементы ``opts``: ``opts.timeout`` (число, значение по умолчанию --- 100 лет, временная квота в секундах).

source: IllegalParams: string length is greater then SSIZE_MAX
ru: IllegalParams: длина строки превышает SSIZE_MAX

source: IllegalParams: a requested IO operation is not supported by the handle (stdin is not piped)
ru: IllegalParams: запрашиваемая операция ввода-вывода не поддерживается дескриптором (вывод stdin не перенаправлен)

source: SocketError: an IO error occurs at write()
ru: SocketError: ошибка ввода-вывода при выполнении write()

source: TimedOut: exceeded opts.timeout quota
ru: TimedOut: превышение квоты opts.timeout

source: ``write()`` may yield forever if the child process does not read data from stdin and a pipe buffer becomes full. The size of this pipe buffer depends on the platform. Set ``opts.timeout`` when unsure.
ru: ``write()`` может передать управление (yield) и заблокировать файбер, если дочерний процесс не считывает данные из stdin и буфер канала заполнился. Размер буфера зависит от платформы. Если сомневаетесь, обратите внимание на опцию ``opts.timeout``.

source: When ``opts.timeout`` is not set, the ``write()`` blocks (yields the fiber) until all data is written or an error happens.
ru: Когда опция ``opts.timeout`` не установлена, ``write()`` блокирует файбер до момента полной записи данных или возникновения ошибки записи.

source: Close parent's ends of std* fds.
ru: Закрытие канала с std* со стороны родителя.

source: ``opts.stdin`` (boolean) close parent's end of stdin
ru: ``opts.stdin`` (boolean) закрыть stdin со стороны родителя

source: ``opts.stdout`` (boolean) close parent's end of stdout
ru: ``opts.stdout`` (boolean) закрыть stdout со стороны родителя

source: ``opts.stderr`` (boolean) close parent's end of stderr
ru: ``opts.stderr`` (boolean) закрыть stderr со стороны родителя

source: We may use the term std* to mean any one of these items.
ru: Мы можем использовать термин std* для указания на любой из этих элементов.

source: IllegalParams: an incorrect handle parameter
ru: IllegalParams: некорректный параметр дескриптора

source: IllegalParams: called on a closed handle
ru: IllegalParams: вызов дескриптора, который уже был закрыт

source: IllegalParams: neither stdin, stdout nor stderr is chosen
ru: IllegalParams: не выбран ни один из потоков stdin, stdout или stderr

source: IllegalParams: a requested IO operation is not supported by the handle (one of std* is not piped)
ru: IllegalParams: запрашиваемая операция ввода-вывода не поддерживается дескриптором (один из потоков std* не перенаправлен)

source: The main reason to use ``shutdown()`` is to send EOF to a child's stdin. However the parent's end of stdout / stderr may be closed too.
ru: Основная цель использования ``shutdown()`` --- отправка EOF в дочерний поток stdin. Однако stdout / stderr может быть уже закрыт со стороны родительского процесса.

source: ``shutdown()`` does not fail on already closed fds (idempotence). However, it fails on an attempt to close the end of a pipe that never existed. In other words, only those ``std*`` options that were set to ``popen.opts.PIPE`` during handle creation may be used here (for :ref:`popen.shell() <popen-shell>`: ``'r'`` corresponds to stdout, ``'R'`` to stderr and ``'w'`` to stdin).
ru: ``shutdown()`` не выдает ошибку при выполнении над уже закрытыми файловыми дескрипторами (идемпотентность). Однако ошибка возникнет при попытке закрыть канал, которого никогда не существовало. Другими словами, здесь можно использовать только те опции ``std*`` , которые были заданы для ``popen.opts.PIPE`` при создании дескриптора (для :ref:`popen.shell() <popen-shell>`: ``'r'`` соответствует stdout, ``'R'`` --- stderr, а ``'w'`` --- stdin).

source: ``shutdown()`` does not close any fds on a failure: either all requested fds are closed or none of them.
ru: ``shutdown()`` не закрывает никакие файловые дескрипторы при завершении с ошибкой: либо закрываются все запрашиваемые дескрипторы (при успешном выполнении), либо ни один из них.

source: Send SIGTERM signal to a child process.
ru: Отправка сигнала SIGTERM дочернему процессу.

source: see :ref:`popen_handle:signal() <popen-signal>` for errors and return values
ru: для получения информации об ошибках и возвращаемых значениях смотрите :ref:`popen_handle:signal() <popen-signal>`

source: ``terminate()`` only sends a SIGTERM signal. It does *not* free any resources (such as popen handle memory and file descriptors).
ru: ``terminate()`` просто отправляет сигнал SIGTERM. Он *не* освобождает никакие ресурсы (такие как память для дескрипторов popen и файловые дескрипторы).

source: Send SIGKILL signal to a child process.
ru: Отправка сигнала SIGKILL дочернему процессу.

source: ``kill()`` only sends a SIGKILL signal. It does *not* free any resources (such as popen handle memory and file descriptors).
ru: ``kill()`` просто отправляет сигнал SIGKILL. Он *не* освобождает никакие ресурсы (такие как память для дескрипторов popen и файловые дескрипторы).

source: Send signal to a child process.
ru: Отправка сигнала дочернему процессу.

source: signal to send
ru: отправляемый сигнал

source: (if success) `true` (signal is sent)
ru: (при успешном выполнении) `true` (сигнал отправлен)

source: Possible raised errors:
ru: Возможные ошибки:

source: IllegalParams: an incorrect handle parameter
ru: IllegalParams: некорректный параметр дескриптора

source: Possible error values for ``nil, err``:
ru: Возможные значения ошибок при возвращении ``nil, err``:

source: SystemError: a process does not exists any more (this may also be returned for a zombie process or when all processes in a group are zombies (but see note re Mac OS below)
ru: SystemError: процесс больше не существует (также может возвращаться для зомби-процессов или когда все процессы в группе являются зомби-процессами (но см. примечание для Mac OS ниже)

source: SystemError: invalid signal number
ru: SystemError: неправильный номер сигнала

source: SystemError: no permission to send a signal to a process or a process group (this is returned on Mac OS when a signal is sent to a process group, where a group leader is a zombie (or when all processes in it are zombies, details re uncertain) (this may also appear due to other reasons, details are uncertain)
ru: SystemError: нет разрешения на отправку сигнала процессу или группе процессов (возвращается на Mac OS, когда сигнал отправляется группе процессов, где лидер группы является зомби-процессом (или все процессы являются зомби-процессами, детали неясны) (эта ошибка также может возникнуть по другим причинам, детали неясны)

source: If ``opts.setsid`` and ``opts.group_signal`` are set for the handle, the signal is sent to the process group rather than to the process. See :ref:`popen.new() <popen-new>` for details about group signaling. Warning: On Mac OS it is possible that a process in the group will not receive the signal, particularly if the process has just been forked (this may be due to a race condition).
ru: Если для дескриптора установлены ``opts.setsid`` и ``opts.group_signal``, сигнал отправляется группе процессов, а не отдельному процессу. Для подробной информации по групповым сигналам смотрите :ref:`popen.new() <popen-new>`. Внимание: на Mac OS процесс в группе может не получить сигнал, особенно если он только что был разветвлен (возможно это происходит из-за состояния гонки).

source: Note: The module offers ``popen.signal.SIG*`` constants, because some signals have different numbers on different platforms.
ru: Примечание: Некоторые сигналы имеют разные номера на разных платформах. Поэтому в этом модуле мы предлагаем константы ``popen.signal.SIG*``.

source: Return information about the popen handle.
ru: Получение информации о дескрипторе popen.

source: (if success) formatted result
ru: (при успешном выполнении) отформатированный результат

source: IllegalParams: an incorrect handle parameter
ru: IllegalParams: некорректный параметр дескриптора

source: IllegalParams: called on a closed handle
ru: IllegalParams: вызов дескриптора, который уже был закрыт

source: The result format is:
ru: Результат выводится в следующем формате:

source: ``pid`` is a process id of the process when it is alive, otherwise ``pid`` is nil.
ru: ``pid`` --- это идентификатор процесса, когда тот находится в рабочем состоянии; для завершенного процесса ``pid`` имеет значение nil.

source: ``command`` is a concatenation of space-separated arguments that were passed to ``execve()``. Multiword arguments are quoted. Quotes inside arguments are not escaped.
ru: ``command`` --- это конкатенация аргументов, разделенных пробелами, которые были переданы в ``execve()``. Аргументы, состоящие из нескольких слов, заключаются в кавычки. Кавычки внутри аргументов не экранируются.

source: ``opts`` is a table of handle options as in the :ref:`popen.new() <popen-new>` ``opts`` parameter. ``opts.env`` is not shown here, because the environment variables map is not stored in a handle.
ru: ``opts`` -- это таблица параметров дескриптора, описанная в разделе ``opts`` функции :ref:`popen.new() <popen-new>`. ``opts.env`` здесь не отображается, потому что карта переменных среды не хранится в дескрипторе.

source: ``status`` is a table that represents a process status in the following format:
ru: ``status`` --- это таблица, отображающая состояние процесса в следующем формате:

source: { state = one-of( popen.state.ALIVE (== 'alive'), popen.state.EXITED (== 'exited'), popen.state.SIGNALED (== 'signaled'), ) -- Present when `state` is 'exited'. exit_code = <number>, -- Present when `state` is 'signaled'. signo = <number>, signame = <string>, }
ru: { state = one-of( popen.state.ALIVE (== 'alive'), popen.state.EXITED (== 'exited'), popen.state.SIGNALED (== 'signaled'), ) -- Отображается при состоянии процесса 'завершенный'. exit_code = <number>, -- Отображается при состоянии процесса 'принимающий сигнал'. signo = <number>, signame = <string>, }

source: ``stdin``, ``stdout``, and ``stderr`` reflect the status of the parent's end of a piped stream. If a stream is not piped, the field is not present (``nil``). If it is piped, the status may be either ``popen.stream.OPEN`` (== ``'open'``) or ``popen.stream.CLOSED`` (== ``'closed'``). The status may be changed from ``'open'`` to ``'closed'`` by a :ref:`popen_handle:shutdown({std... = true}) <popen-shutdown>` call.
ru: ``stdin``, ``stdout`` и ``stderr`` отражают состояние канала cо стороны процесса-родителя. Если поток не перенаправлен, это поле отсутствует (``nil``). Если же перенаправлен, состояние может быть либо ``popen.stream.OPEN`` (== ``'open'``), либо ``popen.stream.CLOSED`` (== ``'closed'``). Состояние можно изменить с ``'open'`` на ``'closed'`` вызовом :ref:`popen_handle:shutdown({std... = true}) <popen-shutdown>`.

source: (on Tarantool console)
ru: (в консоли Tarantool)

source: Wait until a child process gets exited or signaled.
ru: Ожидание, пока дочерний процесс не завершится или не получит сигнал.

source: The formatted result is a process status table (the same as the ``status`` component of the table returned by :ref:`popen_handle:info() <popen-info>`).
ru: Отформатированный результат представляет собой таблицу состояний процесса (аналогично компоненту ``status`` таблицы, возвращаемой через :ref:`popen_handle:info() <popen-info>`).

source: Close a popen handle.
ru: Закрытие дескриптора popen.

source: (if success) true
ru: (при успешном выполнении) true

source: Possible diagnostics when ``nil, err`` is returned (do not consider them as errors):
ru: Возможные результаты диагностики, когда возвращается ``nil, err`` (не рассматривайте эти случаи как ошибки):

source: SystemError: no permission to send a signal to a process or a process group (This diagnostic may appear due to Mac OS behavior on zombies when ``opts.group_signal`` is set, see :ref:`popen_handle:signal() <popen-signal>`. It may appear for other reasons, details are unclear.)
ru: SystemError: нет разрешения на отправку сигнала процессу или группе процессов (это сообщение диагностики может появиться из-за особенностей обработки зомби-процессов в Mac OS, когда установлен ``opts.group_signal``, см. :ref:`popen_handle:signal() <popen-signal>`. Оно также может появиться по другим причинам, детали неясны).

source: The return is always ``true`` when a process is known to be dead (for example, after :ref:`popen_handle:wait() <popen-wait>` no signal will be sent, so no 'failure' may appear).
ru: Если известно, что процесс был завершен, то в результате всегда возвращается ``true`` (например, после выполнения :ref:`popen_handle:wait() <popen-wait>` не будет отправлено никакого сигнала, так что никакой ошибки не может возникнуть).

source: ``close()`` kills a process using SIGKILL and releases all resources associated with the popen handle.
ru: ``close()`` принудительно завершает процесс через SIGKILL и освобождает все ресурсы, связанные с дескриптором popen.

source: Details about signaling:
ru: Подробная информация об отправке сигналов:

source: The signal is sent only when opts.keep_child is not set.
ru: Сигнал отправляется только когда поле opts.keep_child не установлено.

source: The signal is sent only when a process is alive according to the information available on current event loop iteration. (There is a gap here: a zombie may be signaled; it is harmless.)
ru: Сигнал отправляется только когда процесс находится в рабочем состоянии согласно информации, доступной на текущей итерации цикла событий. (Здесь есть слабое место: сигнал может быть отправлен зомби-процессу, но это не представляет никакой угрозы).

source: The signal is sent to a process or a process group depending on ``opts.group_signal``. (See :ref:`popen.new() <popen-new>` for details of group signaling).
ru: Сигнал отправляется процессу или группе процессов в зависимости от ``opts.group_signal``. (Для подробной информации о групповых сигналах смотрите :ref:`popen.new() <popen-new>`).

source: Resources are released regardless whether or not a signal sending succeeds: fds are closed, memory is released, the handle is marked as closed.
ru: Ресурсы освобождаются вне зависимости от того, успешно ли отправился сигнал: дескрипторы файлов закрываются, память освобождается, а дескриптор popen помечается как закрытый.

source: No operation is possible on a closed handle except ``close()``, which is always successful on a closed handle (idempotence).
ru: Над закрытым дескриптором невозможно выполнять никакие операции кроме ``close()``, которая всегда выполняется успешно над закрытым дескриптором (идемпотентность).

source: ``close()`` may return ``true`` or ``nil, err``, but it always frees the handle resources. So any return value usually means success for a caller. The return values are purely informational: they are for logging or some kind of reporting.
ru: ``close()`` может вернуть ``true`` или ``nil, err``, но она всегда освобождает ресурсы дескриптора. Поэтому для того, кто отправил сигнал, любое возвращаемое значение означает успешное выполнение. Возвращаемые значения только дают информацию для логирования или составления отчетов.

source: **Handle fields**
ru: **Поля дескриптора**

source: See :ref:`popen_handle:info() <popen-info>` for details.
ru: За более подробной информацией обратитесь к :ref:`popen_handle:info() <popen-info>`.

source: **Module constants**
ru: **Константы модуля**
