Repository: tarantool/doc
Catalog: locale/*/LC_MESSAGES/admin/replication/repl_problem_solving.po
Languages: ru

source: Resolving replication conflicts
ru: Решение конфликтов репликации

source: Solving problems with master-master replication
ru: Устранение конфликтов репликации мастер-мастер

source: Tarantool guarantees that every update is applied only once on every replica. However, due to the asynchronous nature of replication, the order of updates is not guaranteed. We now analyze this problem with more details, provide examples of replication going out of sync, and suggest solutions.
ru: Tarantool гарантирует, что все обновления применяются однократно на каждой реплике. Однако, поскольку репликация носит асинхронный характер, порядок обновлений не гарантируется. Сейчас мы проанализируем данную проблему более подробно с примерами рассинхронизации репликации и предложим соответствующие решения.

source: Replacing the same primary key
ru: Замена по одному и тому же первичному ключу

source: **Case 1:** You have two instances of Tarantool. For example, you try to make a ``replace`` operation with the same primary key on both instances in the same time. This will cause a conflict over which tuple to save and which one to discard.
ru: **Кейс 1:** у вас есть два экземпляра Тарантула. Например, вы пытаетесь сделать операцию замены одного и того же первичного ключа на обоих экземплярах одновременно. Случится конфликт из-за того, какой кортеж сохранить, а какой отбросить.

source: Tarantool :ref:`trigger functions <triggers>` can help here to implement the rules of conflict resolution on some condition. For example, if you have a timestamp, you can declare saving the tuple with the bigger one.
ru: :ref:`Триггер-функции <triggers>` Тарантула могут помочь в реализации правил разрешения конфликтов при определенных условиях. Например, если у вас есть метка времени, то можно указать, что сохранять нужно кортеж с большей меткой.

source: First, you need a :ref:`before_replace() <box_space-before_replace>` trigger on the space which may have conflicts. In this trigger you can compare the old and new replica records and choose which one to use (or skip the update entirely, or merge two records together).
ru: Во-первых, вам нужно повесить триггер :ref:`before_replace() <box_space-before_replace>` на спейс, в котором могут быть конфликты. В этом триггере вы можете сравнить старую и новую записи реплики и выбрать, какую из них использовать (или полностью пропустить обновление, или объединить две записи вместе).

source: Then you need to set the trigger at the right time, before the space starts to receive any updates. The way you usually set the ``before_replace`` trigger is right when the space is created, so you need a trigger to set another trigger on the system space ``_space``, to capture the moment when your space is created and set the trigger there. This can be an :ref:`on_replace() <box_space-on_replace>` trigger.
ru: Затем вам нужно установить триггер в нужное время, прежде чем спейс начнет получать обновления. Триггер ``before_replace`` нужно устанавливать в тот момент, когда спейс создается, поэтому еще нужен триггер, чтобы установить другой триггер на системном спейсе ``_space``, чтобы поймать момент, когда ваш спейс создается, и установить триггер там. Для этого подходит триггер :ref:`on_replace() <box_space-on_replace>`.

source: The difference between ``before_replace`` and ``on_replace`` is that ``on_replace`` is called after a row is inserted into the space, and ``before_replace`` is called before that.
ru: Разница между ``before_replace`` и ``on_replace`` заключается в том, что ``on_replace`` вызывается после вставки строки в спейс, а ``before_replace`` вызывается перед ней.

source: To set a ``_space:on_replace()`` trigger correctly, you also need the right timing. The best timing to use it is when ``_space`` is just created, which is the :ref:`box.ctl.on_schema_init() <box_ctl-on_schema_init>` trigger.
ru: Устанавливать триггер ``_space:on_replace()`` также нужно в определенный момент. Лучшее время для его использования -- это когда только что создан ``_space``, что является триггером на :ref:`box.ctl.on_schema_init() <box_ctl-on_schema_init>`.

source: You will also need to utilize ``box.on_commit`` to get access to the space being created. The resulting snippet would be the following:
ru: Вам также нужно использовать ``box.on_commit``, чтобы получить доступ к создаваемому спейсу. В результате код будет выглядеть следующим образом:

source: local my_space_name = 'my_space' local my_trigger = function(old, new) ... end -- your function resolving a conflict box.ctl.on_schema_init(function() box.space._space:on_replace(function(old_space, new_space) if not old_space and new_space and new_space.name == my_space_name then box.on_commit(function() box.space[my_space_name]:before_replace(my_trigger) end end end) end)
ru: local my_space_name = 'my_space' local my_trigger = function(old, new) ... end -- ваша функция, устраняющая конфликт box.ctl.on_schema_init(function() box.space._space:on_replace(function(old_space, new_space) if not old_space and new_space and new_space.name == my_space_name then box.on_commit(function() box.space[my_space_name]:before_replace(my_trigger) end end end) end)

source: Preventing duplicate insert
ru: Предотвращение дублирующей вставки

source: **Case 2:** In a replica set of two masters, suppose master #1 tries to ``insert`` a tuple with the same unique key:
ru: **Кейс 2:** Предположим, что в наборе реплик с двумя мастерами мастер №1 пытается вставить кортеж с одинаковым уникальным ключом:

source: This would cause an error saying ``Duplicate key exists in unique index 'primary' in space 'tester'`` and the replication would be stopped. (This is the behavior when the :ref:`replication_skip_conflict <cfg_replication-replication_skip_conflict>` configuration parameter has its default recommended value, ``false``.)
ru: Это вызовет сообщение об ошибке дубликата ключа (``Duplicate key exists in unique index 'primary' in space 'tester'``), и репликация остановится. Такое поведение системы обеспечивается использованием рекомендуемого значения ``false`` (по умолчанию) для конфигурационного параметра :ref:`replication_skip_conflict <cfg_replication-replication_skip_conflict>`.

source: $ # error messages from master #1 2017-06-26 21:17:03.233 [30444] main/104/applier/rep_user@100.96.166.1 I> can't read row 2017-06-26 21:17:03.233 [30444] main/104/applier/rep_user@100.96.166.1 memtx_hash.cc:226 E> ER_TUPLE_FOUND: Duplicate key exists in unique index 'primary' in space 'tester' 2017-06-26 21:17:03.233 [30444] relay/[::ffff:100.96.166.178]/101/main I> the replica has closed its socket, exiting 2017-06-26 21:17:03.233 [30444] relay/[::ffff:100.96.166.178]/101/main C> exiting the relay loop $ # error messages from master #2 2017-06-26 21:17:03.233 [30445] main/104/applier/rep_user@100.96.166.1 I> can't read row 2017-06-26 21:17:03.233 [30445] main/104/applier/rep_user@100.96.166.1 memtx_hash.cc:226 E> ER_TUPLE_FOUND: Duplicate key exists in unique index 'primary' in space 'tester' 2017-06-26 21:17:03.234 [30445] relay/[::ffff:100.96.166.178]/101/main I> the replica has closed its socket, exiting 2017-06-26 21:17:03.234 [30445] relay/[::ffff:100.96.166.178]/101/main C> exiting the relay loop
ru: $ # сообщения об ошибках от мастера №1 2017-06-26 21:17:03.233 [30444] main/104/applier/rep_user@100.96.166.1 I> can't read row 2017-06-26 21:17:03.233 [30444] main/104/applier/rep_user@100.96.166.1 memtx_hash.cc:226 E> ER_TUPLE_FOUND: Duplicate key exists in unique index 'primary' in space 'tester' 2017-06-26 21:17:03.233 [30444] relay/[::ffff:100.96.166.178]/101/main I> the replica has closed its socket, exiting 2017-06-26 21:17:03.233 [30444] relay/[::ffff:100.96.166.178]/101/main C> exiting the relay loop $ # сообщения об ошибках от мастера №2 2017-06-26 21:17:03.233 [30445] main/104/applier/rep_user@100.96.166.1 I> can't read row 2017-06-26 21:17:03.233 [30445] main/104/applier/rep_user@100.96.166.1 memtx_hash.cc:226 E> ER_TUPLE_FOUND: Duplicate key exists in unique index 'primary' in space 'tester' 2017-06-26 21:17:03.234 [30445] relay/[::ffff:100.96.166.178]/101/main I> the replica has closed its socket, exiting 2017-06-26 21:17:03.234 [30445] relay/[::ffff:100.96.166.178]/101/main C> exiting the relay loop

source: If we check replication statuses with ``box.info``, we will see that replication at master #1 is stopped (``1.upstream.status = stopped``). Additionally, no data is replicated from that master (section ``1.downstream`` is missing in the report), because the downstream has encountered the same error:
ru: Если мы проверим статус репликации с помощью ``box.info``, то увидим, что репликация на мастере №1 остановлена (``1.upstream.status = stopped``). Кроме того, данные с этого мастера не реплицируются (группа ``1.downstream`` отсутствует в отчете), поскольку встречается та же ошибка:

source: # replication statuses (report from master #3) tarantool> box.info --- - version: 1.7.4-52-g980d30092 id: 3 ro: false vclock: {1: 9, 2: 1000000, 3: 3} uptime: 557 lsn: 3 vinyl: [] cluster: uuid: 34d13b1a-f851-45bb-8f57-57489d3b3c8b pid: 30445 status: running signature: 1000012 replication: 1: id: 1 uuid: 7ab6dee7-dc0f-4477-af2b-0e63452573cf lsn: 9 upstream: peer: replicator@192.168.0.101:3301 lag: 0.00050592422485352 status: stopped idle: 445.8626639843 message: Duplicate key exists in unique index 'primary' in space 'tester' 2: id: 2 uuid: 9afbe2d9-db84-4d05-9a7b-e0cbbf861e28 lsn: 1000000 upstream: status: follow idle: 201.99915885925 peer: replicator@192.168.0.102:3301 lag: 0.0015020370483398 downstream: vclock: {1: 8, 2: 1000000, 3: 3} 3: id: 3 uuid: e826a667-eed7-48d5-a290-64299b159571 lsn: 3 uuid: e826a667-eed7-48d5-a290-64299b159571 ...
ru: # статусы репликации (отчет от мастера №3) tarantool> box.info --- - version: 1.7.4-52-g980d30092 id: 3 ro: false vclock: {1: 9, 2: 1000000, 3: 3} uptime: 557 lsn: 3 vinyl: [] cluster: uuid: 34d13b1a-f851-45bb-8f57-57489d3b3c8b pid: 30445 status: running signature: 1000012 replication: 1: id: 1 uuid: 7ab6dee7-dc0f-4477-af2b-0e63452573cf lsn: 9 upstream: peer: replicator@192.168.0.101:3301 lag: 0.00050592422485352 status: stopped idle: 445.8626639843 message: Duplicate key exists in unique index 'primary' in space 'tester' 2: id: 2 uuid: 9afbe2d9-db84-4d05-9a7b-e0cbbf861e28 lsn: 1000000 upstream: status: follow idle: 201.99915885925 peer: replicator@192.168.0.102:3301 lag: 0.0015020370483398 downstream: vclock: {1: 8, 2: 1000000, 3: 3} 3: id: 3 uuid: e826a667-eed7-48d5-a290-64299b159571 lsn: 3 uuid: e826a667-eed7-48d5-a290-64299b159571 ...

source: When replication is later manually resumed:
ru: Когда позднее репликация возобновлена вручную:

source: # resuming stopped replication (at all masters) tarantool> original_value = box.cfg.replication tarantool> box.cfg{replication={}} tarantool> box.cfg{replication=original_value}
ru: # возобновление остановленной репликации (на всех мастерах) tarantool> original_value = box.cfg.replication tarantool> box.cfg{replication={}} tarantool> box.cfg{replication=original_value}

source: ... the faulty row in the write-ahead-log files is skipped.
ru: ... запись с ошибкой в журнале упреждающей записи пропущена.

source: **Solution #1: replication runs out of sync**
ru: **Решение #1: рассинхронизация репликации**

source: In a master-master cluster of two instances, suppose we make the following operation:
ru: Предположим, что мы выполняем следующую операцию в кластере из двух экземпляров с конфигурацией мастер-мастер:

source: When this operation is applied on both instances in the replica set:
ru: Когда эта операция применяется на обоих экземплярах в наборе реплик:

source: # at master #1 tarantool> box.space.tester:upsert({1}, {{'=', 2, box.info.uuid}}) # at master #2 tarantool> box.space.tester:upsert({1}, {{'=', 2, box.info.uuid}})
ru: # на мастере #1 tarantool> box.space.tester:upsert({1}, {{'=', 2, box.info.uuid}}) # на мастере #2 tarantool> box.space.tester:upsert({1}, {{'=', 2, box.info.uuid}})

source: ... we can have the following results, depending on the order of execution:
ru: ... можно получить следующие результаты в зависимости от порядка выполнения:

source: each master’s row contains the UUID from master #1,
ru: каждая строка мастера содержит UUID из мастера №1,

source: each master’s row contains the UUID from master #2,
ru: каждая строка мастера содержит UUID из мастера №2,

source: master #1 has the UUID of master #2, and vice versa.
ru: у мастера №1 UUID мастера №2, и наоборот.

source: **Solution #2: commutative changes**
ru: **Решение #2: коммутативные изменения**

source: The cases described in the previous paragraphs represent examples of **non-commutative** operations, i.e. operations whose result depends on the execution order. On the contrary, for **commutative operations**, the execution order does not matter.
ru: Случаи, описанные в предыдущих абзацах, представляют собой примеры **некоммутативных** операций, т.е. операций, результат которых зависит от порядка их выполнения. Для **коммутативных операций** порядок выполнения значения не имеет.

source: Consider for example the following command:
ru: Рассмотрим, например, следующую команду:

source: This operation is commutative: we get the same result no matter in which order the update is applied on the other masters.
ru: Эта операция коммутативна: получаем одинаковый результат, независимо от порядка, в котором обновление применяется на других мастерах.

source: **Solution #3: trigger usage**
ru: **Решение #3: использование триггера**

source: The logic and the snippet setting a trigger will be the same here as in case 1. But the trigger function will differ:
ru: Логика и установка триггера будет такой же, как в кейсе 1. Но сама триггер-функция будет отличаться:

source: local my_space_name = 'test' local my_trigger = function(old, new, sp, op) -- op: ‘INSERT’, ‘DELETE’, ‘UPDATE’, or ‘REPLACE’ if new == nil then print("No new during "..op, old) return -- deletes are ok end if old == nil then print("Insert new, no old", new) return new -- insert without old value: ok end print(op.." duplicate", old, new) if op == 'INSERT' then if new[2] > old[2] then -- Creating new tuple will change op to ‘REPLACE’ return box.tuple.new(new) end return old end if new[2] > old[2] then return new else return old end return end box.ctl.on_schema_init(function() box.space._space:on_replace(function(old_space, new_space) if not old_space and new_space and new_space.name == my_space_name then box.on_commit(function() box.space[my_space_name]:before_replace(my_trigger) end) end end) end)
ru: local my_space_name = 'test' local my_trigger = function(old, new, sp, op) -- op: ‘INSERT’, ‘DELETE’, ‘UPDATE’, or ‘REPLACE’ if new == nil then print("No new during "..op, old) return -- удаление допустимо end if old == nil then print("Insert new, no old", new) return new -- вставка без старого значения допустима end print(op.." duplicate", old, new) if op == 'INSERT' then if new[2] > old[2] then -- Создание нового кортежа сменит оператор на REPLACE return box.tuple.new(new) end return old end if new[2] > old[2] then return new else return old end return end box.ctl.on_schema_init(function() box.space._space:on_replace(function(old_space, new_space) if not old_space and new_space and new_space.name == my_space_name then box.on_commit(function() box.space[my_space_name]:before_replace(my_trigger) end) end end) end)
