Repository: tarantool/doc
Catalog: locale/*/LC_MESSAGES/platform/security/security.po
Languages: ru

source: Security hardening guide
ru: Инструкции по повышению безопасности

source: This guide explains how to enhance security in your Tarantool Enterprise Edition's cluster using built-in features and provides general recommendations on security hardening.
ru: В данном руководстве объясняется, как обеспечить безопасность в кластере Tarantool Enterprise, используя встроенные функции, и даются общие рекомендации по повышению безопасности.

source: Tarantool Enterprise Edition does not provide a dedicated API for security control. All the necessary configuration can be done via an administrative console or initialization code.
ru: В Tarantool Enterprise нет выделенного API для контроля безопасности. Все необходимые настройки можно выполнить через административную консоль или код инициализации.

source: Built-in security features
ru: Встроенные средства безопасности

source: Tarantool Enterprise Edition has the following built-in security features:
ru: В Tarantool Enterprise есть следующие встроенные средства безопасности:

source: authentication,
ru: аутентификация,

source: access control,
ru: управление доступом,

source: audit log;
ru: журнал аудита;

source: And backup functionality:
ru: А также функции резервного копирования:

source: `snapshotting </book/admin/backups/>`_ (physical),
ru: `создание снимков </book/admin/backups/>`_ (физическое),

source: `dumping <https://github.com/tarantool/dump>`_ (logical).
ru: `создание дампов <https://github.com/tarantool/dump>`_ (логическое).

source: The following sections describe the features and provide links to detailed documentation.
ru: В следующих разделах описаны эти функции и приведены ссылки на подробную документацию.

source: Authentication
ru: Аутентификация

source: Tarantool Enterprise Edition supports password-based authentication and allows for two types of connections:
ru: Tarantool Enterprise поддерживает аутентификацию на основе паролей и допускает два типа соединений:

source: via an `administrative console </reference/reference_lua/console/>`_ and
ru: через `административную консоль </reference/reference_lua/console/>`_ и

source: over a binary port for read and write operations and procedure invocation.
ru: через двоичный порт для операций чтения / записи и вызова процедур.

source: For more information on authentication and connection types, see the `security section of the Tarantool manual </book/admin/security/>`_.
ru: Для получения дополнительной информации об аутентификации и типах соединений см. `раздел по безопасности в руководстве по Tarantool </book/admin/security/>`_.

source: In addition, Tarantool provides the following functionality:
ru: Кроме того, Tarantool предоставляет следующие функциональные возможности:

source: `sessions </book/box/authentication/#sessions-and-security>`_ -- states which associate connections with users and make Tarantool API available to them after authentication,
ru: `сеансы </book/box/authentication/#sessions-and-security>`_ -- состояния, которые связывают соединения с пользователями и предоставляют доступ к API Tarantool после аутентификации,

source: authentication `triggers </book/box/triggers/>`_ which execute actions on authentication events.
ru: `триггеры </book/box/triggers/>`_ аутентификации, которые выполняют действия при событиях аутентификации.

source: third-party (external) authentication protocols and services such as LDAP or Active Directory -- supported in the web interface, but unavailable on the binary-protocol level.
ru: сторонние (внешние) протоколы и службы аутентификации, такие как LDAP или Active Directory, поддерживаются в веб-интерфейсе, но недоступны на уровне бинарного протокола.

source: Access control
ru: Управление доступом

source: Tarantool Enterprise Edition provides the means for administrators to prevent unauthorized access to the database and to certain functions.
ru: Для администраторов Tarantool Enterprise предоставляет средства предотвращения несанкционированного доступа к базе данных и к определенным функциям.

source: Tarantool recognizes:
ru: Tarantool различает:

source: different users (guests and administrators),
ru: разных пользователей (гостей и администраторов),

source: **privileges** associated with users,
ru: **права**, связанные с пользователями,

source: **roles** (containers for privileges) granted to users;
ru: **роли** (контейнеры для ролей), выданные пользователям;

source: And divides system space into:
ru: И хранит информацию о доступе в системных спейсах:

source: ``_user`` space to store usernames and hashed passwords for authentication,
ru: спейс ``_user`` для хранения имен пользователей и хеш-паролей для аутентификации,

source: ``_priv`` space to store privileges for access control.
ru: спейс ``_priv`` для хранения прав доступа.

source: For more information, see the `access control section of the Tarantool manual </book/box/authentication/#authentication-users>`_.
ru: Для получения дополнительной информации см. `раздел по управлению доступом в руководстве по Tarantool </book/box/authentication/#authentication-users>`_.

source: Users who create **objects** (spaces, indexes, users, roles, sequences, and functions) in the database become their **owners** and automatically acquire privileges for what they create. For more information, see the `owners and privileges section of the Tarantool manual </book/box/authentication/#owners-and-privileges>`_.
ru: Пользователи, которые создают **объекты** (спейсы, индексы, пользователей, роли, последовательности и функции) в базе данных становятся их **владельцами** и автоматически получают права на то, что они создают. Для получения дополнительной информации см. `раздел о владельцах и правах в руководстве по Tarantool </book/box/authentication/#owners-and-privileges>`_.

source: Audit log
ru: Журнал аудита

source: Tarantool Enterprise Edition has a built-in audit log that records events such as:
ru: В Tarantool Enterprise есть встроенный журнал аудита, в котором записываются такие события, как:

source: authentication successes and failures;
ru: пройденная и непройденная аутентификации;

source: connection closures;
ru: закрытие подключения;

source: creation, removal, enabling, and disabling of users;
ru: создание, удаление, включение и отключение пользователей;

source: changes of passwords, privileges, and roles;
ru: изменение паролей, прав и ролей;

source: denials of access to database objects;
ru: отказ в доступе к объектам базы данных;

source: Audit log contains:
ru: В журнале аудита указываются:

source: timestamps,
ru: отметки времени,

source: usernames of users who performed actions,
ru: имена пользователей, которые выполняли действия,

source: event types (e.g. ``user_create``, ``user_enable``, ``disconnect``, etc),
ru: типы событий (например, ``user_create``, ``user_enable``, ``disconnect`` и т.д.),

source: descriptions.
ru: описание.

source: Audit log has two configuration parameters:
ru: Есть два конфигурационных параметра для настройки журнала аудита:

source: ``audit_log = <PATH_TO_FILE>`` which is similar to the `log </reference/configuration/#cfg-logging-log>`_ parameter; it tells Tarantool to record audit events to a specific file;
ru: ``audit_log = <PATH_TO_FILE>``, аналог параметра `log </reference/configuration/#cfg-logging-log>`_; если данный параметр задан, то Tarantool записывает события, подлежащие аудиту, в указанный файл;

source: ``audit_nonblock`` which is similar to the `log_nonblock </reference/configuration/#cfg-logging-log-nonblock>`_ parameter.
ru: ``audit_nonblock``, аналог параметра `log_nonblock </reference/configuration/#cfg-logging-log-nonblock>`_.

source: For more information on logging, see the following:
ru: Для получения дополнительной информации о журналировании см. следующие разделы:

source: `logs section of the Tarantool manual </book/admin/logs/>`_,
ru: `раздел о журналах в руководстве по Tarantool </book/admin/logs/>`_,

source: `logging section of the configuration reference </reference/configuration/#logging>`_,
ru: `раздел по журналированию в справочнике по настройке </reference/configuration/#logging>`_,

source: :ref:`Audit module <enterprise_audit_module>` in this document.
ru: :ref:`Журнал аудита <enterprise_audit_module>` данного документа.

source: Access permissions to audit log files can be set up as to any other Unix file system object -- via ``chmod``.
ru: Права доступа к файлам журнала можно настроить, как для любого другого объекта файловой системы Unix -- через ``chmod``.

source: Recommendations on security hardening
ru: Рекомендации по повышению безопасности

source: This section lists recommendations that can help you harden the cluster's security.
ru: В этом разделе даны рекомендации, которые могут помочь вам повысить безопасность кластера.

source: Traffic encryption
ru: Криптографическая защита трафика

source: Tarantool Enterprise does not encrypt traffic over binary connections (i.e., between servers in the cluster). To secure such connections, consider:
ru: Tarantool Enterprise не шифрует трафик, проходящий через двоичные соединения (т.е. между серверами в кластере). Чтобы защитить такие соединения, рекомендуется:

source: setting up connection tunneling, or
ru: настроить туннелирование соединения или

source: encrypting the actual data stored in the database.
ru: зашифровать сами данные, которые хранятся в базе.

source: For more information on data encryption, see the `crypto module reference </reference/reference_lua/crypto/>`_.
ru: Для получения дополнительной информации см. `справочник по модулю crypto </reference/reference_lua/crypto/>`_.

source: The `HTTP server module <https://github.com/tarantool/http>`_ provided by rocks does not support the HTTPS protocol. To set up a secure connection for a client (e.g., REST service), consider hiding the Tarantool instance (router if it is a cluster of instances) behind a Nginx server and setting up an SSL certificate for it.
ru: `Модуль HTTP-сервера <https://github.com/tarantool/http>`_ из сторонних библиотек не поддерживает протокол HTTPS. Чтобы установить безопасное соединение для клиента (например, REST-сервис), рекомендуется скрыть экземпляр Tarantool (роутер, если это кластер экземпляров) за сервером Nginx и настроить для него сертификат SSL.

source: To make sure that no information can be intercepted 'from the wild', run Nginx on the same physical server as the instance and set up their communication over a Unix socket. For more information, see the `socket module reference </reference/reference_lua/socket/>`_.
ru: Чтобы убедиться, что никакая информация не может быть перехвачена извне, запустите Nginx на том же физическом сервере, что и экземпляр, и настройте их связь по Unix-сокету. Для получения дополнительной информации см. `справочник по модулю socket </reference/reference_lua/socket/>`_.

source: Firewall configuration
ru: Настройка брандмауэра

source: To protect the cluster from any unwanted network activity 'from the wild', configure the firewall on each server to allow traffic on ports listed in :ref:`network requirements <enterprise-prereqs-network>`.
ru: Чтобы защитить кластер от нежелательной сетевой активности извне, настройте брандмауэр на каждом сервере, чтобы разрешить трафик через порты, перечисленные в :ref:`сетевых требованиях <enterprise-prereqs-network>`.

source: If you are using static IP addresses, whitelist them, again, on each server as the cluster has a full mesh network topology. Consider blacklisting all the other addresses on all servers except the router (running behind the Nginx server).
ru: Если вы используете статические IP-адреса, повторно внесите их в белый список на каждом сервере, поскольку кластер работает на принципах полносвязной топологии (full mesh topology). Рекомендуется внести в черный список всех остальные адреса на всех серверах, кроме роутера (работающего за сервером Nginx).

source: Tarantool Enterprise does not provide defense against DoS or DDoS attacks. Consider using third-party software instead.
ru: Tarantool Enterprise не предоставляет защиту от DoS-атак или DDoS-атак. Для этих целей рекомендуется использовать сторонние программы.

source: Data integrity
ru: Целостность данных

source: Tarantool Enterprise does not keep checksums or provide the means to control data integrity. However, it ensures data persistence using a write ahead log, regularly snapshots the entire data set to disk, and checks the data format whenever it reads the data back from the disk. For more information, see the `data persistence section of the Tarantool manual <https://www.tarantool.io/en/doc/1.9/book/box/data_model/#persistence>`_.
ru: Tarantool Enterprise не хранит контрольные суммы и не предоставляет инструменты для контроля целостности данных. Тем не менее, он обеспечивает персистентность данных с помощью журнала упреждающей записи, регулярно делает снимок всего набора данных на диск и проверяет формат данных всякий раз, когда считывает данные с диска. Для получения дополнительной информации см. `раздел о персистентности данных в руководстве по Tarantool <https://www.tarantool.io/en/doc/1.9/book/box/data_model/#persistence>`_.
