Repository: tarantool/doc
Catalog: locale/*/LC_MESSAGES/doc.po
Languages: ru

source: This is a basic function which is used by other functions. Depending on the value of ``condition``, print 'ok' or 'not ok' along with debugging information. Displays the message.
ru: Это базовая функция, которая используется другими функциями. В зависимости от условия ``condition``, выводится 'ok' или 'not ok' вместе с отладочной информацией. Отображается сообщение.

source: an expression which is true or false
ru: выражение, которое либо true (правда), либо false (ложь)

source: name of the test
ru: имя теста

source: ``taptest:fail('x')`` is equivalent to ``taptest:ok(false, 'x')``. Displays the message.
ru: ``taptest:fail('x')`` -- аналог ``taptest:ok(false, 'x')``. Отображается сообщение.

source: ``taptest:skip('x')`` is equivalent to ``taptest:ok(true, 'x' .. '# skip')``. Displays the message.
ru: ``taptest:skip('x')`` -- аналог ``taptest:ok(true, 'x' .. '# skip')``. Отображается сообщение.

source: Check whether the first argument equals the second argument. Displays extensive message if the result is false.
ru: Проверка равенства первого аргумента второму аргументу. Отображается подробное сообщение, если результатом будет false (ложь).

source: actual result
ru: фактический результат

source: expected result
ru: ожидаемый результат

source: This is the negation of :ref:`taptest:is() <taptest-is>`.
ru: Отрицание :ref:`taptest:is() <taptest-is>`.

source: Recursive version of ``taptest:is(...)``, which can be be used to compare tables as well as scalar values.
ru: Рекурсивная версия ``taptest:is(...)``, которую можно использовать для сопоставления таблиц, а также скалярных значений.

source: Verify a string against a `pattern <http://lua-users.org/wiki/PatternsTutorial>`_. Ok if match is found.
ru: Проверка совпадения строки с `шаблоном <http://lua-users.org/wiki/PatternsTutorial>`_. Ok, если найдено совпадение.

source: pattern
ru: шаблон

source: This is the negation of :ref:`taptest:like() <taptest-like>`.
ru: Отрицание :ref:`taptest:like() <taptest-like>`.

source: Test whether a value has a particular type. Displays a long message if the value is not of the specified type.
ru: Проверка соответствия значения определенному типу. Отображается длинное сообщение, если значение не принадлежит указанному типу.

source: To run this example: put the script in a file named ./tap.lua, then make tap.lua executable by saying ``chmod a+x ./tap.lua``, then execute using Tarantool as a script processor by saying ./tap.lua.
ru: Для выполнения данного примера поместите скрипт в файл под названием ./tap.lua, затем сделайте tap.lua выполняемым файлом с помощью команды ``chmod a+x ./tap.lua``, а затем выполните его, используя Tarantool в качестве обработчика скриптов после выполнения команды ./tap.lua.

source: The output from the above script will look approximately like this:
ru: Результатом вышеприведенного скрипта будет примерно следующее:

source: Module `tarantool`
ru: Модуль `tarantool`

source: By saying ``require('tarantool')``, one can answer some questions about how the tarantool server was built, such as "what flags were used", or "what was the version of the compiler".
ru: Выполнив команду ``require('tarantool')``, можно получить ответы на вопросы о том, как был собран Tarantool-сервер, например, какие флаги были использованы, или какая версия компилятора использовалась.

source: Additionally one can see the uptime and the server version and the process id. Those information items can also be accessed with :ref:`box.info() <box_introspection-box_info>` but use of the tarantool module is recommended.
ru: Кроме того, можно проверить время работы и версию сервера, а также идентификатор процесса. Эту информацию также можно получить с помощью :ref:`box.info() <box_introspection-box_info>`, но рекомендуется использовать модуль tarantool.

source: Module `uri`
ru: Модуль `uri`

source: A "URI" is a "Uniform Resource Identifier". The `IETF standard <https://www.ietf.org/rfc/rfc2396.txt>`_ says a URI string looks like this:
ru: URI -- это Унифицированный идентификатор ресурса (Uniform Resource Identifier). Согласно `стандарту IETF <https://www.ietf.org/rfc/rfc2396.txt>`_, URI-строка выглядит следующим образом:

source: [scheme:]scheme-specific-part[#fragment]
ru: [схема:]специальная-часть-схемы[#фрагмент]

source: A common type, a hierarchical URI, looks like this:
ru: Общий тип, иерархический URI, выглядит так:

source: [scheme:][//authority][path][?query][#fragment]
ru: [схема:][//адрес][путь][?запрос][#фрагмент]

source: For example the string ``'https://tarantool.org/x.html#y'`` has three components:
ru: Например, строка ``'https://tarantool.org/x.html#y'`` содержит три компонента:

source: ``https`` is the scheme,
ru: ``https`` -- схема,

source: ``tarantool.org/x.html`` is the path,
ru: ``tarantool.org/x.html`` -- путь,

source: ``y`` is the fragment.
ru: ``y`` -- фрагмент.

source: Tarantool's URI module provides routines which convert URI strings into their components, or turn components into URI strings.
ru: Модуль Tarantool'а URI включает в себя процедуры для разложения URI-строк на компоненты или объединения компонентов в URI-строку.

source: Below is a list of all ``uri`` functions.
ru: Ниже приведен перечень всех функций модуля ``uri``.

source: Get a table of URI components
ru: Получение таблицы URI-компонентов

source: Construct a URI from components
ru: Создание URI из компонентов

source: a Uniform Resource Identifier
ru: Унифицированный идентификатор ресурса

source: URI-components-table. Possible components are fragment, host, login, password, path, query, scheme, service.
ru: таблица с компонентами URI. Доступные компоненты: fragment (фрагмент), host (хост), login (имя для входа), password (пароль), path (путь), query (запрос), scheme (схема), service (сервис).

source: Table
ru: Таблица

source: a series of name:value pairs, one for each component
ru: ряд пар ключ-значение, одна для каждого компонента

source: URI-string. Thus uri.format() is the reverse of uri.parse().
ru: URI-строка. Таким образом, uri.format() -- это операция, обратная uri.parse().

source: Module `uuid`
ru: Модуль `uuid`

source: A "UUID" is a `Universally unique identifier`_. If an application requires that a value be unique only within a single computer or on a single database, then a simple counter is better than a UUID, because getting a UUID is time-consuming (it requires a syscall_). For clusters of computers, or widely distributed applications, UUIDs are better.
ru: UUID -- это Универсальный уникальный идентификатор (`Universally unique identifier`_). Если значение должно быть уникальным в пределах отдельного компьютера или одной базы данных, лучше использовать простой счетчик вместо UUID, поскольку получение UUID затратно по времени (требуется syscall_). Что же касается кластеров компьютеров или широко распространенных приложений, лучше использовать UUID.

source: Below is list of all ``uuid`` functions and members.
ru: Ниже приведен перечень всех функций и элементов модуля ``uuid``.

source: A nil object
ru: Объект nil

source: Get a UUID
ru: Получение UUID

source: Get a converted UUID
ru: Получение конвертированного UUID

source: Check if a UUID is an all-zero value
ru: Проверка, состоит ли UUID из одних нулей

source: a UUID
ru: UUID

source: 16-byte string
ru: 16-байтная строка

source: 36-byte binary string
ru: 36-байтная двоичная строка

source: UUID in 36-byte hexadecimal string
ru: UUID в 36-байтной шестнадцатеричной строке

source: converted UUID
ru: конвертированный UUID

source: UUID in 16-byte binary string
ru: UUID в 16-байтной двоичной строке

source: ``byte-order`` can be one of next flags:
ru: ``byte-order`` может быть одним из следующих флагов:

source: 'l' - little-endian,
ru: 'l' - порядок от младшего к старшему,

source: 'b' - big-endian,
ru: 'b' - порядок от старшего к младшему,

source: 'h' - endianness depends on host (default),
ru: 'h' - порядок зависит от хоста (по умолчанию),

source: 'n' - endianness depends on network
ru: 'n' - порядок зависит от сети

source: one of ``'l'``, ``'b'``, ``'h'`` or ``'n'``.
ru: один из ``'l'``, ``'b'``, ``'h'`` или ``'n'``.

source: UUID converted from cdata input value.
ru: UUID, сконвертированный из введенного значения формата cdata.

source: 16-byte binary string
ru: 16-байтная двоичная строка

source: 36-byte hexadecimal string
ru: 36-байтная шестнадцатеричная строка

source: The all-zero UUID value can be expressed as uuid.NULL, or as ``uuid.fromstr('00000000-0000-0000-0000-000000000000')``. The comparison with an all-zero value can also be expressed as ``uuid_with_type_cdata == uuid.NULL``.
ru: Значение UUID из одних нулей может быть выражено как uuid.NULL или ``uuid.fromstr('00000000-0000-0000-0000-000000000000')``. Сравнение со значением из одних нулей также может быть выражено как ``uuid_with_type_cdata == uuid.NULL``.

source: true if the value is all zero, otherwise false.
ru: true (правда), если значение состоит из одних нулей, в противном случае false (ложь).

source: Module `xlog`
ru: Модуль `xlog`

source: The xlog module contains one function: ``pairs()``. It can be used to read Tarantool's :ref:`snapshot files<index-box_persistence>` or :ref:`write-ahead-log (WAL) <internals-wal>` files. A description of the file format is in section :ref:`Data persistence and the WAL file format <internals-data_persistence>`.
ru: Модуль xlog включает в себя одну функцию: ``pairs()``. Ее можно использовать для чтения :ref:`файлов снимка <index-box_persistence>` или :ref:`файлов журнала упреждающей записи (WAL) <internals-wal>` в Tarantool'е. Описание формата файла дается в разделе :ref:`Персистентность данных и формат WAL-файла <internals-data_persistence>`.

source: Open a file, and allow iterating over one file entry at a time.
ru: Открытие файла и итерация по одной записи файла за раз.

source: returns
ru: возвращает

source: iterator which can be used in a for/end loop.
ru: итератор, который можно использовать в цикле for / end.

source: `iterator <https://www.lua.org/pil/7.1.html>`_
ru: `итератор <https://www.lua.org/pil/7.1.html>`_

source: Possible errors: File does not contain properly formatted snapshot or write-ahead-log information.
ru: Возможные ошибки: Файл не содержит снимок в правильном формате или информацию журнала упреждающей записи.

source: This will read the first write-ahead-log (WAL) file that was created in the :ref:`wal_dir <cfg_basic-wal_dir>` directory in our :ref:`"Getting started" exercises <getting_started>`.
ru: В данном примере производится чтение первого WAL-файла, который был создан в директории :ref:`wal_dir <cfg_basic-wal_dir>` в рамках наших :ref:`упражнений в "Руководстве для начинающих" <getting_started>`.

source: Each result from ``pairs()`` is formatted with MsgPack so its structure can be specified with :ref:`__serialize <msgpack-serialize>`.
ru: Каждый результат из ``pairs()`` выводится в формате MsgPack, поэтому его структуру можно указать с помощью :ref:`__serialize <msgpack-serialize>`.

source: The first lines of the result will look like:
ru: Первые строки результата будут выглядеть следующим образом:

source: Module `yaml`
ru: Модуль `yaml`

source: The ``yaml`` module takes strings in YAML_ format and decodes them, or takes a series of non-YAML values and encodes them.
ru: Модуль ``yaml`` берет строки в формате YAML_ и декодирует их или берет ряд значений в ином формате и кодирует их в формат YAML.

source: Below is a list of all ``yaml`` functions and members.
ru: Ниже приведен перечень всех функций и элементов модуля ``yaml``.

source: Convert a Lua object to a YAML string
ru: Конвертация Lua-объекта в YAML-строку

source: Convert a YAML string to a Lua object
ru: Конвертация YAML-строки в Lua-объект

source: Convert a Lua object to a YAML string.
ru: Конвертация Lua-объекта в YAML-строку.

source: the original value reformatted as a YAML string.
ru: оригинальное значение, преобразованное в YAML-строку.

source: Convert a YAML string to a Lua object.
ru: Конвертация YAML-строки в Lua-объект.

source: a string formatted as YAML.
ru: строка в формате YAML.

source: The `YAML collection style <http://yaml.org/spec/1.1/#id930798>`_ can be specified with ``__serialize``:
ru: `Набор YAML-стилей <http://yaml.org/spec/1.1/#id930798>`_ можно указать с помощью ``__serialize``:

source: ``__serialize="sequence"`` for a Block Sequence array,
ru: ``__serialize="sequence"`` для массива последовательности блоков,

source: ``__serialize="seq"`` for a Flow Sequence array,
ru: ``__serialize="seq"`` для массива последовательности потоков,

source: ``__serialize="mapping"`` for a Block Mapping map,
ru: ``__serialize="mapping"`` для ассоциативного массива последовательности блоков,

source: ``__serialize="map"`` for a Flow Mapping map.
ru: ``__serialize="map"`` для ассоциативного массива последовательности потоков.

source: Also, some YAML configuration settings for encoding can be changed, in the same way that they can be changed for :ref:`JSON <json-module_cfg>`.
ru: Кроме того, некоторые параметры конфигурации YAML для кодировки можно изменить так же, как и для :ref:`JSON <json-module_cfg>`.

source: SQL DBMS Modules
ru: Модули СУБД SQL

source: The discussion here in the reference is about incorporating and using two modules that have already been created: the "SQL DBMS rocks" for MySQL and PostgreSQL.
ru: В данном разделе справочника рассматривается внедрение и использование двух уже созданных модулей: сторонние библиотеки СУБД SQL для MySQL и PostgreSQL.

source: To call another DBMS from Tarantool, the essential requirements are: another DBMS, and Tarantool. The module which connects Tarantool to another DBMS may be called a "connector". Within the module there is a shared library which may be called a "driver".
ru: Для вызова другой СУБД из Tarantool'а нужно: другая СУБД и Tarantool. Модуль, который соединяет другую СУБД может называться коннектором. В модуле есть библиотека общего пользования, которая может называться драйвером.

source: Tarantool supplies DBMS connector modules with the module manager for Lua, LuaRocks. So the connector modules may be called "rocks".
ru: Tarantool предоставляет модули-коннекторы для СУБД вместе с менеджером модулей для Lua под названием LuaRocks.

source: The Tarantool rocks allow for connecting to SQL servers and executing SQL statements the same way that a MySQL or PostgreSQL client does. The SQL statements are visible as Lua methods. Thus Tarantool can serve as a "MySQL Lua Connector" or "PostgreSQL Lua Connector", which would be useful even if that was all Tarantool could do. But of course Tarantool is also a DBMS, so the module also is useful for any operations, such as database copying and accelerating, which work best when the application can work on both SQL and Tarantool inside the same Lua routine. The methods for connect/select/insert/etc. are similar to the ones in the :ref:`net.box <net_box-module>` module.
ru: Модули Tarantool'а позволяют подключаться к SQL-серверам и выполнять SQL-запросы так же, как это делает клиент MySQL или PostgreSQL. Операторы SQL доступны как Lua-методы. Таким образом, Tarantool может служить Lua-коннектором для MySQL или Lua-коннектором для PostgreSQL, что было бы полезно, даже если бы Tarantool больше ничего не умел. Но конечно же, Tarantool также представляет собой СУБД, поэтому модуль используется для любых операций, таких как копирование и ускорение базы данных, которые максимально эффективно, если приложение может работать как с SQL, так и с Tarantool в пределах одной Lua-процедуры. Методы подключения / выборки / вставки / и т.д. аналогичны методам модуля :ref:`net.box <net_box-module>`.

source: From a user's point of view the MySQL and PostgreSQL rocks are very similar, so the following sections -- "MySQL Example" and "PostgreSQL Example" -- contain some redundancy.
ru: С точки зрения пользователя, модули для MySQL и PostgreSQL очень похожи, поэтому следующие разделы -- "Пример для MySQL" и "Пример для PostgreSQL" -- слегка избыточны.

source: MySQL Example
ru: Пример для MySQL

source: This example assumes that MySQL 5.5 or MySQL 5.6 or MySQL 5.7 has been installed. Recent MariaDB versions will also work, the MariaDB C connector is used. The package that matters most is the MySQL client developer package, typically named something like libmysqlclient-dev. The file that matters most from this package is libmysqlclient.so or a similar name. One can use ``find`` or ``whereis`` to see what directories these files are installed in.
ru: В данном примере предполагается, что установлены MySQL 5.5, MySQL 5.6 или MySQL 5.7. Последние версии MariaDB также подойдут, используется коннектор к MariaDB для C. Самым важным пакетом будет пакет для разработчиков клиента MySQL, который обычно называется libmysqlclient-dev. Наиболее важным файлом из этого пакета будет файл libmysqlclient.so или с похожим названием. Можно использовать `` find`` или `` whereis``, чтобы узнать, в каких директориях установлены эти файлы.

source: It will be necessary to install Tarantool's MySQL driver shared library, load it, and use it to connect to a MySQL server instance. After that, one can pass any MySQL statement to the server instance and receive results, including multiple result sets.
ru: Также нужно будет установить библиотеку общего пользования Tarantool'а с драйвером для MySQL, загрузить ее и использовать для подключения к экземпляру MySQL-сервера. После этого можно передавать любой оператор MySQL на экземпляр сервера и получать результаты, включая наборы результатов.

source: Installation
ru: Установка

source: Check the instructions for `downloading and installing a binary package <http://tarantool.org/download.html>`_ that apply for the environment where Tarantool was installed. In addition to installing ``tarantool``, install ``tarantool-dev``. For example, on Ubuntu, add the line:
ru: Проверьте инструкции по `загрузке и установке бинарного пакета <http://tarantool.org/download.html>`_, которые применимы к среде, где установлен Tarantool. Помимо установки ``tarantool``, установите ``tarantool-dev``. Например, в Ubuntu добавьте строку:

source: Now, for the MySQL driver shared library, there are two ways to install:
ru: Что касается библиотеки общего пользования с драйвером для MySQL, ее можно установить двумя способами:

source: With LuaRocks
ru: Из LuaRocks

source: Begin by installing luarocks and making sure that tarantool is among the upstream servers, as in the instructions on `rocks.tarantool.org`_, the Tarantool luarocks page. Now execute this:
ru: Начните с установки luarocks. Убедитесь, что tarantool указан в серверах, как описано на странице сторонних модулей Tarantool'а `rocks.tarantool.org`_. Затем выполните:

source: With GitHub
ru: Из GitHub

source: Go the site `github.com/tarantool/mysql`_. Follow the instructions there, saying:
ru: Перейдите по ссылке `github.com/tarantool/mysql`_. Следуя инструкциям, введите команду:

source: At this point it is a good idea to check that the installation produced a file named ``driver.so``, and to check that this file is on a directory that is searched by the ``require`` request.
ru: На данном этапе желательно проверить, что после установки появился файл под названием ``driver.so``, а также проверить, что этот файл находится в директории, которую можно найти по запросу ``require``.

source: Connecting
ru: Подключение

source: Begin by making a ``require`` request for the mysql driver. We will assume that the name is ``mysql`` in further examples.
ru: Начните с выполнения запроса ``require`` для драйвера mysql. В дальнейших примерах у него будет имя ``mysql``.

source: Now, say:
ru: Теперь выполните:

source: *connection_name* = mysql.connect(*connection options*)
ru: *имя_подключения* = mysql.connect(*параметры подключения*)

source: The connection-options parameter is a table. Possible options are:
ru: Параметры подключения включены в таблицу. Доступные параметры:

source: :samp:`host = {host-name}` - string, default value = 'localhost'
ru: :samp:`host = {имя-хоста}` -- строка, значение по умолчанию = 'localhost'

source: :samp:`port = {port-number}` - number, default value = 3306
ru: :samp:`port = {номер-порта}` -- число, значение по умолчанию = 3306

source: :samp:`user = {user-name}` - string, default value is operating-system user name
ru: :samp:`user = {имя-пользователя}` -- строка, значение по умолчанию -- имя пользователя в операционной системе

source: :samp:`password = {password}` - string, default value is blank
ru: :samp:`password = {пароль}` -- строка, по умолчанию пустая

source: :samp:`db = {database-name}` - string, default value is blank
ru: :samp:`db = {имя-базы-данных}` -- строка, по умолчанию пустая

source: :samp:`raise = {true|false}` - boolean, default value is false
ru: :samp:`raise = {true|false}` -- логическое значение, по умолчанию, false (ложь)

source: The option names, except for `raise`, are similar to the names that MySQL's mysql client uses, for details see the MySQL manual at `dev.mysql.com/doc/refman/5.6/en/connecting.html`_. The `raise` option should be set to :codenormal:`true` if errors should be raised when encountered. To connect with a Unix socket rather than with TCP, specify ``host = 'unix/'`` and :samp:`port = {socket-name}`.
ru: Имена параметров, за исключением `raise`, похожи на имена, которые используются в MySQL-клиенте mysql, для получения подробной информации см. руководство по MySQL по ссылке `dev.mysql.com/doc/refman/5.6/en/connecting.html`_. Значение параметра `raise` следует указать как :codenormal:`true`, если ошибки должны возникать при обнаружении. Чтобы подключиться по Unix-сокету, а не по TCP, укажите ``host = 'unix/'`` и :samp:`port = {имя-сокета}`.

source: Example, using a table literal enclosed in {braces}:
ru: Пример с использованием таблицы, заключенной в {фигурные скобки}:

source: conn = mysql.connect({ host = '127.0.0.1', port = 3306, user = 'p', password = 'p', db = 'test', raise = true }) -- OR conn = mysql.connect({ host = 'unix/', port = '/var/run/mysqld/mysqld.sock' })
ru: conn = mysql.connect({ host = '127.0.0.1', port = 3306, user = 'p', password = 'p', db = 'test', raise = true }) -- ИЛИ conn = mysql.connect({ host = 'unix/', port = '/var/run/mysqld/mysqld.sock' })

source: Example, creating a function which sets each option in a separate line:
ru: Пример с созданием функции, которая определяет параметры в отдельных строках:

source: tarantool> -- Connection function. Usage: conn = mysql_connect() tarantool> function mysql_connection() > local p = {} > p.host = 'widgets.com' > p.db = 'test' > conn = mysql.connect(p) > return conn > end --- ... tarantool> conn = mysql_connect() --- ...
ru: tarantool> -- Функция подключения. Использование: conn = mysql_connect() tarantool> function mysql_connection() > local p = {} > p.host = 'widgets.com' > p.db = 'test' > conn = mysql.connect(p) > return conn > end --- ... tarantool> conn = mysql_connect() --- ...

source: We will assume that the name is 'conn' in further examples.
ru: Предполагаем, что в дальнейших примерах будет использоваться имя 'conn'.

source: How to ping
ru: Как проверить связь

source: To ensure that a connection is working, the request is:
ru: Чтобы убедиться, что подключение работает, следует использовать запрос:

source: *connection-name*:ping()
ru: *имя-соединение*:ping()

source: Executing a statement
ru: Исполнение оператора

source: For all MySQL statements, the request is:
ru: Для всех операторов MySQL запрос будет:

source: *connection-name*:execute(*sql-statement* [, *parameters*])
ru: *имя-соединения*:execute(*sql-оператор* [, *параметры*])
