Repository: tarantool/doc
Catalog: locale/*/LC_MESSAGES/doc.po
Languages: ru

source: After: ``box_tuple_position(it) == 0``
ru: После: ``box_tuple_position(it) == 0``

source: Seek the tuple iterator.
ru: Поиск итератора кортежей.

source: The result is a pointer to raw MessagePack data which can be decoded with mp_decode functions, for an example see the tutorial program :ref:`read.c <f_c_tutorial-read>`. The returned buffer is valid until the next call to ``box_tuple_*`` API. The requested ``field_no`` is returned by the next call to ``box_tuple_next(it)``.
ru: Результатом будет указатель на сырые MessagePack-данные, которые можно расшифровать с помощью функций ``mp_decode``. Пример можно увидеть в программе практикума :ref:`read.c <f_c_tutorial-read>`. Возвращаемый буфер действует до следующего вызова API ``box_tuple_*`` . Запрашиваемый номер поля ``field_no`` возвращается при следующем вызове ``box_tuple_next(it)``.

source: field number - zero-based position in MsgPack array
ru: номер поля -- положение с основанием 0 в MsgPack-массиве

source: After:
ru: После:

source: ``box_tuple_position(it) == field_not`` if returned value is not NULL.
ru: ``box_tuple_position(it) == field_not``, если возвращается не NULL.

source: ``box_tuple_position(it) == box_tuple_field_count(tuple)`` if returned value is NULL.
ru: ``box_tuple_position(it) == box_tuple_field_count(tuple)``, если возвращается NULL.

source: Return the next tuple field from tuple iterator.
ru: Возврат следующего поля кортежа из итератора кортежей.

source: The result is a pointer to raw MessagePack data which can be decoded with mp_decode functions, for an example see the tutorial program :ref:`read.c <f_c_tutorial-read>`. The returned buffer is valid until next call to ``box_tuple_*`` API.
ru: Результатом будет указатель на сырые MessagePack-данные, которые можно расшифровать с помощью функций mp_decode. Пример можно увидеть в программе практикума :ref:`read.c <f_c_tutorial-read>`. Возвращаемый буфер действует до следующего вызова API ``box_tuple_*``.

source: NULL if there are no more fields
ru: NULL, если полей больше нет

source: MsgPack otherwise
ru: в остальных случаях MsgPack

source: Before: :ref:`box_tuple_position()<c_api-tuple-box_tuple_position>` is zero-based ID of returned field.
ru: Ранее: :ref:`box_tuple_position()<c_api-tuple-box_tuple_position>` -- это идентификатор с основанием 0 возвращаемого поля.

source: After: ``box_tuple_position(it) == box_tuple_field_count(tuple)`` if returned value is NULL.
ru: После: ``box_tuple_position(it) == box_tuple_field_count(tuple)``, если возвращается NULL.

source: Module `txn`
ru: Модуль `txn`

source: Return true if there is an active transaction.
ru: Возврат true (правда), если есть активная транзакция.

source: Begin a transaction in the current fiber.
ru: Начало транзакции в текущем файбере.

source: A transaction is attached to caller fiber, therefore one fiber can have only one active transaction. See also :ref:`box.begin()<box-begin>`.
ru: Транзакция привязана к вызывающему файберу, поэтому в одном файбере может быть только одна активная транзакция. См. также :ref:`box.begin()<box-begin>`.

source: -1 on error. Perhaps a transaction has already been started.
ru: -1 в случае ошибки. Возможно, транзакция уже была запущена.

source: Commit the current transaction. See also :ref:`box.commit() <box-commit>`.
ru: Коммит текущей транзакции. См. также :ref:`box.commit() <box-commit>`.

source: -1 on error. Perhaps a disk write failure
ru: -1 в случае ошибки. Возможен отказ записи на диск

source: Roll back the current transaction. See also :ref:`box.rollback() <box-rollback>`.
ru: Откат текущей транзакции. См. также :ref:`box.rollback() <box-rollback>`.

source: Return a descriptor of a savepoint.
ru: Возврат дескриптора контрольной точки.

source: Roll back the current transaction as far as the specified savepoint.
ru: Откат текущей транзакции до указанной контрольной точки.

source: Allocate memory on txn memory pool.
ru: Выделение памяти в пул памяти txn.

source: The memory is automatically deallocated when the transaction is committed or rolled back.
ru: Память автоматически освобождается при коммите или откате транзакции.

source: Module `lua/utils`
ru: Модуль `lua/utils`

source: Push cdata of given ``ctypeid`` onto the stack.
ru: Принудительная передача cdata заданного ``ctypeid`` в стек.

source: CTypeID must be used from FFI at least once. Allocated memory returned uninitialized. Only numbers and pointers are supported.
ru: CTypeID должен быть использован хотя бы один раз из FFI. Выделенная область памяти возвращается неинициализированной. Поддерживаются только числа и указатели.

source: FFI's CTypeID of this cdata
ru: CTypeID из FFI для cdata

source: memory associated with this cdata
ru: область памяти, ассоциированная с cdata

source: See also: :ref:`luaL_checkcdata()<c_api-utils-luaL_checkcdata>`
ru: См. также :ref:`luaL_checkcdata()<c_api-utils-luaL_checkcdata>`

source: Check whether the function argument ``idx`` is a cdata.
ru: Проверка, является ли аргумент функции ``idx`` cdata.

source: stack index
ru: индекс стека

source: output argument. FFI's CTypeID of returned cdata
ru: аргумент вывода. CTypeID из FFI для возвращаемого cdata

source: See also: :ref:`luaL_pushcdata()<c_api-utils-luaL_pushcdata>`
ru: См. также :ref:`luaL_pushcdata()<c_api-utils-luaL_pushcdata>`

source: Set finalizer function on a cdata object.
ru: Определение функции-финализатора для cdata.

source: Equivalent to call `ffi.gc(obj, function)`. Finalizer function must be on the top of the stack.
ru: Аналог вызова `ffi.gc(obj, function)`. Функция-финализатор должна быть на вершине стека.

source: Return CTypeID (FFI) of given СDATA type.
ru: Возврат CTypeID (FFI) заданного типа СDATA.

source: C type name as string (e.g. "struct request" or "uint32_t")
ru: Имя типа в C в виде строки (например, "struct request" или "uint32_t")

source: See also: :ref:`luaL_pushcdata()<c_api-utils-luaL_pushcdata>`, :ref:`luaL_checkcdata()<c_api-utils-luaL_checkcdata>`
ru: См. также :ref:`luaL_pushcdata()<c_api-utils-luaL_pushcdata>`, :ref:`luaL_checkcdata()<c_api-utils-luaL_checkcdata>`

source: Declare symbols for FFI.
ru: Объявление символов для FFI.

source: C definitions (e.g. "struct stat")
ru: C-определения (например, "struct stat")

source: ``LUA_ERRRUN``, ``LUA_ERRMEM` or ``LUA_ERRERR`` otherwise.
ru: ``LUA_ERRRUN``, ``LUA_ERRMEM` или ``LUA_ERRERR``, в противном случае.

source: See also: ``ffi.cdef(def)``
ru: См. также ``ffi.cdef(def)``

source: Push uint64_t onto the stack.
ru: Принудительная передача uint64_t в стек.

source: value to push
ru: передаваемое значение

source: Push int64_t onto the stack.
ru: Принудительная передача int64_t в стек.

source: Check whether the argument idx is a uint64 or a convertable string and returns this number.
ru: Проверка, является ли аргумент idx uint64 или конвертируемой строкой, и возврат этого числа.

source: throws
ru: выбрасывает

source: error if the argument can't be converted
ru: ошибку, если аргумент нельзя конвертировать

source: Check whether the argument idx is a int64 or a convertable string and returns this number.
ru: Проверка, является ли аргумент idx int64 или конвертируемой строкой, и возврат этого числа.

source: the converted number or 0 of argument can't be converted
ru: конвертированное число или 0, если аргумент нельзя конвертировать

source: Push a tuple onto the stack.
ru: Принудительная передача кортежа в стек.

source: error on OOM
ru: ошибка при нехватке памяти

source: See also: :ref:`luaT_istuple <c_api-utils-luaT_istuple>`
ru: См. также :ref:`luaT_istuple <c_api-utils-luaT_istuple>`

source: Check whether ``idx`` is a tuple.
ru: Проверка, является ли ``idx`` кортежем.

source: the stack index
ru: индекс стека

source: non-NULL if ``idx`` is a tuple
ru: не NULL, если ``idx`` -- это кортеж

source: NULL if ``idx`` is not a tuple
ru: NULL, если ``idx`` -- это не кортеж

source: Re-throw the last Tarantool error as a Lua object.
ru: Повторение последней ошибки в Tarantool'е в виде Lua-объекта.

source: See also: `lua_error() <https://www.lua.org/manual/5.1/manual.html#lua_error>`_,
ru: См. также `lua_error() <https://www.lua.org/manual/5.1/manual.html#lua_error>`_,

source: Similar to `lua_cpcall() <https://www.lua.org/manual/5.1/manual.html#lua_cpcall>`_, but with the proper support of Tarantool errors.
ru: Аналог `lua_cpcall() <https://www.lua.org/manual/5.1/manual.html#lua_cpcall>`_, но с соответствующей поддержкой ошибок Tarantool'а.

source: Get the global Lua state used by Tarantool.
ru: Получение глобального состояния Lua, используемого Tarantool'ом.

source: Release management
ru: Управление версиями

source: Release policy
ru: Политика управления версия

source: A Tarantool release is identified by three digits, for example, 1.7.7. We use these digits according to their definitions provided at http://semver.org:
ru: Версия Tarantool'а определяется тремя цифрами, например, 1.7.7. Мы пользуемся цифрами по определению, данному на сайте http://semver.org:

source: The first digit stands for MAJOR release. A **major** release may contain *incompatible changes*.
ru: Первая цифра означает МАЖОРНУЮ версию. **Мажорная** версия может содержать *несовместимые изменения*.

source: The second digit stands for MINOR release, it does not contain incompatible changes, and is used for introducing backward-compatible *features*.
ru: Вторая цифра означает МИНОРНУЮ версию; такая версия не содержит несовместимых изменений и используется для релиза нового *функционала* с обратной совместимостью.

source: The third digit is for PATCH releases that contain only backward-compatible *bug fixes*.
ru: Третья цифра используется для ПАТЧ-версий, которые содержат только **исправления дефектов** с обратной совместимостью.

source: In MINOR digit, we reflect how stable a release is:
ru: Цифра МИНОРНОЙ версии также отражает ее стабильность:

source: 0 meaning alpha,
ru: 0 означает альфа-версию,

source: 1 meaning beta,
ru: 1 означает бета-версию,

source: anything between 1 and 10 meaning stable, and
ru: от 1 до 10 означает стабильную версию, а

source: 10 meaning LTS.
ru: 10 означает окончательную версию с долгосрочной технической поддержкой.

source: So, each MAJOR release series goes through a development-maturity life cycle of MINOR releases, as follows:
ru: Таким образом, каждая МАЖОРНАЯ версия проходит через жизненный цикл разработки МИНОРНЫХ версий следующим образом:

source: **Alpha**. Once in every few months we release a few alpha versions, e.g. 2.0.1, 2.0.2.
ru: **Альфа**. Один раз в несколько месяцев выходят несколько альфа-версий, например, 2.0.1, 2.0.2.

source: Alpha versions may contain incompatible changes, crashes and other bugs.
ru: Альфа-версии могут содержать несовместимые изменения, сбои и другие дефекты.

source: **Beta**. Once major changes necessary to introduce new flagship features are ready, we release a few beta versions, e.g. 2.1.3, 2.1.4.
ru: **Бета**. Когда готовы значительные изменения, необходимые для включения новых основных функций, мы выпускаем несколько бета-версий, например, 2.1.3, 2.1.4.

source: Beta versions may contain crashes, but do not have incompatible changes, so can be used to develop new applications.
ru: Бета-версии могут приводить к сбоям, но не содержат несовместимых изменений, поэтому их можно использовать для разработки новых приложений.

source: **Stable**. Finally, after we see our beta versions run successfully in production, usually in a few more months, during which we fix all incoming bugs and add some minor features, we declare this MAJOR release series stable.
ru: **Стабильная**. Наконец, после того, как бета-версии успешно отработают примерно несколько месяцев, во время которых мы исправляем поступающие дефекты и добавляем некоторые небольшие функции, мы объявляем эту МАЖОРНУЮ версию стабильной.

source: Like Ubuntu, we distinguish two kinds of stable releases:
ru: Как и в Ubuntu, мы различаем два вида стабильных версий:

source: **LTS (Long Term Support)** releases that are supported for 3 years (community) and up to 5 years (paying customers). **LTS** release is identified by MINOR version 10.
ru: **LTS (Long Term Support - Долгосрочная техническая поддержка)** такие версии поддерживаются в течение 3 лет (сообщество) и до 5 лет (платежеспособные клиенты). **LTS**-версию можно идентифицировать по МИНОРНОЙ версии = 10.

source: **Standard stable releases** are only supported a few months after the next stable is out.
ru: **Стандартные стабильные версии** поддерживаются в течении нескольких месяцев после выхода.

source: "Support" means that we continue fixing bugs in a release.
ru: "Support" (поддержка) означает, что мы продолжаем исправлять ошибки в этой версии.

source: We add commits simultaneously to three MAJOR releases:
ru: Мы добавляем коммиты одновременно в три МАЖОРНЫЕ версии:

source: **LTS** is a stable release which does not receive new features, and only gets backward compatible fixes. Hence, following the rules of semver, LTS release never has its MAJOR or MINOR version increased, and only gets PATCH level releases.
ru: **LTS** -- это стабильная версия, которая не получает новые функции, а только исправления обратной совместимости. Следовательно, по правилам семантической версификации в LTS-версии никогда не увеличивается МАЖОРНАЯ или МИНОРНАЯ, а только ПАТЧ-версия.

source: **STABLE** is our current stable release, which may receive new features. When the next STABLE version is published, MINOR version is incremented. Between MINOR releases, we may have intermediate PATCH level releases as well, which will contain only bug fixes. We maintain PATCH level releases for two STABLE releases, the current and the previous one, to preserve support continuity.
ru: **СТАБИЛЬНАЯ** -- это наша текущая стабильная версия, в которую могут быть добавлены новые функции. Когда выходит следующая СТАБИЛЬНАЯ версия, увеличивается МИНОРНАЯ версия. Между МИНОРНЫМИ версиями у нас могут увеличиваться промежуточные уровни ПАТЧ-версии, в которых будут только исправлены дефекты. Мы поддерживаем ПАТЧ-уровни для двух СТАБИЛЬНЫХ версий -- текущей и предыдущей -- для сообщества разработчиков.

source: **NEXT** is our next MAJOR release, and it follows the maturity cycle described in the beginning. While NEXT release is in alpha state, its MINOR is frozen at 0 and is only increased when the release reaches BETA status. Once the NEXT release becomes STABLE, we switch the vehicle for delivery of minor features, designating the previous stable release as LTS, and releasing it with MINOR set to 10.
ru: **СЛЕДУЮЩАЯ** -- это следующая МАЖОРНАЯ версия, которая проходит процесс зрелости, описанный в начале раздела. Когда СЛЕДУЮЩАЯ версия находится в альфа-стадии, МИНОРНАЯ остается на уровне 0 и увеличивается, когда версия переходит в БЕТА-стадию. После того, как СЛЕДУЮЩАЯ версия становится СТАБИЛЬНОЙ, мы переключаемся на выдачу небольших функций, обозначая предыдущую стабильную версию как LTS, и выпускаем ее с МИНОРНОЙ версией = 10.

source: To sum up, once a quarter we release:
ru: Итак, раз в квартал выходят:

source: the next LTS release, e.g. 2.10.6, 2.10.7 or 2.10.8
ru: следующая LTS-версия, например, 2.10.6, 2.10.7 или 2.10.8

source: the next STABLE release, e.g. 3.6, 3.7 or 3.8
ru: следующая СТАБИЛЬНАЯ версия,например, 3.6, 3.7 или 3.8

source: (optionally) an alpha or beta version of the NEXT release, e.g. 4.0.1, 4.0.2 or 4.0.3
ru: (возможно) альфа-стадия или бета-стадия СЛЕДУЮЩЕЙ версии, например, 4.0.1, 4.0.2 или 4.0.3

source: In all supported releases, we also release a PATCH release as soon as we find and fix an outstanding CVE/vulnerability.
ru: Для всех поддерживаемых версий мы также выпускаем ПАТЧИ, как только обнаружим и устраним уязвимость.

source: We also publish nightly builds, and use the fourth slot in the version identifier to designate the nightly build number.
ru: Мы также публикуем ночные сборки и используем четвертый слот в идентификаторе версии для обозначения номера ночной сборки.

source: Example version identifier:
ru: Пример идентификатора версии:

source: 2.0.3 - third alpha of 2.0 release
ru: 2.0.3 - третья альфа-стадия версии 2.0

source: 2.1.3 - a beta of 2.0 release
ru: 2.1.3 - бета-стадия версии 2.0

source: 2.2 - a stable version of 2.0 series, but not an LTS yet
ru: 2.2 - стабильная версия серии 2.0, но еще не LTS

source: 2.10 - an LTS release
ru: 2.10 - LTS-версия

source: How to make a minor release
ru: Как собрать минорную версию

source: $ git tag -a 2.4 -m "Next minor in 2.x series" $ vim CMakeLists.txt # edit CPACK_PACKAGE_VERSION_PATCH $ git push --tags
ru: $ git tag -a 2.4 -m "Next minor in 2.x series" $ vim CMakeLists.txt # редактировать CPACK_PACKAGE_VERSION_PATCH $ git push --tags

source: A tag which is made on a git branch can be taken along with a merge, or left on the branch. The technique to "keep the tag on the branch it was originally set on" is to use ``--no-fast-forward`` when merging this branch.
ru: Тег, который делается на ветке git, можно забрать при слиянии или оставить на ветке. Метод "сохранить тег на ветке, на которой он был первоначально установлен", заключается в использовании ``--no-fast-forward`` при слиянии этой ветки.

source: With ``--no-ff``, a merge changeset is created to represent the received changes, and only that merge changeset ends up in the destination branch. This technique can be useful when there are two active lines of development, e.g. "stable" and "next", and it's necessary to be able to tag both lines independently.
ru: С помощью ``--no-ff`` создается набор изменений при слиянии для пояснения полученных изменений, и только этот набор изменений при слиянии оказывается в ветке назначения. Этот метод можно использовать, когда есть две активные линии разработки, например, "стабильная" и "следующая", и необходимо иметь возможность помечать тегами линии независимо друг от друга.

source: To make sure that a tag doesn't end up in the destination branch, it is necessary to have the commit to which the tag is attached, "stay on the original branch". That's exactly what a merge with disabled "fast-forward" does -- creates a "merge" commit and adds it to both branches.
ru: Чтобы убедиться, что тег не окажется в ветке назначения, необходимо, чтобы коммит, к которому привязан тег, остался в исходной ветке. Это и происходит при отключенном "fast-forward" -- создается коммит для слияния и добавляется в обе ветки.

source: Here's what it may look like:
ru: Вот как это может выглядеть:

source: Also, don't forget this:
ru: Кроме того, следует помнить:

source: Update all issues. Upload the ChangeLog based on ``git log`` output.
ru: Обновляйте все задачи. Обновляйте журнал изменений ChangeLog на основании вывода ``git log``.

source: The ChangeLog must only include items which are mentioned as issues on GitHub. If anything significant is there, which is not mentioned, something went wrong in release planning and the release should be held up until this is cleared.
ru: Журнал изменений ChangeLog должен включать в себя только пункты, указанные в задачах на GitHub. Если что-то значительное не указано, значит, что-то пошло не так при планировании версии, и ее выход следует отложить до выяснения причин.

source: Click 'Release milestone'. Create a milestone for the next minor release. Alert the driver to target bugs and blueprints to the new milestone.
ru: Нажимайте 'Release milestone' (создать промежуточную версию). Создавайте промежуточные версии для следующей минорной версии. Указывайте драйверу на дефекты и проекты для новой промежуточной версии.

source: How to release a Docker container
ru: Как выпустить Docker-контейнер

source: To bump a new version of a Docker container:
ru: Чтобы выдать новую версию Docker-контейнера:

source: Commit the Dockerfile back to ``master`` branch.
ru: Снова загрузите Dockerfile в главную ветку.

source: In Tarantool container build settings at ``hub.docker.com`` (https://hub.docker.com/r/tarantool/tarantool/~/settings/automated-builds/), add a new line:
ru: В настройках сборки контейнера Tarantool'а в ``hub.docker.com`` (https://hub.docker.com/r/tarantool/tarantool/~/settings/automated-builds/) добавьте новую строку:

source: where ``x`` and ``y`` correspond to the commit's major and minor versions.
ru: где ``x`` и ``y`` соответствуют мажорной и минорной версиям коммита.

source: Click **Save changes**.
ru: Нажмите **Save changes** (сохранить изменения).

source: Shortly after, a new Docker container will be built.
ru: Вскоре будет создан новый Docker-контейнер.

source: Tarantool - Documentation
ru: Tarantool - Документация

source: This manual embraces all aspects of using Tarantool: from introductory information and exercises for beginners -- to advanced instructions and detailed references for power users and contributors.
ru: Данное руководство охватывает все аспекты использования Tarantool'а: от вводной информации и упражнений для начинающих -- до продвинутых инструкций и подробных справочников для опытных пользователей и сторонних разработчиков.

source: Other sources
ru: Другие источники

source: `Single page <singlehtml.html>`_
ru: `На одной странице <singlehtml.html>`_

source: `English`_
ru: `Форум (eng)`_

source: `Russian`_
ru: `Форум (рус)`_

source: `Telegram chat EN`_
ru: Чат в Telegram на EN `Telegram chat EN`_

source: An application server together with a database manager
ru: Сервер приложений + СУБД

source: Tarantool is a Lua application server integrated with a database management system. It has a "fiber" model which means that many Tarantool applications can run simultaneously on a single thread, while each instance of the Tarantool server itself can run multiple threads for input-output and background maintenance. It incorporates the LuaJIT -- "Just In Time" -- Lua compiler, Lua libraries for most common applications, and the Tarantool Database Server which is an established NoSQL DBMS. Thus Tarantool serves all the purposes that have made node.js and Twisted popular, plus it supports data persistence.
ru: Tarantool представляет собой сервер приложений на языке Lua, интегрированный с СУБД. В основе Tarantool'а лежат файберы (fibers), что означает, что несколько Tarantool-приложений могут работать в одном потоке (thread), при этом каждый экземпляр Tarantool-сервера может одновременно запускать несколько потоков для обработки ввода-вывода данных и фоновых задач. Tarantool включает в себя LuaJIT (Just In Time) - Lua-компилятор, Lua-библиотеки для наиболее распространенных приложений, а также сервер базы данных Tarantool'а, который представляет собой широко признанную СУБД NoSQL. Таким образом, Tarantool используется для всех тех целей, которые принесли популярность node.js и Twisted, и более того - поддерживает персистентность данных.

source: The code is free. The open-source license is `BSD license`_. The supported platforms are GNU/Linux, Mac OS and FreeBSD.
ru: Tarantool -- это open-source проект. Исходный код открыт для всех и распространяется бесплатно согласно лицензии `BSD license`_. Поддерживаемые платформы: GNU / Linux, Mac OS и FreeBSD.
