Repository: tarantool/doc
Catalog: locale/*/LC_MESSAGES/doc.po
Languages: ru

source: For all connectors, calling a function via Tarantool causes a return in the MsgPack format. If the function is called using the connector's API, some conversions may occur. All scalar values are returned as tuples (with a MsgPack type-identifier followed by a value); all non-scalar values are returned as a group of tuples (with a MsgPack array-identifier followed by the scalar values). If the function is called via the binary protocol command layer -- "eval" -- rather than via the connector's API, no conversions occur.
ru: При работе с любым Tarantool-коннектором функции, вызванные с помощью Tarantool'а, возвращают значения в формате MsgPack. Если функция была вызвана через API коннектора, то формат возвращаемых значений будет следующим: скалярные значения возвращаются в виде кортежей (сначала идет идентификатор типа из формата MsgPack, а затем идет значение); все прочие (не скалярные) значения возвращаются в виде групп кортежей (сначала идет идентификатор массива в формате MsgPack, а затем идут скалярные значения). Но если функция была вызвана в рамках бинарного протокола (с помощью команды ``eval``), а не через API коннектора, то подобных изменений формата возвращаемых значений не происходит.

source: In the following example, a Lua function will be created. Since it will be accessed externally by a :ref:`'guest' user<box_space-user>`, a :ref:`grant <box_schema-user_grant>` of an execute privilege will be necessary. The function returns an empty array, a scalar string, two booleans, and a short integer. The values are the ones described in the table :ref:`Common Types and MsgPack Encodings <msgpack-common_types_and_msgpack_encodings>`.
ru: Далее приводится пример создания Lua-функции. Поскольку эту функцию будет вызывать внешний пользователь :ref:`'guest' user<box_space-user>`, то нужно настроить права на исполнение с помощью :ref:`grant <box_schema-user_grant>`. Эта функция возвращает пустой массив, строку-скаляр, два логических значения и короткое целое число. Значение будут теми же, что описаны в разделе про MsgPack в таблице :ref:`Стандартные типы в MsgPack-кодировке <msgpack-common_types_and_msgpack_encodings>`.

source: Here is a C program which calls the function. Although C is being used for the example, the result would be precisely the same if the calling program was written in Perl, PHP, Python, Go, or Java.
ru: Далее идет пример программы на C, из который мы вызываем эту Lua-функцию. Хотя в примере использован код на C, результат будет одинаковым, на каком бы языке ни была написана вызываемая программа: Perl, PHP, Python, Go или Java.

source: #include <stdio.h> #include <stdlib.h> #include <tarantool/tarantool.h> #include <tarantool/tnt_net.h> #include <tarantool/tnt_opt.h> void main() { struct tnt_stream *tnt = tnt_net(NULL); /* SETUP */ tnt_set(tnt, TNT_OPT_URI, "localhost:3301"); if (tnt_connect(tnt) < 0) { /* CONNECT */ printf("Connection refused\n"); exit(-1); } struct tnt_stream *arg; arg = tnt_object(NULL); /* MAKE REQUEST */ tnt_object_add_array(arg, 0); struct tnt_request *req1 = tnt_request_call(NULL); /* CALL function f() */ tnt_request_set_funcz(req1, "f"); uint64_t sync1 = tnt_request_compile(tnt, req1); tnt_flush(tnt); /* SEND REQUEST */ struct tnt_reply reply; tnt_reply_init(&reply); /* GET REPLY */ tnt->read_reply(tnt, &reply); if (reply.code != 0) { printf("Call failed %lu.\n", reply.code); exit(-1); } const unsigned char *p= (unsigned char*)reply.data; /* PRINT REPLY */ while (p < (unsigned char *) reply.data_end) { printf("%x ", *p); ++p; } printf("\n"); tnt_close(tnt); /* TEARDOWN */ tnt_stream_free(arg); tnt_stream_free(tnt); }
ru: #include <stdio.h> #include <stdlib.h> #include <tarantool/tarantool.h> #include <tarantool/tnt_net.h> #include <tarantool/tnt_opt.h> void main() { struct tnt_stream *tnt = tnt_net(NULL); /* НАСТРОЙКА */ tnt_set(tnt, TNT_OPT_URI, "localhost:3301"); if (tnt_connect(tnt) < 0) { /* СОЕДИНЕНИЕ */ printf("Connection refused\n"); exit(-1); } struct tnt_stream *tuple = tnt_object(NULL); /* СОЗДАНИЕ ЗАПРОСА */ struct tnt_stream *arg; arg = tnt_object(NULL); tnt_object_add_array(arg, 0); struct tnt_request *req1 = tnt_request_call(NULL); /* ВЫЗОВ function f() */ tnt_request_set_funcz(req1, "f"); tnt_request_set_tuple(req1, arg); uint64_t sync1 = tnt_request_compile(tnt, req1); tnt_flush(tnt); /* ОТПРАВКА ЗАПРОСА */ struct tnt_reply reply; tnt_reply_init(&reply); /* ПОЛУЧЕНИЕ ОТВЕТА */ tnt->read_reply(tnt, &reply); if (reply.code != 0) { printf("Call failed %lu.\n", reply.code); exit(-1); } const unsigned char *p= (unsigned char*)reply.data;/* ВЫВОД ОТВЕТА */ while (p < (unsigned char *) reply.data_end) { printf("%x ", *p); ++p; } printf("\n"); tnt_close(tnt); /* ЗАВЕРШЕНИЕ */ tnt_stream_free(tuple); tnt_stream_free(tnt); }

source: When this program is executed, it will print:
ru: По завершении программа выведет на экран следующие значения:

source: The first five bytes -- ``dd 0 0 0 5`` -- are the MsgPack encoding for "32-bit array header with value 5" (see `MsgPack specification <http://github.com/msgpack/msgpack/blob/master/spec.md>`_). The rest are as described in the table :ref:`Common Types and MsgPack Encodings <msgpack-common_types_and_msgpack_encodings>`.
ru: Первые пять байт -- ``dd 0 0 0 5`` -- это фрагмент данных в формате MsgPack, означающий "32-битный заголовок массива со значением 5" (см. `спецификацию на формат MsgPack <http://github.com/msgpack/msgpack/blob/master/spec.md>`_). Остальные значения описаны в таблице :ref:`Стандартные типы в MsgPack-кодировке <msgpack-common_types_and_msgpack_encodings>`.

source: FAQ
ru: Вопросы и ответы

source: Q
ru: В

source: Why Tarantool?
ru: В чем особенности Tarantool'а?

source: A
ru: О

source: Tarantool is the latest generation of a family of in-memory data servers developed for web applications. It is the result of practical experience and trials within Mail.Ru since development began in 2008.
ru: Tarantool -- представитель нового поколения семейства серверов для in-memory базы данных, разработанный для веб-приложений. Он создан в компании Mail.Ru на основе практического опыта, полученного методом проб и ошибок с начала разработки в 2008 году.

source: Why Lua?
ru: Почему Lua?

source: Lua is a lightweight, fast, extensible multi-paradigm language. Lua also happens to be very easy to embed. Lua coroutines relate very closely to Tarantool fibers, and Lua architecture works well with Tarantool internals. Lua acts well as a stored program language for Tarantool, although connecting with other languages is also easy.
ru: Lua -- это легкий, быстрый и расширяемый язык, позволяющий использовать различные парадигмы программирования. Lua также легко встраивается в различные приложения. Сопрограммы (coroutines) в Lua близко соотносятся с файберами (fibers) в Tarantool'е, а вся Lua-архитектура гладко ложится на его внутреннюю реализацию. Lua -- это первый язык, на котором можно писать хранимые процедуры для Tarantool'а. В будущем список поддерживаемых языков планируется расширить.

source: What's the key advantage of Tarantool?
ru: В чем ключевое преимущество Tarantool'а?

source: Tarantool provides a rich database feature set (HASH, TREE, RTREE, BITSET indexes, secondary indexes, composite indexes, transactions, triggers, asynchronous replication) in a flexible environment of a Lua interpreter.
ru: Tarantool обеспечивает богатый набор функций базы данных (HASH-индексы, TREE-индексы, RTREE-индексы, BITSET-индексы, вторичные индексы, составные индексы, транзакции, триггеры. асинхронная репликация) в гибкой среде Lua-интерпретатора.

source: These two properties make it possible to be a fast, atomic and reliable in-memory data server which handles non-trivial application-specific logic. The advantage over traditional SQL servers is in performance: low-overhead, lock-free architecture means Tarantool can serve an order of magnitude more requests per second, on comparable hardware. The advantage over NoSQL alternatives is in flexibility: Lua allows flexible processing of data stored in a compact, denormalized format.
ru: Благодаря этим характеристикам, он представляет собой быстрый и надежный in-memory сервер с легким доступом к базе данных, который обрабатывает нетривиальную проблемно-ориентированную логику. Преимущество по сравнению с традиционными SQL-серверами -- в производительности: архитектура без блокировок с малой перегрузкой означает, что Tarantool может обслуживать на порядок больше запросов в секунду на аналогичном оборудовании. Преимущество NoSQL-аналогов -- в гибкости: Lua допускает гибкую обработку данных, хранимых в компактном денормализированном формате.

source: Who is developing Tarantool?
ru: Кто разрабатывает Tarantool?

source: There is an engineering team employed by Mail.Ru -- check out our commit logs on `github.com/tarantool <http://github.com/tarantool/>`_. The development is fully open. Most of the connectors' authors, and the maintainers for different distributions, come from the wider community.
ru: Во-первых, этим занимается команда разработки в Mail.Ru -- см. историю коммитов на `github.com/tarantool <http://github.com/tarantool/>`_. Вся разработка ведется открытым образом. Кроме того, активную роль играют члены сообщества разработчиков Tarantool'а. Их силами было создано большинство коннекторов и ведутся доработки под разные дистрибутивы.

source: Are there problems associated with being an in-memory server?
ru: Возникают ли проблемы из-за того, что Tarantool является in-memory решением?

source: The principal storage engine (memtx) is designed for RAM plus persistent storage. It is immune to data loss because there is a write-ahead log. Its memory-allocation and compression techniques ensure there is no waste. And if Tarantool runs out of memory, then it will stop accepting updates until more memory is available, but will continue to handle read and delete requests without difficulty. However, for databases which are much larger than the available RAM space, Tarantool has a second storage engine (vinyl) which is only limited by the available disk space.
ru: Основной движок баз данных в Tarantool'е работает с оперативной памятью, но при этом он гарантирует сохранность данных благодаря механизму WAL (write ahead log), т.е. журналу упреждающей записи. Также в Tarantool'е используются технологии сжатия и распределения данных, которые позволяют использовать все виды памяти наиболее эффективно. Если Tarantool сталкивается с нехваткой оперативной памяти, то он приостанавливает прием запросов на изменение данных до тех пор, пока не появится свободная память, но при этом с успехом продолжает обработку запросов на чтение и удаление данных. А для больших баз, где объем данных значительно превосходит имеющийся объем оперативной памяти, у Tarantool'а есть второй движок, чьи возможности ограничены лишь размером жесткого диска.

source: Can I store (large) BLOBs in Tarantool?
ru: Можно ли хранить (большие) объекты BLOB в Tarantool'е?

source: Starting with Tarantool 1.7, there is no "hard" limit for the maximal tuple size. Tarantool, however, is designed for high-velocity workload with a lot of small chunks. For example, when you change an existing tuple, Tarantool creates a new version of the tuple in memory. Thus, an optimal tuple size is within kilobytes.
ru: Начиная с Tarantool 1.7, нет "жесткого" ограничения на максимальный размер кортежа. Однако Tarantool предназначен для работы с множеством фрагментов на высокой скорости. Например, при изменении существующего кортежа Tarantool создает новую версию кортежа в памяти. Таким образом, оптимальный размер кортежа -- несколько килобайтов.

source: I delete data from vinyl, but disk usage stays the same. What gives?
ru: Я удаляю данные из vinyl'а, но использование диска не изменяется. В чем дело?

source: Data you write to vinyl is persisted in append-only run files. These files are immutable, and to perform a delete, a deletion marker (tombstone) is written to a newer run file instead. On compaction, new and old run files are merged, and a new run file is produced. Independently, the checkpoint manager keeps track of all run files involved in a checkpoint, and deletes obsolete files once they are no longer needed.
ru: Данные, записываемые в vinyl, сохраняются в исполняемых файлах, обновление которых происходит только путем присоединения новых записей. Такие файлы нельзя изменить, а для удаления маркер удаления (удаленная запись) записывается в новый исполняемый файл. Для уплотнения данных новый и старый исполняемые файлы объединяются, и создается новый исполняемый файл. Независимо от этого, менеджер контрольных точек следит за всеми исполняемыми файлами в контрольной точке и удаляет устаревшие файлы, как только в них отпадает необходимость.

source: Getting started
ru: Руководство для начинающих

source: In this chapter, we explain how to install Tarantool, how to start it, and how to create a simple database.
ru: В этой главе объясняется, как установить и запустить Tarantool, а также как создать простую базу данных.

source: Using a binary package
ru: Использование бинарного пакета

source: To download and install the package that’s appropriate for your OS, start a shell (terminal) and enter the command-line instructions provided for your OS at Tarantool's `download page <http://tarantool.org/download.html>`_.
ru: Чтобы скачать и установить бинарный пакет для вашей операционной системы, откройте командную строку и введите инструкции, которые даны для вашей операционной системы на `странице для скачивания <http://tarantool.org/download.html>`_.

source: Starting Tarantool
ru: Запуск экземпляра Tarantool’а

source: To start a Tarantool instance, say this:
ru: Для запуска экземпляра Tarantool’а выполните эту команду:

source: $ # if you downloaded a binary with apt-get or yum, say this: $ /usr/bin/tarantool $ # if you downloaded and untarred a binary tarball to ~/tarantool, say this: $ ~/tarantool/bin/tarantool
ru: $ # если вы скачали бинарный пакет с помощью apt-get или yum, введите: $ /usr/bin/tarantool $ # если вы скачали бинарный пакет в формате TAR $ # и разархивировали его в директорию ~/tarantool, введите: $ ~/tarantool/bin/tarantool

source: Tarantool starts in the interactive mode and displays a prompt:
ru: Tarantool запускается в интерактивном режиме и показывает приглашение командной строки:

source: Now you can enter requests on the command line.
ru: Теперь вы можете вводить запросы в командной строке.

source: On production machines, Tarantool's interactive mode is for system administration only. But we use it for most examples in this manual, because the interactive mode is convenient for learning.
ru: На боевых серверах интерактивный режим Tarantool’а предназначен только для системных администраторов. Мы же используем его в большинстве примеров в данном руководстве, потому что интерактивный режим хорошо подходит для обучения.

source: Creating a database
ru: Создание базы данных

source: Here is how to create a simple test database after installing.
ru: Далее объясняется, как создать простую тестовую базу данных после установки Tarantool'а.

source: Create a new directory (it’s just for tests, so you can delete it when the tests are over):
ru: Создайте новую директорию (она понадобится только для тестовых целей, и ее можно будет удалить по окончании экспериментов):

source: To start Tarantool's database module and make the instance accept TCP requests on port 3301, say this:
ru: Чтобы запустить модуль Tarantool’а для работы с базой данных и сделать так, чтобы запущенный экземпляр принимал TCP-запросы на порту 3301, выполните эту команду:

source: First, create the first :ref:`space <index-box_space>` (named 'tester'):
ru: Сначала создайте первый :ref:`спейс <index-box_space>` (с именем 'tester'):

source: Format the created space by specifying field names and types:
ru: Форматируйте созданный спейс, указав имена и типы полей:

source: Create the first :ref:`index <index-box_index>` (named 'primary'):
ru: Создайте первый :ref:`индекс <index-box_index>` (с именем 'primary’):

source: This is a primary index based on the 'id' field of each tuple.
ru: Это первичный индекс по полю 'id' в каждом кортеже.

source: Insert three :ref:`tuples <index-box_tuple>` (our name for "records") into the space:
ru: Вставьте в созданный спейс три :ref:`кортежа <index-box_tuple>` (наш термин для «записей»):

source: To select a tuple using the 'primary' index, say:
ru: Для выборки кортежей по первичному индексу выполните команду:

source: The terminal screen now looks like this:
ru: Теперь вывод в окне терминала выглядит следующим образом:

source: To add a secondary index based on the 'band_name' field, say:
ru: Для добавления вторичного индекса по полю 'band_name' используйте эту команду:

source: To select tuples using the 'secondary' index, say:
ru: Для выборки кортежей по вторичному индексу выполните команду:

source: Now, to prepare for the example in the next section, try this:
ru: Теперь, чтобы подготовиться к примеру в следующем разделе, попробуйте следующее:

source: Connecting remotely
ru: Установка удаленного подключения

source: In the request ``box.cfg{listen = 3301}`` that we made earlier, the ``listen`` value can be any form of a :ref:`URI <index-uri>` (uniform resource identifier). In this case, it’s just a local port: port 3301. You can send requests to the listen URI via:
ru: В запросе ``box.cfg{listen = 3301}``, который мы отправили ранее, параметр ``listen`` может принимать в качестве значения :ref:`URI <index-uri>` (унифицированный идентификатор ресурса) любой формы. В нашем случае это просто локальный порт 3301. Вы можете отправлять запросы на указанный URI, используя:

source: a :ref:`connector <index-box_connectors>`,
ru: :ref:`коннектор <index-box_connectors>`,

source: another instance of Tarantool (using the :ref:`console <console-module>` module), or
ru: другой экземпляр Tarantool'а (с помощью модуля :ref:`console <console-module>`), либо

source: :ref:`tarantoolctl <tarantoolctl>` utility.
ru: утилиту :ref:`tarantoolctl <tarantoolctl>`.

source: Let’s try (4).
ru: Давайте попробуем вариант с ``tarantoolctl``.

source: Switch to another terminal. On Linux, for example, this means starting another instance of a Bash shell. You can switch to any working directory in the new terminal, not necessarily to ``~/tarantool_sandbox``.
ru: Переключитесь на другой терминал. Например, в Linux-системе для этого нужно запустить еще один экземпляр Bash. В новом терминале можно сменить текущую рабочую директорию на любую другую, необязательно использовать ``~/tarantool_sandbox``.

source: Start the ``tarantoolctl`` utility:
ru: Запустите утилиту ``tarantoolctl``:

source: This means "use ``tarantoolctl connect`` to connect to the Tarantool instance that’s listening on ``localhost:3301``".
ru: Данная команда означает «использовать утилиту ``tarantoolctl`` для подключения к Tarantool-серверу, который слушает по адресу ``localhost:3301``».

source: Try this request:
ru: Введите следующий запрос:

source: This means "send a request to that Tarantool instance, and display the result". The result in this case is one of the tuples that was inserted earlier. Your terminal screen should now look like this:
ru: Это означает "послать запрос тому Tarantool-серверу и вывести результат на экран". Результатом в данном случае будет один из кортежей, что вы вставляли ранее. В окне терминала теперь должно отображаться примерно следующее:

source: You can repeat ``box.space...:insert{}`` and ``box.space...:select{}`` indefinitely, on either Tarantool instance.
ru: Вы можете посылать запросы ``box.space...:insert{}`` и ``box.space...:select{}`` неограниченное количество раз на любом из двух запущенных экземпляров Tarantool’а.

source: When the testing is over:
ru: Закончив тестирование, выполните следующие шаги:

source: To drop the space: ``s:drop()``
ru: Для удаления спейса: ``s:drop()``

source: To stop ``tarantoolctl``: Ctrl+C or Ctrl+D
ru: Для остановки ``tarantoolctl``: ctrl+C или ctrl+D

source: To stop Tarantool (an alternative): the standard Lua function `os.exit() <http://www.lua.org/manual/5.1/manual.html#pdf-os.exit>`_
ru: Для остановки Tarantool’а (альтернативный вариант): стандартная Lua-функция `os.exit() <http://www.lua.org/manual/5.1/manual.html#pdf- os.exit>`_

source: To stop Tarantool (from another terminal): ``sudo pkill -f tarantool``
ru: Для остановки Tarantool’а (из другого терминала): ``sudo pkill -f tarantool``

source: To destroy the test: ``rm -r ~/tarantool_sandbox``
ru: Для удаления директории-песочницы: ``rm -r ~/tarantool_sandbox``

source: Using a Docker image
ru: Использование Docker-образа

source: If you're new to Docker, we recommend going over `this tutorial <https://docs.docker.com/engine/getstarted/step_one/>`_ before proceeding with this chapter.
ru: Если вы никогда раньше не работали с Docker, рекомендуем сперва прочитать `эту обучающую статью <https://docs.docker.com/engine/getstarted/step_one/>`_.

source: Launching a container
ru: Запуск контейнера

source: If you don't have Docker installed, please follow the official `installation guide <https://docs.docker.com/engine/getstarted/step_one/#/step-1-get-docker>`_ for your OS.
ru: Если Docker не установлен на вашей машине, следуйте официальным `инструкциям по установке <https://docs.docker.com/engine/getstarted/step_one/#/step-1-get- docker>`_ для вашей ОС.

source: To start a fully functional Tarantool instance, run a container with minimal options:
ru: Для использования полнофункционального экземпляра Tarantool’а запустите контейнер с минимальными настройками:

source: Tarantool will be accepting incoming connections on ``localhost:3301``. You may start using it as a key-value storage right away.
ru: Tarantool будет принимать входящие подключения по адресу ``localhost:3301``. Можно сразу начать его использовать как key-value хранилище.

source: Tarantool :ref:`persists data <index-box_persistence>` inside the container. To make your test data available after you stop the container, this command also mounts the host's directory ``/data/dir/on/host`` (you need to specify here an absolute path to an existing local directory) in the container's directory ``/var/lib/tarantool`` (by convention, Tarantool in a container uses this directory to persist data). So, all changes made in the mounted directory on the container's side are applied to the host's disk.
ru: Tarantool :ref:`сохраняет данные <index-box_persistence>` внутри контейнера. Чтобы ваше тестовые данные остались доступны после остановки контейнера, эта команда также монтирует директорию ``/data/dir/on/host`` (здесь необходимо указать абсолютный путь до существующей локальной директории), расположенную на машине, в директорию ``/var/lib/tarantool`` (Tarantool традиционно использует эту директорию в контейнере для сохранения данных), расположенную в контейнере. Таким образом все изменения в смонтированной директории, внесенные на стороне контейнера, также отражаются в расположенной на пользовательском диске директории.

source: Tarantool's database module in the container is already :ref:`configured <box_introspection-box_cfg>` and started. You needn't do it manually, unless you use Tarantool as an :ref:`application server <app_server>` and run it with an application.
ru: Модуль Tarantool’а для работы с базой данных уже :ref:`настроен <box_introspection-box_cfg>` и запущен в контейнере. Ручная настройка не требуется, если только вы не используете Tarantool как :ref:`сервер приложений <app_server>` и не запускаете его вместе с приложением.

source: Attaching to Tarantool
ru: Подключение к экземпляру Tarantool’а

source: To attach to Tarantool that runs inside the container, say:
ru: Для подключения к запущенному в контейнере экземпляру Tarantool’а, выполните эту команду:

source: This command:
ru: Эта команда:
