Repository: tarantool/doc
Catalog: locale/*/LC_MESSAGES/doc.po
Languages: ru

source: local function handler(s, peer, msg) -- You don't have to wait until socket is ready to send UDP -- s:writable() s:sendto(peer.host, peer.port, "Pong: " .. msg) end local server = udp_server('127.0.0.1', 3548, handler) if not server then error('Failed to bind: ' .. errno.strerror()) end print('Started') require('console').start()
ru: local function handler(s, peer, msg) -- Необязательно ждать, пока сокет будет готов отправлять UDP -- s:writable() s:sendto(peer.host, peer.port, "Pong: " .. msg) end local server = udp_server('127.0.0.1', 3548, handler) if not server then error('Failed to bind: ' .. errno.strerror()) end print('Started') require('console').start()

source: Use the :ref:`http module <http-module>` to get data via HTTP.
ru: Используйте :ref:`Модуль HTTP <http-module>` для получения данных по HTTP.

source: Use the :ref:`http module <http-module>` to send data via HTTP.
ru: Используйте :ref:`Модуль HTTP <http-module>` для отправки данных по HTTP.

source: Use the `http`_ `rock`_ (which must first be installed) to turn Tarantool into a web server.
ru: Используйте `сторонний модуль`_ `http`_ (который необходимо предварительно установить), чтобы превратить Tarantool в веб-сервер.

source: #!/usr/bin/env tarantool local function handler(self) return self:render{ json = { ['Your-IP-Is'] = self.peer.host } } end local server = require('http.server').new(nil, 8080) -- listen *:8080 server:route({ path = '/' }, handler) server:start() -- connect to localhost:8080 and see json
ru: #!/usr/bin/env tarantool local function handler(self) return self:render{ json = { ['Your-IP-Is'] = self.peer.host } } end local server = require('http.server').new(nil, 8080) -- анализировать связь с *:8080 server:route({ path = '/' }, handler) server:start() -- подключиться к localhost:8080 и читать JSON

source: Use the `http`_ `rock` (which must first be installed) to generate HTML pages from templates. The `http`_ `rock`_ has a fairly simple template engine which allows execution of regular Lua code inside text blocks (like PHP). Therefore there is no need to learn new languages in order to write templates.
ru: Используйте сторонний модуль `http`_ (который необходимо предварительно установить) для создания HTML-страниц из шаблонов. В `модуле <https://tarantool.io/ru/download/rocks>` `http`_ достаточно простой движок шаблонов, который позволяет выполнять регулярный код на Lua в текстовых блоках (как в PHP). Таким образом, нет необходимости в изучении новых языков, чтобы написать шаблоны.

source: #!/usr/bin/env tarantool local function handler(self) local fruits = { 'Apple', 'Orange', 'Grapefruit', 'Banana'} return self:render{ fruits = fruits } end local server = require('http.server').new(nil, 8080) -- nil means '*' server:route({ path = '/', file = 'index.html.lua' }, handler) server:start()
ru: #!/usr/bin/env tarantool local function handler(self) local fruits = { 'Apple', 'Orange', 'Grapefruit', 'Banana'} return self:render{ fruits = fruits } end local server = require('http.server').new(nil, 8080) -- nil означает '*' server:route({ path = '/', file = 'index.html.lua' }, handler) server:start()

source: An "HTML" file for this server, including Lua, could look like this (it would produce "1 Apple | 2 Orange | 3 Grapefruit | 4 Banana").
ru: HTML-файл для этого сервера, включая Lua, может выглядеть следующим образом (он выведет "1 Apple | 2 Orange | 3 Grapefruit | 4 Banana").

source: Creating an application
ru: Создание приложения

source: Further we walk you through key programming practices that will give you a good start in writing Lua applications for Tarantool. For an adventure, this is a story of implementing... a real microservice based on Tarantool! We implement a backend for a simplified version of `Pokémon Go <https://en.wikipedia.org/wiki/Pokémon_Go>`_, a location-based augmented reality game released in mid-2016. In this game, players use a mobile device's GPS capability to locate, capture, battle and train virtual monsters called "pokémon", who appear on the screen as if they were in the same real-world location as the player.
ru: Далее мы пошагово разберем ключевые методики программирования, что послужит хорошим началом для написания Lua-приложений для Tarantool'а. Для интереса возьмем историю реализации... настоящего микросервиса на основе Tarantool'а! Мы реализуем бэкенд для упрощенной версии `Pokémon Go <https://ru.wikipedia.org/wiki/Pok%C3%A9mon_Go>`_, игры на основе определения местоположения дополненной реальности, выпущенной в середине 2016 года. В этой игре игроки используют GPS-возможности мобильных устройств, чтобы находить, захватывать, сражаться и тренировать виртуальных существ, или покемонов, которые появляются на экране, как если бы они находились в том же реальном месте, как и игрок.

source: To stay within the walk-through format, let's narrow the original gameplay as follows. We have a map with pokémon spawn locations. Next, we have multiple players who can send catch-a-pokémon requests to the server (which runs our Tarantool microservice). The server replies whether the pokémon is caught or not, increases the player's pokémon counter if yes, and triggers the respawn-a-pokémon method that spawns a new pokémon at the same location in a while.
ru: Чтобы не выходить за рамки пошагового примера, ограничим оригинальный сюжет игры. У нас есть карта с местами появления покемонов. Далее у нас есть несколько игроков, которые могут отправлять запросы на поимку покемона на сервер (где работает микросервис Tarantool'а). Сервер отвечает, пойман ли покемон, увеличивает счетчик покемонов, если пойман, и вызывает метод респауна покемона, который через некоторое время создает нового покемона на том же самом месте.

source: We leave client-side applications outside the scope of this story. Yet we promise a mini-demo in the end to simulate real users and give us some fun. :-)
ru: Мы вынесем клиентские приложения за рамки рассказа. Но в конце обещаем небольшую демонстрацию с моделированием настоящих пользователей, чтобы немного поразвлечься. :-)

source: First, what would be the best way to deliver our microservice?
ru: Для начала как лучше всего предоставить микросервис?

source: Modules, rocks and applications
ru: Модули и приложения

source: To make our game logic available to other developers and Lua applications, let's put it into a Lua module.
ru: Чтобы наша логическая схема игры была доступна другим разработчикам и Lua-приложениям, поместим ее в Lua-модуль.

source: A **module** (called "rock" in Lua) is an optional library which enhances Tarantool functionality. So, we can install our logic as a module in Tarantool and use it from any Tarantool application or module. Like applications, modules in Tarantool can be written in Lua (rocks), C or C++.
ru: **Модуль** (который называется "rock" в Lua) -- это дополнительная библиотека, которая расширяет функции Tarantool'а. Поэтому можно установить нашу логическую схему в виде модуля в Tarantool и использовать ее из любого Tarantool-приложения или модуля. Как и приложения, модули в Tarantool'е могут быть написаны на Lua (rocks), C или C++.

source: Modules are good for two things:
ru: Модули хороши для двух целей:

source: easier **code management** (reuse, packaging, versioning), and
ru: облегченное **управление кодом** (переиспользование, подготовка к развертыванию, версионирование) и

source: hot **code reload** without restarting the Tarantool instance.
ru: горячая **перезагрузка кода** без перезапуска экземпляра Tarantool'а.

source: Technically, a module is a file with source code that exports its functions in an API. For example, here is a Lua module named ``mymodule.lua`` that exports one function named ``myfun``:
ru: В техническом смысле, модуль - это файл с исходным кодом, который экспортирует свои функции в API. Например, вот Lua-модуль под названием ``mymodule.lua``, который экспортирует одну функцию под названием ``myfun``:

source: To launch the function ``myfun()`` -- from another module, from a Lua application, or from Tarantool itself, -- we need to save this module as a file, then load this module with the ``require()`` directive and call the exported function.
ru: Чтобы запустить функцию ``myfun()`` -- из другого модуля, из Lua-приложения или из самого Tarantool'а -- необходимо сохранить этот модуль в виде файла, а затем загрузить этот модуль с директивой ``require()`` и вызвать экспортированную функцию.

source: For example, here's a Lua application that uses ``myfun()`` function from ``mymodule.lua`` module:
ru: Например, вот Lua-приложение, которое использует функцию ``myfun()`` из модуля ``mymodule.lua``:

source: -- loading the module local mymodule = require('mymodule') -- calling myfun() from within test() function local test = function() mymodule.myfun() end
ru: -- загрузка модуля local mymodule = require('mymodule') -- вызов myfun() из функции test() local test = function() mymodule.myfun() end

source: A thing to remember here is that the ``require()`` directive takes load paths to Lua modules from the ``package.path`` variable. This is a semicolon-separated string, where a question mark is used to interpolate the module name. By default, this variable contains system-wide Lua paths and the working directory. But if we put our modules inside a specific folder (e.g. ``scripts/``), we need to add this folder to ``package.path`` before any calls to ``require()``:
ru: Здесь важно запомнить, что директива ``require()`` берет пути загрузки к Lua-модулям из переменной ``package.path``. Она представляет собой строку с разделителями в виде точки с запятой, где знак вопроса используется для вставки имени модуля. По умолчанию, эта переменная содержит пути в системе и рабочую директорию. Но если мы поместим наши модули в особую папку (например, ``scripts/``), необходимо будет добавить эту папку в ``package.path`` до вызова ``require()``:

source: For our microservice, a simple and convenient solution would be to put all methods in a Lua module (say ``pokemon.lua``) and to write a Lua application (say ``game.lua``) that initializes the gaming environment and starts the game loop.
ru: Для нашего микросервиса простым и удобным решением будет разместить все методы в Lua-модуле (скажем, ``pokemon.lua``) и написать Lua-приложение (скажем, ``game.lua``), которое запустит игровое окружение и цикл игры.

source: Now let's get down to implementation details. In our game, we need three entities:
ru: Теперь приступим к деталям реализации. В игре нам необходимы три сущности:

source: **map**, which is an array of pokémons with coordinates of respawn locations; in this version of the game, let a location be a rectangle identified with two points, upper-left and lower-right;
ru: **карта**, которая представляет собой массив покемонов с координатами мест респауна; в данной версии игры пусть местом будет прямоугольник, установленный по двум точкам, верхней левой и нижней правой;

source: **player**, which has an ID, a name, and coordinates of the player's location point;
ru: **игрок**, у которого есть ID, имя и координаты местонахождения игрока;

source: **pokémon**, which has the same fields as the player, plus a status (active/inactive, that is present on the map or not) and a catch probability (well, let's give our pokémons a chance to escape :-) )
ru: **покемон**, у которого такие же поля, как и у игрока, плюс статус (активный/неактивный, то есть находится ли на карте) и возможность поимки (давайте уж дадим нашим покемонам шанс сбежать :-) )

source: We'll store these entities as tuples in Tarantool spaces. But to deliver our backend application as a microservice, the good practice would be to send/receive our data in the universal JSON format, thus using Tarantool as a document storage.
ru: Эти данные будем хранить как кортежи в спейсах Tarantool'а. Но чтобы бэкенд-приложение работало как микросервис, правильно будет отправлять/получать данные в универсальном формате JSON, используя Tarantool в качестве системы хранения документов.

source: Avro schemas
ru: Avro-схемы

source: To store JSON data as tuples, we will apply a savvy practice which reduces data footprint and ensures all stored documents are valid. We will use Tarantool module `avro-schema <https://github.com/tarantool/avro-schema>`_ which checks the schema of a JSON document and converts it to a Tarantool tuple. The tuple will contain only field values, and thus take a lot less space than the original document. In avro-schema terms, converting JSON documents to tuples is "flattening", and restoring the original documents is "unflattening". The usage is quite straightforward:
ru: Чтобы хранить JSON-данные в виде кортежей, используем продвинутую методику, которая уменьшит отпечаток данных и обеспечит пригодность всех сохраняемых документов. Будем использовать Tarantool-модуль `avro-schema <https://github.com/tarantool/avro-schema>`_, который проверяет схему JSON-документа и конвертирует его в кортеж Tarantool'а. Кортеж будет содержать только значения полей, таким образом, занимая меньше места, чем оригинальный документ. С точки зрения avro-схемы, конвертация JSON-документов в кортежи -- "flattening" (конвертация в плоские файлы), а восстановление оригинальных документов -- "unflattening" (конвертация из плоских файлов). Использовать модуль достаточно просто:

source: For each entity, we need to define a schema in `Apache Avro schema <https://en.wikipedia.org/wiki/Apache_Avro>`_ syntax, where we list the entity's fields with their names and `Avro data types <http://avro.apache.org/docs/current/spec.html#schema_primitive>`_.
ru: Для каждой сущности необходимо определить схему в синтаксисе `схемы Apache Avro <https://en.wikipedia.org/wiki/Apache_Avro>`_, где мы перечисляем поля сущности с их наименованиями и `типами данных по Avro <http://avro.apache.org/docs/current/spec.html#schema_primitive>`_.

source: At initialization, we call ``avro-schema.create()`` that creates objects in memory for all schema entities, and ``compile()`` that generates flatten/unflatten methods for each entity.
ru: При инициализации мы вызываем функцию ``avro-schema.create()``, которая создает объекты в памяти для всех сущностей схемы, а также функцию ``compile()``, которая создает методы flatten/unflatten (конвертация в плоские файлы и обратно) для каждой сущности.

source: Further on, we just call flatten/unflatten methods for a respective entity on receiving/sending the entity's data.
ru: Далее мы просто вызываем методы flatten/unflatten для соответствующей сущности при получении/отправке данных об этой сущности.

source: Here's what our schema definitions for the player and pokémon entities look like:
ru: Вот как будут выглядеть определения схемы для сущностей игрока и покемона:

source: And here's how we create and compile our entities at initialization:
ru: А вот как мы создадим и скомпилируем наши сущности при инициализации:

source: -- load avro-schema module with require() local avro = require('avro_schema') -- create models local ok_m, pokemon = avro.create(schema.pokemon) local ok_p, player = avro.create(schema.player) if ok_m and ok_p then -- compile models local ok_cm, compiled_pokemon = avro.compile(pokemon) local ok_cp, compiled_player = avro.compile(player) if ok_cm and ok_cp then -- start the game <...> else log.error('Schema compilation failed') end else log.info('Schema creation failed') end return false
ru: -- загрузить модуль avro-schema с директивой require() local avro = require('avro_schema') -- создать модели local ok_m, pokemon = avro.create(schema.pokemon) local ok_p, player = avro.create(schema.player) if ok_m and ok_p then -- скомпилировать модели local ok_cm, compiled_pokemon = avro.compile(pokemon) local ok_cp, compiled_player = avro.compile(player) if ok_cm and ok_cp then -- начать игру <...> else log.error('Schema compilation failed') end else log.info('Schema creation failed') end return false

source: As for the map entity, it would be an overkill to introduce a schema for it, because we have only one map in the game, it has very few fields, and -- which is most important -- we use the map only inside our logic, never exposing it to external users.
ru: Что касается сущности карты, вводить для нее схему будет перебор, потому что в игре всего одна карта, у нее мало полей, и -- что самое главное -- мы используем карту только внутри нашей логики, не показывая ее внешним пользователям.

source: Next, we need methods to implement the game logic. To simulate object-oriented programming in our Lua code, let's store all Lua functions and shared variables in a single local variable (let's name it as ``game``). This will allow us to address functions or variables from within our module as ``self.func_name`` or ``self.var_name``. Like this:
ru: Далее нам нужны методы для реализации игровой логики. Чтобы смоделировать объектно-ориентированное программирование в нашем Lua-коде, будем хранить все Lua-функции и общие переменные в одной внутренней переменной (назовем ее ``game``). Это позволит нам обращаться к функциям или переменным из нашего модуля с помощью ``self.func_name`` или ``self.var_name`` следующим образом:

source: local game = { -- a local variable num_players = 0, -- a method that prints a local variable hello = function(self) print('Hello! Your player number is ' .. self.num_players .. '.') end, -- a method that calls another method and returns a local variable sign_in = function(self) self.num_players = self.num_players + 1 self:hello() return self.num_players end }
ru: local game = { -- локальная переменная num_players = 0, -- метод, который выводит локальную переменную hello = function(self) print('Hello! Your player number is ' .. self.num_players .. '.') end, -- метод, который вызывает другой метод и возвращает локальную переменную sign_in = function(self) self.num_players = self.num_players + 1 self:hello() return self.num_players end }

source: In OOP terms, we can now regard local variables inside ``game`` as object fields, and local functions as object methods.
ru: В терминах ООП сейчас мы можем рассматривать внутренние переменные внутри переменной ``game`` как поля объекта, а внутренние функции -- как методы объекта.

source: In this manual, Lua examples use **local** variables. Use **global** variables with caution, since the module’s users may be unaware of them.
ru: Обратите внимание, что в текущей документации в примерах Lua-кода используются *локальные* переменные. Используйте *глобальные* переменные аккуратно, поскольку пользователи ваших модулей могут не знать об этих переменных.

source: To enable/disable the use of undeclared global variables in your Lua code, use Tarantool's :ref:`strict <strict-module>` module.
ru: Чтобы включить/отключить использование необъявленных глобальных переменных в вашем коде на языке Lua, используйте модуль Tarantool'а :ref:`strict <strict-module>`.

source: So, our game module will have the following methods:
ru: Таким образом, в модуле игры будут следующие методы:

source: ``catch()`` to calculate whether the pokémon was caught (besides the coordinates of both the player and pokémon, this method will apply a probability factor, so not every pokémon within the player's reach will be caught);
ru: ``catch()`` (поймать) для расчета, когда был пойман покемон (помимо координат как игрока, так и покемона, этот метод будет использовать коэффициент вероятности, чтобы в пределах досягаемости игрока можно было поймать не каждого покемона);

source: ``respawn()`` to add missing pokémons to the map, say, every 60 seconds (we assume that a frightened pokémon runs away, so we remove a pokémon from the map on any catch attempt and add it back to the map in a while);
ru: ``respawn()`` (респаун) для добавления отсутствующих покемонов на карту, скажем, каждые 60 секунд (предположим, что испуганный покемон убегает, поэтому мы убираем покемона с карты при любой попытке поймать его и через некоторое время добавляем обратно на карту);

source: ``notify()`` to log information about caught pokémons (like "Player 1 caught pokémon A");
ru: ``notify()`` (уведомить) для записи информации о пойманных покемонах (например, "Игрок 1 поймал покемона A");

source: ``start()`` to initialize the game (it will create database spaces, create and compile avro schemas, and launch ``respawn()``).
ru: ``start()`` (начать) для инициализации игры (метод создаст спейсы в базе данных, создаст и скомпилирует avro-схемы, а также запустит метод ``respawn()``).

source: Besides, it would be convenient to have methods for working with Tarantool storage. For example:
ru: Кроме того, было бы удобно завести методы для работы с хранилищем Tarantool'а. Например:

source: ``add_pokemon()`` to add a pokémon to the database, and
ru: ``add_pokemon()`` (добавить покемона) для добавления покемона в базу данных и

source: ``map()`` to populate the map with all pokémons stored in Tarantool.
ru: ``map()`` (карта) для заполнения карты всеми покемонами, которые хранятся в Tarantool'е.

source: We'll need these two methods primarily when initializing our game, but we can also call them later, for example to test our code.
ru: Эти два метода будут главным образом использоваться во время инициализации нашей игры, но их также можно вызывать позднее, например для тестирования кода.

source: Bootstrapping a database
ru: Настройка базы данных

source: Let's discuss game initialization. In ``start()`` method, we need to populate Tarantool spaces with pokémon data. Why not keep all game data in memory? Why use a database? The answer is: :ref:`persistence <index-box_persistence>`. Without a database, we risk losing data on power outage, for example. But if we store our data in an in-memory database, Tarantool takes care to persist it on disk whenever it's changed. This gives us one more benefit: quick startup in case of failure. Tarantool has a :ref:`smart algorithm <internals-recovery_process>` that quickly loads all data from disk into memory on startup, so the warm-up takes little time.
ru: Обсудим инициализацию игры. В методе ``start()`` нам нужно заполнить спейсы Tarantool'а данными о покемонах. Почему бы не хранить все игровые данные в памяти? Зачем нужна база данных? Ответ на это: :ref:`персистентность <index-box_persistence>`. Без базы данных мы рискуем потерять данные при отключении электроэнергии, например. Но если мы храним данные в in-memory базе данных, Tarantool позаботится о том, чтобы обеспечить постоянное хранение данных при их изменении. Это дает дополнительное преимущество: быстрая загрузка в случае отказа. :ref:`Умный алгоритм <internals-recovery_process>` Tarantool'а быстро загружает все данные с диска в память при начале работы, так что подготовка к работе не займет много времени.

source: We'll be using functions from Tarantool built-in :ref:`box <box-module>` module:
ru: Мы будем использовать функции из встроенного модуля Tarantool'а :ref:`box <box-module>`:

source: ``box.schema.create_space('pokemons')`` to create a space named ``pokemon`` for storing information about pokémons (we don't create a similar space for players, because we intend to only send/receive player information via API calls, so we needn't store it);
ru: ``box.schema.create_space('pokemons')`` для создания спейса под названием ``pokemon`` (покемон), чтобы хранить информацию о покемонах (мы не создаем аналогичный спейс по игрокам, потому что планируем только отправлять и получать информацию об игроках с помощью вызовов API, так что нет необходимости хранить ее);

source: ``box.space.pokemons:create_index('primary', {type = 'hash', parts = {1, 'unsigned'}})`` to create a primary HASH index by pokémon ID;
ru: ``box.space.pokemons:create_index('primary', {type = 'hash', parts = {1, 'unsigned'}})`` для создания первичного HASH-индекса по ID покемона;
