Repository: tarantool/doc
Catalog: locale/*/LC_MESSAGES/doc.po
Languages: ru

source: There is a rule: ``min`` <= ``start`` <= ``max``. For example it is illegal to say ``{start=0}`` because then the specified start value (0) would be less than the default min value (1).
ru: Есть следующее правило: ``min`` <= ``start`` <= ``max``. Например, нельзя указать ``{start=0}``, поскольку указанное начальное значение (0) будет меньше, чем минимальное значение, используемое по умолчанию (1).

source: There is a rule: ``min`` <= next-value <= ``max``. For example, if the next generated value would be 1000, but the maximum value is 999, then that would be considered "overflow".
ru: Есть следующее правило: ``min`` <= следующее-значение <= ``max``. Например, если сгенерированное значение будет 1000, но максимальное значение -- 999, это будет считаться переполнением.

source: ``cycle`` -- the CYCLE value. Type = bool. Default = false.
ru: ``cycle`` -- значение ЦИКЛА. Тип = bool (логический), по умолчанию = false (ложь).

source: If the sequence generator's next value is an overflow number, it causes an error return -- unless ``cycle == true``.
ru: Если следующее значение в генераторе последовательности будет переполнением, это вызовет ошибку -- не считая случаев, когда задан цикл (``cycle == true``).

source: But if ``cycle == true``, the count is started again, at the MINIMUM value or at the MAXIMUM value (not the STARTS WITH value).
ru: Если же ``cycle == true``, отсчет начинается заново с МИНИМАЛЬНОГО значения или с МАКСИМАЛЬНОГО значения (не с НАЧАЛЬНОГО значения).

source: ``cache`` -- the CACHE value. Type = unsigned integer. Default = 0.
ru: ``cache`` -- значение КЭША. Тип = беззнаковое целое число, по умолчанию = 0.

source: Currently Tarantool ignores this value, it is reserved for future use.
ru: В данный момент Tarantool игнорирует это значение, оно зарезервировано для последующего использования.

source: ``step`` -- the INCREMENT BY value. Type = integer. Default = 1.
ru: ``step`` -- значение УВЕЛИЧЕНИЯ. Тип = целое число, по умолчанию = 1.

source: Ordinarily this is what is added to the previous value.
ru: Это значение прибавляется к предыдущему.

source: Generate the next value and return it.
ru: Генерация и возврат следующего значения.

source: The generation algorithm is simple:
ru: Простой алгоритм для генерации:

source: If this is the first time, then return the STARTS WITH value.
ru: В первый раз вернуть НАЧАЛЬНОЕ значение.

source: If the previous value plus the INCREMENT value is less than the MINIMUM value or greater than the MAXIMUM value, that is "overflow", so either return an error (if ``cycle`` = ``false``) or return the MAXIMUM value (if ``cycle`` = ``true`` and ``step`` < 0) or return the MINIMUM value (if ``cycle`` = ``true`` and ``step`` > 0).
ru: Если предыдущее значение плюс значение УВЕЛИЧЕНИЯ меньше, чем МИНИМАЛЬНОЕ значение, или больше, чем МАКСИМАЛЬНОЕ значение, будет переполнение, поэтому либо вернуть ошибку (если цикл не задан -- ``cycle`` = ``false``) или вернуть МАКСИМАЛЬНОЕ значение (если цикл задан -- ``cycle`` = ``true`` -- и ``step`` < 0), или вернуть МИНИМАЛЬНОЕ значение (если цикл задан -- ``cycle`` = ``true`` -- и ``step`` > 0).

source: If there was no error, then save the returned result, it is now the "previous value".
ru: Если ошибки нет, сохранить результат, который становится "предыдущим значением".

source: For example, suppose sequence 'S' has:
ru: Например, предположим, что для последовательности 'S':

source: previous value = -2.
ru: предыдущее значение = -2.

source: Then ``box.sequence.S:next()`` returns -5 because -2 + (-3) == -5.
ru: Тогда ``box.sequence.S:next()`` вернет -5, потому что -2 + (-3) == -5.

source: Then ``box.sequence.S:next()`` again returns -1 because -5 + (-3) < -6, which is overflow, causing cycle, and ``max`` == -1.
ru: Затем ``box.sequence.S:next()`` снова вернет -1, потому что -5 + (-3) < -6, что будет переполнением, которое вызовет цикл, а ``max`` == -1.

source: This function requires a :ref:`'write' privilege <box_schema-user_grant>` on the sequence.
ru: Для данной функции необходимы права на :ref:`запись ('write') <box_schema-user_grant>` на последовательность.

source: This function should not be used in "cross-engine" transactions (transactions which use both the memtx and the vinyl storage engines).
ru: Данную функцию не следует использовать в транзакциях между движками (транзакции, в которых используется и движок memtx, и движок vinyl).

source: To see what the previous value was, without changing it, you can select from the :ref:`_sequence_data <box_space-sequence_data>` system space.
ru: Чтобы увидеть предыдущее значение, не изменяя его, сделайте выборку из системного спейса :ref:`_sequence_data <box_space-sequence_data>`.

source: The ``alter()`` function can be used to change any of the sequence's options. Requirements and restrictions are the same as for :ref:`box.schema.sequence.create() <box_schema-sequence_create>`.
ru: Функцию ``alter()`` можно использовать для изменения любых параметров последовательности. Требования и ограничения в данном случае такие же, как для :ref:`box.schema.sequence.create() <box_schema-sequence_create>`.

source: Set the sequence back to its original state. The effect is that a subsequent ``next()`` will return the ``start`` value. This function requires a :ref:`'write' privilege <box_schema-user_grant>` on the sequence.
ru: Возврат последовательности в оригинальное состояние. Смысл в том, что последующий вызов ``next()`` вернет начальное значение ``start``. Для данной функции необходимы права на :ref:`запись ('write') <box_schema-user_grant>` на последовательность.

source: Set the "previous value" to ``new-previous-value``. This function requires a :ref:`'write' privilege <box_schema-user_grant>` on the sequence.
ru: Установите "предыдущее значение" на ``new-previous-value`` (новое предыдущее значение). Для данной функции необходимы права на :ref:`запись ('write') <box_schema-user_grant>` на последовательность.

source: Drop an existing sequence.
ru: Удаление существующей последовательности.

source: Here is an example showing all sequence options and operations:
ru: Ниже представлен пример, иллюстрирующий все параметры и операции для последовательностей:

source: You can use the :samp:`sequence={sequence-name}` (or :samp:`sequence={sequence-id}` or :samp:`sequence=true`) option when :ref:`creating <box_space-create_index>` or :ref:`altering <box_index-alter>` a primary-key index. The sequence becomes associated with the index, so that the next ``insert()`` will put the next generated number into the primary-key field, if the field would otherwise be nil.
ru: Можно использовать опцию :samp:`sequence={имя-последовательности}` (или :samp:`sequence={id-последовательности}`, или :samp:`sequence=true`) при :ref:`создании <box_space-create_index>` или :ref:`изменении <box_index-alter>` первичного индекса. Происходит ассоциация последовательности с индексом, так что следующий вызов ``insert()`` поместит следующее сгенерированное число в поле первичного ключа, если в противном случае поле было бы nil.

source: For example, if 'Q' is a sequence and 'T' is a new space, then this will work:
ru: Например, если 'Q' -- это последовательность, а 'T' -- это новый спейс, то сработает:

source: (Notice that the index now has a ``sequence_id`` field.)
ru: (Обратите внимание, что теперь в индексе есть поле идентификатора последовательности ``sequence_id``.)

source: And this will work:
ru: И сработает:

source: If you are using negative numbers for the sequence options, make sure that the index key type is 'integer'. Otherwise the index key type may be either 'integer' or 'unsigned'.
ru: Если вы используете отрицательные числа в параметрах последовательности, убедитесь, что тип ключа индекса будет целое число 'integer'. В противном случае, тип ключа может быть либо 'integer', либо 'unsigned' (без знака).

source: A sequence cannot be dropped if it is associated with an index.
ru: Последовательность нельзя удалить, если она связана с индексом.

source: Submodule `box.session`
ru: Вложенный модуль `box.session`

source: Below is a list of all ``box.session`` functions and members.
ru: Ниже приведен перечень всех функций и элементов модуля ``box.session``.

source: Get the current session's ID
ru: Получение идентификатора текущей сессии

source: Check if a session exists
ru: Проверка наличия сессии

source: Get the session peer's host address and port
ru: Получение адреса хоста и порта подключенного узла

source: Get the sync integer constant
ru: Получение целочисленной константы sync

source: Get the current user's name
ru: Получение имени текущего пользователя

source: Get the connection type or cause of action
ru: Получение типа соединения или повода к действию

source: Change the current user
ru: Изменение текущего пользователя

source: Get the current user's ID
ru: Получение идентификатора текущего пользователя

source: Get the current effective user's ID
ru: Получение идентификатора текущего действующего пользователя

source: Table with session-specific names and values
ru: Таблица с именами и значениями по сессии

source: Define a connect trigger
ru: Определение триггера для подключения

source: Define a disconnect trigger
ru: Определение триггера для отключения

source: Define an authentication trigger
ru: Определение триггера для аутентификации

source: the unique identifier (ID) for the current session. The result can be 0 meaning there is no session.
ru: уникальный идентификатор (ID) для текущей сессии. Результатом может быть 0, что означает, что сессии нет.

source: 1 if the session exists, 0 if the session does not exist.
ru: 1, если сессия есть; 0, если сессии нет.

source: This function works only if there is a peer, that is, if a connection has been made to a separate Tarantool instance.
ru: Данная функция сработает только в том случае, если есть подключенная программа, то есть если было выполнено подключение к отдельному экземпляру Tarantool'а.

source: The host address and port of the session peer, for example "127.0.0.1:55457". If the session exists but there is no connection to a separate instance, the return is null. The command is executed on the server instance, so the "local name" is the server instance's host and port, and the "peer name" is the client's host and port.
ru: Адрес хоста и порт подключенного узла, например "127.0.0.1:55457". Если существует сессия, но отсутствует подключение к отдельному экземпляру, вернется null. Команда выполняется на экземпляре сервера, поэтому "локальное имя" -- это хост и порт экземпляра сервера, а "имя узла" -- это хост и порт клиента.

source: Possible errors: 'session.peer(): session does not exist'
ru: Возможные ошибки: 'session.peer(): сессия отсутствует'

source: the name of the :ref:`current user <authentication-users>`
ru: имя :ref:`текущего пользователя <authentication-users>`

source: the type of connection or cause of action.
ru: тип соединения или повод к действию.

source: Possible return values are:
ru: Возможные возвращаемые значения:

source: 'binary' if the connection was done via the binary protocol, for example to a target made with :ref:`box.cfg{listen=...} <cfg_basic-listen>`;
ru: 'binary' (бинарное), если подключение было выполнено по бинарному протоколу, например, к объекту с помощью :ref:`box.cfg{listen=...} <cfg_basic-listen>`;

source: 'console' if the connection was done via the administrative console, for example to a target made with :ref:`console.listen <console-listen>`;
ru: 'console' (консоль), если подключение было выполнено по административной консоли, например, к объекту с помощью :ref:`console.listen <console-listen>`;

source: 'repl' if the connection was done directly, for example when :ref:`using Tarantool as a client <admin-using_tarantool_as_a_client>`;
ru: 'repl' (репликация), если подключение было выполнено напрямую, например, при :ref:`использовании Tarantool'а в качестве клиента <admin-using_tarantool_as_a_client>`;

source: 'applier' if the action is due to :ref:`replication <replication>`, regardless of how the connection was done;
ru: 'applier' (наложение), если действие происходит по причине :ref:`репликации <replication>`, независимо от типа подключения;

source: 'background' if the action is in a :ref:`background fiber <fiber-module>`, regardless of whether the Tarantool server was :ref:`started in the background <cfg_basic-background>`.
ru: 'background' (в фоне), если действие происходит в :ref:`фоновом файбере <fiber-module>`, независимо от того, был ли Tarantool :ref:`запущен в фоновом режиме <cfg_basic-background>`.

source: ``box.session.type()`` is useful for an :ref:`on_replace() <box_space-on_replace>` trigger on a replica -- the value will be 'applier' if and only if the trigger was activated because of a request that was done on the master.
ru: ``box.session.type()`` используется для триггера при замене :ref:`on_replace() <box_space-on_replace>` на реплике -- значение будет 'applier' только в том случае, если триггер был активирован по причине запроса, выполненного на мастере.

source: Change Tarantool's :ref:`current user <authentication-users>` -- this is analogous to the Unix command ``su``.
ru: Изменение :ref:`текущего пользователя <authentication-users>` Tarantool'а -- аналогично Unix-команде ``su``.

source: Or, if function-to-execute is specified, change Tarantool's :ref:`current user <authentication-users>` temporarily while executing the function -- this is analogous to the Unix command ``sudo``.
ru: Или, если указана выполняемая функция (function-to-execute), временное изменение :ref:`текущего пользователя <authentication-users>` Tarantool'а во время выполнения функции – аналогично Unix-команде ``sudo``.

source: name of a target user
ru: целевое имя пользователя

source: name of a function, or definition of a function. Additional parameters may be passed to ``box.session.su``, they will be interpreted as parameters of function-to-execute.
ru: имя функции или определение функции. Дополнительные параметры могут передаваться в ``box.session.su``, они будут интерпретироваться как параметры выполняемой функции.

source: the user ID of the :ref:`current user <authentication-users>`.
ru: ID :ref:`текущего пользователя <authentication-users>`.

source: Every user has a unique name (seen with :ref:`box.session.user() <box_session-user>`) and a unique ID (seen with ``box.session.uid()``). The values are stored together in the ``_user`` space.
ru: У каждого пользователя есть уникальное имя (узнать с помощью :ref:`box.session.user() <box_session-user>`) и уникальный идентификатор (узнать с помощью ``box.session.uid()``). Значения хранятся вместе в спейсе ``_user``.

source: the effective user ID of the :ref:`current user <authentication-users>`.
ru: рабочий ID :ref:`текущего пользователя <authentication-users>`.

source: This is the same as :ref:`box.session.uid() <box_session-uid>`, except in two cases:
ru: Аналогично :ref:`box.session.uid() <box_session-uid>`, за исключением двух случаев:

source: The first case: if the call to ``box.session.euid()`` is within a function invoked by :ref:`box.session.su(user-name, function-to-execute) <box_session-su>` -- in that case, ``box.session.euid()`` returns the ID of the changed user (the user who is specified by the ``user-name`` parameter of the ``su`` function) but ``box.session.uid()`` returns the ID of the original user (the user who is calling the ``su`` function).
ru: Первый случай: если вызов ``box.session.euid()`` выполняется в рамках функции, вызываемой по :ref:`box.session.su(user-name, function-to-execute) <box_session-su>` -- в таком случае ``box.session.euid()`` вернет измененный идентификатор пользователя (пользователь, который указан в параметре ``user-name`` функции ``su``), но ``box.session.uid()`` вернет идентификатор оригинального пользователя (пользователя, который вызывает функцию ``su``).

source: The second case: if the call to ``box.session.euid()`` is within a function specified with :ref:`box.schema.func.create(function-name, {setuid= true}) <box_schema-func_create>` and the binary protocol is in use -- in that case, ``box.session.euid()`` returns the ID of the user who created "function-name" but ``box.session.uid()`` returns the ID of the the user who is calling "function-name".
ru: Второй случай: если вызов ``box.session.euid()`` выполняется в рамках функции по :ref:`box.schema.func.create(function-name, {setuid= true}) <box_schema-func_create>`, и используется бинарный протокол -- в таком случае ``box.session.euid()`` вернет идентификатор пользователя, который создал функцию "function-name", а ``box.session.uid()`` вернет идентификатор пользователя, который вызывает эту функцию "function-name".

source: A Lua table that can hold arbitrary unordered session-specific names and values, which will last until the session ends. For example, this table could be useful to store current tasks when working with a `Tarantool queue manager <https://github.com/tarantool/queue>`_.
ru: Lua-таблица с произвольными неупорядоченными именами и значениями по сессии, которая хранится до конца сессии. Например, эту таблицу можно использовать для хранения текущих задач при работе с `очередями сообщений в Tarantool'е <https://github.com/tarantool/queue>`_.

source: Define a trigger for execution when a new session is created due to an event such as :ref:`console.connect <console-connect>`. The trigger function will be the first thing executed after a new session is created. If the trigger execution fails and raises an error, the error is sent to the client and the connection is closed.
ru: Определение исполняемого триггера во время создания новой сессии при подключению по консоли :ref:`console.connect <console-connect>`. Функция с триггером будет первой исполняемой функцией после создания сессии. Если триггер не выполняется и выдает ошибку, эта ошибка отправляется на клиент, и подключение разрывается.

source: function which will become the trigger function
ru: функция, в которой будет триггер

source: existing trigger function which will be replaced by trigger-function
ru: существующая функция с триггером, которую заменит новая

source: nil or function pointer
ru: nil или указатель функции

source: If the parameters are (nil, old-trigger-function), then the old trigger is deleted.
ru: Если указаны параметры (nil, old-trigger-function), старый триггер будет удален.

source: Details about trigger characteristics are in the :ref:`triggers <triggers-box_triggers>` section.
ru: Подробная информация о характеристиках триггера находится в разделе :ref:`Триггеры <triggers-box_triggers>`.

source: If a trigger always results in an error, it may become impossible to connect to a server to reset it.
ru: Если триггер всегда приводит к ошибке, подключение к серверу для его переустановки может стать невозможным.

source: Define a trigger for execution after a client has disconnected. If the trigger function causes an error, the error is logged but otherwise is ignored. The trigger is invoked while the session associated with the client still exists and can access session properties, such as :ref:`box.session.id() <box_session-id>`.
ru: Определение исполняемого триггера после отключения клиента. Если функция с триггером вызывает ошибку, то ошибка записывается в журнал, в противном случае записей не будет. Триггер вызывается во время сессии клиента и может получить доступ к свойствам сессии, как :ref:`box.session.id() <box_session-id>`.

source: After the following series of requests, a Tarantool instance will write a message using the :ref:`log <log-module>` module whenever any user connects or disconnects.
ru: После следующей серии запросов экземпляр Tarantool'а запишет сообщение с помощью модуля :ref:`log <log-module>` при подключении или отключении любого пользователя.

source: Here is what might appear in the log file in a typical installation:
ru: Вот что может быть записано в файл журнала при обычной установке:

source: Define a trigger for execution during :ref:`authentication <authentication-users>`.
ru: Определение триггера, используемого во время :ref:`аутентификации <authentication-users>`.

source: The ``on_auth`` trigger function is invoked in these circumstances:
ru: Вызов функции ``on_auth`` с триггером происходит в следующих обстоятельствах:

source: The :ref:`console.connect <console-connect>` function includes an authentication check for all users except 'guest'. For this case, the ``on_auth`` trigger function is invoked after the ``on_connect`` trigger function, if and only if the connection has succeeded so far.
ru: Функция :ref:`console.connect <console-connect>` включает в себя проверку аутентификации всех пользователей, кроме 'guest'. Вызов функции ``on_auth`` с триггером происходит после триггера ``on_connect`` только в том случае, если подключение было успешным.

source: The :ref:`binary protocol <admin-security>` has a separate :ref:`authentication packet <box_protocol-authentication>`. For this case, connection and authentication are considered to be separate steps.
ru: В :ref:`бинарном протоколе <admin-security>` есть отдельный :ref:`пакет для аутентификации <box_protocol-authentication>`. В этом случае подключение и аутентификация считаются отдельными действиям.

source: Unlike other trigger types, ``on_auth`` trigger functions are invoked **before** the event. Therefore a trigger function like :code:`function auth_function () v = box.session.user(); end` will set :code:`v` to "guest", the user name before the authentication is done. To get the user name **after** the authentication is done, use the special syntax: :code:`function auth_function (user_name) v = user_name; end`
ru: В отличие от других типов триггеров, вызов функций с триггером ``on_auth`` происходит **до** события. Таким образом, функция с таким триггером, как :code:`function auth_function () v = box.session.user(); end`, определит :code:`v` как "guest", то есть имя пользователя до проведения аутентификации. Чтобы получить имя пользователя **после** проведения аутентификации, используйте специальный синтаксис: :code:`function auth_function (user_name) v = user_name; end`

source: If the trigger fails by raising an error, the error is sent to the client and the connection is closed.
ru: Если триггер не выполняется и выдает ошибку, эта ошибка отправляется на клиент, и подключение разрывается.

source: **Example 1**
ru: **Пример 1**

source: **Example 2**
ru: **Пример 2**

source: This is a more complex example, with two server instances.
ru: Более сложный пример с двумя экземплярами сервера.

source: The first server instance listens on port 3301; its default user name is 'admin'. There are three ``on_auth`` triggers:
ru: Первый экземпляр сервера настроен на прослушивание по порту 3301; имя пользователя по умолчанию -- 'admin'. Есть три триггера ``on_auth``:

source: The first trigger has a function with no arguments, it can only look at ``box.session.user()``.
ru: В первом триггере есть функция без аргументов, которая только смотрит на ``box.session.user()``.

source: The second trigger has a function with a ``user_name`` argument, it can look at both of: ``box.session.user()`` and ``user_name``.
ru: Во втором триггере есть функция с аргументом ``user_name``, которая может смотреть на ``box.session.user()`` и ``user_name``.

source: The third trigger has a function with a ``user_name`` argument and a ``status`` argument, it can look at all three of: ``box.session.user()`` and ``user_name`` and ``status``.
ru: В третьем триггере есть функция с аргументом ``user_name`` и аргументом ``status``, которая может смотреть на ``box.session.user()`` и ``user_name``, и``status``.
