Repository: tarantool/doc
Catalog: locale/*/LC_MESSAGES/doc.po
Languages: ru

source: $ # launching the replica $ tarantool replica.lua 2017-06-14 14:35:36.763 [18952] main/101/replica.lua C> version 1.7.4-52-g980d30092 2017-06-14 14:35:36.765 [18952] main/101/replica.lua C> log level 5 2017-06-14 14:35:36.765 [18952] main/101/replica.lua I> mapping 268435456 bytes for tuple arena... 2017-06-14 14:35:36.772 [18952] iproto/101/main I> binary: bound to [::]:3301 2017-06-14 14:35:36.772 [18952] main/104/applier/replicator@192.168.0. I> can't connect to master 2017-06-14 14:35:36.772 [18952] main/104/applier/replicator@192.168.0. coio.cc:105 !> SystemError connect, called on fd 13, aka 192.168.0.101:56820: Connection refused 2017-06-14 14:35:36.772 [18952] main/104/applier/replicator@192.168.0. I> will retry every 1 second 2017-06-14 14:35:36.772 [18952] main/105/applier/replicator@192.168.0. I> remote master is 1.7.4 at 192.168.0.102:3301
ru: $ # запуск реплики $ tarantool replica.lua 2017-06-14 14:35:36.763 [18952] main/101/replica.lua C> version 1.7.4-52-g980d30092 2017-06-14 14:35:36.765 [18952] main/101/replica.lua C> log level 5 2017-06-14 14:35:36.765 [18952] main/101/replica.lua I> mapping 268435456 bytes for tuple arena... 2017-06-14 14:35:36.772 [18952] iproto/101/main I> binary: bound to [::]:3301 2017-06-14 14:35:36.772 [18952] main/104/applier/replicator@192.168.0. I> can't connect to master 2017-06-14 14:35:36.772 [18952] main/104/applier/replicator@192.168.0. coio.cc:105 !> SystemError connect, called on fd 13, aka 192.168.0.101:56820: Connection refused 2017-06-14 14:35:36.772 [18952] main/104/applier/replicator@192.168.0. I> will retry every 1 second 2017-06-14 14:35:36.772 [18952] main/105/applier/replicator@192.168.0. I> remote master is 1.7.4 at 192.168.0.102:3301

source: ... and the master later:
ru: ... а затем уже мастера:

source: $ # launching the master $ tarantool master.lua 2017-06-14 14:35:43.701 [18953] main/101/master.lua C> version 1.7.4-52-g980d30092 2017-06-14 14:35:43.702 [18953] main/101/master.lua C> log level 5 2017-06-14 14:35:43.702 [18953] main/101/master.lua I> mapping 268435456 bytes for tuple arena... 2017-06-14 14:35:43.709 [18953] iproto/101/main I> binary: bound to [::]:3301 2017-06-14 14:35:43.709 [18953] main/105/applier/replicator@192.168.0. I> remote master is 1.7.4 at 192.168.0.102:3301 2017-06-14 14:35:43.709 [18953] main/104/applier/replicator@192.168.0. I> remote master is 1.7.4 at 192.168.0.101:3301 2017-06-14 14:35:43.709 [18953] main/101/master.lua I> initializing an empty data directory 2017-06-14 14:35:43.721 [18953] snapshot/101/main I> saving snapshot `/var/lib/tarantool/master/00000000000000000000.snap.inprogress' 2017-06-14 14:35:43.722 [18953] snapshot/101/main I> done 2017-06-14 14:35:43.723 [18953] main/101/master.lua I> vinyl checkpoint done 2017-06-14 14:35:43.723 [18953] main/101/master.lua I> ready to accept requests 2017-06-14 14:35:43.724 [18953] main/105/applier/replicator@192.168.0. I> failed to authenticate 2017-06-14 14:35:43.724 [18953] main/105/applier/replicator@192.168.0. xrow.cc:431 E> ER_LOADING: Instance bootstrap hasn't finished yet box.once executed on master 2017-06-14 14:35:43.726 [18953] main C> entering the event loop 2017-06-14 14:35:43.779 [18953] main/103/main I> initial data sent. 2017-06-14 14:35:43.780 [18953] relay/[::ffff:192.168.0.101]:/101/main I> recover from `/var/lib/tarantool/master/00000000000000000000.xlog' 2017-06-14 14:35:43.780 [18953] main/103/main I> final data sent. 2017-06-14 14:35:43.796 [18953] relay/[::ffff:192.168.0.102]:/101/main I> recover from `/var/lib/tarantool/master/00000000000000000000.xlog' 2017-06-14 14:35:44.726 [18953] main/105/applier/replicator@192.168.0. I> authenticated
ru: $ # запуск мастера $ tarantool master.lua 2017-06-14 14:35:43.701 [18953] main/101/master.lua C> version 1.7.4-52-g980d30092 2017-06-14 14:35:43.702 [18953] main/101/master.lua C> log level 5 2017-06-14 14:35:43.702 [18953] main/101/master.lua I> mapping 268435456 bytes for tuple arena... 2017-06-14 14:35:43.709 [18953] iproto/101/main I> binary: bound to [::]:3301 2017-06-14 14:35:43.709 [18953] main/105/applier/replicator@192.168.0. I> remote master is 1.7.4 at 192.168.0.102:3301 2017-06-14 14:35:43.709 [18953] main/104/applier/replicator@192.168.0. I> remote master is 1.7.4 at 192.168.0.101:3301 2017-06-14 14:35:43.709 [18953] main/101/master.lua I> initializing an empty data directory 2017-06-14 14:35:43.721 [18953] snapshot/101/main I> saving snapshot `/var/lib/tarantool/master/00000000000000000000.snap.inprogress' 2017-06-14 14:35:43.722 [18953] snapshot/101/main I> done 2017-06-14 14:35:43.723 [18953] main/101/master.lua I> vinyl checkpoint done 2017-06-14 14:35:43.723 [18953] main/101/master.lua I> ready to accept requests 2017-06-14 14:35:43.724 [18953] main/105/applier/replicator@192.168.0. I> failed to authenticate 2017-06-14 14:35:43.724 [18953] main/105/applier/replicator@192.168.0. xrow.cc:431 E> ER_LOADING: Instance bootstrap hasn't finished yet box.once executed on master 2017-06-14 14:35:43.726 [18953] main C> entering the event loop 2017-06-14 14:35:43.779 [18953] main/103/main I> initial data sent. 2017-06-14 14:35:43.780 [18953] relay/[::ffff:192.168.0.101]:/101/main I> recover from `/var/lib/tarantool/master/00000000000000000000.xlog' 2017-06-14 14:35:43.780 [18953] main/103/main I> final data sent. 2017-06-14 14:35:43.796 [18953] relay/[::ffff:192.168.0.102]:/101/main I> recover from `/var/lib/tarantool/master/00000000000000000000.xlog' 2017-06-14 14:35:44.726 [18953] main/105/applier/replicator@192.168.0. I> authenticated

source: In this case, the replica would wait for the master to become available, so the launch order doesn't matter. Our ``box.once()`` logic would also be executed only once, at the master.
ru: В данном случае реплика ожидает доступности мастера, поэтому порядок запуска не имеет значения. Наша функция ``box.once()`` также будет выполняться однократно, только на мастере.

source: $ # the replica has eventually connected to the master $ # and got bootstrapped (from the replica's log) 2017-06-14 14:35:43.777 [18952] main/104/applier/replicator@192.168.0. I> remote master is 1.7.4 at 192.168.0.101:3301 2017-06-14 14:35:43.777 [18952] main/104/applier/replicator@192.168.0. I> authenticated 2017-06-14 14:35:43.777 [18952] main/101/replica.lua I> bootstrapping replica from 192.168.0.199:3310 2017-06-14 14:35:43.788 [18952] main/104/applier/replicator@192.168.0. I> initial data received 2017-06-14 14:35:43.789 [18952] main/104/applier/replicator@192.168.0. I> final data received 2017-06-14 14:35:43.793 [18952] snapshot/101/main I> saving snapshot `/var/lib/tarantool/replica/00000000000000000005.snap.inprogress' 2017-06-14 14:35:43.793 [18952] snapshot/101/main I> done 2017-06-14 14:35:43.795 [18952] main/101/replica.lua I> vinyl checkpoint done 2017-06-14 14:35:43.795 [18952] main/101/replica.lua I> ready to accept requests 2017-06-14 14:35:43.795 [18952] main/101/replica.lua I> set 'read_only' configuration option to true 2017-06-14 14:35:43.795 [18952] main C> entering the event loop
ru: $ # реплика в итоге подключена к мастеру $ # и получила настройки (из журнала реплики) 2017-06-14 14:35:43.777 [18952] main/104/applier/replicator@192.168.0. I> remote master is 1.7.4 at 192.168.0.101:3301 2017-06-14 14:35:43.777 [18952] main/104/applier/replicator@192.168.0. I> authenticated 2017-06-14 14:35:43.777 [18952] main/101/replica.lua I> bootstrapping replica from 192.168.0.199:3310 2017-06-14 14:35:43.788 [18952] main/104/applier/replicator@192.168.0. I> initial data received 2017-06-14 14:35:43.789 [18952] main/104/applier/replicator@192.168.0. I> final data received 2017-06-14 14:35:43.793 [18952] snapshot/101/main I> saving snapshot `/var/lib/tarantool/replica/00000000000000000005.snap.inprogress' 2017-06-14 14:35:43.793 [18952] snapshot/101/main I> done 2017-06-14 14:35:43.795 [18952] main/101/replica.lua I> vinyl checkpoint done 2017-06-14 14:35:43.795 [18952] main/101/replica.lua I> ready to accept requests 2017-06-14 14:35:43.795 [18952] main/101/replica.lua I> set 'read_only' configuration option to true 2017-06-14 14:35:43.795 [18952] main C> entering the event loop

source: Controlled failover
ru: Контролируемое восстановление после сбоя

source: Set ``read_only=true`` at the master.
ru: Настройте ``read_only=true`` на мастере.

source: # at the master tarantool> box.cfg{read_only=true}
ru: # на мастере tarantool> box.cfg{read_only=true}

source: Record the master’s current position with ``box.info.signature``, containing the sum of all LSNs in the master’s vector clock.
ru: Зарегистрируйте текущее состояние мастера с помощью ``box.info.signature``, которое содержит общее количество всех LSN в векторных часах мастера.

source: # at the master tarantool> box.info.signature
ru: # на мастере tarantool> box.info.signature

source: Wait until the replica’s signature is the same as the master’s.
ru: Подождите, пока сигнатура реплики не совпадет с сигнатурой мастера.

source: # at the replica tarantool> box.info.signature
ru: # на реплике tarantool> box.info.signature

source: Set ``read_only=false`` at the replica to enable write operations.
ru: Настройте `read_only=false`` на реплике, чтобы запустить операции записи данных.

source: # at the replica tarantool> box.cfg{read_only=false}
ru: # на реплике tarantool> box.cfg{read_only=false}

source: Master-master bootstrap
ru: Настройка репликации мастер-мастер

source: We re-use the master's instance file from the :ref:`master-replica example <replication-master_replica_bootstrap>` above.
ru: Переиспользуем файл экземпляра для мастера из вышеописанного :ref:`примера мастер-реплика <replication-master_replica_bootstrap>`.

source: -- instance file for any of the two masters box.cfg{ listen = 3301, replication = {'replicator:password@192.168.0.101:3301', -- master1 URI 'replicator:password@192.168.0.102:3301'}, -- master2 URI read_only = false } box.once("schema", function() box.schema.user.create('replicator', {password = 'password'}) box.schema.user.grant('replicator', 'replication') -- grant replication role box.schema.space.create("test") box.space.test:create_index("primary") print('box.once executed on master #1') end)
ru: -- файл экземпляра для любого из двух мастеров box.cfg{ listen = 3301, replication = {'replicator:password@192.168.0.101:3301', -- URI мастера 1 'replicator:password@192.168.0.102:3301'}, -- URI мастера 2 read_only = false } box.once("schema", function() box.schema.user.create('replicator', {password = 'password'}) box.schema.user.grant('replicator', 'replication') -- настроить роль для репликации box.schema.space.create("test") box.space.test:create_index("primary") print('box.once executed on master #1') end)

source: $ # launching master #1 $ tarantool master1.lua 2017-06-14 15:39:03.062 [47021] main/101/master1.lua C> version 1.7.4-52-g980d30092 2017-06-14 15:39:03.062 [47021] main/101/master1.lua C> log level 5 2017-06-14 15:39:03.063 [47021] main/101/master1.lua I> mapping 268435456 bytes for tuple arena... 2017-06-14 15:39:03.065 [47021] iproto/101/main I> binary: bound to [::]:3301 2017-06-14 15:39:03.065 [47021] main/105/applier/replicator@192.168.0.10 I> can't connect to master 2017-06-14 15:39:03.065 [47021] main/105/applier/replicator@192.168.0.10 coio.cc:107 !> SystemError connect, called on fd 14, aka 192.168.0.102:57110: Connection refused 2017-06-14 15:39:03.065 [47021] main/105/applier/replicator@192.168.0.10 I> will retry every 1 second 2017-06-14 15:39:03.065 [47021] main/104/applier/replicator@192.168.0.10 I> remote master is 1.7.4 at 192.168.0.101:3301 2017-06-14 15:39:08.070 [47021] main/105/applier/replicator@192.168.0.10 I> remote master is 1.7.4 at 192.168.0.102:3301 2017-06-14 15:39:08.071 [47021] main/105/applier/replicator@192.168.0.10 I> authenticated 2017-06-14 15:39:08.071 [47021] main/101/master1.lua I> bootstrapping replica from 192.168.0.102:3301 2017-06-14 15:39:08.073 [47021] main/105/applier/replicator@192.168.0.10 I> initial data received 2017-06-14 15:39:08.074 [47021] main/105/applier/replicator@192.168.0.10 I> final data received 2017-06-14 15:39:08.074 [47021] snapshot/101/main I> saving snapshot `/Users/e.shebunyaeva/work/tarantool-test-repl/master1_dir/00000000000000000008.snap.inprogress' 2017-06-14 15:39:08.074 [47021] snapshot/101/main I> done 2017-06-14 15:39:08.076 [47021] main/101/master1.lua I> vinyl checkpoint done 2017-06-14 15:39:08.076 [47021] main/101/master1.lua I> ready to accept requests box.once executed on master #1 2017-06-14 15:39:08.077 [47021] main C> entering the event loop
ru: $ # запуск мастера №1 $ tarantool master1.lua 2017-06-14 15:39:03.062 [47021] main/101/master1.lua C> version 1.7.4-52-g980d30092 2017-06-14 15:39:03.062 [47021] main/101/master1.lua C> log level 5 2017-06-14 15:39:03.063 [47021] main/101/master1.lua I> mapping 268435456 bytes for tuple arena... 2017-06-14 15:39:03.065 [47021] iproto/101/main I> binary: bound to [::]:3301 2017-06-14 15:39:03.065 [47021] main/105/applier/replicator@192.168.0.10 I> can't connect to master 2017-06-14 15:39:03.065 [47021] main/105/applier/replicator@192.168.0.10 coio.cc:107 !> SystemError connect, called on fd 14, aka 192.168.0.102:57110: Connection refused 2017-06-14 15:39:03.065 [47021] main/105/applier/replicator@192.168.0.10 I> will retry every 1 second 2017-06-14 15:39:03.065 [47021] main/104/applier/replicator@192.168.0.10 I> remote master is 1.7.4 at 192.168.0.101:3301 2017-06-14 15:39:08.070 [47021] main/105/applier/replicator@192.168.0.10 I> remote master is 1.7.4 at 192.168.0.102:3301 2017-06-14 15:39:08.071 [47021] main/105/applier/replicator@192.168.0.10 I> authenticated 2017-06-14 15:39:08.071 [47021] main/101/master1.lua I> bootstrapping replica from 192.168.0.102:3301 2017-06-14 15:39:08.073 [47021] main/105/applier/replicator@192.168.0.10 I> initial data received 2017-06-14 15:39:08.074 [47021] main/105/applier/replicator@192.168.0.10 I> final data received 2017-06-14 15:39:08.074 [47021] snapshot/101/main I> saving snapshot `/Users/e.shebunyaeva/work/tarantool-test-repl/master1_dir/00000000000000000008.snap.inprogress' 2017-06-14 15:39:08.074 [47021] snapshot/101/main I> done 2017-06-14 15:39:08.076 [47021] main/101/master1.lua I> vinyl checkpoint done 2017-06-14 15:39:08.076 [47021] main/101/master1.lua I> ready to accept requests box.once executed on master #1 2017-06-14 15:39:08.077 [47021] main C> entering the event loop

source: $ # launching master #2 $ tarantool master2.lua 2017-06-14 15:39:07.452 [47022] main/101/master2.lua C> version 1.7.4-52-g980d30092 2017-06-14 15:39:07.453 [47022] main/101/master2.lua C> log level 5 2017-06-14 15:39:07.453 [47022] main/101/master2.lua I> mapping 268435456 bytes for tuple arena... 2017-06-14 15:39:07.455 [47022] iproto/101/main I> binary: bound to [::]:3301 2017-06-14 15:39:07.455 [47022] main/104/applier/replicator@192.168.0.19 I> remote master is 1.7.4 at 192.168.0.101:3301 2017-06-14 15:39:07.455 [47022] main/105/applier/replicator@192.168.0.10 I> remote master is 1.7.4 at 192.168.0.102:3301 2017-06-14 15:39:07.455 [47022] main/101/master2.lua I> initializing an empty data directory 2017-06-14 15:39:07.457 [47022] snapshot/101/main I> saving snapshot `/Users/e.shebunyaeva/work/tarantool-test-repl/master2_dir/00000000000000000000.snap.inprogress' 2017-06-14 15:39:07.457 [47022] snapshot/101/main I> done 2017-06-14 15:39:07.458 [47022] main/101/master2.lua I> vinyl checkpoint done 2017-06-14 15:39:07.459 [47022] main/101/master2.lua I> ready to accept requests 2017-06-14 15:39:07.460 [47022] main C> entering the event loop 2017-06-14 15:39:08.072 [47022] main/103/main I> initial data sent. 2017-06-14 15:39:08.073 [47022] relay/[::ffff:192.168.0.102]:/101/main I> recover from `/Users/e.shebunyaeva/work/tarantool-test-repl/master2_dir/00000000000000000000.xlog' 2017-06-14 15:39:08.073 [47022] main/103/main I> final data sent. 2017-06-14 15:39:08.077 [47022] relay/[::ffff:192.168.0.102]:/101/main I> recover from `/Users/e.shebunyaeva/work/tarantool-test-repl/master2_dir/00000000000000000000.xlog' 2017-06-14 15:39:08.461 [47022] main/104/applier/replicator@192.168.0.10 I> authenticated
ru: $ # запуск мастера №2 $ tarantool master2.lua 2017-06-14 15:39:07.452 [47022] main/101/master2.lua C> version 1.7.4-52-g980d30092 2017-06-14 15:39:07.453 [47022] main/101/master2.lua C> log level 5 2017-06-14 15:39:07.453 [47022] main/101/master2.lua I> mapping 268435456 bytes for tuple arena... 2017-06-14 15:39:07.455 [47022] iproto/101/main I> binary: bound to [::]:3301 2017-06-14 15:39:07.455 [47022] main/104/applier/replicator@192.168.0.19 I> remote master is 1.7.4 at 192.168.0.101:3301 2017-06-14 15:39:07.455 [47022] main/105/applier/replicator@192.168.0.10 I> remote master is 1.7.4 at 192.168.0.102:3301 2017-06-14 15:39:07.455 [47022] main/101/master2.lua I> initializing an empty data directory 2017-06-14 15:39:07.457 [47022] snapshot/101/main I> saving snapshot `/Users/e.shebunyaeva/work/tarantool-test-repl/master2_dir/00000000000000000000.snap.inprogress' 2017-06-14 15:39:07.457 [47022] snapshot/101/main I> done 2017-06-14 15:39:07.458 [47022] main/101/master2.lua I> vinyl checkpoint done 2017-06-14 15:39:07.459 [47022] main/101/master2.lua I> ready to accept requests 2017-06-14 15:39:07.460 [47022] main C> entering the event loop 2017-06-14 15:39:08.072 [47022] main/103/main I> initial data sent. 2017-06-14 15:39:08.073 [47022] relay/[::ffff:192.168.0.102]:/101/main I> recover from `/Users/e.shebunyaeva/work/tarantool-test-repl/master2_dir/00000000000000000000.xlog' 2017-06-14 15:39:08.073 [47022] main/103/main I> final data sent. 2017-06-14 15:39:08.077 [47022] relay/[::ffff:192.168.0.102]:/101/main I> recover from `/Users/e.shebunyaeva/work/tarantool-test-repl/master2_dir/00000000000000000000.xlog' 2017-06-14 15:39:08.461 [47022] main/104/applier/replicator@192.168.0.10 I> authenticated

source: Preventing duplicate actions
ru: Предотвращение дублирующихся действий

source: Replication stops
ru: Остановка репликации

source: $ # error messages from master #1 2017-06-26 21:17:03.233 [30444] main/104/applier/rep_user@100.96.166.1 I> can't read row 2017-06-26 21:17:03.233 [30444] main/104/applier/rep_user@100.96.166.1 memtx_hash.cc:226 E> ER_TUPLE_FOUND: Duplicate key exists in unique index 'primary' in space 'tester' 2017-06-26 21:17:03.233 [30444] relay/[::ffff:100.96.166.178]/101/main I> the replica has closed its socket, exiting 2017-06-26 21:17:03.233 [30444] relay/[::ffff:100.96.166.178]/101/main C> exiting the relay loop $ # error messages from master #2 2017-06-26 21:17:03.233 [30445] main/104/applier/rep_user@100.96.166.1 I> can't read row 2017-06-26 21:17:03.233 [30445] main/104/applier/rep_user@100.96.166.1 memtx_hash.cc:226 E> ER_TUPLE_FOUND: Duplicate key exists in unique index 'primary' in space 'tester' 2017-06-26 21:17:03.234 [30445] relay/[::ffff:100.96.166.178]/101/main I> the replica has closed its socket, exiting 2017-06-26 21:17:03.234 [30445] relay/[::ffff:100.96.166.178]/101/main C> exiting the relay loop
ru: $ # сообщения об ошибках от мастера №1 2017-06-26 21:17:03.233 [30444] main/104/applier/rep_user@100.96.166.1 I> can't read row 2017-06-26 21:17:03.233 [30444] main/104/applier/rep_user@100.96.166.1 memtx_hash.cc:226 E> ER_TUPLE_FOUND: Duplicate key exists in unique index 'primary' in space 'tester' 2017-06-26 21:17:03.233 [30444] relay/[::ffff:100.96.166.178]/101/main I> the replica has closed its socket, exiting 2017-06-26 21:17:03.233 [30444] relay/[::ffff:100.96.166.178]/101/main C> exiting the relay loop $ # сообщения об ошибках от мастера №2 2017-06-26 21:17:03.233 [30445] main/104/applier/rep_user@100.96.166.1 I> can't read row 2017-06-26 21:17:03.233 [30445] main/104/applier/rep_user@100.96.166.1 memtx_hash.cc:226 E> ER_TUPLE_FOUND: Duplicate key exists in unique index 'primary' in space 'tester' 2017-06-26 21:17:03.234 [30445] relay/[::ffff:100.96.166.178]/101/main I> the replica has closed its socket, exiting 2017-06-26 21:17:03.234 [30445] relay/[::ffff:100.96.166.178]/101/main C> exiting the relay loop

source: # replication statuses (report from master #3) tarantool> box.info --- - version: 1.7.4-52-g980d30092 id: 3 ro: false vclock: {1: 9, 2: 1000000, 3: 3} uptime: 557 lsn: 3 vinyl: [] cluster: uuid: 34d13b1a-f851-45bb-8f57-57489d3b3c8b pid: 30445 status: running signature: 1000012 replication: 1: id: 1 uuid: 7ab6dee7-dc0f-4477-af2b-0e63452573cf lsn: 9 upstream: peer: replicator@192.168.0.101:3301 lag: 0.00050592422485352 status: stopped idle: 445.8626639843 message: Duplicate key exists in unique index 'primary' in space 'tester' 2: id: 2 uuid: 9afbe2d9-db84-4d05-9a7b-e0cbbf861e28 lsn: 1000000 upstream: status: follow idle: 201.99915885925 peer: replicator@192.168.0.102:3301 lag: 0.0015020370483398 downstream: vclock: {1: 8, 2: 1000000, 3: 3} 3: id: 3 uuid: e826a667-eed7-48d5-a290-64299b159571 lsn: 3 uuid: e826a667-eed7-48d5-a290-64299b159571 ...
ru: # статусы репликации (отчет от мастера №3) tarantool> box.info --- - version: 1.7.4-52-g980d30092 id: 3 ro: false vclock: {1: 9, 2: 1000000, 3: 3} uptime: 557 lsn: 3 vinyl: [] cluster: uuid: 34d13b1a-f851-45bb-8f57-57489d3b3c8b pid: 30445 status: running signature: 1000012 replication: 1: id: 1 uuid: 7ab6dee7-dc0f-4477-af2b-0e63452573cf lsn: 9 upstream: peer: replicator@192.168.0.101:3301 lag: 0.00050592422485352 status: stopped idle: 445.8626639843 message: Duplicate key exists in unique index 'primary' in space 'tester' 2: id: 2 uuid: 9afbe2d9-db84-4d05-9a7b-e0cbbf861e28 lsn: 1000000 upstream: status: follow idle: 201.99915885925 peer: replicator@192.168.0.102:3301 lag: 0.0015020370483398 downstream: vclock: {1: 8, 2: 1000000, 3: 3} 3: id: 3 uuid: e826a667-eed7-48d5-a290-64299b159571 lsn: 3 uuid: e826a667-eed7-48d5-a290-64299b159571 ...

source: When replication is later manually resumed:
ru: Когда позднее репликация возобновлена вручную:

source: # resuming stopped replication (at all masters) tarantool> original_value = box.cfg.replication tarantool> box.cfg{replication={}} tarantool> box.cfg{replication=original_value}
ru: # возобновление остановленной репликации (на всех мастерах) tarantool> original_value = box.cfg.replication tarantool> box.cfg{replication={}} tarantool> box.cfg{replication=original_value}

source: Replication runs out of sync
ru: Рассинхронизация репликации

source: In a master-master cluster of two instances, suppose we make the following operation:
ru: Предположим, что мы выполняем следующую операцию в кластере из двух экземпляров с конфигурацией мастер-мастер:

source: # at master #1 tarantool> box.space.tester:upsert({1}, {{'=', 2, box.info.uuid}}) # at master #2 tarantool> box.space.tester:upsert({1}, {{'=', 2, box.info.uuid}})
ru: # на мастере №1 tarantool> box.space.tester:upsert({1}, {{'=', 2, box.info.uuid}}) # на мастере №2 tarantool> box.space.tester:upsert({1}, {{'=', 2, box.info.uuid}})

source: ... we can have the following results, depending on the order of execution:
ru: ... можно получить следующие результаты в зависимости порядка выполнения:

source: Commutative changes
ru: Коммутативные изменения

source: Consider for example the following command:
ru: Рассмотрим, например, следующую команду:

source: This operation is commutative: we get the same result no matter in which order the update is applied on the other masters.
ru: Эта операция коммутативна: получаем одинаковый результат, независимо от порядка, в котором обновление применяется на других мастерах.

source: Monitoring a replica set
ru: Мониторинг набора реплик
