Repository: tarantool/doc
Catalog: locale/*/LC_MESSAGES/doc.po
Languages: ru

source: At this point, if the above explanation is worthwhile, it's clear that ``expirationd.lua`` starts a background routine (fiber) which iterates through all the tuples in a space, sleeps cooperatively so that other fibers can operate at the same time, and - whenever it finds a tuple that has expired - deletes it from this space. Now the "``expirationd_run_task()``" function can be used in a test which creates sample data, lets the daemon run for a while, and prints results.
ru: На этом этапе ясно, что ``expirationd.lua`` запускает фоновый процесс (файбер), который выполняет итерацию по всем кортежам в спейсе, в рамках кооперативной многозадачности уходит в режим ожидания, чтобы другие файберы могли работать одновременно с ним, а когда находит неактуальный кортеж, удаляет его из спейса. Теперь функцию "``expirationd_run_task()``" можно использовать в тестировании, где создаются образцы данных, некоторое время работает демон, и выводятся результаты.

source: For those who like to see things run, here are the exact steps to get expirationd through the test.
ru: Если вы хотите увидеть, как все работает, обратите внимание на нижеприведенные шаги по включению expirationd в тестирование.

source: Get ``expirationd.lua``. There are standard ways - it is after all part of a `standard rock <https://luarocks.org/modules/rtsisyk/expirationd>`_ - but for this purpose just copy the contents of expirationd.lua_ to a default directory.
ru: Найдите ``expirationd.lua``. Можно воспользоваться стандартным способом, поскольку модуль включен в общий список `модулей <https://luarocks.org/modules/rtsisyk/expirationd>`_, но для этой цели просто скопируйте содержимое expirationd.lua_ в директорию, используемую по умолчанию.

source: Start the Tarantool server as described before.
ru: Запустите Tarantool-сервер, как описано выше.

source: Execute these requests:
ru: Выполните следующие запросы:

source: The database-specific requests (``cfg``, :ref:`space.create <box_schema-space_create>`, :ref:`create_index <box_space-create_index>`) should already be familiar.
ru: Запросы в работе с базой данных (``cfg``, :ref:`space.create <box_schema-space_create>`, :ref:`create_index <box_space-create_index>`) уже должны быть вам знакомы.

source: The function which will be supplied to expirationd is :codenormal:`is_tuple_expired`, which is saying "if the second field of the tuple is less than the :ref:`current time <fiber-time>` , then return true, otherwise return false".
ru: В expirationd передается функция :codenormal:`is_tuple_expired`, которая задает следующее условие: если второе поле кортежа меньше :ref:`текущего времени <fiber-time>` , вернуть true (правда), в противном случае, вернуть false (ложь).

source: The key for getting the rock rolling is ``expd = require('expirationd')``. The "``require``" function is what reads in the program; it will appear in many later examples in this manual, when it's necessary to get a module that's not part of the Tarantool kernel. After the Lua variable expd has been assigned the value of the expirationd module, it's possible to invoke the module's ``run_task()`` function.
ru: Ключ к запуску модуля -- ``expd = require('expirationd')``. Функция "``require``" -- это именно то, что выполняет чтение в программе. Она появится и в дальнейших примерах в данном руководстве, когда будет необходимо запустить модуль, не входящий в ядро Tarantool'а. После того, как Lua-переменной expd присваивается значение модуля expirationd, можно вызвать функцию модуля ``run_task()``.

source: After :ref:`sleeping <fiber-sleep>` for two seconds, when the task has had time to do its iterations through the spaces, ``expd.task_stats()`` will print out a report showing how many tuples have expired -- "expired_count: 0". After sleeping for two more seconds, ``expd.task_stats()`` will print out a report showing how many tuples have expired -- "expired_count: 1". This shows that the is_tuple_expired() function eventually returned "true" for one of the tuples, because its timestamp field was more than three seconds old.
ru: После ухода :ref:`в режим ожидания <fiber-sleep>` на две секунды, когда проводится итерация по спейсам, ``expd.task_stats()`` выведет отчет о количестве неактуальных кортежей -- "expired_count: 0". После ожидания в течение еще двух секунд ``expd.task_stats()`` выведет отчет о количестве неактуальных кортежей -- "expired_count: 1". Это показывает, что функция is_tuple_expired() с течением времени вернула "true" для одного из кортежей, поскольку поле метки времени было дольше трех секунд.

source: Of course, expirationd can be customized to do different things by passing different parameters, which will be evident after looking in more detail at the source code.
ru: Конечно, expirationd можно настроить на выполнение различных задач с помощью разных параметров, что будет очевидно после более детального изучения исходного кода.

source: Rocks reference
ru: Справочник по сторонним библиотекам

source: This reference covers third-party Lua modules for Tarantool.
ru: В данном справочнике описаны сторонние Lua-модули для Tarantool'а.

source: Module `shard`
ru: Модуль `shard`

source: With sharding, the tuples of a tuple set are distributed to multiple nodes, with a Tarantool database server instance on each node. With this arrangement, each instance is handling only a subset of the total data, so larger loads can be handled by simply adding more computers to a network.
ru: Во время шардинга кортежи из набора кортежей распределяются по нескольким узлам, на каждом из которых есть экземпляр сервера базы данных Tarantool'а. При таком распределении каждый экземпляр обрабатывает только подмножество общих данных, поэтому появляется возможность обрабатывать данные при больших нагрузках путем простого добавления большего количества компьютеров в сеть.

source: The Tarantool `shard` module has facilities for creating shards, as well as analogues for the data-manipulation functions of the box library (select, insert, replace, update, delete).
ru: Модуль Tarantool'а `shard` позволяет создавать шарды, а также аналоги функций по управлению данными из библиотеки box (select, insert, replace, update, delete).

source: First some terminology:
ru: Для начала введем терминологию:

source: **Consistent hash**
ru: **Консистентное хеширование**

source: The `shard` module distributes according to a hash algorithm, that is, it applies a hash function to a tuple's primary-key value in order to decide which shard the tuple belongs to. The hash function is `consistent <https://en.wikipedia.org/wiki/Consistent_hashing>`_ so that changing the number of servers will not affect results for many keys. The specific hash function that the `shard` module uses is :ref:`digest.guava <digest-guava>` in the :codeitalic:`digest` module.
ru: Модуль `shard` распределяет данные в соответствии с алгоритмом хеширования, то есть применяет хеш-функцию к значению первичного ключа кортежа, что определить к какому шарду относится кортеж. Хеш-функция является `консистентной <https://en.wikipedia.org/wiki/Consistent_hashing>`_, поэтому изменение количества серверов не повлияет на результат для множества ключей. Модуль `shard` использует специальную хеш-функцию :ref:`digest.guava <digest-guava>` из модуля :codeitalic:`digest`.

source: **Instance**
ru: **Экземпляр**

source: A currently-running in-memory copy of the Tarantool server, sometimes called a "server instance". Usually each shard is associated with one instance, or, if both sharding and replicating are going on, each shard is associated with one replica set.
ru: Запущенная in-memory копия Tarantool-сервера иногда называется экземпляром сервера. Как правило, каждый шард ассоциирован с одним экземпляром, или же, если выполняется и шардинг, и репликация, каждый шард ассоциирован с одним набором реплик.

source: **Queue**
ru: **Очередь**

source: A temporary list of recent update requests. Sometimes called "batching". Since updates to a sharded database can be slow, it may speed up throughput to send requests to a queue rather than wait for the update to finish on every node. The `shard` module has functions for adding requests to the queue, which it will process without further intervention. Queuing is optional.
ru: Временный список последних запросов обновления. Иногда называется "пакетная обработка". Поскольку обновления в базу данных с шардингом могут быть замедлены, ускорить выполнение можно путем отправки запросов в очередь вместо ожидания окончания обновления на каждом узле. В модуле `shard` присутствуют функции для добавления запросов в очередь, которые будут затем обработаны без дополнительных действий. Использование очереди необязательно.

source: **Redundancy**
ru: **Резервирование по принципу избыточности**

source: The number of replicated data copies in each shard.
ru: Количество копий реплицируемых данных в каждом шарде.

source: **Replica**
ru: **Реплика**

source: An instance which is part of a replica set.
ru: Экземпляр, который входит в набор реплик.

source: **Replica set**
ru: **Набор реплик**

source: Often a single shard is associated with a single instance; however, often the shard is replicated. When a shard is replicated, the multiple instances ("replicas"), which handle the shard's replicated data, are a "replica set".
ru: Часто отдельный шард ассоциирован с отдельным экземпляром. Однако, часто шард реплицируется. Когда шард реплицируется, множество экземпляров ("реплики"), которые обрабатывают реплицируемые данные шарда, составляют "набор реплик".

source: **Replicated data**
ru: **Реплицируемые данные**

source: A complete copy of the data. The `shard` module handles both sharding and replication. One shard can contain one or more replicated data copies. When a write occurs, the write is attempted on every replicated data copy in turn. The `shard` module does not use the built-in replication feature.
ru: Полная копия данных. Модуль `shard` обрабатывает как шардинг, так и репликацию. Один шард может содержать одну или несколько копий реплицируемых данных. Попытки записи производятся по очереди на каждую копию реплицируемых данных. Модуль `shard` не использует встроенную функцию репликации.

source: **Shard**
ru: **Шард**

source: A subset of the tuples in the database partitioned according to the value returned by the consistent hash function. Usually each shard is on a separate node, or a separate set of nodes (for example if redundancy = 3 then the shard will be on three nodes).
ru: Подмножество кортежей в базе данных, разделенное по значению, которое возвращает консистентная хеш-функция. Как правило, каждый шард находится на отдельном узле или отдельном наборе узлов (например, если резервирование = 3, то шард будет на трех узлах).

source: **Zone**
ru: **Зона**

source: A physical location where the nodes are closely connected, with the same security and backup and access points. The simplest example of a zone is a single computer with a single Tarantool-server instance. A shard's replicated data copies should be in different zones.
ru: Физическое местоположение, где узлы тесно связаны, с одинаковыми точками безопасности, резервного копирования и доступа. Простейшим примером зоны является один компьютер с одним экземпляром Tarantool-сервера. Копии реплицируемых данных на шарде должны находиться в разных зонах.

source: The `shard` package is distributed separately from the main `tarantool` package. To acquire it, do a separate installation:
ru: Пакет `shard` распространяется отдельно от основного пакета `Tarantool`. Для работы с ним выполните установку отдельно:

source: with Tarantool 1.7.4+, say:
ru: либо на версии Tarantool'а 1.7.4+ выполните команду:

source: install with `yum` or `apt`, for example on Ubuntu say:
ru: либо установите с помощью `yum` или `apt`, например, на Ubuntu выполните команду:

source: or download from GitHub `tarantool/shard` and use the Lua files as described in the `README <https://github.com/tarantool/shard>`_.
ru: либо скачайте из GitHub `tarantool/shard` и используйте Lua-файлы, как описано в файле `README <https://github.com/tarantool/shard>`_.

source: Then, before using the module, say ``shard = require('shard')``.
ru: Затем перед использованием модуля выполните команду ``shard = require('shard')``.

source: The most important function is:
ru: Самой необходимой функцией модуля является

source: shard.init(*shard-configuration*)
ru: shard.init(*настройка-шарда*)

source: This must be called for every shard.
ru: Ее следует вызывать для каждого шарда.

source: The shard configuration is a table with these fields:
ru: Настройка шарда представляет собой таблицу со следующими полями:

source: `servers` (a list of URIs of nodes and the zones the nodes are in)
ru: `servers` -- серверы, т.е. список URI узлов и зон, в которых находятся узлы

source: `login` (the user name which applies for accessing via the `shard` module)
ru: `login` -- имя пользователя, которое используется для доступа по модулю `shard`

source: `password` (the password for the login)
ru: `password` -- пароль для имени пользователя

source: `redundancy` (a number, minimum 1)
ru: `redundancy` -- резервирование, число, минимум 1

source: `binary` (a port number that this host is listening on, on the current host, (distinguishable from the 'listen' port specified by `box.cfg`)
ru: `binary` -- номер порта, на котором настроено прослушивание для текущего хоста (отличный от порта 'listen', который определяет `box.cfg`)

source: Possible errors:
ru: Возможные ошибки:

source: redundancy should not be greater than the number of servers;
ru: значение параметра redundancy (резервирование) не должно быть больше количества серверов;

source: the servers must be alive;
ru: серверы должны быть рабочими;

source: two replicated data copies of the same shard should not be in the same zone.
ru: две копии реплицируемых данных одного шарда не должны находиться в одной зоне.

source: Example: `shard.init` syntax for one shard
ru: Пример: синтаксис `shard.init` для одного шарда

source: The number of replicated data copies per shard (redundancy) is 3.
ru: Количество копий реплицируемых данных на один шард (redundancy -- резервирование) равно 3.

source: The number of instances is 3.
ru: Количество экземпляров равно 3.

source: The `shard` module will conclude that there is only one shard.
ru: Модуль `shard` делает вывод, что существует только один шард.

source: Example: `shard.init` syntax for three shards
ru: Пример: синтаксис `shard.init` для трех шардов

source: This describes three shards. Each shard has two replicated data copies. Since the number of servers is 7, and the number of replicated data copies per shard is 2, and dividing 7 / 2 leaves a remainder of 1, one of the servers will not be used. This is not necessarily an error, because perhaps one of the servers in the list is not alive.
ru: Здесь описаны три шарда. Каждый шард содержит две копии реплицируемых данных. Поскольку количество серверов равно 7, количество копий реплицируемых данных на один шард равно 2, а деление 7 на 2 дает в остатке 1, -- один из серверов не будет использоваться. Это необязательно должно быть ошибкой, поскольку один из серверов может быть нерабочим.

source: Every data-access function in the `box` module has an analogue in the `shard` module:
ru: Каждой функции взаимодействия с данными модуля `box` соответствует функция в модуле `shard`:

source: shard[*space-name*].insert{...} shard[*space-name*].replace{...} shard[*space-name*].delete{...} shard[*space-name*].select{...} shard[*space-name*].update{...} shard[*space-name*].auto_increment{...}
ru: shard[*имя-спейса*].insert{...} shard[*имя-спейса*].replace{...} shard[*имя-спейса*].delete{...} shard[*имя-спейса*].select{...} shard[*имя-спейса*].update{...} shard[*имя-спейса*].auto_increment{...}

source: For example, to insert in table T in a sharded database you simply say ``shard.T:insert{...}`` instead of ``box.space.T:insert{...}``.
ru: Например, чтобы выполнить вставку в таблицу T в базе данных с шардингом, просто выполните команду ``shard.T:insert{...}`` вместо ``box.space.T:insert{...}``.

source: Every queued data-access function has an analogue in the `shard` module:
ru: Каждой функции модуля `box` для взаимодействия с данными, поставленной в очередь, соответствует функция в модуле `shard`:

source: shard[*space-name*].q_insert{...} shard[*space-name*].q_replace{...} shard[*space-name*].q_delete{...} shard[*space-name*].q_select{...} shard[*space-name*].q_update{...} shard[*space-name*].q_auto_increment{...}
ru: shard[*имя-спейса*].q_insert{...} shard[*имя-спейса*].q_replace{...} shard[*имя-спейса*].q_delete{...} shard[*имя-спейса*].q_select{...} shard[*имя-спейса*].q_update{...} shard[*имя-спейса*].q_auto_increment{...}

source: The user must add an `operation_id`. For details of queued data-access functions, and of maintenance-related functions, see the `README <https://github.com/tarantool/shard>`_.
ru: Пользователь должен добавить `operation_id`. Чтобы получить дополнительную информацию о функциях для взаимодействия с данными, поставленными в очередь, и о функциях, предназначенных для обслуживания, см. файл `README <https://github.com/tarantool/shard>`_.

source: Example: shard, minimal configuration
ru: Пример: шард, минимальная настройка

source: There is only one shard, and that shard contains only one replicated data copy. So this isn't illustrating the features of either replication or sharding, it's only illustrating what the syntax is, and what the messages look like, that anyone could duplicate in a minute or two with the magic of cut-and-paste.
ru: Создан только один шард, который содержит только одну копию реплицируемых данных. Таким образом, данный пример не иллюстрирует возможности репликации или шардинга, он показывает синтаксис и отображаемые сообщения, что каждый может повторить за пару минут лишь с помощью вырезания и вставки.

source: If you cut and paste the above, then the result, showing only the requests and responses for `shard.init` and `shard.tester`, should look approximately like this:
ru: Если вырезать и вставить вышеуказанное, то результат с запросами и ответами только для `shard.init` и `shard.tester` должен выглядеть примерно так:

source: <...> tarantool> shard.init(cfg) 2017-09-06 ... I> Sharding initialization started... 2017-09-06 ... I> establishing connection to cluster servers... 2017-09-06 ... I> connected to all servers 2017-09-06 ... I> started 2017-09-06 ... I> redundancy = 1 2017-09-06 ... I> Adding localhost:3301 to shard 1 2017-09-06 ... I> shards = 1 2017-09-06 ... I> Done --- - true ... tarantool> -- Now put something in ... --- ... tarantool> shard.tester:insert{1,'Tuple #1'} --- - - [1, 'Tuple #1'] ...
ru: <...> tarantool> shard.init(cfg) 2017-09-06 ... I> Sharding initialization started... 2017-09-06 ... I> establishing connection to cluster servers... 2017-09-06 ... I> connected to all servers 2017-09-06 ... I> started 2017-09-06 ... I> redundancy = 1 2017-09-06 ... I> Adding localhost:3301 to shard 1 2017-09-06 ... I> shards = 1 2017-09-06 ... I> Done --- - true ... tarantool> -- Введите что-то... --- ... tarantool> shard.tester:insert{1,'Tuple #1'} --- - - [1, 'Tuple #1'] ...

source: Example: shard, scaling out
ru: Пример: шард, горизонтальное масштабирование

source: There are two shards, and each shard contains one replicated data copy. This requires two nodes. In real life the two nodes would be two computers, but for this illustration the requirement is merely: start two shells, which we'll call Terminal#1 and Terminal #2.
ru: Созданы два шарда, каждый из которых содержит одну копию реплицируемых данных. В реальной жизни два узла будут представлены двумя компьютерами, для примера же требуется использовать две оболочки, которые мы назовем "терминал №1" и "терминал №2".

source: On Terminal #1, say:
ru: В первом терминале введите:

source: $ mkdir ~/tarantool_sandbox_1 $ cd ~/tarantool_sandbox_1 $ rm -r *.snap $ rm -r *.xlog $ ~/tarantool-1.7/src/tarantool tarantool> box.cfg{listen = 3301} tarantool> box.schema.space.create('tester') tarantool> box.space.tester:create_index('primary', {}) tarantool> box.schema.user.create('test_user', {password = 'pass'}) tarantool> box.schema.user.grant('test_user', 'read,write,execute', 'universe') tarantool> console = require('console') tarantool> cfg = { > servers = { > { uri = 'localhost:3301', zone = '1' }, > { uri = 'localhost:3302', zone = '2' }, > }, > login = 'test_user', > password = 'pass', > redundancy = 1, > binary = 3301, > } tarantool> shard = require('shard') tarantool> shard.init(cfg) tarantool> -- Now put something in ... tarantool> shard.tester:insert{1,'Tuple #1'}
ru: $ mkdir ~/tarantool_sandbox_1 $ cd ~/tarantool_sandbox_1 $ rm -r *.snap $ rm -r *.xlog $ ~/tarantool-1.7/src/tarantool tarantool> box.cfg{listen = 3301} tarantool> box.schema.space.create('tester') tarantool> box.space.tester:create_index('primary', {}) tarantool> box.schema.user.create('test_user', {password = 'pass'}) tarantool> box.schema.user.grant('test_user', 'read,write,execute', 'universe') tarantool> console = require('console') tarantool> cfg = { > servers = { > { uri = 'localhost:3301', zone = '1' }, > { uri = 'localhost:3302', zone = '2' }, > }, > login = 'test_user', > password = 'pass', > redundancy = 1, > binary = 3301, > } tarantool> shard = require('shard') tarantool> shard.init(cfg) tarantool> -- Введите что-нибудь ... tarantool> shard.tester:insert{1,'Tuple #1'}

source: On Terminal #2, say:
ru: Во втором терминале введите:

source: $ mkdir ~/tarantool_sandbox_2 $ cd ~/tarantool_sandbox_2 $ rm -r *.snap $ rm -r *.xlog $ ~/tarantool-1.7/src/tarantool tarantool> box.cfg{listen = 3302} tarantool> box.schema.space.create('tester') tarantool> box.space.tester:create_index('primary', {}) tarantool> box.schema.user.create('test_user', {password = 'pass'}) tarantool> box.schema.user.grant('test_user', 'read,write,execute', 'universe') tarantool> console = require('console') tarantool> cfg = { > servers = { > { uri = 'localhost:3301', zone = '1' }; > { uri = 'localhost:3302', zone = '2' }; > }; > login = 'test_user'; > password = 'pass'; > redundancy = 1; > binary = 3302; > } tarantool> shard = require('shard') tarantool> shard.init(cfg) tarantool> -- Now get something out ... tarantool> shard.tester:select{1}
ru: $ mkdir ~/tarantool_sandbox_2 $ cd ~/tarantool_sandbox_2 $ rm -r *.snap $ rm -r *.xlog $ ~/tarantool-1.7/src/tarantool tarantool> box.cfg{listen = 3302} tarantool> box.schema.space.create('tester') tarantool> box.space.tester:create_index('primary', {}) tarantool> box.schema.user.create('test_user', {password = 'pass'}) tarantool> box.schema.user.grant('test_user', 'read,write,execute', 'universe') tarantool> console = require('console') tarantool> cfg = { > servers = { > { uri = 'localhost:3301', zone = '1' }; > { uri = 'localhost:3302', zone = '2' }; > }; > login = 'test_user'; > password = 'pass'; > redundancy = 1; > binary = 3302; > } tarantool> shard = require('shard') tarantool> shard.init(cfg) tarantool> -- Выведите что-нибудь ... tarantool> shard.tester:select{1}

source: What will appear on Terminal #1 is: a loop of error messages saying "Connection refused" and "server check failure". This is normal. It will go on until Terminal #2 process starts.
ru: На терминале №1 появится цикл сообщений с ошибками типа "Connection refused" (в подключении отказано) и "server check failure" (отказ проверки сервера). Это нормально. Сообщения будут появляться, пока не начнется процесс на терминале №2.

source: What will appear on Terminal #2, at the end, should look like this:
ru: В конце, на терминале №2 появится примерно следующее:
