Repository: tarantool/doc
Catalog: locale/*/LC_MESSAGES/doc.po
Languages: ru

source: The time that a function takes within a processor. This function uses ``clock.proc()``, therefore it calculates elapsed CPU time. Therefore it is not useful for showing actual elapsed time.
ru: Время, которое функция проводит в процессоре. Данная функция использует ``clock.proc()``, то есть рассчитывает затраченное процессором время. Таким образом, она не используется для отображения фактически затраченного времени.

source: function or function reference
ru: функция или ссылка на функцию

source: whatever values are required by the function.
ru: значения, которые необходимы для функции.

source: **table**. first element - seconds of CPU time, second element - whatever the function returns.
ru: **таблица**. Первый элемент -- время работы процессора в секундах, второй элемент -- то, что возвращает функция.

source: -- Benchmark a function which sleeps 10 seconds. -- NB: bench() will not calculate sleep time. -- So the returned value will be {a number less than 10, 88}. clock = require('clock') fiber = require('fiber') function f(param) fiber.sleep(param) return 88 end clock.bench(f, 10)
ru: -- Эталонное тестирование функции, которая находится в спящем режиме в течение 10 секунд. -- NB: bench() не будет рассчитывать время сна. -- Поэтому вернется значение, которое будет {число менее 10, 88}. clock = require('clock') fiber = require('fiber') function f(param) fiber.sleep(param) return 88 end clock.bench(f, 10)

source: Module `console`
ru: Модуль `console`

source: The console module allows one Tarantool instance to access another Tarantool instance, and allows one Tarantool instance to start listening on an :ref:`admin port <admin-security>`.
ru: Модуль `console` позволяет одному экземпляру Tarantool'а получать доступ к другому экземпляру Tarantool'а и позволяет одному экземпляру Tarantool'а начать прослушивание по :ref:`порту администрирования <admin-security>`.

source: Below is a list of all ``console`` functions.
ru: Ниже приведен перечень всех функций модуля ``console``.

source: Connect to an instance
ru: Подключение к экземпляру

source: Listen for incoming requests
ru: Прослушивание входящих запросов

source: Start the console
ru: Запуск консоли

source: Set the auto-completion flag
ru: Установка флага автодополнения ввода

source: Set a delimiter
ru: Настройка разделителя

source: Connect to the instance at :ref:`URI <index-uri>`, change the prompt from '``tarantool>``' to ':samp:`{uri}>`', and act henceforth as a client until the user ends the session or types ``control-D``.
ru: Подключение к экземпляру по :ref:`URI <index-uri>`, смена командной строки с '``tarantool>``' на ':samp:`{uri}>`' и дальнейшая работа в качестве клиента до окончания сессии пользователя или ввода команды ``control-D``.

source: The console.connect function allows one Tarantool instance, in interactive mode, to access another Tarantool instance. Subsequent requests will appear to be handled locally, but in reality the requests are being sent to the remote instance and the local instance is acting as a client. Once connection is successful, the prompt will change and subsequent requests are sent to, and executed on, the remote instance. Results are displayed on the local instance. To return to local mode, enter ``control-D``.
ru: Функция console.connect позволяет одному экземпляру Tarantool'а в интерактивном режиме получать доступ к другому экземпляру Tarantool'а. Последующие запросы на первый взгляд будут обрабатываться локально, но в действительности запросы отправляются на удаленный экземпляр, а локальный экземпляр выступает в виде клиента. После успешного подключения командная строка сменится, и последующие запросы отправляются и выполняются на удаленном экземпляре. Результат выводится на локальный экземпляр. Чтобы вернуться к работе на локальном экземпляре, введите команду ``control-D``.

source: If the Tarantool instance at :samp:`uri` requires authentication, the connection might look something like: ``console.connect('admin:secretpassword@distanthost.com:3301')``.
ru: Если экземпляр Tarantool'а по :samp:`URI` запрашивает авторизацию, подключение может выглядеть следующим образом: ``console.connect('admin:secretpassword@distanthost.com:3301')``.

source: There are no restrictions on the types of requests that can be entered, except those which are due to privilege restrictions -- by default the login to the remote instance is done with user name = 'guest'. The remote instance could allow for this by granting at least one privilege: ``box.schema.user.grant('guest','execute','universe')``.
ru: Нет ограничений по типу вводимых запросов, кроме ограничений по правам на выполняемые запросы -- по умолчанию, вход в систему на удаленном экземпляре выполняется от имени пользователя 'guest'. Можно разрешить работу на удаленном экземпляре, выдав права: ``box.schema.user.grant('guest','execute','universe')``.

source: the URI of the remote instance
ru: URI удаленного экземпляра

source: Possible errors: the connection will fail if the target Tarantool instance was not initiated with ``box.cfg{listen=...}``.
ru: Возможные ошибки: подключение не будет установлено, если целевой экземпляр Tarantool'а не был инициирован с помощью ``box.cfg{listen=...}``.

source: tarantool> console = require('console') --- ... tarantool> console.connect('198.18.44.44:3301') --- ... 198.18.44.44:3301> -- prompt is telling us that instance is remote
ru: tarantool> console = require('console') --- ... tarantool> console.connect('198.18.44.44:3301') --- ... 198.18.44.44:3301> -- командная строка показывает, что работа идет с удаленным экземпляром

source: Listen on :ref:`URI <index-uri>`. The primary way of listening for incoming requests is via the connection-information string, or URI, specified in ``box.cfg{listen=...}``. The alternative way of listening is via the URI specified in ``console.listen(...)``. This alternative way is called "administrative" or simply :ref:`"admin port" <admin-security>`. The listening is usually over a local host with a Unix domain socket.
ru: Прослушивание по :ref:`URI <index-uri>`. Основной способ прослушивания на предмет входящих запросов -- по строке информации о подключении, или URI, указанному в ``box.cfg{listen=...}``. Другой способ прослушивания -- по URI, указанному в ``console.listen(...)``. Этот другой способ называется "административным" или просто :ref:`"по порту администрирования" <admin-security>`. Такое прослушивание обычно осуществляется по локальному хосту с доменным Unix-сокетом.

source: the URI of the local instance
ru: URI локального экземпляра

source: The "admin" address is the URI to listen on. It has no default value, so it must be specified if connections will occur via an admin port. The parameter is expressed with URI = Universal Resource Identifier format, for example "/tmpdir/unix_domain_socket.sock", or a numeric TCP port. Connections are often made with telnet. A typical port value is 3313.
ru: "Административный" адрес -- это URI для прослушивания. У него нет значения по умолчанию, поэтому следует указать, будет ли подключение производиться по порту администрирования. Параметр выражен URI = Универсальным идентификатором ресурса, например "/tmpdir/unix_domain_socket.sock", или числовым идентификатором TCP-порта. Подключения часто выполняются по telnet. Типичное значение порта: 3313.

source: Start the console on the current interactive terminal.
ru: Запуск консоли на текущем интерактивном терминале.

source: A special use of ``console.start()`` is with :ref:`initialization files <index-init_label>`. Normally, if one starts the Tarantool instance with :samp:`tarantool {initialization file}` there is no console. This can be remedied by adding these lines at the end of the initialization file:
ru: ``console.start()`` специально используется с :ref:`файлами инициализации <index-init_label>`. Как правило, при запуске экземпляра Tarantool'а с помощью команды :samp:`tarantool {initialization file}`, консоль не поддерживается. Эту проблему можно решить путем добавления следующих строк в конце файла инициализации:

source: Set the auto-completion flag. If auto-completion is `true`, and the user is using Tarantool as a client or the user is using Tarantool via ``console.connect()``, then hitting the TAB key may cause tarantool to complete a word automatically. The default auto-completion value is `true`.
ru: Установка флага автодополнения ввода. Если значение автодополнения = `true` (правда), и пользователь использует Tarantool в качестве клиента или подключен к Tarantool'у по ``console.connect()``, то при нажатии клавиши TAB Tarantool будет автоматически дополнять текст по введенной части. По умолчанию, задано значение `true`.

source: Set a custom end-of-request marker for Tarantool console.
ru: Настройка специального маркера окончания запроса для консоли Tarantool'а.

source: The default end-of-request marker is a newline (line feed). Custom markers are not necessary because Tarantool can tell when a multi-line request has not ended (for example, if it sees that a function declaration does not have an end keyword). Nonetheless for special needs, or for entering multi-line requests in older Tarantool versions, you can change the end-of-request marker. As a result, newline alone is not treated as end of request.
ru: По умолчанию, маркер окончания запроса представляет собой символ разрыва строки (перевод строки). Нет необходимости в специальных маркерах, поскольку Tarantool может определить, если многостроковый запрос не завершен (например, если видно, что при объявлении функции еще не задано конечное ключевое слово). Тем не менее, в особых случаях или при вводе многостроковых запросов в более ранних версиях Tarantool'а, можно изменить маркер окончания запроса. В результате символ разрыва строки не будет означать окончание запроса.

source: To go back to normal mode, say: ``console.delimiter('')<marker>``
ru: Чтобы вернуться в нормальный режим, введите команду: ``console.delimiter('')<marker>``

source: a custom end-of-request marker for Tarantool console
ru: специальный маркер окончания запроса для консоли Tarantool'а

source: Module `crypto`
ru: Модуль `crypto`

source: "Crypto" is short for "Cryptography", which generally refers to the production of a digest value from a function (usually a `Cryptographic hash function`_), applied against a string. Tarantool's ``crypto`` module supports ten types of cryptographic hash functions (AES_, DES_, DSS_, MD4_, MD5_, MDC2_, RIPEMD_, SHA-0_, SHA-1_, SHA-2_). Some of the crypto functionality is also present in the :ref:`digest` module.
ru: "Crypto" -- это сокращенно "криптография", что обычно означает производство значения дайджеста из функции (как правило, криптографической хеш-функции -- `Cryptographic hash function`_), примененной к строке. Модуль ``crypto`` Tarantool'а поддерживает десять типов криптографических хеш-функций (AES_, DES_, DSS_, MD4_, MD5_, MDC2_, RIPEMD_, SHA-0_, SHA-1_, SHA-2_). В модуле :ref:`digest` также есть некоторые криптографические функции.

source: Below is a list of all ``crypto`` functions.
ru: Ниже приведен перечень всех функций модуля ``crypto``.

source: Encrypt a string
ru: Шифрование строки

source: Decrypt a string
ru: Расшифрование строки

source: Get a digest
ru: Получение дайджеста

source: Pass or return a cipher derived from the string, key, and (optionally, sometimes) initialization vector. The four choices of algorithms:
ru: Передача или возврат шифрованного сообщения, полученного из строки, ключа и (необязательно) вектора инициализации. Четыре алгоритма на выбор:

source: aes128 - aes-128 (with 192-bit binary strings using AES)
ru: aes128 - aes-128 (128-битные двоичные строки с использованием AES)

source: aes192 - aes-192 (with 192-bit binary strings using AES)
ru: aes192 - aes-192 (192-битные двоичные строки с использованием AES)

source: aes256 - aes-256 (with 256-bit binary strings using AES)
ru: aes256 - aes-256 (256-битные двоичные строки с использованием AES)

source: des - des (with 56-bit binary strings using DES, though DES is not recommended)
ru: des - des (56-битные двоичные строки с использованием DES, хотя использование DES не рекомендуется)

source: Four choices of block cipher modes are also available:
ru: Также доступны четыре режима блочного шифрования на выбор:

source: cbc - Cipher Block Chaining
ru: cbc - Сцепление блоков шифротекста

source: cfb - Cipher Feedback
ru: cfb - Обратная связь по шифротексту

source: ecb - Electronic Codebook
ru: ecb - Электронная кодовая книга

source: ofb - Output Feedback
ru: ofb - Обратная связь по выходу

source: For more information, read the article about `Encryption Modes`_
ru: Для получения дополнительной информации, см. статью о режимах шифрования `Encryption Modes`_

source: Pass or return a digest derived from the string. The twelve choices of algorithms:
ru: Передача или возврат дайджеста из строки. Выбор из двенадцати алгоритмов:

source: dss - dss (using DSS)
ru: dss - dss (с использованием DSS)

source: dss1 - dss (using DSS-1)
ru: dss1 - dss (с использованием DSS-1)

source: md4 - md4 (with 128-bit binary strings using MD4)
ru: md4 - md4 (128-битные двоичные строки с использованием MD4)

source: md5 - md5 (with 128-bit binary strings using MD5)
ru: md5 - md5 (128-битные двоичные строки с использованием MD5)

source: mdc2 - mdc2 (using MDC2)
ru: mdc2 - mdc2 (с использованием MDC2)

source: ripemd160 - ripemd (with 160-bit binary strings using RIPEMD-160)
ru: ripemd160 - ripemd (160-битные двоичные строки с использованием RIPEMD-160)

source: sha - sha (with 160-bit binary strings using SHA-0)
ru: sha - sha (160-битные двоичные строки с использованием SHA-0)

source: sha1 - sha-1 (with 160-bit binary strings using SHA-1)
ru: sha1 - sha-1 (160-битные двоичные строки с использованием SHA-1)

source: sha224 - sha-224 (with 224-bit binary strings using SHA-2)
ru: sha224 - sha-224 (224-битные двоичные строки с использованием SHA-2)

source: sha256 - sha-256 (with 256-bit binary strings using SHA-2)
ru: sha256 - sha-256 (256-битные двоичные строки с использованием SHA-2)

source: sha384 - sha-384 (with 384-bit binary strings using SHA-2)
ru: sha384 - sha-384 (384-битные двоичные строки с использованием SHA-2)

source: sha512 - sha-512(with 512-bit binary strings using SHA-2).
ru: sha512 - sha-512(512-битные двоичные строки с использованием SHA-2).

source: Incremental methods in the crypto module
ru: Инкрементальные методы в модуле ``crypto``

source: Suppose that a digest is done for a string 'A', then a new part 'B' is appended to the string, then a new digest is required. The new digest could be recomputed for the whole string 'AB', but it is faster to take what was computed before for 'A' and apply changes based on the new part 'B'. This is called multi-step or "incremental" digesting, which Tarantool supports for all crypto functions..
ru: Предположим, что вычислен дайджест для строки 'A', затем часть 'B' добавляется в строку, необходим новый дайджест. Новый дайджест можно пересчитать для всей строки 'AB', но быстрее будет взять вычисленный дайджест для 'A' и внести изменения на основании добавленной части 'B'. Это называется многошаговым процессом или "инкрементным" хеш-суммированием, которое поддерживает Tarantool поддерживает для всех криптографических функций.

source: crypto = require('crypto') -- print aes-192 digest of 'AB', with one step, then incrementally print(crypto.cipher.aes192.cbc.encrypt('AB', 'key')) c = crypto.cipher.aes192.cbc.encrypt.new() c:init() c:update('A', 'key') c:update('B', 'key') print(c:result()) c:free() -- print sha-256 digest of 'AB', with one step, then incrementally print(crypto.digest.sha256('AB')) c = crypto.digest.sha256.new() c:init() c:update('A') c:update('B') print(c:result()) c:free()
ru: crypto = require('crypto') -- вывести дайджест 'AB' по aes-192 пошагово, затем с инкрементом print(crypto.cipher.aes192.cbc.encrypt('AB', 'key')) c = crypto.cipher.aes192.cbc.encrypt.new() c:init() c:update('A', 'key') c:update('B', 'key') print(c:result()) c:free() -- вывести дайджест 'AB' по sha-256 пошагово, затем с инкрементом print(crypto.digest.sha256('AB')) c = crypto.digest.sha256.new() c:init() c:update('A') c:update('B') print(c:result()) c:free()

source: Getting the same results from digest and crypto modules
ru: Получение одинаковых результатов из модулей digest и crypto

source: The following functions are equivalent. For example, the ``digest`` function and the ``crypto`` function will both produce the same result.
ru: Следующие функции равноценны. Например, функция ``digest`` и функция ``crypto`` приведут к одному результату.

source: Module `csv`
ru: Модуль `csv`

source: The ``csv`` module handles records formatted according to Comma-Separated-Values (CSV) rules.
ru: Модуль ``csv`` обрабатывает записи, форматированные в соответствии с правилами CSV (значения, разделенные запятыми).

source: The default formatting rules are:
ru: По умолчанию, используются следующие правила форматирования:

source: Lua `escape sequences`_ such as \\n or \\10 are legal within strings but not within files,
ru: Escape-последовательности `escape sequences`_ в Lua, такие как \\n или \\10, можно использовать в строках, но не в файлах,

source: Commas designate end-of-field,
ru: Запятые обозначают конец поля,

source: Line feeds, or line feeds plus carriage returns, designate end-of-record,
ru: Символы перевода строки или перевода строки плюс возврата каретки означают конец записи,

source: Leading or trailing spaces are ignored,
ru: Начальные и конечные пробелы игнорируются,

source: Quote marks may enclose fields or parts of fields,
ru: Кавычками могут обрамляться поля или компоненты полей,

source: When enclosed by quote marks, commas and line feeds and spaces are treated as ordinary characters, and a pair of quote marks "" is treated as a single quote mark.
ru: При обрамлении кавычками запятые, символы перевода строки и пробелы считаются обычными символами, а двойные кавычки "" считаются одинарными.

source: The possible options which can be passed to csv functions are:
ru: Возможные параметры, передаваемые в функции модуля csv:

source: :samp:`delimiter = {string}` (default: comma) -- single-byte character to designate end-of-field
ru: :samp:`delimiter = {строка}` (по умолчанию: запятая) -- однобайтовый символ для обозначения конца поля

source: :samp:`quote_char = {string}` (default: quote mark) -- single-byte character to designate encloser of string
ru: :samp:`quote_char = {строка}` (по умолчанию: кавычка) -- однобайтовый символ для обозначения закрытия строки

source: :samp:`chunk_size = {number}` (default: 4096) -- number of characters to read at once (usually for file-IO efficiency)
ru: :samp:`chunk_size = {число}` (по умолчанию: 4096) -- число символов для одновременного чтения (обычно для эффективности файлового ввода-вывода)

source: :samp:`skip_head_lines = {number}` (default: 0) -- number of lines to skip at the start (usually for a header)
ru: :samp:`skip_head_lines = {число}` (по умолчанию: 0) -- число строк, которые пропускаются в начале (обычно для заголовка)

source: Below is a list of all ``csv`` functions.
ru: Ниже приведен перечень всех функций модуля ``csv``.

source: Load a CSV file
ru: Загрузка CSV-файла

source: Transform input into a CSV-formatted string
ru: Преобразование входного значения в строку формата CSV

source: Iterate over CSV records
ru: Итерация по записям в формате CSV

source: Get CSV-formatted input from ``readable`` and return a table as output. Usually ``readable`` is either a string or a file opened for reading. Usually :samp:`{options}` is not specified.
ru: Получение входного значения в формате CSV из ``readable`` и возврат таблицы в качестве выходного значения. Обычно ``readable`` представляет собой либо строку, либо открытый для чтения файл. Как правило, параметры :samp:`{options}` не указываются.

source: a string, or any object which has a read() method, formatted according to the CSV rules
ru: строка или любой объект с методом read(), форматированный по правилам CSV

source: see :ref:`above <csv-options>`
ru: см. :ref:`выше <csv-options>`

source: loaded_value
ru: загруженное значение

source: Readable string has 3 fields, field#2 has comma and space so use quote marks:
ru: В читаемой строке 3 поля, поле №2 содержит запятую и пробел, поэтому следует использовать кавычки:

source: Readable string contains 2-byte character = Cyrillic Letter Palochka: (This displays a palochka if and only if character set = UTF-8.)
ru: В читаемой строке 2-байтный символ = Палочка в кириллице: (Отобразит палочку только в том случае, если кодировка = UTF-8.)

source: Semicolon instead of comma for the delimiter:
ru: Точка с запятой вместо запятой в виде символа разделителя:

source: Readable file :file:`./file.csv` contains two CSV records. Explanation of ``fio`` is in section :ref:`fio <fio-section>`. Source CSV file and example respectively:
ru: Читаемый файл :file:`./file.csv` содержит две записи в формате CSV. Объяснение блока ``fio`` дается в разделе :ref:`fio <fio-section>`. Исходный CSV-файл и пример соответственно:

source: tarantool> -- input in file.csv is: tarantool> -- a,"b,c ",d tarantool> -- a\\211\\128b tarantool> fio = require('fio') --- ... tarantool> f = fio.open('./file.csv', {'O_RDONLY'}) --- ... tarantool> csv.load(f, {chunk_size = 4096}) --- - - - a - 'b,c ' - d - - a\\211\\128b ... tarantool> f:close() --- - true ...
ru: tarantool> -- входное значение в файле file.csv: tarantool> -- a,"b,c ",d tarantool> -- a\\211\\128b tarantool> fio = require('fio') --- ... tarantool> f = fio.open('./file.csv', {'O_RDONLY'}) --- ... tarantool> csv.load(f, {chunk_size = 4096}) --- - - - a - 'b,c ' - d - - a\\211\\128b ... tarantool> f:close() --- - true ...

source: Get table input from ``csv-table`` and return a CSV-formatted string as output. Or, get table input from ``csv-table`` and put the output in ``writable``. Usually :samp:`{options}` is not specified. Usually ``writable``, if specified, is a file opened for writing. :ref:`csv.dump() <csv-dump>` is the reverse of :ref:`csv.load() <csv-load>`.
ru: Получение входного значения из таблицы ``csv-table`` и возврат строки в формате CSV в качестве выходного значения. Или получение входного значения из таблицы ``csv-table`` и размещение выходного значения в ``writable``. Обычно параметры :samp:`{options}` не указываются. Как правило, если указан ``writable``, то это открытый для чтения файл. :ref:`csv.dump() <csv-dump>` -- это операция, обратная :ref:`csv.load() <csv-load>`.

source: a table which can be formatted according to the CSV rules.
ru: таблица, которую можно форматировать в соответствии с правилами CSV

source: optional. see :ref:`above <csv-options>`
ru: необязательно. См. :ref:`выше <csv-options>`

source: any object which has a ``write()`` method
ru: любой объект с методом ``write()``

source: dumped_value
ru: записанное значение

source: string, which is written to ``writable`` if specified
ru: строка, которая записывается в объект ``writable``, если указан

source: CSV-table has 3 fields, field#2 has "," so result has quote marks
ru: В таблице формата CSV 3 поля, поле №2 содержит "," поэтому результат включает в себя кавычки

source: Round Trip: from string to table and back to string
ru: Круговое преобразование: из строки в таблицу и обратно в строку

source: Form a Lua iterator function for going through CSV records one field at a time. Use of an iterator is strongly recommended if the amount of data is large (ten or more megabytes).
ru: Создание Lua-функции с итератором для прохода по записям в формате CSV по одному полю за раз. Настоятельно рекомендуется использовать итератор для большого объема данных (10 мегабайт и более).

source: Lua iterator function
ru: Lua-функция с итератором

source: iterator function
ru: функция с итератором
