Repository: tarantool/doc
Catalog: locale/*/LC_MESSAGES/doc.po
Languages: ru

source: memtx TREE or HASH indexes, |br| vinyl TREE indexes
ru: индексы типа TREE или HASH в memtx'е, |br| TREE-индексы в vinyl'е

source: strings -- any set of octets
ru: строки -- любой набор октетов

source: memtx TREE or HASH indexes |br| vinyl TREE indexes
ru: индексы типа TREE или HASH в memtx'е |br| TREE-индексы в vinyl'е

source: integers between -9223372036854775808 and 18446744073709551615
ru: целые числа от -9 223 372 036 854 775 808 до 18 446 744 073 709 551 615

source: integers between -9223372036854775808 and 18446744073709551615, single-precision floating point numbers, double-precision floating point numbers
ru: целые числа от -9 223 372 036 854 775 808 до 18 446 744 073 709 551 615, числа с плавающей запятой с одинарной точностью или с двойной точностью

source: true or false
ru: true или false

source: array of integers between -9223372036854775808 and 9223372036854775807
ru: массив целых чисел от -9 223 372 036 854 775 808 до 9 223 372 036 854 775 807

source: memtx RTREE indexes
ru: RTREE-индексы в memtx'е

source: booleans (true or false), integers between -9223372036854775808 and 18446744073709551615, single-precision floating point numbers, double-precision floating point numbers, strings
ru: логические значения (true или false), целые числа от -9 223 372 036 854 775 808 до 18 446 744 073 709 551 615, числа с плавающей запятой с одинарной точностью или с двойной точностью, строки

source: **Using field names instead of field numbers:** ``create_index()`` can use field names and/or field types described by the optional :ref:`space_object:format() <box_space-format>` clause. In the following example, we show ``format()`` for a space that has two columns named 'x' and 'y', and then we show five variations of the ``parts={}`` clause of ``create_index()``, first for the 'x' column, second for both the 'x' and 'y' columns. The variations include omitting the type, using numbers, and adding extra braces.
ru: **Использование имен полей вместо номеров полей:** в ``create_index()`` можно использовать имена полей и/или типы полей, описанные в необязательном операторе :ref:`space_object:format() <box_space-format>`. В следующем примере покажем ``format()`` для спейса с двумя столбцами под названиями 'x' и 'y', а затем покажем пять вариантов оператора ``parts={}`` в ``create_index()``, сначала для столбца 'x', затем для столбцов 'x' и 'y'. Варианты включают в себя пропуск типа, использование номеров и добавление дополнительных фигурных скобок.

source: **Note re storage engine:** vinyl supports only the TREE index type, and vinyl secondary indexes must be created before tuples are inserted.
ru: **Примечание про движок базы данных:** vinyl поддерживает только TREE-индексы, и следует создать в vinyl'е вторичные индексы до вставки кортежей.

source: Delete a tuple identified by a primary key.
ru: Удаление кортежа по первичному ключу.

source: the deleted tuple
ru: удаленный кортеж.

source: **Complexity factors:** Index size, Index type
ru: **Факторы сложности:** Размер индекса, тип индекса

source: **Note re storage engine:** vinyl will return ``nil``, rather than the deleted tuple.
ru: **Примечание про движок базы данных:** vinyl вернет ``nil``, а не удаленный кортеж.

source: For more usage scenarios and typical errors see :ref:`Example: using data operations <box_space-operations-detailed-examples>` further in this section.
ru: Для получения дополнительной информации о сценариях использования и типичных ошибках, см. :ref:`Пример: использование операций с данными <box_space-operations-detailed-examples>` далее в разделе.

source: Drop a space.
ru: Удаление спейса.

source: **Possible errors:** ``space_object`` does not exist.
ru: **Возможные ошибки:** ``space_object`` не существует.

source: **Complexity factors:** Index size, Index type, Number of indexes accessed, WAL settings.
ru: **Факторы сложности** Размер индекса, тип индекса, количество кортежей, к которым получен доступ, настройки журнала упреждающей записи (WAL).

source: Declare field names and :ref:`types <index-box_data-types>`.
ru: Объявление имен и :ref:`типов <index-box_data-types>` полей.

source: a list of field names and types
ru: список имен и типов полей

source: nil, unless format-clause is omitted
ru: nil, если не указан оператор формата

source: ``space_object`` does not exist;
ru: ``space_object``не существует,

source: type is not legal.
ru: тип не поддерживается.

source: Ordinarily Tarantool allows unnamed untyped fields. But with ``format`` users can, for example, document that the Nth field is the surname field and must contain strings. It is also possible to specify a format clause in :ref:`box.schema.space.create() <box_schema-space_create>`.
ru: Как правило, Tarantool допускает поля без имен и без указания типа. Но с помощью ``format`` можно, например, задокументировать, что N-ное поле представляет собой поле для фамилии и должно содержать строковое значение. Также оператор формата можно указать в :ref:`box.schema.space.create() <box_schema-space_create>`.

source: It is legal for tuples to have more fields than are described by a format clause. The way to constrain the number of fields is to specify a space's :ref:`field_count <box_space-field_count>` member.
ru: В кортежах может быть больше полей, чем описано в операторе формата. Чтобы ограничить количество полей, необходимо указать элемент спейса :ref:`field_count <box_space-field_count>`.

source: It is legal to use ``format`` on a space that already has a format, thus replacing any previous definitions, provided that there is no conflict with existing data or index definitions.
ru: Можно использовать ``format`` для спейса, в котором уже определен формат, заменяя таким образом предыдущие определения при условии, что нет конфликта с существующими данными или определениями индекса.

source: There are legal variations of the format clause:
ru: Можно использовать следующие варианты оператора:

source: omitting both 'name=' and 'type=',
ru: пропуск и 'name=', и 'type=',

source: omitting 'type=' alone, and
ru: пропуск 'type=' и

source: adding extra braces.
ru: добавление дополнительных фигурных скобок.

source: The following examples show all the variations, first for one field named 'x', second for two fields named 'x' and 'y'.
ru: В следующем примере иллюстрируются все варианты, первый для поля с именем 'x', второй -- для двух полей с именами 'x' и 'y'.

source: The following example shows how to create a space, format it with all possible types, and insert into it.
ru: В следующем примере показывается создание спейса, определение формата для него со всеми возможными типа и вставка данных.

source: tarantool> box.schema.space.create('t') --- ... tarantool> box.space.t:format({{name='1',type='any'}, > {name='2',type='unsigned'}, > {name='3',type='string'}, > {name='4',type='number'}, > {name='5',type='integer'}, > {name='6',type='boolean'}, > {name='7',type='scalar'}, > {name='8',type='array'}, > {name='9',type='map'}}) --- ... tarantool> box.space.t:create_index('i',{parts={2,'unsigned'}}) --- ... tarantool> box.space.t:insert{{'a'}, -- any > 1, -- unsigned > 'W?', -- string > 5.5, -- number > -0, -- integer > true, -- boolean > true, -- scalar > {{'a'}}, -- array > {val=1}} -- map --- - [['a'], 1, 'W?', 5.5, 0, true, true, [['a']], {'val': 1}] ...
ru: tarantool> box.schema.space.create('t') --- ... tarantool> box.space.t:format({{name='1',type='any'}, > {name='2',type='unsigned'}, > {name='3',type='string'}, > {name='4',type='number'}, > {name='5',type='integer'}, > {name='6',type='boolean'}, > {name='7',type='scalar'}, > {name='8',type='array'}, > {name='9',type='map'}}) --- ... tarantool> box.space.t:create_index('i',{parts={2,'unsigned'}}) --- ... tarantool> box.space.t:insert{{'a'}, -- любой > 1, -- без знака > 'W?', -- строка > 5.5, -- число > -0, -- целое число > true, -- логическое значение > true, -- скаляр > {{'a'}}, -- массив > {val=1}} -- ассоциативный массив --- - [['a'], 1, 'W?', 5.5, 0, true, true, [['a']], {'val': 1}] ...

source: Search for a tuple in the given space.
ru: Поиск кортежа в данном спейсе.

source: value to be matched against the index key, which may be multi-part.
ru: значение должно совпасть с индексным ключом, который может быть составным.

source: the tuple whose index key matches ``key``, or ``nil``.
ru: кортеж, ключ индекса в котором совпадает с ``key`` или ``nil``.

source: The ``box.space...select`` function returns a set of tuples as a Lua table; the ``box.space...get`` function returns at most a single tuple. And it is possible to get the first tuple in a space by appending ``[1]``. Therefore ``box.space.tester:get{1}`` has the same effect as ``box.space.tester:select{1}[1]``, if exactly one tuple is found.
ru: Функция ``box.space...select`` вернет набор кортежей в виде Lua-таблицы; функция ``box.space...get`` вернет самое большее один кортеж. Можно получить первый кортеж в спейсе, добавив ``[1]``. Таким образом, ``box.space.tester:get{1}`` эквивалентна ``box.space.tester:select{1}[1]``, если найден только один кортеж.

source: **Using field names instead of field numbers:** `get()` can use field names described by the optional :ref:`space_object:format() <box_space-format>` clause. This is similar to a standard Lua feature, where a component can be referenced by its name instead of its number. For example, we can format the `tester` space with a field named `x` and use the name `x` in the index definition:
ru: **Использование имен полей вместо номеров полей:** в `get()` можно использовать имена полей, описанные в необязательном операторе :ref:`space_object:format() <box_space-format>`. Это аналогично стандартной Lua-функции, где на компонент можно ссылаться по имени, а не по номеру. Например, может форматировать спейс `tester` с полем под названием `x` и использовать имя `x` в определении индекса:

source: Then, if ``get`` or ``select`` retrieve a single tuple, we can reference the field 'x' in the tuple by its name:
ru: Тогда если ``get`` или ``select`` вернут отдельный кортеж, можно сослаться на поле 'x' в кортеже по имени:

source: Insert a tuple into a space.
ru: Вставка кортежа в спейс.

source: tuple to be inserted.
ru: вставляемый кортеж.

source: the inserted tuple
ru: вставленный кортеж

source: **Possible errors:** If a tuple with the same unique-key value already exists, returns :errcode:`ER_TUPLE_FOUND`.
ru: **Возможные ошибки:** Если уже существует кортеж с тем же уникальным значением ключа, возвращается :errcode:`ER_TUPLE_FOUND`.

source: Return the number of tuples in the space. If compared with :ref:`count() <box_space-count>`, this method works faster because ``len()`` does not scan the entire space to count the tuples.
ru: Возврат количества кортежей в спейсе. Если сравнивать с :ref:`count() <box_space-count>`, то данный метод работает быстрее, поскольку метод ``len()`` не сканирует весь спейс для подсчета кортежей.

source: Number of tuples in the space.
ru: Количество кортежей в спейсе.

source: **Note re storage engine:** vinyl does not support ``len()``. Possible workarounds are to use :ref:`count() <box_space-count>` or ``#select(...)``.
ru: **Примечание про движок базы данных:** vinyl не поддерживает ``len()``. Решением будет использование :ref:`count() <box_space-count>` или ``#select(...)``.

source: Create a "replace :ref:`trigger <triggers>`". The ``trigger-function`` will be executed whenever a ``replace()`` or ``insert()`` or ``update()`` or ``upsert()`` or ``delete()`` happens to a tuple in ``<space-name>``.
ru: Создание ":ref:`триггера <triggers>` замены". Функция с триггером ``trigger-function`` будет выполняться в случае операции ``replace()`` или ``insert()``, или ``update()``, или ``upsert()``, или ``delete()`` над кортежем в спейсе ``<space-name>``.

source: If it is necessary to know whether the trigger activation happened due to replication or on a specific connection type, the function can refer to :ref:`box.session.type() <box_session-type>`.
ru: Следует знать, что если активация триггера произошла в случае репликации или определенного вида подключения, функция может ссылаться на :ref:`box.session.type() <box_session-type>`.

source: See also :ref:`space_object:before_replace() <box_space-before_replace>`.
ru: См. также :ref:`space_object:before_replace() <box_space-before_replace>`.

source: **Example #1:**
ru: **Пример №1:**

source: The ``trigger-function`` can have two parameters: old tuple, new tuple. For example, the following code causes nil to be printed when the insert request is processed, and causes [1, 'Hi'] to be printed when the delete request is processed:
ru: В функции ``trigger-function`` могут быть два параметра: старый кортеж, новый кортеж. Например, следующий код вызывает вывод nil при обработке запроса на вставку и вывод [1, 'Hi'] при обработке запроса на удаление:

source: **Example #2:**
ru: **Примеры:**

source: The following series of requests will create a space, create an index, create a function which increments a counter, create a trigger, do two inserts, drop the space, and display the counter value - which is 2, because the function is executed once after each insert.
ru: Следующая серия запросов создаст спейс, создаст индекс, создаст функцию, которая увеличит содержимое счетчика, создаст триггер, сделает две вставки, удалит спейс и отобразит значение счетчика -- 2, поскольку функция выполняется однократно после каждой вставки.

source: existing trigger function which will be replaced by ``trigger-function``
ru: существующая функция с триггером, которую заменит новая ``trigger-function``

source: If the parameters are ``(nil, old-trigger-function)``, then the old trigger is deleted.
ru: Если указаны параметры ``(nil, old-trigger-function)``, старый триггер будет удален.

source: See also :ref:`space_object:on_replace() <box_space-on_replace>`.
ru: См. также :ref:`space_object:on_replace() <box_space-on_replace>`.

source: Administrators can make replace triggers with ``on_replace()``, or make triggers with ``before_replace()``. If they make both types, then all ``before_replace`` triggers are executed before all ``on_replace`` triggers. The functions for both ``on_replace`` and ``before_replace`` triggers can make changes to the database, but only the functions for ``before_replace`` triggers can change the tuple that is being replaced.
ru: Администраторы могут создавать триггеры замены с условием после замены ``on_replace()`` или до замены ``before_replace()``. Если созданы оба типа, то все триггеры до замены ``before_replace`` выполняются до всех триггеров после замены ``on_replace``. Функции для обоих типов триггеров ``on_replace`` и ``before_replace`` могут вносить изменения в базу данных, гл только функции с триггерами до замены ``before_replace`` могут изменять кортеж, который будет заменен.

source: Since a ``before_replace`` trigger function has the extra capability of making a change to the old tuple, it also can have extra overhead, to fetch the old tuple before making the change. Therefore an ``on_replace`` trigger is better if there is no need to change the old tuple. However, this only applies for the memtx engine -- for the vinyl engine, the fetch will happen for either kind of trigger. (With memtx the tuple data is stored along with the index key so no extra search is necessary; with vinyl that is not the case so the extra search is necessary.)
ru: Поскольку функция с триггером до замены ``before_replace`` может вносить дополнительные изменения в старый кортеж, для нее также потребуются дополнительные ресурсы для вызова старого кортежа до внесения изменений. Таким образом, лучше использовать триггер после замены ``on_replace``, если нет необходимости изменять старый кортеж. Тем не менее, это применимо только к движку memtx -- что касается движка vinyl, такой вызов произойдет для любого типа триггера. (В memtx'е данные кортежа хранятся вместе с ключом индекса, поэтому нет необходимости в дополнительном поиске; для vinyl'а дело обстоит иначе, поэтому нужен дополнительный поиск.)

source: Where the extra capability is not needed, ``on_replace`` should be used instead of ``before_replace``. Usually ``before_replace`` is used only for certain replication scenarios -- it is useful for conflict resolution.
ru: Если нет необходимости в дополнительных изменениях, следует использовать ``on_replace`` вместо ``before_replace``. Как правило, ``before_replace`` используется только для определенных сценариев репликации -- в части разрешения конфликтов.

source: The value that a ``before_replace`` trigger function can return affects what will happen after the return. Specifically:
ru: Что случится после возврата значения, которое может вернуть функция с триггером ``before_replace``, зависит от этого значения. А именно:

source: if there is no return value, then execution proceeds, inserting|replacing the new value;
ru: если нет возвращаемого значения, выполнение продолжается со вставкой|заменой нового значения;

source: if the value is nil, then the tuple will be deleted;
ru: если значение -- nil, то кортеж будет удален;

source: if the value is the same as the old parameter, then no `on_replace`` function will be called and the data change will be skipped
ru: если значение совпадает со старым, то вызывается функция ``on_replace``, и изменение данных не происходит

source: if the value is the same as the new parameter, then it's as if the ``before_replace`` function wasn't called;
ru: если значение совпадает с новым, то считаем, что вызова функции ``before_replace`` не было;

source: if the value is something else, then execution proceeds, inserting|replacing the new value.
ru: если значение другое, выполнение продолжается со вставкой|заменой нового значения.

source: The following are ``before_replace`` functions that have no return value, or that return nil, or the same as the old parameter, or the same as the new parameter, or something else.
ru: Далее представлены функции ``before_replace``: не возвращает значение, возвращает nil, возвращает совпадающее со старым значение, возвращает совпадающее с новым значение, возвращает другое значение.

source: Search for a tuple or a set of tuples in the given space, and allow iterating over one tuple at a time.
ru: Поиск кортежа или набора кортежей в заданном спейсе и итерация по одному кортежу за раз.

source: see :ref:`index_object:pairs <box_index-index_pairs>`
ru: см. :ref:`index_object:pairs <box_index-index_pairs>`

source: no such space;
ru: отсутствие такого спейса.

source: wrong type.
ru: неправильный тип.

source: For examples of complex ``pairs`` requests, where one can specify which index to search and what condition to use (for example "greater than" instead of "equal to"), see the later section :ref:`index_object:pairs <box_index-index_pairs>`.
ru: Чтобы посмотреть примеры сложных запросов ``pairs``, где можно указать индекс для поиска и используемое условие (например, "больше чем" вместо "равен"), см. раздел далее по тексту :ref:`index_object:pairs <box_index-index_pairs>`.

source: tarantool> s = box.schema.space.create('space33') --- ... tarantool> -- index 'X' has default parts {1, 'unsigned'} tarantool> s:create_index('X', {}) --- ... tarantool> s:insert{0, 'Hello my '}, s:insert{1, 'Lua world'} --- - [0, 'Hello my '] - [1, 'Lua world'] ... tarantool> tmp = '' --- ... tarantool> for k, v in s:pairs() do > tmp = tmp .. v[2] > end --- ... tarantool> tmp --- - Hello my Lua world ...
ru: tarantool> s = box.schema.space.create('space33') --- ... tarantool> -- в индексе 'X' количество частей по умолчанию {1, 'unsigned'} tarantool> s:create_index('X', {}) --- ... tarantool> s:insert{0, 'Hello my '}, s:insert{1, 'Lua world'} --- - [0, 'Hello my '] - [1, 'Lua world'] ... tarantool> tmp = '' --- ... tarantool> for k, v in s:pairs() do > tmp = tmp .. v[2] > end --- ... tarantool> tmp --- - Hello my Lua world ...

source: Rename a space.
ru: Переименование спейса.

source: new name for space
ru: новое имя спейса

source: Insert a tuple into a space. If a tuple with the same primary key already exists, ``box.space...:replace()`` replaces the existing tuple with a new one. The syntax variants ``box.space...:replace()`` and ``box.space...:put()`` have the same effect; the latter is sometimes used to show that the effect is the converse of ``box.space...:get()``.
ru: Вставка кортежа в спейс. Если уже существует кортеж с тем же первичным ключом, ``box.space...:replace()`` заменит существующий кортеж новым. Варианты синтаксиса (``box.space...:replace()`` и ``box.space...:put()``) приведут к одному результату, но последний иногда используется как противоположность ``box.space...:get()``.

source: tuple to be inserted
ru: вставляемый кортеж

source: **Possible errors:** If a different tuple with the same unique-key value already exists, returns :errcode:`ER_TUPLE_FOUND`. (This will only happen if there is a unique secondary index.)
ru: **Возможные ошибки:** Если уже существует другой кортеж с тем же уникальным значением ключа, возвращается :errcode:`ER_TUPLE_FOUND`. (Это случится только в том случае, если есть уникальный вторичный индекс.)

source: At the time that a :ref:`trigger <triggers>` is defined, it is automatically enabled - that is, it will be executed. :ref:`Replace <box_space-on_replace>` triggers can be disabled with :samp:`box.space.{space-name}:run_triggers(false)` and re-enabled with :samp:`box.space.{space-name}:run_triggers(true)`.
ru: На тот момент, когда :ref:`триггер <triggers>` определен, он автоматически активируется, то есть он будет исполняться. Триггеры :ref:`для замены <box_space-on_replace>` можно отключить с помощью :samp:`box.space.{имя-спейса}:run_triggers(false)` и повторно активировать с помощью :samp:`box.space.{имя-спейса}:run_triggers(true)`.

source: The following series of requests will associate an existing function named `F` with an existing space named `T`, associate the function a second time with the same space (so it will be called twice), disable all triggers of `T`, and delete each trigger by replacing with ``nil``.
ru: Следующая серия запросов ассоциирует существующую функцию с именем `F` с существующим спейсом с именем `T`, ассоциирует функцию во второй раз с тем же спейсом (чтобы вызвать ее дважды), отключит все триггеры на `T` и удалит каждый триггер, заменив его на ``nil``.

source: Search for a tuple or a set of tuples in the given space.
ru: Поиск кортежа или набора кортежей в заданном спейсе.

source: the tuples whose primary-key fields are equal to the fields of the passed key. If the number of passed fields is less than the number of fields in the primary key, then only the passed fields are compared, so ``select{1,2}`` will match a tuple whose primary key is ``{1,2,3}``.
ru: кортежи, поля первичного ключа в которых равны полям переданного ключа. Если количество переданных полей меньшей количества полей первичного ключа, сопоставляются только переданные поля, то есть для ``select{1,2}`` совпадением будет кортеж с первичным ключом ``{1,2,3}``.

source: Deletes all tuples.
ru: Удаление всех кортежей.

source: The ``truncate`` method cannot be called from within a transaction.
ru: Метод ``truncate`` нельзя вызвать из транзакции.
