Repository: tarantool/doc
Catalog: locale/*/LC_MESSAGES/doc.po
Languages: ru

source: Upgrading Tarantool in a replication cluster
ru: Обновление Tarantool'а в репликационном кластере

source: This procedure allows for a rolling upgrade **without downtime** and works for any cluster configuration: master-master or master-replica.
ru: Этот процесс позволяет осуществить последовательное обновление **без простоев** и подходит для любой конфигурации кластера: master-master или мастер-реплика.

source: Upgrade Tarantool at all replicas (or at any master in a master-master cluster). See details in :ref:`Upgrading a Tarantool instance <admin-upgrades_instance>`.
ru: Обновите Tarantool на всех репликах (или на любом мастере в кластере мастер-мастер). Подробные инструкции доступны в подразделе :ref:`Обновление экземпляра Tarantool'а <admin-upgrades_instance>`.

source: Verify installation on the replicas:
ru: Проверьте работу реплик:

source: Start Tarantool.
ru: Запустите Tarantool.

source: Attach to the master and start working as before.
ru: Присоединитесь к мастеру и начните работать, как раньше.

source: The master runs the old Tarantool version, which is always compatible with the next major version.
ru: На мастере установлена старая версия Tarantool'а, которая всегда совместима со следующей мажорной версией.

source: Upgrade the master. The procedure is similar to upgrading a replica.
ru: Обновите мастер. Процесс такой же, как и при обновлении реплики.

source: Verify master installation:
ru: Проверьте работу мастера:

source: Start Tarantool with replica configuration to catch up.
ru: Запустите Tarantool в режиме реплики для получения последней версии данных.

source: Switch to master mode.
ru: Переключитесь в режим мастера.

source: Upgrade the database on any master node in the cluster. Make the request ``box.schema.upgrade()``. This updates Tarantool system spaces to match the currently installed version of Tarantool. Changes are propagated to other nodes via the regular replication mechanism.
ru: Обновите базу данных на любом мастере в кластере. Выполните команду ``box.schema.upgrade()``. Это обновит системные спейсы Tarantool'а так, чтобы они совпадали с текущей установленной версией Tarantool'а. Изменения распространятся на другие узлы кластера через обычный механизм репликации.

source: Contributing a module
ru: Добавление собственного модуля

source: We have already discussed :ref:`how to create a simple module in Lua for local usage <app_server-modules>`. Now let's discuss how to create a more advanced Tarantool module and then get it published on `Tarantool rocks page <http://tarantool.org/rocks.html>`_ and included in `official Tarantool images <http://github.com/tarantool/docker>`_ for Docker.
ru: Мы уже обсуждали, :ref:`как создать простой модуль на языке Lua для локального использования <app_server-modules>`.Теперь давайте обсудим, как создать модуль более продвинутого уровня для Tarantool'а, а затем разместить его на странице модулей Tarantool'а <http://tarantool.org/rocks.html>`_ и включить его в `официальные образы Tarantool'а <http://github.com/tarantool/docker>`_ для Docker.

source: To help our contributors, we have created `modulekit <http://github.com/tarantool/modulekit>`_, a set of templates for creating Tarantool modules in Lua and C.
ru: Чтобы помочь разработчикам, мы создали `modulekit <http://github.com/tarantool/modulekit>`_, набор шаблонов для создания Tarantool-модулей на Lua и C.

source: As a prerequisite for using ``modulekit``, install ``tarantool-dev`` package first. For example, in Ubuntu say:
ru: Чтобы использовать ``modulekit``, необходимо предварительно установить пакет ``tarantool-dev``. Например, в Ubuntu выполните команду:

source: Contributing a module in Lua
ru: Добавление собственного модуля на Lua

source: See `README in "luakit" branch of tarantool/modulekit repository <http://github.com/tarantool/modulekit/blob/luakit/README.md>`_ for detailed instructions and examples.
ru: Подробную информацию и примеры см. в `README в ветке "luakit" репозитория tarantool/modulekit <http://github.com/tarantool/modulekit/blob/luakit/README.md>`_.

source: Contributing a module in C
ru: Добавление собственного модуля на C

source: In some cases, you may want to create a Tarantool module in C rather than in Lua. For example, to work with specific hardware or low-level system interfaces.
ru: В некоторых случаях может потребоваться создание Tarantool-модуля на C, а не на Lua, например, для работы со специальным оборудованием или низкоуровневыми системными интерфейсами.

source: See `README in "ckit" branch of tarantool/modulekit repository <http://github.com/tarantool/modulekit/blob/ckit/README.md>`_ for detailed instructions and examples.
ru: Подробную информацию и примеры см. в `README в ветке "ckit" репозитория tarantool/modulekit <http://github.com/tarantool/modulekit/blob/ckit/README.md>`_.

source: You can also create modules with C++, provided that the code does not throw exceptions.
ru: Вы можете аналогичным образом создавать модули на C++ при условии, что в их коде не будут выбрасываться исключения.

source: Cookbook recipes
ru: Примеры и рекомендации по разработке

source: Here are contributions of Lua programs for some frequent or tricky situations.
ru: Ниже представлены дополнения в виде Lua-программ для часто встречающихся или сложных случаев.

source: You can execute any of these programs by copying the code into a ``.lua`` file, and then entering :samp:`chmod +x ./{program-name}.lua` and :samp:`./{program-name}.lua` on the terminal.
ru: Любую из этих программ можно выполнить, скопировав код в ``.lua-файл``, а затем выполнив в командной строке :samp:`chmod +x ./{имя-программы}.lua` и :samp :`./{имя-программы}.lua`.

source: The first line is a "hashbang":
ru: Первая строка -- это шебанг:

source: This runs Tarantool Lua application server, which should be on the execution path.
ru: Он запускает сервер приложений Tarantool'а на языке Lua, который должен быть в пути выполнения.

source: This section contains the following recipes:
ru: В этом разделе собраны следующие рецепты:

source: Use freely.
ru: Можно использовать свободно.

source: The standard example of a simple program.
ru: Стандартный пример простой программы.

source: Use :ref:`box.once() <box-once>` to initialize a database (creating spaces) if this is the first time the server has been run. Then use :ref:`console.start() <console-start>` to start interactive mode.
ru: Для инициализации базы данных (создания спейсов) используйте :ref:`box.once() <box-once>`, если сервер запускается впервые. Затем используйте :ref:`console.start() <console-start>`, чтобы запустить интерактивный режим.

source: #!/usr/bin/env tarantool -- Configure database box.cfg { listen = 3313 } box.once("bootstrap", function() box.schema.space.create('tweedledum') box.space.tweedledum:create_index('primary', { type = 'TREE', parts = {1, 'unsigned'}}) end) require('console').start()
ru: #!/usr/bin/env tarantool -- Настроить базу данных box.cfg { listen = 3313 } box.once("bootstrap", function() box.schema.space.create('tweedledum') box.space.tweedledum:create_index('primary', { type = 'TREE', parts = {1, 'unsigned'}}) end) require('console').start()

source: Use the :ref:`fio module <fio-module>` to open, read, and close a file.
ru: Используйте :ref:`Модуль fio <fio-module>`, чтобы открыть, прочитать и закрыть файл.

source: Use the :ref:`fio module <fio-module>` to open, write, and close a file.
ru: Используйте :ref:`Модуль fio <fio-module>`, чтобы открыть, записать данные и закрыть файл.

source: Use the `LuaJIT ffi library <http://luajit.org/ext_ffi.html>`_ to call a C built-in function: printf(). (For help understanding ffi, see the `FFI tutorial <http://luajit.org/ext_ffi_tutorial.html>`_.)
ru: Используйте `Библиотеку LuaJIT FFI <http://luajit.org/ext_ffi.html>`_, чтобы вызвать встроенную в C функцию: printf(). (Чтобы лучше понимать FFI, см. `Учебное пособие по FFI <http://luajit.org/ext_ffi_tutorial.html>`_.)

source: Use the `LuaJIT ffi library <http://luajit.org/ext_ffi.html>`_ to call a C function: gettimeofday(). This delivers time with millisecond precision, unlike the time function in Tarantool's :ref:`clock module <clock-module>`.
ru: Используйте `Библиотеку LuaJIT FFI <http://luajit.org/ext_ffi.html>`_, чтобы вызвать встроенную в C функцию: gettimeofday(). Она позволяет получить значение времени с точностью в миллисекундах, в отличие от функции времени в Tarantool'е :ref:`Модуль clock <clock-module>`.

source: Use the `LuaJIT ffi library <http://luajit.org/ext_ffi.html>`_ to call a C library function. (For help understanding ffi, see the `FFI tutorial <http://luajit.org/ext_ffi_tutorial.html>`_.)
ru: Используйте `Библиотеку LuaJIT FFI <http://luajit.org/ext_ffi.html>`_, чтобы вызвать библиотечную функцию в C. (Чтобы лучше понимать FFI, см. `Учебное пособие по FFI <http://luajit.org/ext_ffi_tutorial.html>`_.)

source: #!/usr/bin/env tarantool local ffi = require("ffi") ffi.cdef[[ unsigned long compressBound(unsigned long sourceLen); int compress2(uint8_t *dest, unsigned long *destLen, const uint8_t *source, unsigned long sourceLen, int level); int uncompress(uint8_t *dest, unsigned long *destLen, const uint8_t *source, unsigned long sourceLen); ]] local zlib = ffi.load(ffi.os == "Windows" and "zlib1" or "z") -- Lua wrapper for compress2() local function compress(txt) local n = zlib.compressBound(#txt) local buf = ffi.new("uint8_t[?]", n) local buflen = ffi.new("unsigned long[1]", n) local res = zlib.compress2(buf, buflen, txt, #txt, 9) assert(res == 0) return ffi.string(buf, buflen[0]) end -- Lua wrapper for uncompress local function uncompress(comp, n) local buf = ffi.new("uint8_t[?]", n) local buflen = ffi.new("unsigned long[1]", n) local res = zlib.uncompress(buf, buflen, comp, #comp) assert(res == 0) return ffi.string(buf, buflen[0]) end -- Simple test code. local txt = string.rep("abcd", 1000) print("Uncompressed size: ", #txt) local c = compress(txt) print("Compressed size: ", #c) local txt2 = uncompress(c, #txt) assert(txt2 == txt)
ru: #!/usr/bin/env tarantool local ffi = require("ffi") ffi.cdef[[ unsigned long compressBound(unsigned long sourceLen); int compress2(uint8_t *dest, unsigned long *destLen, const uint8_t *source, unsigned long sourceLen, int level); int uncompress(uint8_t *dest, unsigned long *destLen, const uint8_t *source, unsigned long sourceLen); ]] local zlib = ffi.load(ffi.os == "Windows" and "zlib1" or "z") -- Надстройка Lua для функции compress2() local function compress(txt) local n = zlib.compressBound(#txt) local buf = ffi.new("uint8_t[?]", n) local buflen = ffi.new("unsigned long[1]", n) local res = zlib.compress2(buf, buflen, txt, #txt, 9) assert(res == 0) return ffi.string(buf, buflen[0]) end -- Надстройка Lua для функции uncompress local function uncompress(comp, n) local buf = ffi.new("uint8_t[?]", n) local buflen = ffi.new("unsigned long[1]", n) local res = zlib.uncompress(buf, buflen, comp, #comp) assert(res == 0) return ffi.string(buf, buflen[0]) end -- Простой код тестов local txt = string.rep("abcd", 1000) print("Uncompressed size: ", #txt) local c = compress(txt) print("Compressed size: ", #c) local txt2 = uncompress(c, #txt) assert(txt2 == txt)

source: Use the `LuaJIT ffi library <http://luajit.org/ext_ffi.html>`_ to access a C object via a metamethod (a method which is defined with a metatable).
ru: Используйте `Библиотеку LuaJIT FFI <http://luajit.org/ext_ffi.html>`_, чтобы получить доступ к объекту в C с помощью метаметода (метод, который определен метатаблицей).

source: Create Lua tables, and print them. Notice that for the 'array' table the iterator function is ipairs(), while for the 'map' table the iterator function is pairs(). (`ipairs()` is faster than `pairs()`, but pairs() is recommended for map-like tables or mixed tables.) The display will look like: "1 Apple | 2 Orange | 3 Grapefruit | 4 Banana | k3 v3 | k1 v1 | k2 v2".
ru: Используйте, чтобы создать Lua-таблицы и вывести их. Следует отметить, что для таблицы типа массива (array) функция-итератор будет ipairs(), а для таблицы типа ассоциативного массива (map) функция-итератор -- pairs(). (`ipairs()` быстрее, чем `pairs()`, но pairs() рекомендуется для ассоциативных массивов или смешанных таблиц.) Результат будет выглядеть следующим образом: "1 Apple | 2 Orange | 3 Grapefruit | 4 Banana | k3 v3 | k1 v1 | k2 v2".

source: Use the '#' operator to get the number of items in an array-like Lua table. This operation has O(log(N)) complexity.
ru: Используйте оператор '#', чтобы получить количество элементов в Lua-таблице типа массива. У этой операции сложность O(log(N)).

source: Missing elements in arrays, which Lua treats as "nil"s, cause the simple "#" operator to deliver improper results. The "print(#t)" instruction will print "4"; the "print(counter)" instruction will print "3"; the "print(max)" instruction will print "10". Other table functions, such as table.sort(), will also misbehave when "nils" are present.
ru: Отсутствующие элементы в массивах, которые Lua рассматривает как nil, заставляют простой оператор '#' выдавать неправильные результаты. Команда "print(#t)" выведет "4", команда "print(counter)" выведет "3", а команда "print(max)" -- "10". Другие табличные функции, такие как table.sort(), также сработают неправильно при наличии значений nils.

source: Use explicit ``NULL`` values to avoid the problems caused by Lua's nil == missing value behavior. Although :code:`json.NULL == nil` is :code:`true`, all the print instructions in this program will print the correct value: 10.
ru: Используйте явные значения``NULL``, чтобы избежать проблем, вызванных nil в Lua == поведение с пропущенными значениями. Хотя :code:`json.NULL == nil` является :code:`true`, все команды вывода в данной программе выведут правильное значение: 10.

source: Get the number of elements in a map-like table.
ru: Программа используется для получения количества элементов в таблице типа ассоциативного массива.

source: Use a Lua peculiarity to swap two variables without needing a third variable.
ru: Программа использует особенность Lua менять местами две переменные без необходимости использования третьей переменной.

source: Create a class, create a metatable for the class, create an instance of the class. Another illustration is at `http://lua-users.org/wiki/LuaClassesWithMetatable <http://lua-users.org/wiki/LuaClassesWithMetatable>`_.
ru: Используется для создания класса, метатаблицы для класса, экземпляра класса. Другой пример можно найти в `http://lua-users.org/wiki/LuaClassesWithMetatable <http://lua-users.org/wiki/LuaClassesWithMetatable>`_.

source: #!/usr/bin/env tarantool -- define class objects local myclass_somemethod = function(self) print('test 1', self.data) end local myclass_someothermethod = function(self) print('test 2', self.data) end local myclass_tostring = function(self) return 'MyClass <'..self.data..'>' end local myclass_mt = { __tostring = myclass_tostring; __index = { somemethod = myclass_somemethod; someothermethod = myclass_someothermethod; } } -- create a new object of myclass local object = setmetatable({ data = 'data'}, myclass_mt) print(object:somemethod()) print(object.data)
ru: #!/usr/bin/env tarantool -- определить объекты класса local myclass_somemethod = function(self) print('test 1', self.data) end local myclass_someothermethod = function(self) print('test 2', self.data) end local myclass_tostring = function(self) return 'MyClass <'..self.data..'>' end local myclass_mt = { __tostring = myclass_tostring; __index = { somemethod = myclass_somemethod; someothermethod = myclass_someothermethod; } } -- создать новый объект своего класса myclass local object = setmetatable({ data = 'data'}, myclass_mt) print(object:somemethod()) print(object.data)

source: Start one fiber for producer and one fiber for consumer. Use :ref:`fiber.channel() <fiber_ipc-channel>` to exchange data and synchronize. One can tweak the channel size (:code:`ch_size` in the program code) to control the number of simultaneous tasks waiting for processing.
ru: Запустите один файбер для производителя и один файбер для потребителя. Используйте :ref:`fiber.channel() <fiber_ipc-channel>` для обмена данных и синхронизации. Можно настроить ширину канала (:code:`ch_size` в программном коде) для управления количеством одновременных задач к обработке.

source: #!/usr/bin/env tarantool local fiber = require('fiber') local function consumer_loop(ch, i) -- initialize consumer synchronously or raise an error() fiber.sleep(0) -- allow fiber.create() to continue while true do local data = ch:get() if data == nil then break end print('consumed', i, data) fiber.sleep(math.random()) -- simulate some work end end local function producer_loop(ch, i) -- initialize consumer synchronously or raise an error() fiber.sleep(0) -- allow fiber.create() to continue while true do local data = math.random() ch:put(data) print('produced', i, data) end end local function start() local consumer_n = 5 local producer_n = 3 -- Create a channel local ch_size = math.max(consumer_n, producer_n) local ch = fiber.channel(ch_size) -- Start consumers for i=1, consumer_n,1 do fiber.create(consumer_loop, ch, i) end -- Start producers for i=1, producer_n,1 do fiber.create(producer_loop, ch, i) end end start() print('started')
ru: #!/usr/bin/env tarantool local fiber = require('fiber') local function consumer_loop(ch, i) -- инициализировать потребитель синхронно или выдать ошибку() fiber.sleep(0) -- позволить fiber.create() продолжать while true do local data = ch:get() if data == nil then break end print('consumed', i, data) fiber.sleep(math.random()) -- моделировать работу end end local function producer_loop(ch, i) -- инициализировать потребитель синхронно или выдать ошибку() fiber.sleep(0) -- allow fiber.create() to continue while true do local data = math.random() ch:put(data) print('produced', i, data) end end local function start() local consumer_n = 5 local producer_n = 3 -- создать канал local ch_size = math.max(consumer_n, producer_n) local ch = fiber.channel(ch_size) -- запустить потребители for i=1, consumer_n,1 do fiber.create(consumer_loop, ch, i) end -- запустить производители for i=1, producer_n,1 do fiber.create(producer_loop, ch, i) end end start() print('started')

source: Use :ref:`socket.tcp_connect() <socket-tcp_connect>` to connect to a remote host via TCP. Display the connection details and the result of a GET request.
ru: Используйте :ref:`socket.tcp_connect() <socket-tcp_connect>` для подключения к удаленному серверу по TCP. Можно отобразить информацию о подключении и результат запроса GET.

source: Use :ref:`socket.tcp_connect() <socket-tcp_connect>` to set up a simple TCP server, by creating a function that handles requests and echos them, and passing the function to :ref:`socket.tcp_server() <socket-tcp_server>`. This program has been used to test with 100,000 clients, with each client getting a separate fiber.
ru: Используйте :ref:`socket.tcp_connect() <socket-tcp_connect>` для настройки простого TCP-сервера путем создания функции, которая обрабатывает запросы и отражает их, а затем передачи функции на :ref:`socket.tcp_server() <socket-tcp_server>`. Данная программа была протестирована на 100 000 клиентов, каждый из которых получил отдельный файбер.

source: #!/usr/bin/env tarantool local function handler(s, peer) s:write("Welcome to test server, " .. peer.host .."\n") while true do local line = s:read('\n') if line == nil then break -- error or eof end if not s:write("pong: "..line) then break -- error or eof end end end local server, addr = require('socket').tcp_server('localhost', 3311, handler)
ru: #!/usr/bin/env tarantool local function handler(s, peer) s:write("Welcome to test server, " .. peer.host .."\n") while true do local line = s:read('\n') if line == nil then break -- ошибка или eof end if not s:write("pong: "..line) then break -- ошибка или eof end end end local server, addr = require('socket').tcp_server('localhost', 3311, handler)

source: Use :ref:`socket.getaddrinfo() <socket-getaddrinfo>` to perform non-blocking DNS resolution, getting both the AF_INET6 and AF_INET information for 'google.com'. This technique is not always necessary for tcp connections because :ref:`socket.tcp_connect() <socket-tcp_connect>` performs `socket.getaddrinfo` under the hood, before trying to connect to the first available address.
ru: Используйте :ref:`socket.getaddrinfo() <socket-getaddrinfo>`, чтобы провести неблокирующее разрешение имен DNS, получая как AF_INET6, так и AF_INET информацию для 'google.com'. Данная техника не всегда необходима для TCP-соединений, поскольку :ref:`socket.tcp_connect() <socket-tcp_connect>` выполняет `socket.getaddrinfo` с точки зрения внутреннего устройства до попытки соединения с первым доступным адресом.

source: Tarantool does not currently have a `udp_server` function, therefore socket_udp_echo.lua is more complicated than socket_tcp_echo.lua. It can be implemented with sockets and fibers.
ru: В данный момент в Tarantool нет функции `udp_server`, поэтому socket_udp_echo.lua -- более сложная программа, чем socket_tcp_echo.lua. Ее можно реализовать с помощью сокетов и файберов.

source: #!/usr/bin/env tarantool local socket = require('socket') local errno = require('errno') local fiber = require('fiber') local function udp_server_loop(s, handler) fiber.name("udp_server") while true do -- try to read a datagram first local msg, peer = s:recvfrom() if msg == "" then -- socket was closed via s:close() break elseif msg ~= nil then -- got a new datagram handler(s, peer, msg) else if s:errno() == errno.EAGAIN or s:errno() == errno.EINTR then -- socket is not ready s:readable() -- yield, epoll will wake us when new data arrives else -- socket error local msg = s:error() s:close() -- save resources and don't wait GC error("Socket error: " .. msg) end end end end local function udp_server(host, port, handler) local s = socket('AF_INET', 'SOCK_DGRAM', 0) if not s then return nil -- check errno:strerror() end if not s:bind(host, port) then local e = s:errno() -- save errno s:close() errno(e) -- restore errno return nil -- check errno:strerror() end fiber.create(udp_server_loop, s, handler) -- start a new background fiber return s end
ru: #!/usr/bin/env tarantool local socket = require('socket') local errno = require('errno') local fiber = require('fiber') local function udp_server_loop(s, handler) fiber.name("udp_server") while true do -- попытка прочитать сначала датаграмму local msg, peer = s:recvfrom() if msg == "" then -- сокет был закрыт с помощью s:close() break elseif msg ~= nil then -- получена новая датаграмма handler(s, peer, msg) else if s:errno() == errno.EAGAIN or s:errno() == errno.EINTR then -- сокет не готов s:readable() -- передача управления, epoll сообщит, когда будут новые данные else -- ошибка сокета local msg = s:error() s:close() -- сохранить ресурсы и не ждать сборку мусора error("Socket error: " .. msg) end end end end local function udp_server(host, port, handler) local s = socket('AF_INET', 'SOCK_DGRAM', 0) if not s then return nil -- проверить номер ошибки errno:strerror() end if not s:bind(host, port) then local e = s:errno() -- сохранить номер ошибки errno s:close() errno(e) -- восстановить номер ошибки errno return nil -- проверить номер ошибки errno:strerror() end fiber.create(udp_server_loop, s, handler) -- запустить новый файбер в фоновом режиме return s end

source: A function for a client that connects to this server could look something like this ...
ru: Функция для клиента, который подключается к этому серверу, может выглядеть следующим образом:
