Repository: tarantool/doc
Catalog: locale/*/LC_MESSAGES/doc.po
Languages: ru

source: The 'Info' line is not present because the ``log_level`` is 3.
ru: Строка 'Info' отсутствует, потому что ``log_level`` -- 3.

source: Module `msgpack`
ru: Модуль `msgpack`

source: The ``msgpack`` module takes strings in MsgPack_ format and decodes them, or takes a series of non-MsgPack values and encodes them. Tarantool makes heavy internal use of MsgPack because tuples in Tarantool are :ref:`stored <index-box_lua-vs-msgpack>` as MsgPack arrays.
ru: Модуль ``msgpack`` берет строки в формате MsgPack_ и декодирует их или берет ряд значений в ином формате и кодирует их в формат MsgPack. MsgPack интенсивно используется в Tarantool'е, поскольку кортежи :ref:`хранятся <index-box_lua-vs-msgpack>` в виде массивов в формате MsgPack.

source: Below is a list of all ``msgpack`` functions and members.
ru: Ниже приведен перечень всех функций и элементов модуля ``msgpack``.

source: Convert a Lua object to an MsgPack string
ru: Конвертация Lua-объекта в MsgPack-строку

source: Convert a MsgPack string to a Lua object
ru: Конвертация MsgPack-строки в Lua-объект

source: Convert a Lua object to a MsgPack string.
ru: Конвертация Lua-объекта в MsgPack-строку.

source: the original value reformatted as a MsgPack string.
ru: оригинальное значение, преобразованное в MsgPack-строку.

source: Convert a MsgPack string to a Lua object.
ru: Конвертация MsgPack-строки в Lua-объект.

source: a string formatted as MsgPack.
ru: строка в формате MsgPack.

source: Convert a MsgPack string to a Lua object. Because checking is skipped, ``decode_unchecked()`` can operate with string pointers to buffers which ``decode()`` cannot handle. For an example see the :ref:`buffer <buffer-module>` module.
ru: Конвертация MsgPack-строки в Lua-объект. Поскольку проверка не проводится, ``decode_unchecked()`` может работать с указателями строки в буфере в отличие от ``decode()``. Пример см. в модуле :ref:`buffer <buffer-module>`.

source: the original contents formatted as a Lua table;
ru: оригинальное содержание в формате Lua-таблицы;

source: the number of bytes that were decoded.
ru: количество декодированных байтов.

source: lua object
ru: Lua-объект.

source: The MsgPack output structure can be specified with ``__serialize``:
ru: Структуру MsgPack-вывода можно указать с помощью ``__serialize``:

source: ``__serialize = "seq" or "sequence"`` for an array
ru: ``__serialize = "seq" или "sequence"`` для массива

source: ``__serialize = "map" or "mapping"`` for a map
ru: ``__serialize = "map" или "mapping"`` для ассоциативного массива

source: Serializing 'A' and 'B' with different ``__serialize`` values causes different results. To show this, here is a routine which encodes `{'A','B'}` both as an array and as a map, then displays each result in hexadecimal.
ru: Сериализация 'A' и' B' различными значениями ``__serialize`` приводит к различным результатам. Чтобы показать различия, ниже приведена процедура кодирования `{'A','B'}` в массив и в ассоциативный массив с выводом каждого результата в виде шестнадцатеричного числа.

source: **Result:**
ru: **Результат:**

source: The MsgPack Specification_ page explains that the first encoding means:
ru: На странице спецификации MsgPack по ссылке Specification_ объясняется, что значение первого результата кодирования:

source: and the second encoding means:
ru: а значение второго результата кодирования:

source: Here are examples for all the common types, with the Lua-table representation on the left, with the MsgPack format name and encoding on the right.
ru: Ниже приведены примеры всех стандартных типов: слева отображение в Lua-таблице, а справа -- имя и кодировка в формате MsgPack.

source: **Common Types and MsgPack Encodings**
ru: **Стандартные типы в MsgPack-кодировке**

source: 'fixmap' if metatable is 'map' = 80 otherwise 'fixarray' = 90
ru: 'fixmap' = 80, если метатаблица -- ассоциативный массив 'map', в противном случае, 'fixarray' = 90

source: same as nil
ru: то же, что и nil

source: 'fixmap(1)' + 'positive fixint' (for the key) + 'positive fixint' (for the value) = 81 00 05
ru: 'fixmap(1)' + 'positive fixint' (для ключа) + 'positive fixint' (для значения) = 81 00 05

source: 'fixmap(0)' = 80 -- nil is not stored when it is a missing map value
ru: 'fixmap(0)' = 80 -- nil не хранится, если это отсутствующее значение ассоциативного массива

source: Also, some MsgPack configuration settings for encoding can be changed, in the same way that they can be changed for :ref:`JSON <json-module_cfg>`.
ru: Кроме того, некоторые параметры конфигурации MsgPack для кодировки можно изменить так же, как и для :ref:`JSON <json-module_cfg>`.

source: Module `net.box`
ru: Модуль `net.box`

source: You can call the following methods:
ru: Можно вызвать следующие методы:

source: ``require('net.box')`` to get a ``net.box`` object (named ``net_box`` for examples in this section),
ru: ``require('net.box')`` для получения объекта ``net.box`` (который называется ``net_box`` для примеров в данном разделе),

source: ``net_box.connect()`` to connect and get a connection object (named ``conn`` for examples in this section),
ru: ``net_box.connect()`` для подключения и получения объекта подключения (который называется ``conn`` для примеров в данном разделе),

source: ``conn:close`` to disconnect.
ru: ``conn:close`` для отключения.

source: Most ``net.box`` methods allow a final ``{options}`` argument, which can be:
ru: В большинстве методов ``net.box`` можно использовать заключительный аргумент ``{options}``, который может быть:

source: ``{timeout=...}``. For example, a method whose final argument is ``{timeout=1.5}`` will stop after 1.5 seconds on the local node, although this does not guarantee that execution will stop on the remote server node.
ru: ``{timeout=...}``. Например, метод с заключительным аргументом ``{timeout=1.5}`` остановится через 1,5 секунды на локальном узле, хотя это не гарантирует, что выполнение остановится на удаленном сервере.

source: ``{buffer=...}``. For an example see :ref:`buffer module <buffer-module>`.
ru: ``{buffer=...}``. Например, см. :ref:`модуль buffer <buffer-module>`.

source: The diagram below shows possible connection states and transitions:
ru: На диаграмме ниже представлены возможные состояния и варианты перехода из одного состояния в другое:

source: On this diagram:
ru: На этой диаграмме:

source: The state machine starts in the 'initial' state.
ru: Работа начинается с начального состояния 'initial'.

source: ``net_box.connect()`` method changes the state to 'connecting' and spawns a worker fiber.
ru: Выполнение метода ``net_box.connect()`` переводит состояние в 'connecting', создается рабочий файбер.

source: If authentication and schema upload are required, it's possible later on to re-enter the 'fetch_schema' state from 'active' if a request fails due to a schema version mismatch error, so schema reload is triggered.
ru: Если требуются аутентификация и загрузка схемы, можно позднее повторно войти в состояние загрузки схемы 'fetch_schema' из активного 'active', если запрос не будет выполнен из-за ошибки несовпадения версий схемы, то есть будет вызвана перезагрузка схемы.

source: ``conn.close()`` method sets the state to 'closed' and kills the worker. If the transport is already in the 'error' state, ``close()`` does nothing.
ru: Метод ``conn.close()`` изменяет состояние на закрытое 'closed' и отключает рабочий процесс. Если транспорт уже находится в состоянии ошибки 'error', ``close()`` не делает ничего.

source: Below is a list of all ``net.box`` functions.
ru: Ниже приведен перечень всех функций модуля ``net.box``.

source: Create a connection
ru: Создание подключения

source: Execute a PING command
ru: Выполнение команды проверки состояния PING

source: Wait for a connection to be active or closed
ru: Ожидание активности или закрытия подключения

source: Check if a connection is active or closed
ru: Проверка активности или закрытия подключения

source: Wait for a target state
ru: Ожидание нужного состояния

source: Close a connection
ru: Закрытие подключения

source: Call a stored procedure
ru: Вызов хранимой процедуры

source: Evaluate and execute the expression in a string
ru: Оценка и выполнение выражения в строке

source: Set a timeout
ru: Установка времени ожидания

source: Create a new connection. The connection is established on demand, at the time of the first request. It can be re-established automatically after a disconnect (see ``reconnect_after`` option below). The returned ``conn`` object supports methods for making remote requests, such as select, update or delete.
ru: Создание нового подключения. Подключение устанавливается по требованию во время первого запроса. Можно повторно установить подключение автоматически после отключения (см. ниже опцию ``reconnect_after``). Возвращается объект ``conn``, который поддерживает методы создание удаленных запросов, таких как select, update или delete.

source: For a local Tarantool server, there is a pre-created always-established connection object named :samp:`{net_box}.self`. Its purpose is to make polymorphic use of the ``net_box`` API easier. Therefore :samp:`conn = {net_box}.connect('localhost:3301')` can be replaced by :samp:`conn = {net_box}.self`. However, there is an important difference between the embedded connection and a remote one. With the embedded connection, requests which do not modify data do not yield. When using a remote connection, due to :ref:`the implicit rules <atomic-implicit-yields>` any request can yield, and database state may have changed by the time it regains control.
ru: Для локального Tarantool-сервера есть заданный объект всегда установленного подключения под названием :samp:`{net_box}.self`. Он создан с целью облегчить полиморфное использование API модуля ``net_box``. Таким образом, :samp:`conn = {net_box}.connect('localhost:3301')` можно заменить на :samp:`conn = {net_box}.self`. Однако, есть важно отличие встроенного подключения от удаленного. При встроенном подключении запросы без изменения данных не передают управление. При использовании удаленного подключения любой запрос может передавать управление исходя из :ref:`правил неявной передачи управления <atomic-implicit-yields>`, и состояние базы данных может измениться к тому времени, как управление вернется.

source: Possible options:
ru: Возможные опции

source: `wait_connected`: by default, connection creation is blocked until the connection is established, but passing ``wait_connected=false`` makes it return immediately. Also, passing a timeout makes it wait before returning (e.g. ``wait_connected=1.5`` makes it wait at most 1.5 seconds).
ru: `wait_connected`: по умолчанию, создание подключения блокируется до тех пор, пока подключение не будет установлено, но передача ``wait_connected=false`` заставит метод сразу же вернуться. Передача времени ожидания заставит метод ждать до возвращения (например, ``wait_connected=1.5`` заставит ожидать подключения максимум 1,5 секунды).

source: In the presence of ``reconnect_after``, ``wait_connected`` ignores transient failures. The wait completes once the connection is established or is closed explicitly.
ru: Если присутствует ``reconnect_after``, ``wait_connected`` проигнорирует неустойчивые отказы. Ожидание заканчивается, когда подключение установлено или явным образом закрыто.

source: `call_16`: [since 1.7.2] by default, ``net.box`` connections comply with a new binary protocol command for CALL, which is not backward compatible with previous versions. The new CALL no longer restricts a function to returning an array of tuples and allows returning an arbitrary MsgPack/JSON result, including scalars, nil and void (nothing). The old CALL is left intact for backward compatibility. It will be removed in the next major release. All programming language drivers will be gradually changed to use the new CALL. To connect to a Tarantool instance that uses the old CALL, specify ``call_16=true``.
ru: `call_16`: [с 1.7.2] по умолчанию, подключения ``net.box`` соответствуют команде CALL нового бинарного протокола, который не поддерживает обратную совместимость с предыдущими версиями. Команда нового бинарного протокола для вызова CALL больше не ограничивает функцию в возврате массива кортежей и позволяет возвращать произвольный результат в формате MsgPack/JSON, включая scalar (скалярные значения), nil (нулевые значения) и void (пусто). Старый метод CALL оставлен нетронутым для обратной совместимости. В следующей основной версии он будет удален. Все драйверы для языков программирования будут постепенно переведены на использование нового метода CALL. Для подключения к экземпляру Tarantool'а, в котором используется старый метод CALL, укажите ``call_16=true``.

source: `console`: depending on the option's value, the connection supports different methods (as if instances of different classes were returned). With ``console = true``, you can use ``conn`` methods ``close()``, ``is_connected()``, ``wait_state()``, ``eval()`` (in this case, both binary and Lua console network protocols are supported). With ``console = false`` (default), you can also use ``conn`` database methods (in this case, only the binary protocol is supported).
ru: `console`: в зависимости от значения параметра поддерживаются различные методы (как если бы возвращались экземпляры разных классов). Если ``console = true``, можно использовать методы ``conn``: ``close()``, ``is_connected()``, ``wait_state()``, ``eval()`` (в этом случае поддерживаются и бинарный сетевой протокол, и протокол Lua-консоли). Если ``console = false`` (по умолчанию), также можно использовать методы ``conn`` для работы с базой данных (в этом случае поддерживается только бинарный протокол).

source: `connect_timeout`: number of seconds to wait before returning "error: Connection timed out".
ru: `connect_timeout`: количество секунд ожидания до возврата ошибки "error: Connection timed out".

source: the :ref:`URI <index-uri>` of the target for the connection
ru: :ref:`URI <index-uri>` объекта подключения

source: possible options are `wait_connected`, `reconnect_after`, `call_16` and `console`
ru: возможные опции: `wait_connected`, `reconnect_after`, `call_16` и `console`

source: conn object
ru: объект подключения

source: Execute a PING command.
ru: Выполнение команды проверки состояния PING.

source: true on success, false on error
ru: true (правда), если выполнено, false (ложь) в случае ошибки

source: Wait for connection to be active or closed.
ru: Ожидание активности или закрытия подключения.

source: in seconds
ru: в секундах

source: true when connected, false on failure.
ru: true (правда) при подключении, false (ложь), если не выполнено.

source: Show whether connection is active or closed.
ru: Проверка активности или закрытия подключения.

source: true if connected, false on failure.
ru: true (правда) при подключении, false (ложь), если не выполнено.

source: [since 1.7.2] Wait for a target state.
ru: [с 1.7.2] Ожидание нужного состояния.

source: target states
ru: необходимое состояние

source: true when a target state is reached, false on timeout or connection closure
ru: true (правда) при подключении, false (ложь) при окончании времени ожидания или закрытии подключения

source: -- wait infinitely for 'active' state: conn:wait_state('active') -- wait for 1.5 secs at most: conn:wait_state('active', 1.5) -- wait infinitely for either `active` or `fetch_schema` state: conn:wait_state({active=true, fetch_schema=true})
ru: -- бесконечное ожидание состояния 'active': conn:wait_state('active') -- ожидание в течение максимум 1,5 секунд: conn:wait_state('active', 1.5) -- бесконечное ожидание состояния `active` или `fetch_schema`: conn:wait_state({active=true, fetch_schema=true})

source: Close a connection.
ru: Закрытие подключения.

source: :samp:`conn.space.{space-name}:select`:code:`({...})` is the remote-call equivalent of the local call :samp:`box.space.{space-name}:select`:code:`{...}`.
ru: :samp:`conn.space.{имя-спейса}:select`:code:`({...})` -- это удаленный вызов, аналогичный локальному вызову :samp:`box.space.{имя-спейса}:select`:code:`{...}`.

source: Due to :ref:`the implicit yield rules <atomic-implicit-yields>` a local :samp:`box.space.{space-name}:select`:code:`{...}` does not yield, but a remote :samp:`conn.space.{space-name}:select`:code:`{...}` call does yield, so global variables or database tuples data may change when a remote :samp:`conn.space.{space-name}:select`:code:`{...}` occurs.
ru: Исходя из :ref:`правил неявной передачи управления <atomic-implicit-yields>`, локальный запрос :samp:`box.space.{имя-спейса}:select`:code:`{...}` не передает управление, а удаленный :samp:`conn.space.{имя-спейса}:select`:code:`{...}` передаст, поэтому глобальные переменные или кортежи в базе данных могут измениться во время удаленного :samp:`conn.space.{имя-спейса}:select`:code:`{...}`.

source: :samp:`conn.space.{space-name}:get(...)` is the remote-call equivalent of the local call :samp:`box.space.{space-name}:get(...)`.
ru: :samp:`conn.space.{имя-спейса}:get(...)` -- это удаленный вызов, аналогичный локальному вызову :samp:`box.space.{имя-спейса}:get(...)`.

source: :samp:`conn.space.{space-name}:insert(...)` is the remote-call equivalent of the local call :samp:`box.space.{space-name}:insert(...)`.
ru: :samp:`conn.space.{имя-спейса}:insert(...)` -- это удаленный вызов, аналогичный локальному вызову :samp:`box.space.{имя-спейса}:insert(...)`.

source: :samp:`conn.space.{space-name}:replace(...)` is the remote-call equivalent of the local call :samp:`box.space.{space-name}:replace(...)`.
ru: :samp:`conn.space.{имя-спейса}:replace(...)` -- это удаленный вызов, аналогичный локальному вызову :samp:`box.space.{имя-спейса}:replace(...)`.

source: :samp:`conn.space.{space-name}:update(...)` is the remote-call equivalent of the local call :samp:`box.space.{space-name}:update(...)`.
ru: :samp:`conn.space.{имя-спейса}:update(...)` -- это удаленный вызов, аналогичный локальному вызову :samp:`box.space.{имя-спейса}:update(...)`.

source: :samp:`conn.space.{space-name}:upsert(...)` is the remote-call equivalent of the local call :samp:`box.space.{space-name}:upsert(...)`.
ru: :samp:`conn.space.{имя-спейса}:upsert(...)` -- это удаленный вызов, аналогичный локальному вызову :samp:`box.space.{имя-спейса}:upsert(...)`.

source: :samp:`conn.space.{space-name}:delete(...)` is the remote-call equivalent of the local call :samp:`box.space.{space-name}:delete(...)`.
ru: :samp:`conn.space.{имя-спейса}:delete(...)` -- это удаленный вызов, аналогичный локальному вызову :samp:`box.space.{имя-спейса}:delete(...)`.

source: ``conn:call('func', {'1', '2', '3'})`` is the remote-call equivalent of ``func('1', '2', '3')``. That is, ``conn:call`` is a remote stored-procedure call.
ru: ``conn:call('func', {'1', '2', '3'})`` -- это удаленный вызов, аналогичный ``func('1', '2', '3')``. Таким образом, ``conn:call`` представляет собой удаленный вызов хранимой процедуры.

source: Limitation: the called function cannot return a function, for example if ``func2`` is defined as ``function func2 () return func end`` then ``conn:call(func2)`` will return "error: unsupported Lua type 'function'".
ru: Ограничение: вызванная функция не может вернуть функцию, например, если ``func2`` определяется как ``function func2 () return func end``, то ``conn:call(func2)`` вернет ошибку "error: unsupported Lua type 'function'".

source: :samp:`conn:eval({Lua-string})` evaluates and executes the expression in Lua-string, which may be any statement or series of statements. An :ref:`execute privilege <authentication-owners_privileges>` is required; if the user does not have it, an administrator may grant it with :samp:`box.schema.user.grant({username}, 'execute', 'universe')`.
ru: :samp:`conn:eval({Lua-строка})` оценивает и выполняет выражение в Lua-строке, которое может представлять собой любое выражение или несколько выражений. Требуются :ref:`права на выполнение <authentication-owners_privileges>`; если у пользователя таких прав нет, администратор может их выдать с помощью :samp:`box.schema.user.grant({имя-пользователя}, 'execute', 'universe')`.

source: ``timeout(...)`` is a wrapper which sets a timeout for the request that follows it. Since version 1.7.4 this method is deprecated -- it is better to pass a timeout value for a method's ``{options}`` parameter.
ru: ``timeout(...)`` -- это надстройка, которая определяет время ожидания для запроса. С версии 1.7.4 этот метод объявлен устаревшим -- лучше передать значение времени ожидания с помощью параметра ``{options}``.

source: Although ``timeout(...)`` is deprecated, all remote calls support its use. Using a wrapper object makes the remote connection API compatible with the local one, removing the need for a separate ``timeout`` argument, which the local version would ignore. Once a request is sent, it cannot be revoked from the remote server even if a timeout expires: the timeout expiration only aborts the wait for the remote server response, not the request itself.
ru: Хотя ``timeout(...)`` объявлен устаревшим, все удаленные вызовы поддерживают его. Использование надстройки обеспечивает совместимость API удаленного соединения с локальным, поэтому отпадает необходимость в отдельном аргументе ``timeout``, который проигнорирует локальная версия. После отправки запроса его нельзя отменить с удаленного сервера даже по истечении времени задержки: окончание времени задержки прерывает только ожидание ответа от удаленного сервера, а не сам запрос.

source: This example shows the use of most of the ``net.box`` methods.
ru: Ниже приводится пример использования большинства методов ``net.box``.

source: The sandbox configuration for this example assumes that:
ru: Данный пример сработает на конфигурации из песочницы, предполагается, что:

source: the Tarantool instance is running on ``localhost 127.0.0.1:3301``,
ru: экземпляр Tarantool'а запущен на ``localhost 127.0.0.1:3301``,

source: there is a space named ``tester`` with a numeric primary key and with a tuple that contains a key value = 800,
ru: создан спейс под названием ``tester`` с первичным числовым ключом и кортежем, в котором есть ключ со значением= 800,

source: the current user has read, write and execute privileges.
ru: у текущего пользователя есть права на чтение, запись и выполнение.

source: Here are commands for a quick sandbox setup:
ru: Ниже приведены команды для быстрой настройки песочницы:

source: And here starts the example:
ru: А здесь приведен пример:

source: Module `os`
ru: Модуль `os`

source: The ``os`` module contains the functions :ref:`execute() <os-execute>`, :ref:`rename() <os-rename>`, :ref:`getenv() <os-getenv>`, :ref:`remove() <os-remove>`, :ref:`date() <os-date>`, :ref:`exit() <os-exit>`, :ref:`time() <os-time>`, :ref:`clock() <os-clock>`, :ref:`tmpname() <os-tmpname>`, :ref:`environ() <os-environ>`, :ref:`setenv() <os-setenv>`, :ref:`setlocale() <os-setlocale>`, :ref:`difftime() <os-difftime>`. Most of these functions are described in the Lua manual Chapter 22 `The Operating System Library <https://www.lua.org/pil/contents.html#22>`_.
ru: Модуль ``os`` включает в себя следующие функции: :ref:`execute() <os-execute>`, :ref:`rename() <os-rename>`, :ref:`getenv() <os-getenv>`, :ref:`remove() <os-remove>`, :ref:`date() <os-date>`, :ref:`exit() <os-exit>`, :ref:`time() <os-time>`, :ref:`clock() <os-clock>`, :ref:`tmpname() <os-tmpname>`, :ref:`environ() <os-environ>`, :ref:`setenv() <os-setenv>`, :ref:`setlocale() <os-setlocale>`, :ref:`difftime() <os-difftime>`. Большинство этих функций описаны в Главе 22 руководства по языку Lua `Библиотека функций операционной системы <https://www.lua.org/pil/contents.html#22>`_.

source: Below is a list of all ``os`` functions.
ru: Ниже приведен перечень всех функций модуля ``os``.

source: Execute by passing to the shell
ru: Выполнение путем передачи в ОС
