Repository: tarantool/doc
Catalog: locale/*/LC_MESSAGES/doc.po
Languages: ru

source: (defun c-lineup-arglist-tabs-only (ignored) "Line up argument lists by tabs, not spaces" (let* ((anchor (c-langelem-pos c-syntactic-element)) (column (c-langelem-2nd-pos c-syntactic-element)) (offset (- (1+ column) anchor)) (steps (floor offset c-basic-offset))) (* (max steps 1) c-basic-offset))) (add-hook 'c-mode-common-hook (lambda () ;; Add kernel style (c-add-style "linux-tabs-only" '("linux" (c-offsets-alist (arglist-cont-nonempty c-lineup-gcc-asm-reg c-lineup-arglist-tabs-only)))))) (add-hook 'c-mode-hook (lambda () (let ((filename (buffer-file-name))) ;; Enable kernel mode for the appropriate files (when (and filename (string-match (expand-file-name "~/src/linux-trees") filename)) (setq indent-tabs-mode t) (c-set-style "linux-tabs-only")))))
ru: (defun c-lineup-arglist-tabs-only (ignored) "Line up argument lists by tabs, not spaces" (let* ((anchor (c-langelem-pos c-syntactic-element)) (column (c-langelem-2nd-pos c-syntactic-element)) (offset (- (1+ column) anchor)) (steps (floor offset c-basic-offset))) (* (max steps 1) c-basic-offset))) (add-hook 'c-mode-common-hook (lambda () ;; Добавить стиль ядра (c-add-style "linux-tabs-only" '("linux" (c-offsets-alist (arglist-cont-nonempty c-lineup-gcc-asm-reg c-lineup-arglist-tabs-only)))))) (add-hook 'c-mode-hook (lambda () (let ((filename (buffer-file-name))) ;; Включить режим ядра для соответсвующих файлов (when (and filename (string-match (expand-file-name "~/src/linux-trees") filename)) (setq indent-tabs-mode t) (c-set-style "linux-tabs-only")))))

source: This will make emacs go better with the kernel coding style for C files below ~/src/linux-trees.
ru: Это заставит emacs лучше работать со стилем программирования ядра для файлов C в ~/src/linux-trees.

source: But even if you fail in getting emacs to do sane formatting, not everything is lost: use "indent".
ru: Но даже если вам не удастся заставить emacs форматировать нормально, не все потеряно: используйте "indent".

source: Now, again, GNU indent has the same brain-dead settings that GNU emacs has, which is why you need to give it a few command line options. However, that's not too bad, because even the makers of GNU indent recognize the authority of K&R (the GNU people aren't evil, they are just severely misguided in this matter), so you just give indent the options "-kr -i8" (stands for "K&R, 8 character indents"), or use "scripts/Lindent", which indents in the latest style.
ru: Опять же, у GNU indent такие же безмозглые настройки, как и у GNU emacs, поэтому надо задать для него несколько параметров командной строки. Тем не менее, это не так уж плохо, потому что даже разработчики GNU indent признают авторитет K&R (люди из GNU не злые, они просто серьезно ошибаются в этом вопросе), поэтому вы просто указываете опции "-kr -i8" (означает "K&R, 8 символов отступа") или используйте "scripts/Lindent", которые делают отступы в новейшем стиле.

source: "indent" has a lot of options, and especially when it comes to comment re-formatting you may want to take a look at the man page. But remember: "indent" is not a fix for bad programming.
ru: В "indent" есть много опций, и особенно когда дело доходит до повторного форматирования комментариев, вы можете захотеть взглянуть на страницу руководства. Но помните: "indent" -- это не залог хорошего программирования.

source: Chapter 10: Kconfig configuration files
ru: Глава 10: Конфигурационные файлы Kconfig

source: For all of the Kconfig* configuration files throughout the source tree, the indentation is somewhat different. Lines under a "config" definition are indented with one tab, while help text is indented an additional two spaces. Example:
ru: Для всех конфигурационных файлов Kconfig* в дереве источников отступы несколько отличаются. Строки под определением "config" имеют отступы на позицию табуляции, а текст справки с отступом еще на два пробела. Пример:

source: Features that might still be considered unstable should be defined as dependent on "EXPERIMENTAL":
ru: Функции, которые все еще могут считаться нестабильными, должны определяться как зависящие от "EXPERIMENTAL":

source: while seriously dangerous features (such as write support for certain filesystems) should advertise this prominently in their prompt string:
ru: тогда как крайне опасные функции (например, поддержка записи для определенных файловых систем) должны подчеркнуть это в строке приглашения:

source: For full documentation on the configuration files, see the file Documentation/kbuild/kconfig-language.txt.
ru: Полную документацию по файлам конфигурации см. в файле Documentation/kbuild/kconfig-language.txt.

source: Chapter 11: Data structures
ru: Глава 11: Структуры данных

source: Data structures that have visibility outside the single-threaded environment they are created and destroyed in should always have reference counts. In the kernel, garbage collection doesn't exist (and outside the kernel garbage collection is slow and inefficient), which means that you absolutely _have_ to reference count all your uses.
ru: Для структур данных, которые видимы за пределами однопотоковой среды, в которой они создаются и удаляются, всегда должен выполняться подсчет ссылок. В ядре нет сборки мусора (и за пределами ядра сборка мусора производится медленно и неэффективно), а это означает, что абсолютно _необходимо_ подсчитывать ссылки на каждый случай использования.

source: Reference counting means that you can avoid locking, and allows multiple users to have access to the data structure in parallel - and not having to worry about the structure suddenly going away from under them just because they slept or did something else for a while.
ru: Подсчет ссылок означает, что можно избежать блокировки и позволить нескольким пользователям получать доступ к структуре данных одновременно -- и не нужно беспокоиться о том, что структура внезапно исчезнет только потому, что они спали или делали что-то еще.

source: Note that locking is _not_ a replacement for reference counting. Locking is used to keep data structures coherent, while reference counting is a memory management technique. Usually both are needed, and they are not to be confused with each other.
ru: Обратите внимание, что блокировка _не_ является заменой для подсчета ссылок. Блокировка используется для обеспечения целостности структур данных, а подсчет ссылок -- это метод управления памятью. Обычно необходимо и то, и другое, и их нельзя путать друг с другом.

source: Many data structures can indeed have two levels of reference counting, when there are users of different "classes". The subclass count counts the number of subclass users, and decrements the global count just once when the subclass count goes to zero.
ru: Для многих структур данных действительно могут быть два уровня подсчета ссылок, когда есть пользователи разных "классов". Подсчет подкласса подсчитывает количество пользователей подкласса и уменьшает глобальный счетчик только один раз, когда подсчет подкласса равен нулю.

source: Examples of this kind of "multi-level-reference-counting" can be found in memory management ("struct mm_struct": mm_users and mm_count), and in filesystem code ("struct super_block": s_count and s_active).
ru: Примеры такого многоуровневого подсчета ссылок можно найти в управлении памятью ("struct mm_struct": mm_users и mm_count) и в коде файловой системы ("struct super_block": s_count и s_active).

source: Remember: if another thread can find your data structure, and you don't have a reference count on it, you almost certainly have a bug.
ru: Следует помнить, что если другой поток может найти вашу структуру данных, и у вас нет счетчика ссылок, почти наверняка возникнет ошибка.

source: Chapter 12: Macros, Enums and RTL
ru: Глава 12: Макросы, перечисления и уровни регистровых передач (RTL)

source: Names of macros defining constants and labels in enums are capitalized.
ru: Имена макросов, определяющих постоянные и метки в перечислениях, пишутся заглавными буквами.

source: Enums are preferred when defining several related constants.
ru: Рекомендуется использовать перечисления при определении нескольких связанных постоянных.

source: CAPITALIZED macro names are appreciated but macros resembling functions may be named in lower case.
ru: Ценятся имена макросов, написанные ЗАГЛАВНЫМИ буквами, но похожие на функции макросы можно называть, используя буквы в нижнем регистре.

source: Generally, inline functions are preferable to macros resembling functions.
ru: Как правило, рекомендуется использовать встроенные функции для макросов, похожих на функции.

source: Macros with multiple statements should be enclosed in a do - while block:
ru: Макросы с несколькими операторами должны быть заключены в блок do - while:

source: Things to avoid when using macros:
ru: Во время использования макросов постарайтесь избегать следующего:

source: macros that affect control flow:
ru: макросы, которые влияют на поток управления:

source: is a _very_ bad idea. It looks like a function call but exits the "calling" function; don't break the internal parsers of those who will read the code.
ru: это _очень_ плохая идея. Он выглядит как вызов функции, но выходит из вызывающей функции; не ломайте внутреннего анализатора у тех, кто прочитает код.

source: macros that depend on having a local variable with a magic name:
ru: макросы, которые зависят от наличия локальной переменной с магическим именем:

source: might look like a good thing, but it's confusing as hell when one reads the code and it's prone to breakage from seemingly innocent changes.
ru: могут показаться хорошей идеей, но они сбивают с толку, когда читаешь код, и такой код склонен ломаться от, казалось бы, невинных изменений.

source: macros with arguments that are used as l-values: FOO(x) = y; will bite you if somebody e.g. turns FOO into an inline function.
ru: макросы с аргументами, которые используются как l-значения: FOO(x) = y; это вам аукнется, если кто-то, например. сделает FOO встроенной функцией.

source: forgetting about precedence: macros defining constants using expressions must enclose the expression in parentheses. Beware of similar issues with macros using parameters.
ru: потеря приоритета: макросы, определяющие постоянные с использованием выражений, должны заключать выражение в круглые скобки. Остерегайтесь аналогичных проблем с макросами с использованием параметров.

source: The cpp manual deals with macros exhaustively. The gcc internals manual also covers RTL which is used frequently with assembly language in the kernel.
ru: В руководстве cpp подробно рассматриваются макросы. Руководство по внутреннему устройству gcc также рассматривает уровни регистровых передач (RTL), которые часто используются с языком ассемблера в ядре.

source: Chapter 13: Printing kernel messages
ru: Глава 13: Вывод сообщений ядра

source: Kernel developers like to be seen as literate. Do mind the spelling of kernel messages to make a good impression. Do not use crippled words like "dont"; use "do not" or "don't" instead. Make the messages concise, clear, and unambiguous.
ru: Разработчики ядра любят выглядеть грамотными. Обращайте внимание на орфографию в сообщениях ядра, чтобы произвести хорошее впечатление. Не используйте искаженные слова типа "dont"; вместо этого используйте "do not" или "don't". Пусть сообщения будут краткими, ясными и недвусмысленными.

source: Kernel messages do not have to be terminated with a period.
ru: Сообщения ядра не должны заканчиваться точкой.

source: Printing numbers in parentheses (%d) adds no value and should be avoided.
ru: Вывод номеров в круглых скобках (%d) не повышает их ценность, и его следует избегать.

source: There are a number of driver model diagnostic macros in <linux/device.h> which you should use to make sure messages are matched to the right device and driver, and are tagged with the right level: dev_err(), dev_warn(), dev_info(), and so forth. For messages that aren't associated with a particular device, <linux/kernel.h> defines pr_debug() and pr_info().
ru: В <linux/device.h> есть несколько макросов для диагностики модели драйвера, которые следует использовать, чтобы убедиться, что сообщения соотнесены с правильным устройством и драйвером и помечены правильным уровнем: dev_err(), dev_warn(), dev_info() и так далее. Для сообщений, не связанных с определенным устройством, <linux/kernel.h> определяет pr_debug() и pr_info().

source: Coming up with good debugging messages can be quite a challenge; and once you have them, they can be a huge help for remote troubleshooting. Such messages should be compiled out when the DEBUG symbol is not defined (that is, by default they are not included). When you use dev_dbg() or pr_debug(), that's automatic. Many subsystems have Kconfig options to turn on -DDEBUG. A related convention uses VERBOSE_DEBUG to add dev_vdbg() messages to the ones already enabled by DEBUG.
ru: Придумать хорошие сообщения отладки может быть довольно сложно; и как только у вас будут такие, они могут стать огромным подспорьем для удаленного устранения неполадок. Такие сообщения должны быть скомпилированы, когда символ DEBUG не определен (то есть, по умолчанию они не включены). Если вы используете dev_dbg() или pr_debug(), это сработает автоматически. Во многих подсистемах есть опции Kconfig для включения -DDEBUG. В соответствующем соглашении VERBOSE_DEBUG используется для добавления сообщений dev_vdbg() в сообщения, которые уже включены с помощью DEBUG.

source: Chapter 14: Allocating memory
ru: Глава 14: Выделение памяти

source: The kernel provides the following general purpose memory allocators: kmalloc(), kzalloc(), kcalloc(), and vmalloc(). Please refer to the API documentation for further information about them.
ru: В ядре поддерживаются следующие распределители памяти широкого применения: kmalloc(), kzalloc(), kcalloc(), and vmalloc(). Для получения дополнительной информации обратитесь к документации по API.

source: The preferred form for passing a size of a struct is the following:
ru: Предпочтительна следующая форма передачи размера структуры:

source: The alternative form where struct name is spelled out hurts readability and introduces an opportunity for a bug when the pointer variable type is changed but the corresponding sizeof that is passed to a memory allocator is not.
ru: Другая форма, в которой прописывается название структуры, ухудшает читаемость и дает дополнительные возможности для возникновения ошибок при изменении типа переменной указателя, когда соответствующий sizeof, который передается в распределитель ресурсов, не меняется.

source: Casting the return value which is a void pointer is redundant. The conversion from void pointer to any other pointer type is guaranteed by the C programming language.
ru: Не нужно отбрасывать возвращаемое значение, представляющее собой указатель на объект, тип которого неизвестен. Язык программирования C обеспечивает преобразование из указателя на объект, тип которого неизвестен, на любой другой тип указателя.

source: Chapter 15: The inline disease
ru: Глава 15: Болезнь встраивания (inline)

source: There appears to be a common misperception that gcc has a magic "make me faster" speedup option called "inline". While the use of inlines can be appropriate (for example as a means of replacing macros, see Chapter 12), it very often is not. Abundant use of the inline keyword leads to a much bigger kernel, which in turn slows the system as a whole down, due to a bigger icache footprint for the CPU and simply because there is less memory available for the pagecache. Just think about it; a pagecache miss causes a disk seek, which easily takes 5 milliseconds. There are a LOT of cpu cycles that can go into these 5 milliseconds.
ru: Похоже, что распространено ошибочное представление о том, что в gcc есть волшебная опция ускорения, называемая встраиванием "inline". Хотя использование встроенных строк может быть оправдано (например, как средство замены макросов, см. Главу 12), довольно часто это не так. Избыток ключевого слова inline приводит к увеличению ядра, что в свою очередь, замедляет работу системы в целом из-за большего объема отпечатка icache для процессора и просто потому, что для pagecache доступно меньше памяти. Просто подумайте: непопадание в pagecache вызывает поиск по диску, который легко занимает 5 миллисекунд. Есть МНОГО циклов процессора, которые могут пройти в эти 5 миллисекунд.

source: A reasonable rule of thumb is to not put inline at functions that have more than 3 lines of code in them. An exception to this rule are the cases where a parameter is known to be a compiletime constant, and as a result of this constantness you *know* the compiler will be able to optimize most of your function away at compile time. For a good example of this later case, see the kmalloc() inline function.
ru: Общее правило состоит в том, чтобы не вводить встраивание в функции, содержащие больше трех строк кода. Исключением из этого правила являются случаи, когда параметр известен как постоянная времени компиляции, и в результате вы *знаете*, что компилятор сможет оптимизировать большую часть ваших функций во время компиляции. Хороший пример последнего случая -- встроенная функция kmalloc().

source: Often people argue that adding inline to functions that are static and used only once is always a win since there is no space tradeoff. While this is technically correct, gcc is capable of inlining these automatically without help, and the maintenance issue of removing the inline when a second user appears outweighs the potential value of the hint that tells gcc to do something it would have done anyway.
ru: Часто утверждают, что беспроигрышным вариантом будет встраивание статических функций, используемых только один раз, поскольку нет компромиссов пространства. Хотя это технически правильно, gcc способен автоматически встраивать их, а проблема удаления встроенного, если появляется второй пользователь, перевешивает потенциальную ценность подсказки для gcc делать что-то, что он сделал бы в любом случае.

source: Chapter 16: Function return values and names
ru: Глава 16: Возвращаемые значения и имена функций

source: Functions can return values of many different kinds, and one of the most common is a value indicating whether the function succeeded or failed. Such a value can be represented as an error-code integer (-Exxx = failure, 0 = success) or a "succeeded" boolean (0 = failure, non-zero = success).
ru: Функции могут возвращать значения множества различных типов, и одним из наиболее распространенных является значение, которое указывает, была функция выполнена или нет. Такое значение может быть представлено как целое число с кодом ошибки (-Exxx = сбой, 0 = выполнено) или логическое значение выполнения (0 = сбой, ненулевое значение = выполнено).

source: Mixing up these two sorts of representations is a fertile source of difficult-to-find bugs. If the C language included a strong distinction between integers and booleans then the compiler would find these mistakes for us... but it doesn't. To help prevent such bugs, always follow this convention:
ru: Смешение этих двух видов дает богатую пищу для появления сложных для обнаружения ошибок. Если бы в языке C были явные различия между целыми числами и логическими значениями, тогда компилятор нашел бы для нас эти ошибки... но это не так. Чтобы предотвратить такие ошибки, всегда следуйте этому соглашению:

source: If the name of a function is an action or an imperative command, the function should return an error-code integer. If the name is a predicate, the function should return a "succeeded" boolean.
ru: Если имя функции представляет собой действие или команду, функция должна возвращать целое число с кодом ошибки. Если имя функции является утверждением, функция должна возвращать логическое значение выполнения.

source: For example, "add work" is a command, and the add_work() function returns 0 for success or -EBUSY for failure. In the same way, "PCI device present" is a predicate, and the pci_dev_present() function returns 1 if it succeeds in finding a matching device or 0 if it doesn't.
ru: Например, "add work" (добавить работу) -- это команда, а функция add_work() возвращает 0 в случае выполнения или -EBUSY при сбое. Точно так же "PCI device present" (есть PCI-устройство) представляет собой утверждение, а функция pci_dev_present() возвращает 1, если ей удается найти подходящее устройство, или 0, если это не так.

source: All EXPORTed functions must respect this convention, and so should all public functions. Private (static) functions need not, but it is recommended that they do.
ru: Все экспортируемые функции (EXPORT) должны подчиняться этому соглашению, то же относится и ко всем доступным функциям. Закрытые (статические) функции не должны подчиняться, но это рекомендуется.

source: Functions whose return value is the actual result of a computation, rather than an indication of whether the computation succeeded, are not subject to this rule. Generally they indicate failure by returning some out-of-range result. Typical examples would be functions that return pointers; they use NULL or the ERR_PTR mechanism to report failure.
ru: Функции, возвращаемое значение которых является фактическим результатом вычисления, а не указанием того, удалось ли выполнить вычисление, не подпадают под это правило. Обычно они указывают на сбой, возвращая некое недопустимое значение. Типичными примерами будут функции, возвращающие указатели; чтобы сообщить об ошибке, они используют NULL или механизм ERR_PTR.

source: Chapter 17: Don't re-invent the kernel macros
ru: Глава 17: Не изобретайте макросы снова

source: The header file include/linux/kernel.h contains a number of macros that you should use, rather than explicitly coding some variant of them yourself. For example, if you need to calculate the length of an array, take advantage of the macro
ru: В файле заголовка include/linux/kernel.h содержатся несколько макросов, которые следует использовать, а не программировать их самостоятельно. Например, если необходимо рассчитать длину массива, воспользуйтесь макросом

source: Similarly, if you need to calculate the size of some structure member, use
ru: Аналогичным образом, если необходимо рассчитать размер какого-либо элемента структуры, используйте

source: There are also min() and max() macros that do strict type checking if you need them. Feel free to peruse that header file to see what else is already defined that you shouldn't reproduce in your code.
ru: Есть также макросы min() и max(), которые выполняют строгую проверку типов, если понадобится. Не стесняйтесь ознакомиться с этим файлом заголовка, чтобы узнать, что еще не нужно воспроизводить в своем коде.

source: Chapter 18: Editor modelines and other cruft
ru: Глава 18: Редакторские строки режима (modelines) и прочий хлам

source: Some editors can interpret configuration information embedded in source files, indicated with special markers. For example, emacs interprets lines marked like this:
ru: Некоторые редакторы могут интерпретировать встроенную в исходные файлы информацию о конфигурации, указанную специальными маркерами. Например, emacs интерпретирует строки, помеченные следующим образом:

source: Or like this:
ru: Или так:

source: Vim interprets markers that look like this:
ru: Vim интерпретирует маркеры, которые выглядят так:
