Repository: tarantool/doc
Catalog: locale/*/LC_MESSAGES/doc.po
Languages: ru

source: This shows that what was inserted by Terminal #1 can be selected by Terminal #2, via the `shard` module.
ru: Данный пример показывает, что введенная на терминале №1 информация может быть извлечена на терминале №2 с помощью модуля `shard`.

source: For details, see the `README <https://github.com/tarantool/shard>`_.
ru: Для получения подробной информации см. файл `README <https://github.com/tarantool/shard>`_.

source: Module `tdb`
ru: Модуль `tdb`

source: The Tarantool Debugger (abbreviation = ``tdb``) can be used with any Lua program. The operational features include: setting breakpoints, examining variables, going forward one line at a time, backtracing, and showing information about fibers. The display features include: using different colors for different situations, including line numbers, and adding hints.
ru: Отладчик Tarantool'а (сокращенно ``tdb``) можно использовать с любой Lua-программой. Рабочие функции: определение точек прерывания, исследование переменных, перебор строк по одной, обратная трассировка и отображение информации о файберах. Функции вывода: использование различных цветов в разных ситуациях, включая номера строк, и добавление подсказок.

source: It is not supplied as part of the Tarantool repository; it must be installed separately. Here is the usual way:
ru: Модуль не поставляется в репозитории Tarantool'а, его следует устанавливать отдельно. Это обычно делается следующим образом:

source: To initiate ``tdb`` within a Lua program and set a breakpoint, edit the program to include these lines:
ru: Чтобы запустить ``tdb`` в рамках Lua-программы и определить точку прерывания, включите в программу следующие строки:

source: To start the debugging session, execute the Lua program. Execution will stop at the breakpoint, and it will be possible to enter debugging commands.
ru: Чтобы начать сессию отладки, выполните Lua-программу: выполнение остановится на точке прерывания, и можно будет вводить команды отладчика.

source: Debugger Commands
ru: Команды отладчика

source: Backtrace -- show the stack (in red), with program/function names and line numbers of whatever has been invoked to reach the current line.
ru: Обратная трассировка -- отображение стека (красным) с именами программы/функции и номерами строк, выполнение которых привело к текущей строке.

source: Continue till next breakpoint or till program ends.
ru: Продолжение выполнения до следующей точки прерывания или до окончания программы.

source: Enter evaluation mode. When the program is in evaluation mode, one can execute certain Lua statements that would be valid in the context. This is particularly useful for displaying the values of the program's variables. Other debugger commands will not work until one exits evaluation mode by typing :codebold:`-e`.
ru: Вход в режим вычисления. Когда программа находится в режиме вычисления, можно выполнять определенные запросы, которые будут действовать с точки зрения контекста. Это особенно полезно для отображения значений переменных программы. Другие команды отладчика не будут работать, пока не выйти из режима оценки, набрав: :codebold:`-e`.

source: Exit evaluation mode.
ru: Выход из режима оценка.

source: Display the fiber id, the program name, and the percentage of memory used, as a table.
ru: Отображение идентификатора файбера, имени программы и процентного соотношения использованной памяти в виде таблицы.

source: Go to the next line, skipping over any function calls.
ru: Переход на следующую строку с пропуском любых вызовов функций.

source: Display names of variables or functions which are defined as global.
ru: Отображение имен переменных или функций, которые являются глобальными.

source: Display a list of debugger commands.
ru: Отображение списка команд отладчика.

source: Display names and values of variables, for example the control variables of a Lua "for" statement.
ru: Отображение имен и значений переменных, например, переменных для управления Lua-оператором "for".

source: Quit immediately.
ru: Немедленный выход.

source: Example Session
ru: Пример сессии

source: Put the following program in a default directory and call it "example.lua":
ru: Сохраните следующую программу в директории по умолчанию и назовите ее "example.lua":

source: Now start Tarantool, using example.lua as the initialization file
ru: Запустите Tarantool, используя example.lua в качестве файла инициализации.

source: The screen should now look like this:
ru: Теперь вывод на экране выглядит следующим образом:

source: Debugger prompts are blue, debugger hints and information are green, and the current line -- line 3 of example.lua -- is the default color. Now enter six debugger commands:
ru: Запросы отладчика выделены синим, подсказки и информация -- зеленым, а текущая строка -- 3 строка программы example.lua -- цветом, который используется по умолчанию. Введите 6 команд отладчика:

source: n -- go to next line n -- go to next line e -- enter evaluation mode j -- display j -e -- exit evaluation mode q -- quit
ru: n -- переход на следующую строку n -- переход на следующую строку e -- вход в режим оценки j -- отображение j -e -- выход из режима оценки q -- выход

source: Another debugger example can be found `here <https://github.com/sulverus/tdb>`_.
ru: Другой пример работы отладчика можно найти `здесь <https://github.com/sulverus/tdb>`_.

source: Utility `tarantoolctl`
ru: Утилита `tarantoolctl`

source: ``tarantoolctl`` is a utility for administering Tarantool :ref:`instances <tarantoolctl-instance_management>`, :ref:`checkpoint files <tarantoolctl-checkpoint_management>` and :ref:`modules <tarantoolctl-module_management>`. It is shipped and installed as part of Tarantool distribution.
ru: ``tarantoolctl`` представляет собой утилиту для администрирования :ref:`экземпляров <tarantoolctl-instance_management>`, :ref:`файлов контрольной точки <tarantoolctl-checkpoint_management>` и :ref:`модулей <tarantoolctl-module_management>` в Tarantool'е. Утилита поставляется и устанавливается как часть дистрибутива Tarantool'а.

source: See also ``tarantoolctl`` usage examples in :ref:`Server administration <admin>` section.
ru: См. также примеры использования ``tarantoolctl`` в разделе :ref:`Администрирование серверной части <admin>`.

source: Command format
ru: Формат команд

source: ``COMMAND`` is one of the following: ``start``, ``stop``, ``status``, ``restart``, ``logrotate``, ``check``, ``enter``, ``eval``, ``connect``, ``cat``, ``play``, ``rocks``.
ru: ``COMMAND`` -- это одна из следующих команд, описанных ниже: ``start``, ``stop``, ``status``, ``restart``, ``logrotate``, ``check``, ``enter``, ``eval``, ``connect``, ``cat``, ``play``, ``rocks``.

source: ``NAME`` is the name of an :ref:`instance file <admin-instance_file>` or a :ref:`module <app_server-modules>`.
ru: ``NAME`` -- это имя :ref:`файла экземпляра <admin-instance_file>` или :ref:`модуля <app_server-modules>`.

source: ``FILE`` is the path to some file (.lua, .xlog or .snap).
ru: ``FILE`` -- это путь к какому-либо файлу (.lua, .xlog или .snap).

source: ``URI`` is the URI of some Tarantool instance.
ru: ``URI`` -- это URI некого экземпляра Tarantool'а.

source: ``OPTIONS`` are options taken by some ``tarantoolctl`` commands.
ru: ``OPTIONS`` -- это параметры, которые принимают команды ``tarantoolctl``.

source: Commands for managing Tarantool instances
ru: Команды для управления экземплярами Tarantool'а

source: Start a Tarantool instance.
ru: Запуск экземпляра Tarantool’а.

source: Stop a Tarantool instance.
ru: Остановка экземпляра Tarantool'а.

source: Show an instance's status (started/stopped). If pid file exists and an alive control socket exists, the return code is ``0``. Otherwise, the return code is not ``0``.
ru: Отображение статуса экземпляра (работает/остановлен). Если есть PID-файл и активный управляющий сокет, возвращается код ``0``. В остальных случаях возвращается не ``0``.

source: Reports typical problems to stderr (e.g. pid file exists and control socket doesn't).
ru: Сообщает о типичных проблемах стандартного вывода ошибок (например, PID-файл есть, а управляющий сокет отсутствует).

source: Stop and start a Tarantool instance.
ru: Остановка и запуск экземпляра Tarantool’а.

source: Rotate logs of a started Tarantool instance. Works only if logging-into-file is enabled in the instance file. Pipe/syslog make no effect.
ru: Ротация файлов журнала работающего Tarantool-экземпляра. Работает только в том случае, если в файле экземпляра задан параметр записи журнала в файл. Отправка записей в конвейер или системный журнал syslog не имеет значения в данном случае.

source: Check an instance file for syntax errors.
ru: Проверка файла экземпляра на ошибки синтаксиса.

source: Enter an instance's interactive Lua console.
ru: Вход в интерактивную Lua-консоль экземпляра.

source: Evaluate a local Lua file on a running Tarantool instance.
ru: Оценка локального Lua-файла на работающем экземпляре Tarantool'а.

source: Connect to a Tarantool instance on an admin-console port. Supports both TCP/Unix sockets.
ru: Подключение к экземпляру Tarantool'а по порту административной консоли. Поддерживаются TCP и Unix сокеты.

source: Commands for managing checkpoint files
ru: Команды для управления файлами контрольной точки

source: Print into stdout the contents of .snap/.xlog files.
ru: Стандартный вывод содержимого .snap-файла или .xlog-файла.

source: Play the contents of .snap/.xlog files to another Tarantool instance.
ru: Передача содержимого .snap-файла или .xlog-файла на другой экземпляр Tarantool'а.

source: Supported options:
ru: Поддерживаемые опции:

source: ``--space=space_no`` to filter the output by space number. May be passed more than once.
ru: ``--space=space_no`` для фильтрации вывода по номеру спейса. Можно передавать несколько раз.

source: ``--show-system`` to show the contents of system spaces.
ru: ``--show-system`` для отображения содержимого системных спейсов.

source: ``--from=from_lsn`` to show operations starting from the given lsn.
ru: ``--from=from_lsn`` для отображения операций, начиная с заданного LSN.

source: ``--to=to_lsn`` to show operations ending with the given lsn.
ru: ``--to=to_lsn`` для отображения операций, заканчивая заданным LSN.

source: ``--replica=replica_id`` to filter the output by replica id. May be passed more than once.
ru: ``--replica=replica_id`` для фильтрации вывода по идентификатору реплики. Можно передавать несколько раз.

source: Commands for managing Tarantool modules
ru: Команды для управления модулями Tarantool'а

source: Install a module in the current directory.
ru: Установка модуля в текущей директории.

source: Remove a module.
ru: Удаление модуля.

source: Show information about an installed module.
ru: Отображение информации об установленном модуле.

source: Search the repository for modules.
ru: Поиск модулей по репозиторию.

source: List all installed modules.
ru: Вывод списка всех установленных модулей.

source: C tutorial
ru: Практическое задание на C

source: Here is one C tutorial: :ref:`C stored procedures <f_c_tutorial-c_stored_procedures>`.
ru: Ниже приводится практическое занятие на языке C: :ref:`Хранимые процедуры на языке C <f_c_tutorial-c_stored_procedures>`.

source: C stored procedures
ru: Хранимые процедуры на языке C

source: Tarantool can call C code with :ref:`modules <app_server-modules>`, or with :ref:`ffi <cookbook-ffi_printf>`, or with C stored procedures. This tutorial only is about the third option, C stored procedures. In fact the routines are always "C functions" but the phrase "stored procedure" is commonly used for historical reasons.
ru: Tarantool может вызывать код на языке C с помощью :ref:`модулей <app_server-modules>`, :ref:`ffi <cookbook-ffi_printf>` или хранимых процедур на C. В данном практическом задании рассматривается только третий метод, хранимые процедуры на языке C. На самом деле, программы всегда представляют собой функции на языке C, но исторически сложилось так, что широко используется фраза "хранимая процедура".

source: In this tutorial, which can be followed by anyone with a Tarantool development package and a C compiler, there are five tasks:
ru: Данное практическое задание могут выполнить те, у кого есть пакет программ для разработки Tarantool'а и компилятор языка программирования C. Оно состоит из пяти задач:

source: :ref:`easy.c <f_c_tutorial-easy>` -- prints "hello world";
ru: :ref:`easy.c <f_c_tutorial-easy>` -- выводит "hello world";

source: :ref:`harder.c <f_c_tutorial-harder>` -- decodes a passed parameter value;
ru: :ref:`harder.c <f_c_tutorial-harder>` -- декодирует переданное значение параметра;

source: :ref:`hardest.c <f_c_tutorial-hardest>` -- uses the C API to do a DBMS insert;
ru: :ref:`hardest.c <f_c_tutorial-hardest>` -- использует API для языка C для вставки в базу данных;

source: :ref:`read.c <f_c_tutorial-read>` -- uses the C API to do a DBMS select;
ru: :ref:`read.c <f_c_tutorial-read>` -- использует API для языка C для выборки из базы данных;

source: :ref:`write.c <f_c_tutorial-write>` -- uses the C API to do a DBMS replace.
ru: :ref:`write.c <f_c_tutorial-write>` -- использует API для языка C для замены в базе данных.

source: After following the instructions, and seeing that the results are what is described here, users should feel confident about writing their own stored procedures.
ru: По окончании задания, вы увидите описанные здесь результаты и сможете самостоятельно написать хранимые процедуры.

source: **Preparation**
ru: **Подготовка**

source: Check that these items exist on the computer:
ru: Проверьте наличие следующих элементов на компьютере:

source: A gcc compiler, any modern version should work
ru: Компилятор GCC, подойдет любая современная версия

source: ``module.h`` and files #included in it
ru: ``module.h`` и включенные в него файлы

source: ``libmsgpuck.a`` (only for some recent msgpuck versions)
ru: ``libmsgpuck.a`` (только для некоторых последних версий msgpuck)

source: or on Fedora say:
ru: или на Fedora введите команду:

source: Both ``module.h`` and ``msgpuck.h`` must be on the include path for the C compiler to see them. For example, if ``module.h`` address is ``/usr/local/include/tarantool/module.h``, and ``msgpuck.h`` address is ``/usr/local/include/msgpuck/msgpuck.h``, and they are not currently on the include path, say:
ru: Чтобы компилятор C увидел файлы ``module.h`` и ``msgpuck.h``, путь к ним следует сохранить в переменной. Например, если адрес файла ``module.h`` -- ``/usr/local/include/tarantool/module.h``, а адрес файла ``msgpuck.h`` -- ``/usr/local/include/msgpuck/msgpuck.h``, введите команду:

source: The ``libmsgpuck.a`` static library is necessary with msgpuck versions produced after February 2017. If and only if you encounter linking problems when using the gcc statements in the examples for this tutorial, you should put ``libmsgpuck.a`` on the path (``libmsgpuck.a`` is produced from both msgpuck and Tarantool source downloads so it should be easy to find). For example, instead of ":code:`gcc -shared -o harder.so -fPIC harder.c`" for the second example below, you will need to say ":code:`gcc -shared -o harder.so -fPIC harder.c libmsgpuck.a`".
ru: Статическая библиотека ``libmsgpuck.a`` нужна для версий msgpuck старше февраля 2017 года. Только в том случае, если встречаются проблемы соединения при использовании операторов GCC в примерах данного практического задания, в пути следует указывать ``libmsgpuck.a`` (``libmsgpuck.a`` создан из исходных файлов загрузки msgpuck и Tarantool, поэтому его легко найти). Например, вместо ":code:`gcc -shared -o harder.so -fPIC harder.c`" во втором примере ниже, необходимо ввести ":code:`gcc -shared -o harder.so -fPIC harder.c libmsgpuck.a`".

source: Requests will be done using Tarantool as a :ref:`client <admin-using_tarantool_as_a_client>`. Start Tarantool, and enter these requests.
ru: Tarantool выполняет запросы в качестве :ref:`клиента <admin-using_tarantool_as_a_client>`. Запустите Tarantool и введите эти запросы.

source: In plainer language: create a space named ``capi_test``, and make a connection to self named ``capi_connection``.
ru: Проще говоря: создайте спейс под названием ``capi_test``, и выполните соединение с одноименным ``capi_connection``.

source: Leave the client running. It will be necessary to enter more requests later.
ru: Не закрывайте клиент. Он понадобится для последующих запросов.

source: Start another shell. Change directory (``cd``) so that it is the same as the directory that the client is running on.
ru: Запустите еще один терминал. Измените директорию (``cd``), чтобы она совпадала с директорией, где запущен клиент.

source: Create a file. Name it ``easy.c``. Put these six lines in it.
ru: Создайте файл. Назовите его ``easy.c``. Запишите в него следующие шесть строк.

source: Compile the program, producing a library file named ``easy.so``:
ru: Скомпилируйте программу, что создаст файл библиотеки под названием ``easy.so``:

source: Now go back to the client and execute these requests:
ru: Теперь вернитесь в клиент и выполните следующие запросы:

source: If these requests appear unfamiliar, re-read the descriptions of :ref:`box.schema.func.create() <box_schema-func_create>`, :ref:`box.schema.user.grant() <box_schema-user_grant>` and :ref:`conn:call() <net_box-call>`.
ru: Если эти запросы вам незнакомы, перечитайте описание :ref:`box.schema.func.create() <box_schema-func_create>`, :ref:`box.schema.user.grant() <box_schema-user_grant>` и :ref:`conn:call() <net_box-call>`.

source: The function that matters is ``capi_connection:call('easy')``.
ru: Важна функция ``capi_connection:call('easy')``.

source: Its first job is to find the 'easy' function, which should be easy because by default Tarantool looks on the current directory for a file named ``easy.so``.
ru: Во-первых, она ищет функцию easy, что должно быть легко, потому что по умолчанию Tarantool ищет в текущей директории файл под названием ``easy.so``.

source: Its second job is to call the 'easy' function. Since the ``easy()`` function in ``easy.c`` begins with ``printf("hello world\n")``, the words "hello world" will appear on the screen.
ru: Во-вторых, она вызывает функцию easy. Поскольку функция ``easy()`` в ``easy.c`` начинается с ``printf("hello world\n")``, слова "hello world" появятся на экране.

source: Its third job is to check that the call was successful. Since the ``easy()`` function in ``easy.c`` ends with :code:`return 0`, there is no error message to display and the request is over.
ru: В-третьих, она проверяет, что вызов прошел успешно. Поскольку функция ``easy()`` в ``easy.c`` оканчивается на :code:`return 0`, сообщение об ошибке отсутствует, и запрос выполнен.

source: The result should look like this:
ru: Результат должен выглядеть следующим образом:

source: Now let's call the other function in easy.c -- ``easy2()``. This is almost the same as the ``easy()`` function, but there's a detail: when the file name is not the same as the function name, then we have to specify :samp:`{file-name}.{function-name}`.
ru: Теперь вызовем другую функцию в easy.c -- ``easy2()``. Она практически совпадает с функцией ``easy()``, но есть небольшое отличие: если имя файла не совпадет с именем функции, нужно будет указать :samp:`{имя-файла}.{имя-функции}`.

source: ... and this time the result will be "hello world -- easy2".
ru: ... и на этот раз результатом будет: "hello world -- easy2".

source: Conclusion: calling a C function is easy.
ru: Вывод: вызвать C-функцию легко.

source: Go back to the shell where the ``easy.c`` program was created.
ru: Вернитесь в терминал, где была создана программа ``easy.c``.

source: Create a file. Name it ``harder.c``. Put these 17 lines in it:
ru: Создайте файл. Назовите его ``harder.c``. Запишите в него следующие 17 строк:

source: Compile the program, producing a library file named ``harder.so``:
ru: Скомпилируйте программу, что создаст файл библиотеки под названием ``harder.so``:

source: This time the call is passing a Lua table (``passable_table``) to the ``harder()`` function. The ``harder()`` function will see it, it's in the :code:`char *args` parameter.
ru: На этот раз вызов передает Lua-таблицу (``passable_table``) в функцию ``harder()``. Функция``harder()`` увидит это, как указано в параметре :code:`char *args`.

source: At this point the ``harder()`` function will start using functions defined in `msgpuck.h <http://rtsisyk.github.io/msgpuck>`_. The routines that begin with "mp" are msgpuck functions that handle data formatted according to the MsgPack_ specification. Passes and returns are always done with this format so one must become acquainted with msgpuck to become proficient with the C API.
ru: На данный момент функция ``harder()`` начнет использовать функции, определенные в `msgpuck.h <http://rtsisyk.github.io/msgpuck>`_. Процедуры, которые начинаются с "mp" -- это функции msgpuck, которые обрабатывают данные в формате MsgPack_. Передача и возврат всегда осуществляются в этом формате, поэтому следует ознакомиться с msgpuck для того, чтобы овладеть навыками работы с API для языка C.

source: For now, though, it's enough to know that ``mp_decode_array()`` returns the number of elements in an array, and ``mp_decode_uint`` returns an unsigned integer, from :code:`args`. And there's a side effect: when the decoding finishes, :code:`args` has changed and is now pointing to the next element.
ru: Однако, пока достаточно понимать, что функция ``mp_decode_array()`` возвращает количество элементов в массиве, а функция ``mp_decode_uint`` возвращает целое число без знака из :code:`args`. Есть также побочный эффект: по окончании декодирования :code:`args` изменился и теперь указывает на следующий элемент.

source: Therefore the first displayed line will be "arg_count = 1" because there was only one item passed: ``passable_table``. |br| The second displayed line will be "field_count = 3" because there are three items in the table. |br| The next three lines will be "1" and "2" and "3" because those are the values in the items in the table.
ru: Таким образом, первой будет отображена строка "arg_count = 1", поскольку был передан только один элемент: ``passable_table``. |br| Второй будет отображена строка "field_count = 3", потому что в таблице находятся три элемента. |br| Следующие три строки будут "1", "2" и "3", потому что это значения элементов в таблице.

source: And now the screen looks like this:
ru: Теперь вывод на экране выглядит следующим образом:

source: Conclusion: decoding parameter values passed to a C function is not easy at first, but there are routines to do the job, and they're documented, and there aren't very many of them.
ru: Вывод: на первый взгляд, декодирование значений параметров, переданных в C-функцию непросто, но существуют документированные процедуры для этих целей, и их не так много.

source: Go back to the shell where the ``easy.c`` and the ``harder.c`` programs were created.
ru: Вернитесь в терминал, где были созданы программы ``easy.c`` и ``harder.c``.

source: Create a file. Name it ``hardest.c``. Put these 13 lines in it:
ru: Создайте файл. Назовите его ```hardest.c``. Запишите в него следующие 13 строк:

source: Compile the program, producing a library file named ``hardest.so``:
ru: Скомпилируйте программу, что создаст файл библиотеки под названием ``hardest.so``:

source: This time the C function is doing three things:
ru: На этот раз C-функция выполняет три действия:

source: finding the numeric identifier of the ``capi_test`` space by calling ``box_space_id_by_name()``;
ru: найдет числовой идентификатор спейса ``capi_test`` путем вызова ``box_space_id_by_name()``;

source: formatting a tuple using more ``msgpuck.h`` functions;
ru: форматирует кортеж, используя другие функции ``msgpuck.h``;

source: inserting a tuple using ``box_insert()``.
ru: вставит кортеж с помощью ``box_insert()``.
