Repository: tarantool/doc
Catalog: locale/*/LC_MESSAGES/doc.po
Languages: ru

source: Alternatively, download Apple's default Xcode toolset:
ru: В противном случае, загрузите стандартный пакет Xcode для разработки:

source: For FreeBSD (instructions below are for FreeBSD 10.1 release), say:
ru: Если вы используете FreeBSD (команды для FreeBSD 10.1), выполните команду:

source: If some Python modules are not available in a repository, it is best to set up the modules by getting a tarball and doing the setup with ``python setup.py`` like this:
ru: Если некоторые модули Python недоступны в репозитории, лучше всего произвести настройку модулей, скачав пакет в формате TAR и выполнив установку с помощью ``python setup.py`` следующим образом:

source: $ # On some machines, this initial command may be necessary: $ wget https://bootstrap.pypa.io/ez_setup.py -O - | sudo python $ # Python module for parsing YAML (pyYAML), for test suite: $ # (If wget fails, check at http://pyyaml.org/wiki/PyYAML $ # what the current version is.) $ cd ~ $ wget http://pyyaml.org/download/pyyaml/PyYAML-3.10.tar.gz $ tar -xzf PyYAML-3.10.tar.gz $ cd PyYAML-3.10 $ sudo python setup.py install
ru: $ # На некоторых машинах может потребоваться такая начальная команда: $ wget https://bootstrap.pypa.io/ez_setup.py -O - | sudo python $ # Модуль Python для анализа YAML (pyYAML) для набора тестов: $ # (Если wget не работает, проверьте на сайте http://pyyaml.org/wiki/PyYAML $ # актуальность версии.) $ cd ~ $ wget http://pyyaml.org/download/pyyaml/PyYAML-3.10.tar.gz $ tar -xzf PyYAML-3.10.tar.gz $ cd PyYAML-3.10 $ sudo python setup.py install

source: Finally, use Python ``pip`` to bring in Python packages that may not be up-to-date in the distro repositories. (On CentOS 7, it will be necessary to install ``pip`` first, with :code:`sudo yum install epel-release` followed by :code:`sudo yum install python-pip`.)
ru: Наконец, используйте ``pip`` в Python, чтобы импортировать пакеты Python, которые могут быть неактуальны в репозиториях дистрибутивов. (В CentOS 7 будет необходимо сначала установить ``pip`` так: :code:`sudo yum install epel-release`, а затем :code:`sudo yum install python-pip`.)

source: This step is only necessary once, the first time you do a download.
ru: Это действие следует выполнить только один раз при первой загрузке.

source: On rare occasions, the submodules need to be updated again with the command:
ru: В редких случаях вложенные модули необходимо снова обновить с помощью команды:

source: Use CMake to initiate the build.
ru: Используйте CMake, чтобы начать сборку.

source: $ cd ~/tarantool $ make clean # unnecessary, added for good luck $ rm CMakeCache.txt # unnecessary, added for good luck $ cmake . # start initiating with build type=Debug
ru: $ cd ~/tarantool $ make clean # необязательно, добавлено на удачу $ rm CMakeCache.txt # необязательно, добавлено на удачу $ cmake . # начать с типом сборки = Debug (отладка)

source: On some platforms, it may be necessary to specify the C and C++ versions, for example:
ru: На некоторых платформах может потребоваться указать версии C и C++, например:

source: The CMake option for specifying build type is :samp:`-DCMAKE_BUILD_TYPE={type}`, where :samp:`{type}` can be:
ru: Чтобы указать тип сборки в CMake используется опция :samp:`-DCMAKE_BUILD_TYPE={type}`, где :samp:`{type}` может быть:

source: ``Debug`` -- used by project maintainers
ru: ``Debug`` -- отладка, используется эксплуатационным персоналом на проекте

source: ``Release`` -- used only if the highest performance is required
ru: ``Release`` -- релиз, используется только при необходимости высокой производительности

source: ``RelWithDebInfo`` -- used for production, also provides debugging capabilities
ru: ``RelWithDebInfo`` -- используется для сборки в эксплуатации, также предоставляет возможности отладки

source: The CMake option for hinting that the result will be distributed is :code:`-DENABLE_DIST=ON`. If this option is on, then later ``make install`` will install ``tarantoolctl`` files in addition to ``tarantool`` files.
ru: Чтобы указать в CMake, что результат будет распределен, используется опция :code:`-DENABLE_DIST=ON`. При наличии такой опции ``make install`` в дальнейшем установит файлы ``tarantoolctl`` в дополнение к файлам ``tarantool``.

source: Use ``make`` to complete the build.
ru: Используйте ``make`` для завершения сборки.

source: For FreeBSD, use ``gmake`` instead.
ru: В FreeBSD используйте вместо этого ``gmake``.

source: This creates the 'tarantool' executable in the ``src/`` directory.
ru: При этом создается исполняемый файл 'tarantool' в директории ``src/``.

source: Next, it's highly recommended to say ``make install`` to install Tarantool to the ``/usr/local`` directory and keep your system clean. However, it is possible to run the Tarantool executable without installation.
ru: Далее настоятельно рекомендуется выполнить команду ``make install`` для установки Tarantool'а в директорию ``/usr/local`` и поддержания порядка в системе. Однако, можно запустить исполняемый файл и без установки.

source: Run the test suite.
ru: Проведите тестирование.

source: This step is optional. Tarantool's developers always run the test suite before they publish new versions. You should run the test suite too, if you make any changes in the code. Assuming you downloaded to ``~/tarantool``, the principal steps are:
ru: Это необязательное действие. Разработчики Tarantool'а всегда проводят тестирование до публикации новых версий. Следует проводить тестирование, если внесены изменения в код. Итак, после загрузки в ``~/tarantool`` основные действия:

source: $ # make a subdirectory named `bin` $ mkdir ~/tarantool/bin $ # link Python to bin (this may require superuser privileges) $ ln /usr/bin/python ~/tarantool/bin/python $ # get to the test subdirectory $ cd ~/tarantool/test $ # run tests using Python $ PATH=~/tarantool/bin:$PATH ./test-run.py
ru: $ # создание поддиректории под названием `bin` $ mkdir ~/tarantool/bin $ # привязка Python к bin (могут потребовать права пользователя superuser) $ ln /usr/bin/python ~/tarantool/bin/python $ # переход в поддиректорию с тестами $ cd ~/tarantool/test $ # проведение тестирования с помощью Python $ PATH=~/tarantool/bin:$PATH ./test-run.py

source: The output should contain reassuring reports, for example:
ru: Вывод должен включать в себя обнадеживающие результаты, например:

source: To prevent later confusion, clean up what's in the ``bin`` subdirectory:
ru: Во избежание путаницы очистите поддиректорию ``bin``:

source: Make RPM and Debian packages.
ru: Создайте пакеты RPM и Debian.

source: This step is optional. It's only for people who want to redistribute Tarantool. We highly recommend to use official packages from the `tarantool.org <https://tarantool.org/download.html>`_ web-site. However, you can build RPM and Debian packages using `PackPack <https://github.com/packpack/packpack>`_ or using the ``dpkg-buildpackage`` or ``rpmbuild`` tools. Please consult ``dpkg`` or ``rpmbuild`` documentation for details.
ru: Это необязательное действие, которое следует выполнить только тем, кто хочет перераспределить Tarantool. Мы настоятельно рекомендуем использовать официальные пакеты с сайта `tarantool.org <https://tarantool.org/download.html>`_. Однако, можно собрать пакеты RPM и Debian с помощью `PackPack <https://github.com/packpack/packpack>`_ или путем использования средств ``dpkg-buildpackage`` или ``rpmbuild``. Для получения более подробной информации обратитесь к документации по ``dpkg`` или ``rpmbuild``.

source: Verify your Tarantool installation.
ru: Проверьте установку Tarantool'а.

source: $ # if you installed tarantool locally after build $ tarantool $ # - OR - $ # if you didn't install tarantool locally after build $ ./src/tarantool
ru: $ # если tarantool установлен локально после сборки $ tarantool $ # - ИЛИ - $ # если tarantool не установлен локально после сборки $ ./src/tarantool

source: This starts Tarantool in the interactive mode.
ru: Tarantool запустится в интерактивном режиме.

source: See also:
ru: См. также:

source: C Style Guide
ru: Руководство по написанию кода на C

source: The project's coding style is based on a version of the Linux kernel coding style.
ru: Стиль программирования проекта основан на версии стиля программирования ядра Linux.

source: The latest version of the Linux style can be found at: http://www.kernel.org/doc/Documentation/CodingStyle
ru: Последнюю версию стиля программирования Linux можно найти по ссылке: http://www.kernel.org/doc/Documentation/CodingStyle

source: Since it is open for changes, the version of style that we follow, one from 2007-July-13, will be also copied later in this document.
ru: Мы придерживаемся версии от 13 июля 2007 года, которая приводится ниже в документе.

source: There are a few additional guidelines, either unique to Tarantool or deviating from the Kernel guidelines.
ru: Здесь мы приводим дополнительные рекомендации, которые либо специфичны для Tarantool'а, либо отличаются от рекомендаций по программированию ядра Linux.

source: Chapters 10 "Kconfig configuration files", 11 "Data structures", 13 "Printing kernel messages", 14 "Allocating memory" and 17 "Don't re-invent the kernel macros" do not apply, since they are specific to Linux kernel programming environment.
ru: Следующие главы не применимы, поскольку они специфичны для среды программирования ядра Linux: 10 "Конфигурационные файлы Kconfig", 11 "Структуры данных", 13 "Вывод сообщений ядра", 14 "Выделение памяти" и 17 "Не изобретайте макросы снова".

source: The rest of Linux Kernel Coding Style is amended as follows:
ru: Остальные главы документа "Стиль программирования ядра Linux" изменяются следующим образом:

source: General guidelines
ru: Общие рекомендации

source: We use Git for revision control. The latest development is happening in the default branch (currently ``2.0``). Our git repository is hosted on github, and can be checked out with ``git clone git://github.com/tarantool/tarantool.git`` (anonymous read-only access).
ru: Для управления версиями мы пользуемся Git. Последние разработки ведутся в ветке, используемой по умолчанию (сейчас ``2.0``). Наш git-репозиторий находится на github, его можно посмотреть выгрузить с помощью ``git clone git://github.com/tarantool/tarantool.git`` (для анонимного пользователя доступ только для чтения).

source: If you have any questions about Tarantool internals, please post them on the developer discussion list, https://groups.google.com/forum/#!forum/tarantool. However, please be warned: Launchpad silently deletes posts from non-subscribed members, thus please be sure to have subscribed to the list prior to posting. Additionally, some engineers are always present on #tarantool channel on irc.freenode.net.
ru: Если у вас есть вопросы о внутреннем устройстве Tarantool'а, разместите их в списке вопросов к обсуждению для разработчиков: https://groups.google.com/forum/#!forum/tarantool. Однако, предупреждаем: Launchpad молча удаляет сообщения от тех, кто не является подписчиком, поэтому обязательно подпишитесь на список перед публикацией. Кроме того, несколько инженеров всегда находятся на канале #tarantool в irc.freenode.net.

source: Commenting style
ru: Стиль комментирования кода

source: Use Doxygen comment format, Javadoc flavor, i.e. `@tag` rather than `\tag`. The main tags in use are @param, @retval, @return, @see, @note and @todo.
ru: Используйте формат комментирования Doxygen, разновидность Javadoc, то есть `@tag` вместо `\tag`. Основные используемые теги: @param, @retval, @return, @see, @note и @todo.

source: Every function, except perhaps a very short and obvious one, should have a comment. A sample function comment may look like below:
ru: Каждая функция, за исключением, пожалуй, очень короткой и очевидной, должна быть прокомментирована. Пример комментария функции может выглядеть следующим образом:

source: /** Write all data to a descriptor. * * This function is equivalent to 'write', except it would ensure * that all data is written to the file unless a non-ignorable * error occurs. * * @retval 0 Success * * @reval 1 An error occurred (not EINTR) * / static int write_all(int fd, void \*data, size_t len);
ru: /** Запись всех данных в дескриптор. * * Эта функция аналогична 'write' во всём кроме того, что она обеспечивает * запись всех данных в файл, если не возникает ошибка, * которую нельзя игнорировать. * * @retval 0 Выполнено * * @reval 1 Ошибка (не EINTR) * / static int write_all(int fd, void \*data, size_t len);

source: Public structures and important structure members should be commented as well.
ru: Доступные структуры и важные элементы структуры также должны быть прокомментированы.

source: Header files
ru: Файлы заголовка

source: Use header guards. Put the header guard in the first line in the header, before the copyright or declarations. Use all-uppercase name for the header guard. Derive the header guard name from the file name, and append _INCLUDED to get a macro name. For example, core/log_io.h -> CORE_LOG_IO_H_INCLUDED. In ``.c`` (implementation) file, include the respective declaration header before all other headers, to ensure that the header is self- sufficient. Header "header.h" is self-sufficient if the following compiles without errors:
ru: Используйте защиту заголовка. Поместите защиту заголовка в первую строку заголовка до авторского права или объявления. Для защиты заголовка используйте имя в верхнем регистре. Выводите имя защиты заголовка из имени файла и добавьте _INCLUDED, чтобы получить имя макроса. Например, core/log_io.h -> CORE_LOG_IO_H_INCLUDE. В файле ``.c`` (реализация) следует включить соответствующий заголовок с объявлением перед всеми другими заголовками, чтобы убедиться, что заголовок является автономным. Заголовок "header.h" является автономным, если компилируется без ошибок:

source: Allocating memory
ru: Выделение памяти

source: Prefer the supplied slab (salloc) and pool (palloc) allocators to malloc()/free() for any performance-intensive or large memory allocations. Repetitive use of malloc()/free() can lead to memory fragmentation and should therefore be avoided.
ru: Предпочтительно использовать предоставляемые распределители slab'ов (salloc) и пулов (palloc) вместо malloc()/free() для любых операций выделения памяти большого объема. Многократное использование malloc()/free() может привести к фрагментации памяти, чего следует избегать.

source: Always free all allocated memory, even allocated at start-up. We aim at being valgrind leak-check clean, and in most cases it's just as easy to free() the allocated memory as it is to write a valgrind suppression. Freeing all allocated memory is also dynamic-load friendly: assuming a plug-in can be dynamically loaded and unloaded multiple times, reload should not lead to a memory leak.
ru: Всегда освобождайте всю выделенную память, даже выделенную при запуске. Мы стремимся к тому, чтобы valgrind не находил утечек памяти, и в большинстве случаев так же легко освободить выделенную память по free(), как и записать подавление valgrind. Освобождение всей выделенной памяти также помогает динамическому балансированию нагрузки: предполагается, что подключаемый модуль может динамически загружаться и выгружаться несколько раз, перезагрузка не должна приводить к утечке памяти.

source: Other
ru: Прочее

source: Select GNU C99 extensions are acceptable. It's OK to mix declarations and statements, use true and false.
ru: Допускаются расширения GNU C99. Можно смешивать операторы и объявления в выражениях.

source: The not-so-current list of all GCC C extensions can be found at: http://gcc.gnu.org/onlinedocs/gcc-4.3.5/gcc/C-Extensions.html
ru: Не слишком актуальный список всех расширений семейства языка C можно найти по ссылке: http://gcc.gnu.org/onlinedocs/gcc-4.3.5/gcc/C-Extensions.html

source: Linux kernel coding style
ru: Стиль программирования ядра Linux

source: This is a short document describing the preferred coding style for the linux kernel. Coding style is very personal, and I won't _force_ my views on anybody, but this is what goes for anything that I have to be able to maintain, and I'd prefer it for most other things too. Please at least consider the points made here.
ru: В данном коротком документе описывается предпочтительный стиль программирования для ядра Linux. Стиль программирования -- это личное дело каждого, и я не буду никому _навязывать_ свои убеждения, но поскольку это касается всего, что я должен поддерживать, я бы предпочел, чтобы эти правила использовали повсеместно. Пожалуйста, хотя бы рассмотрите описываемые здесь пункты.

source: First off, I'd suggest printing out a copy of the GNU coding standards, and NOT read it. Burn them, it's a great symbolic gesture.
ru: Для начала я предлагаю вам распечатать копию стандартов написания кода GNU и НЕ читать их. Сожгите их в качестве весьма символического жеста.

source: Anyway, here goes:
ru: В любом случае, поехали:

source: Chapter 1: Indentation
ru: Глава 1: Отступы

source: Tabs are 8 characters, and thus indentations are also 8 characters. There are heretic movements that try to make indentations 4 (or even 2!) characters deep, and that is akin to trying to define the value of PI to be 3.
ru: Табуляция составляет 8 символов, то есть отступы будут также в 8 символов. Появляются отступнические движения, которые призывают делать отступы в 4 (или даже 2!) символа, а это сродни попытке округлить число Пи до 3.

source: Rationale: The whole idea behind indentation is to clearly define where a block of control starts and ends. Especially when you've been looking at your screen for 20 straight hours, you'll find it a lot easier to see how the indentation works if you have large indentations.
ru: Обоснование: Основная идея отступов состоит в том, чтобы показать, где начинается и заканчивается логический блок кода. Особенно если вы смотрите на один и тот же код в течение 20 часов, трудно не заметить пользу больших отступов.

source: Now, some people will claim that having 8-character indentations makes the code move too far to the right, and makes it hard to read on a 80-character terminal screen. The answer to that is that if you need more than 3 levels of indentation, you're screwed anyway, and should fix your program.
ru: Некоторые могут возразить, что отступ в 8 символов делает код слишком широким, особенно на 80-знаковой строке терминала. Ответ: Если вам понадобилось более трех уровней отступа, вы что-то делаете неправильно, и вам следует переписать этот участок.

source: In short, 8-char indents make things easier to read, and have the added benefit of warning you when you're nesting your functions too deep. Heed that warning.
ru: Короче говоря, отступы в 8 символов облегчают чтение кода, да еще и предупреждают, когда вы слишком глубоко встраиваете свои функции. Прислушайтесь к этому.

source: The preferred way to ease multiple indentation levels in a switch statement is to align the "switch" and its subordinate "case" labels in the same column instead of "double-indenting" the "case" labels. e.g.:
ru: Лучше всего упростить несколько уровней отступов в операторе switch, выравнивая "switch" и его вспомогательные метки "case" в одном столбце вместо использования двойных отступов для меток "case", например:

source: Don't put multiple statements on a single line unless you have something to hide:
ru: Не размещайте несколько операторов на одной строке, если вам нечего скрывать:

source: Don't put multiple assignments on a single line either. Kernel coding style is super simple. Avoid tricky expressions.
ru: И не размещайте несколько операторов присваивания на одной строке. Стиль программирования ядра чрезвычайно прост. Избегайте сложных выражений.

source: Outside of comments, documentation and except in Kconfig, spaces are never used for indentation, and the above example is deliberately broken.
ru: За пределами комментариев, документации и Kconfig, пробелы никогда не используются для отступов, и приведенный выше пример намеренно нарушен.

source: Get a decent editor and don't leave whitespace at the end of lines.
ru: Найдите достойный редактор и не оставляйте пробелы в конце строки.

source: Chapter 2: Breaking long lines and strings
ru: Глава 2: Разрыв длинных строк

source: Coding style is all about readability and maintainability using commonly available tools.
ru: Смысл стиля программирования заключается в читаемости и удобстве сопровождения с использованием общедоступных средств.

source: Statements longer than 80 columns will be broken into sensible chunks. Descendants are always substantially shorter than the parent and are placed substantially to the right. The same applies to function headers with a long argument list. Long strings are as well broken into shorter strings. The only exception to this is where exceeding 80 columns significantly increases readability and does not hide information.
ru: Операторы длиной более 80 символов будут разбиты на логические части. Последующие части значительно короче основной и смещены вправо. То же относится к заголовкам функций с длинным списком аргументов. Длинные строки также разбиваются на более короткие строки. Единственным исключением может быть случай, если превышение ограничений повысит читаемость и не скроет необходимую информацию.

source: Chapter 3: Placing Braces and Spaces
ru: Глава 3: Фигурные скобки и пробелы

source: The other issue that always comes up in C styling is the placement of braces. Unlike the indent size, there are few technical reasons to choose one placement strategy over the other, but the preferred way, as shown to us by the prophets Kernighan and Ritchie, is to put the opening brace last on the line, and put the closing brace first, thusly:
ru: Другой проблемой, которая всегда возникает в программировании на C, является размещение фигурных скобок. В отличие от отступов, есть несколько технических обоснований, чтобы выбрать один способ, а не другой, но предпочтительно, как нам показали великие Керниган и Ричи, поместить открывающую скобку в конце строки, а закрывающую в начале новой строки:

source: This applies to all non-function statement blocks (if, switch, for, while, do). e.g.:
ru: Это применимо ко всем блокам операторов без функций (if, switch, for, while, do), например:

source: However, there is one special case, namely functions: they have the opening brace at the beginning of the next line, thus:
ru: И только в особенных случаях, а именно для функций, открывающая скобка размещается в начале следующей строки:

source: Heretic people all over the world have claimed that this inconsistency is ... well ... inconsistent, but all right-thinking people know that (a) K&R are _right_ and (b) K&R are right. Besides, functions are special anyway (you can't nest them in C).
ru: Отступники по всему миру утверждали, что такая несогласованность ... ну ... несогласованна, но все здравомыслящие люди знают: (a) K&R _правы_, (б) K&R правы. Кроме того, функции в любом случае будут особенными (в C их нельзя вложить).

source: Note that the closing brace is empty on a line of its own, _except_ in the cases where it is followed by a continuation of the same statement, ie a "while" in a do-statement or an "else" in an if-statement, like this:
ru: Обратите внимание, что за закрывающей скобкой на отдельной строке ничего нет, _кроме_ тех случаев, когда за ней следует продолжение того же оператора, то есть "while" в do-операторе или "else" в if-операторе, например:

source: and
ru: и

source: Rationale: K&R.
ru: Обоснование: K&R.
