Repository: tarantool/doc
Catalog: locale/*/LC_MESSAGES/doc.po
Languages: ru

source: The second server instance will connect with :ref:`console.connect <console-connect>`, and then will cause a display of the variables that were set by the trigger functions.
ru: Второй экземпляр сервера подключится по :ref:`console.connect <console-connect>`, а затем отобразит переменные, определенные функциями с триггером.

source: -- On the first server instance, which listens on port 3301 box.cfg{listen=3301} function function1() print('function 1, box.session.user()='..box.session.user()) end function function2(user_name) print('function 2, box.session.user()='..box.session.user()) print('function 2, user_name='..user_name) end function function3(user_name, status) print('function 3, box.session.user()='..box.session.user()) print('function 3, user_name='..user_name) if status == true then print('function 3, status = true, authorization succeeded') end end box.session.on_auth(function1) box.session.on_auth(function2) box.session.on_auth(function3) box.schema.user.passwd('admin')
ru: -- На первом экземпляре сервера, прослушивание на котором настроено на порт 3301 box.cfg{listen=3301} function function1() print('function 1, box.session.user()='..box.session.user()) end function function2(user_name) print('function 2, box.session.user()='..box.session.user()) print('function 2, user_name='..user_name) end function function3(user_name, status) print('function 3, box.session.user()='..box.session.user()) print('function 3, user_name='..user_name) if status == true then print('function 3, status = true, authorization succeeded') end end box.session.on_auth(function1) box.session.on_auth(function2) box.session.on_auth(function3) box.schema.user.passwd('admin')

source: -- On the second server instance, that connects to port 3301 console = require('console') console.connect('admin:admin@localhost:3301')
ru: -- На втором экземпляре сервера, который подключается по порту 3301 console = require('console') console.connect('admin:admin@localhost:3301')

source: The result looks like this:
ru: Теперь результат выглядит следующим образом:

source: Submodule `box.slab`
ru: Вложенный модуль `box.slab`

source: The ``box.slab`` submodule provides access to slab allocator statistics. The slab allocator is the main allocator used to store :ref:`tuples <index-box_tuple>`. This can be used to monitor the total memory usage and memory fragmentation.
ru: Вложенный модуль ``box.slab`` предоставляет доступ к статистике распределения slab. Механизм распределения slab представляет собой основной тип распределения для хранения :ref:`кортежей <index-box_tuple>`. Такое распределение можно использовать для отслеживания использования памяти и фрагментации памяти.

source: Below is a list of all ``box.slab`` functions.
ru: Ниже приведен перечень всех функций модуля ``box.slab``.

source: Show a memory usage report for Lua runtime
ru: Отображение отчета по использованию памяти во время исполнения Lua-кода

source: Show an aggregated memory usage report for slab allocator
ru: Отображение обобщенного отчета по использованию памяти для распределения slab

source: Show a detailed memory usage report for slab allocator
ru: Отображение подробного отчета по использованию памяти для распределения slab

source: Show a memory usage report (in bytes) for the Lua runtime.
ru: Отображение отчета по использованию памяти (в байтах) во время исполнения Lua-кода.

source: ``lua`` is the heap size of the Lua garbage collector;
ru: ``lua`` -- это размер динамической памяти сборщика мусора в Lua;

source: ``maxalloc`` is the maximal memory quota that can be allocated for Lua;
ru: ``maxalloc`` -- это максимальная квота памяти, которую можно выделить для Lua;

source: ``used`` is the current memory size used by Lua.
ru: ``used`` -- объем памяти, используемый Lua в данный момент.

source: Show an aggregated memory usage report (in bytes) for the slab allocator.
ru: Отображение обобщенного отчета по использованию памяти (в байтах) для распределения slab.

source: This report is useful for assessing out-of-memory risks: the risks are high if both ``arena_used_ratio`` and ``quota_used_ratio`` are high (90-95%).
ru: Данный отчет используется для оценки риска нехватки памяти: риск высокий, если высоки значения и ``arena_used_ratio``, и ``quota_used_ratio`` (90-95%).

source: If ``quota_used_ratio`` is low, then high ``arena_used_ratio`` and/or ``items_used_ratio`` indicate that the memory fragmentation is low (i.e. the memory is used efficiently).
ru: Если значение ``quota_used_ratio`` низкое, то высокое значение ``arena_used_ratio`` и/или ``items_used_ratio`` указывает на низкую фрагментацию памяти (т.е. память используется эффективно).

source: If ``quota_used_ratio`` is high (approaching 100%), then low ``arena_used_ratio`` (50-60%) indicates that the memory is heavily fragmentized. Most probably, there is no immediate out-of-memory risk in this case, but generally this is an issue to consider. For example, probable risks are that the entire memory quota is used for tuples, and there is are no slabs left for a piece of an index. Or that all slabs are allocated for storing tuples, but in fact all the slabs are half-empty.
ru: Если значение ``quota_used_ratio`` высокое (достигает 100%), то низкое значение ``arena_used_ratio`` (50-60%) указывает на значительную фрагментацию памяти. Весьма вероятно, что в данном случае непосредственного риска нехватки памяти нет, но такую проблему следует тщательно рассмотреть. Например, есть риск того, что вся квота памяти используется на кортежи, а для части индекса slab'ов нет. Или все slab'ы выделены на хранение кортежей, а в действительности все они наполовину пусты.

source: ``items_size`` is the *total* amount of memory (including allocated, but currently free slabs) used only for tuples, no indexes;
ru: ``items_size`` -- это *общий* объем памяти (включая выделенные, но в данный момент свободные slab'ы), который используется только для кортежей, а не для индексов;

source: ``items_used_ratio`` = ``items_used`` / ``slab_count`` * ``slab_size`` (these are slabs used only for tuples, no indexes);
ru: ``items_used_ratio`` = ``items_used`` / ``slab_count`` * ``slab_size`` (это slab'ы, которые используются только для кортежей, не для индексов);

source: ``items_used`` is the *efficient* amount of memory (omitting allocated, but currently free slabs) used only for tuples, no indexes;
ru: ``items_used`` -- это *эффективный* объем памяти (не включая выделенные, но в данный момент свободные slab'ы), который используется только для кортежей, а не для индексов;

source: ``quota_used`` is the amount of memory that is already distributed to the slab allocator;
ru: ``quota_used`` -- это объем памяти, уже выделенный для распределения slab;

source: ``arena_size`` is the *total* memory used for tuples and indexes together (including allocated, but currently free slabs);
ru: ``arena_size`` -- это *общий* объем памяти, используемый для кортежей и индексов (включая выделенные, но в данный момент свободные slab'ы);

source: ``arena_used`` is the *efficient* memory used for storing tuples and indexes together (omitting allocated, but currently free slabs).
ru: ``arena_used`` -- это *эффективный* объем памяти, используемый для кортежей и индексов (не включая выделенные, но в данный момент свободные slab'ы).

source: Show a detailed memory usage report (in bytes) for the slab allocator. The report is broken down into groups by *data item size* as well as by *slab size* (64-byte, 136-byte, etc). The report includes the memory allocated for storing both tuples and indexes.
ru: Отображение подробного отчета об использовании памяти (в байтах) для распределения slab. Отчет разбивается на группы по *размеру элементов данных*, а также по *размеру slab'а* (64 байта, 136 байтов и т.д.). Отчет включает в себя информацию о памяти, выделенной на хранение и кортежей, и индексов.

source: ``mem_free`` is the allocated, but currently unused memory;
ru: ``mem_free`` -- это выделенная, но не используемая в данный момент память;

source: ``mem_used`` is the memory used for storing data items (tuples and indexes);
ru: ``mem_used`` -- это память, используемая для хранения элементов данных (кортежей и индексов);

source: ``item_count`` is the number of stored items;
ru: ``item_count`` -- это количество хранимых элементов;

source: ``item_size`` is the size of each data item;
ru: ``item_size`` -- это размер каждого элемента данных;

source: ``slab_count`` is the number of slabs allocated;
ru: ``slab_count`` -- это количество выделенных slab'ов;

source: ``slab_size`` is the size of each allocated slab.
ru: ``slab_size`` -- это размер каждого выделенного slab'а.

source: Here is a sample report for the first group:
ru: Ниже представлен пример отчета для первой группы:

source: This report is saying that there are 2 data items (``item_count`` = 2) stored in one (``slab_count`` = 1) 24-byte slab (``item_size`` = 24), so ``mem_used`` = 2 * 24 = 48 bytes. Also, ``slab_size`` is 16384 bytes, of which 16384 - 48 = 16232 bytes are free (``mem_free``).
ru: В отчете показано, что есть два элемента данных (``item_count`` = 2), которые хранятся в одном (``slab_count`` = 1) 24-байтовом slab'е (``item_size`` = 24), поэтому объем используемой памяти ``mem_used`` = 2 * 24 = 48 байтов. Кроме того, размер slab'а ``slab_size`` составляет 16384 байта, из которых 16384 - 48 = 16232 байта свободны (``mem_free``).

source: A complete report would show memory usage statistics for all groups:
ru: В полном отчете будет статистика по использованию памяти во всех группах:

source: The total ``mem_used`` for all groups in this report equals ``arena_used`` in :ref:`box.slab.info() <box_slab_info>` report.
ru: Общий объем используемой памяти ``mem_used`` для всех групп в данном отчете равен ``arena_used`` в отчете :ref:`box.slab.info() <box_slab_info>`.

source: Submodule `box.space`
ru: Вложенный модуль `box.space`

source: The ``box.space`` submodule has the data-manipulation functions ``select``, ``insert``, ``replace``, ``update``, ``upsert``, ``delete``, ``get``, ``put``. It also has members, such as id, and whether or not a space is enabled. Submodule source code is available in file `src/box/lua/schema.lua <https://github.com/tarantool/tarantool/blob/1.7/src/box/lua/schema.lua>`_.
ru: Вложенный модуль ``box.space`` включает в себя функции по управлению данными ``select`` (выборка), ``insert`` (вставка), ``replace`` (замена), ``update`` (обновление), ``upsert`` (обновление и вставка), ``delete`` (удаление), ``get`` (получение), ``put`` (выдача). Также в модуле есть такие элементы, как id, и указание на активность спейса. Код вложенного модуля находится в файле `src/box/lua/schema.lua <https://github.com/tarantool/tarantool/blob/1.7/src/box/lua/schema.lua>`_.

source: Below is a list of all ``box.space`` functions and members.
ru: Ниже приведен перечень всех функций и элементов модуля ``box.space``.

source: Generate key + Insert a tuple
ru: Генерация ключа + вставка кортежа

source: Get count of bytes
ru: Подсчет байтов

source: Get count of tuples
ru: Подсчет кортежей

source: Delete a tuple
ru: Удаление кортежа

source: Destroy a space
ru: Удаление спейса

source: Declare field names and types
ru: Объявление имен и типов полей

source: Select a tuple
ru: Выбор кортежа

source: Insert a tuple
ru: Вставка кортежа

source: Create a replace trigger with a function that cannot change the tuple
ru: Создание триггера замены с функцией, которая не может изменять кортеж

source: Create a replace trigger with a function that can change the tuple
ru: Создание триггера замены с функцией, которая может изменять кортеж

source: Insert or replace a tuple
ru: Вставка или замена кортежа

source: Rename a space
ru: Переименование спейса

source: Enable/disable a replace trigger
ru: Включение/отключение триггера замены

source: Select one or more tuples
ru: Выбор одного или более кортежей

source: Delete all tuples
ru: Удаление всех кортежей

source: Flag, true if space is enabled
ru: Флаг, если спейс активен -- true

source: Required number of fields
ru: Необходимое количество полей

source: Numeric identifier of space
ru: Числовой идентификатор спейса

source: Container of space's indexes
ru: Контейнер для индексов спейса

source: (Metadata) List of replica sets
ru: (Метаданные) Список наборов реплик

source: (Metadata) List of function tuples
ru: (Метаданные) Список кортежей с функциями

source: (Metadata) List of indexes
ru: (Метаданные) Список индексов

source: (Metadata) List of privileges
ru: (Метаданные) Список прав

source: (Metadata) List of schemas
ru: (Метаданные) Список схем

source: (Metadata) List of sequences
ru: (Метаданные) Список последовательностей

source: (Metadata) List of spaces
ru: (Метаданные) Список спейсов

source: (Metadata) List of users
ru: (Метаданные) Список пользователей

source: Insert a new tuple using an auto-increment primary key. The space specified by space_object must have an :ref:`'unsigned' or 'integer' or 'number' <index-box_indexed-field-types>` primary key index of type ``TREE``. The primary-key field will be incremented before the insert.
ru: Вставка нового кортежа, используя первичный ключ с автоматическим увеличением. В спейсе, указанном через space_object должен быть первичный TREE-индекс типа :ref:`'unsigned' или 'integer', или 'number' <index-box_indexed-field-types>`. Поле первичного ключа будет увеличиваться перед вставкой.

source: Since version 1.7.5 this method is deprecated – it is better to use a :ref:`sequence <index-box_sequence>`.
ru: Данный метод объявлен устаревшим с версии 1.7.5 -- лучше использовать :ref:`последовательности <index-box_sequence>`.

source: an :ref:`object reference <app_server-object_reference>`
ru: :ref:`ссылка на объект <app_server-object_reference>`

source: tuple's fields, other than the primary-key field
ru: поля кортежа, не включая поле первичного ключа

source: the inserted tuple.
ru: вставленный кортеж.

source: **Complexity factors:** Index size, Index type, Number of indexes accessed, :ref:`WAL settings <cfg_binary_logging_snapshots-rows_per_wal>`.
ru: **Факторы сложности** Размер индекса, тип индекса, количество кортежей, к которым получен доступ, :ref:`настройки журнала упреждающей записи (WAL) <cfg_binary_logging_snapshots-rows_per_wal>`.

source: index has wrong type;
ru: неподходящий тип индекса;

source: primary-key indexed field is not a number.
ru: проиндексированное поле первичного ключа не является числовым.

source: Number of bytes in the space. This number, which is stored in Tarantool's internal memory, represents the total number of bytes in all tuples, not including index keys. For a measure of index size, see :ref:`index_object:bsize() <box_index-bsize>`.
ru: Количество байтов в спейсе. Это число, которое хранится во внутренней памяти Tarantool'а, представляет собой общее количество байтов во всех кортежах, включая ключи индекса. Для получения информации об измерении размера индекса, см. :ref:`index_object:bsize() <box_index-bsize>`.

source: Return the number of tuples. If compared with :ref:`len() <box_space-len>`, this method works slower because ``count()`` scans the entire space to count the tuples.
ru: Возврат количества кортежей. Если сравнивать с :ref:`len() <box_space-len>`, то данный метод работает медленнее, поскольку метод ``count()`` сканирует весь спейс для подсчета кортежей.

source: primary-key field values, must be passed as a Lua table if key is multi-part
ru: значения поля первичного ключа, которые должны возвращаться в виде Lua-таблицы, если ключ составной

source: Number of tuples.
ru: Количество кортежей.

source: Create an :ref:`index <index-box_index>`. It is mandatory to create an index for a space before trying to insert tuples into it, or select tuples from it. The first created index, which will be used as the primary-key index, must be unique.
ru: Создание :ref:`индекса <index-box_index>`. Индекс обязательно должен создаваться для спейса до вставки в него кортежей или выборки. Первый созданный индекс, который будет использоваться в качестве первичного индекса, должен быть уникальным.

source: index object
ru: объект индекса

source: index_object
ru: объект индекса

source: **Options for space_object:create_index()**
ru: **Параметры для space_object:create_index()**

source: type of index
ru: тип индекса

source: string ('HASH' or 'TREE' or 'BITSET' or 'RTREE') Note re storage engine: vinyl only supports 'TREE'
ru: строка ('HASH' или 'TREE', или 'BITSET', или 'RTREE') Примечание про движок базы данных: vinyl поддерживает только 'TREE'

source: unique identifier
ru: уникальный идентификатор

source: last index's id, +1
ru: идентификатор последнего индекса +1

source: index is unique
ru: индекс уникален

source: ``true``
ru: ``true`` (правда)

source: no error if duplicate name
ru: ошибки нет, если имя дублируется

source: ``false``
ru: ``false`` (ложь)

source: field-numbers + types
ru: номера поля + типы

source: {field_no, 'unsigned' or 'string' or 'integer' or 'number' or 'boolean' or 'array' or 'scalar', and optional collation, and optional is_nullable value}
ru: {field_no, 'unsigned' или 'string', или 'integer', или 'number', или 'boolean', или 'array', или 'scalar', возможна сортировка, возможно значение is_nullable}

source: affects :ref:`RTREE <box_index-rtree>` only
ru: только для :ref:`RTREE <box_index-rtree>`

source: affects RTREE only
ru: только для RTREE

source: string ('euclid' or 'manhattan')
ru: строка ('euclid' или 'manhattan')

source: 'euclid'
ru: 'euclid' (Евклидова)

source: affects vinyl only
ru: только для vinyl

source: see section regarding :ref:`specifying a sequence in create_index() <box_schema-sequence_create_index>`
ru: см. раздел об :ref:`указании последовательности для create_index() <box_schema-sequence_create_index>`

source: string or number
ru: строка или число

source: not present
ru: отсутствует

source: The options in the above chart are also applicable for :ref:`index_object:alter() <box_index-alter>`.
ru: Параметры в вышеуказанной таблице также применимы к :ref:`index_object:alter() <box_index-alter>`.

source: **Note re storage engine:** vinyl has extra options which by default are based on configuration parameters :ref:`vinyl_bloom_fpr <cfg_storage-vinyl_bloom_fpr>`, :ref:`vinyl_page_size <cfg_storage-vinyl_page_size>`, :ref:`vinyl_range_size <cfg_storage-vinyl_range_size>`, :ref:`vinyl_run_count_per_level <cfg_storage-vinyl_run_count_per_level>`, and :ref:`vinyl_run_size_ratio <cfg_storage-vinyl_run_size_ratio>` -- see the description of those parameters. The current values can be seen by selecting from :ref:`box.space._index <box_space-index>`.
ru: **Примечание про движок базы данных:** в vinyl'е есть дополнительные параметры, которые по умолчанию основаны на конфигурационных параметрах :ref:`vinyl_bloom_fpr <cfg_storage-vinyl_bloom_fpr>`, :ref:`vinyl_page_size <cfg_storage-vinyl_page_size>`, :ref:`vinyl_range_size <cfg_storage-vinyl_range_size>`, :ref:`vinyl_run_count_per_level <cfg_storage-vinyl_run_count_per_level>` и :ref:`vinyl_run_size_ratio <cfg_storage-vinyl_run_size_ratio>` -- см. описание этих параметров. Текущие значения можно увидеть, сделав выборку из :ref:`box.space._index <box_space-index>`.

source: too many parts;
ru: слишком много частей;

source: index '...' already exists;
ru: индекс '...' уже существует;

source: primary key must be unique.
ru: первичный ключ должен быть уникальным.

source: **Details about index field types:**
ru: **Подробнее о типах полей индекса:**

source: The seven index field types (unsigned | string | integer | number | boolean | array | scalar) differ depending on what values are allowed, and what index types are allowed.
ru: Семь типов полей индекса (unsigned | string | integer | number | boolean | array | scalar) отличаются друг от друга возможными значениями и типами индексов, где можно использовать такие поля.

source: **unsigned**: unsigned integers between 0 and 18446744073709551615, about 18 quintillion. May also be called 'uint' or 'num', but 'num' is deprecated. Legal in memtx TREE or HASH indexes, and in vinyl TREE indexes.
ru: **unsigned**: беззнаковые целые числа от 0 до 18 446 744 073 709 551 615, т.е. около18 квинтиллионов. Также может называться 'uint' или 'num', но 'num' объявлен устаревшим. Используется в индексах типа TREE или HASH в memtx'е, и в TREE-индексах в vinyl'е.

source: **string**: any set of octets, up to the :ref:`maximum length <limitations_bytes_in_index_key>`. May also be called 'str'. Legal in memtx TREE or HASH or BITSET indexes, and in vinyl TREE indexes. A string may have a :ref:`collation <index-collation>`.
ru: **string**: строка, то есть любая последовательность октетов до :ref:`максимальной длины <limitations_bytes_in_index_key>`. Также может называться 'str'. Используется в индексах типа TREE, HASH или BITSET в memtx'е и в TREE-индексах в vinyl'е. В строке может быть :ref:`сортировка <index-collation>`.

source: **integer**: integers between -9223372036854775808 and 18446744073709551615. May also be called 'int'. Legal in memtx TREE or HASH indexes, and in vinyl TREE indexes.
ru: **integer**: целые числа от -9 223 372 036 854 775 808 до 18 446 744 073 709 551 615. Также может называться 'int'. Используется в индексах типа TREE или HASH в memtx'е и в TREE-индексах в vinyl'е.

source: **number**: integers between -9223372036854775808 and 18446744073709551615, single-precision floating point numbers, or double-precision floating point numbers. Legal in memtx TREE or HASH indexes, and in vinyl TREE indexes.
ru: **number**: целые числа от -9 223 372 036 854 775 808 до 18 446 744 073 709 551 615, числа с плавающей запятой с одинарной точностью или с двойной точностью. Используется в индексах типа TREE или HASH в memtx'е и в TREE-индексах в vinyl'е.

source: **boolean**: true or false. Legal in memtx TREE or HASH indexes, and in vinyl TREE indexes.
ru: **boolean**: логическое значение, true (правда) или false (ложь). Используется в индексах типа TREE или HASH в memtx'е и в TREE-индексах в vinyl'е.

source: **array**: array of numbers. Legal in memtx :ref:`RTREE <box_index-rtree>` indexes.
ru: **array**: массив чисел. Используется в :ref:`RTREE-индексах <box_index-rtree>` в memtx'е.

source: **scalar**: booleans (true or false), or integers between -9223372036854775808 and 18446744073709551615, or single-precision floating point numbers, or double-precison floating-point numbers, or strings. When there is a mix of types, the key order is: booleans, then numbers, then strings. Legal in memtx TREE or HASH indexes, and in vinyl TREE indexes.
ru: **scalar**: логические значения (true или false), целые числа от integers between -9 223 372 036 854 775 808 до 18 446 744 073 709 551 615, числа с плавающей запятой с одинарной точностью или с двойной точностью или строки. При использовании нескольких типов, порядок ключей должен быть следующим: логические значения, затем числа, затем строки. Используется в индексах типа TREE или HASH в memtx'е и в TREE-индексах в vinyl'е.

source: Additionally, `nil` is allowed with any index field type if :ref:`is_nullable=true <box_space-is_nullable>` is specified.
ru: Кроме того, допускается нулевое значение `nil` для любого типа поля, если указана такая возможность :ref:`is_nullable=true <box_space-is_nullable>`.

source: **Index field types to use in space_object:create_index()**
ru: **Типы полей в индексах для использования в space_object:create_index()**

source: Index field type
ru: Тип поля для индексирования

source: What can be in it
ru: Чем может быть

source: Where is it legal
ru: Где может использоваться

source: Examples
ru: Примеры

source: integers between 0 and 18446744073709551615
ru: целые числа от 0 до 18 446 744 073 709 551 615
