Repository: tarantool/doc
Catalog: locale/*/LC_MESSAGES/doc.po
Languages: ru

source: The maximal number of bytes in a tuple is roughly equal to :ref:`memtx_max_tuple_size <cfg_storage-memtx_max_tuple_size>` or :ref:`vinyl_max_tuple_size <cfg_storage-vinyl_max_tuple_size>` (with a metadata overhead of about 20 bytes per tuple, which is added on top of useful bytes). By default, the value of either ``memtx_max_tuple_size`` or ``vinyl_max_tuple_size`` is 1,048,576. To increase it, specify a larger value when starting the Tarantool instance. For example, ``box.cfg{memtx_max_tuple_size=2*1048576}``.
ru: Максимальное количество байтов в кортеже примерно равно :ref:`memtx_max_tuple_size <cfg_storage-memtx_max_tuple_size>` или :ref:`vinyl_max_tuple_size <cfg_storage-vinyl_max_tuple_size>` (с ресурсами метаданных около 20 байтов на кортеж, которые добавляются к полезным байтам). Значение ``memtx_max_tuple_size`` или ``vinyl_max_tuple_size`` по умолчанию составляет 1 048 576. Чтобы его увеличить, укажите большее значение при запуске экземпляра Tarantool'а. Например, ``box.cfg{memtx_max_tuple_size=2*1048576}``.

source: **Number of bytes in an index key**
ru: **Количество байтов в индекс-ключе**

source: If a field in a tuple can contain a million bytes, then the index key can contain a million bytes, so the maximum is determined by factors such as :ref:`Number of bytes in a tuple <limitations_bytes_in_tuple>`, not by the index support.
ru: Если поле в кортеже может содержать миллион байтов, то индекс-ключ может содержать миллион байтов, поэтому максимальное количество определяется такими факторами, как :ref:`количество байтов в кортеже <limitations_bytes_in_tuple>`, а не параметрами индекса.

source: **Number of spaces**
ru: **Количество спейсов**

source: The theoretical maximum is 2147483647 (``box.schema.SPACE_MAX``) but the practical maximum is around 65,000.
ru: Теоретически максимальное количество составляет 2 147 483 647 (``box.schema.SPACE_MAX``), но практически максимальное количество -- около 65 000.

source: **Number of connections**
ru: **Количество соединений**

source: The practical limit is the number of file descriptors that one can set with the operating system.
ru: Практически пределом является количество файловых дескрипторов, которые можно определить с операционной системой.

source: **Space size**
ru: **Размер спейса**

source: The total maximum size for all spaces is in effect set by :ref:`memtx_memory <cfg_storage-memtx_memory>`, which in turn is limited by the total available memory.
ru: Итоговый максимальный размер всех спейсов фактически определяется в :ref:`memtx_memory <cfg_storage-memtx_memory>`, который в свою очередь ограничен общим размером свободной памяти.

source: **Update operations count**
ru: **Число операций обновления**

source: The maximum number of operations that can be in a single update is 4000 (``BOX_UPDATE_OP_CNT_MAX``).
ru: Максимальное количество операций, возможное в рамках одного обновления, составляет 4000 (``BOX_UPDATE_OP_CNT_MAX``).

source: **Number of users and roles**
ru: **Количество пользователей и ролей**

source: **Length of an index name or space name or user name**
ru: **Длина имени индекса, имени спейса или имени пользователя**

source: **Number of replicas in a replica set**
ru: **Количество реплик в наборе реплик**

source: Triggers
ru: Триггеры

source: **Triggers**, also known as **callbacks**, are functions which the server executes when certain events happen.
ru: **Триггеры**, которые также называют **обратными вызовами**, представляют собой функции, которые выполняет сервер при наступлении определенных событий.

source: :ref:`connection triggers <box_session-on_connect>`, which are executed when a session begins or ends,
ru: :ref:`триггеры для обработки соединений <box_session-on_connect>`, которые выполняются, когда начинается или заканчивается сессия,

source: :ref:`authentication triggers <box_session-on_auth>`, which are executed during authentication, and
ru: :ref:`триггеры для обработки аутентификации <box_session-on_auth>`, которые выполняются при аутентификации, и

source: :ref:`replace triggers <box_space-on_replace>`, which are for database events.
ru: :ref:`триггеры для обработки замены <box_space-on_replace>`, которые предназначены для событий в базе данных.

source: All triggers have the following characteristics:
ru: У всех триггеров есть следующие особенности:

source: Triggers are defined only by the :ref:`'admin' user <authentication-owners_privileges>`.
ru: Только :ref:`пользователь 'admin' <authentication-owners_privileges>` определяет триггеры.

source: Triggers are stored in the Tarantool instance's memory, not in the database. Therefore triggers disappear when the instance is shut down. To make them permanent, put function definitions and trigger settings into Tarantool's :ref:`initialization script <index-init_label>`.
ru: Триггеры хранятся в памяти экземпляра Tarantool'а, а не в базе данных. Поэтому триггеры пропадают, когда экземпляр отключают. Чтобы сохранить их, поместите определения функции и настройки триггера в :ref:`скрипт инициализации <index-init_label>` Tarantool'а.

source: Triggers have low overhead. If a trigger is not defined, then the overhead is minimal: merely a pointer dereference and check. If a trigger is defined, then its overhead is equivalent to the overhead of calling a function.
ru: Триггеры не приводят к высокой затрате ресурсов. Если триггер не определен, то затрата ресурсов минимальна: только разыменование указателя и проверка. Если триггер определен, то затрата ресурсов аналогична вызову функции.

source: There can be multiple triggers for one event. In this case, triggers are executed in the reverse order that they were defined in.
ru: Для одного события можно определить несколько триггеров. В таком случае триггеры выполняются в обратном порядке относительно того, как их определили.

source: Triggers must work within the event context. However, effects are undefined if a function contains requests which normally could not occur immediately after the event, but only before the return from the event. For example, putting `os.exit() <http://www.lua.org/manual/5.1/manual.html#pdf-os.exit>`_ or :ref:`box.rollback() <box-rollback>` in a trigger function would be bringing in requests outside the event context.
ru: Триггеры должны работать в контексте события. Однако результат не определен, если функция содержит запросы, которые при нормальных условиях не могут быть выполнены непосредственно после события, а только после возврата из события. Например, если указать `os.exit() <http://www.lua.org/manual/5.1/manual.html#pdf-os.exit>`_ или :ref:`box.rollback() <box-rollback>` в триггерной функции, запросы не будут выполняться в контексте события.

source: Triggers are replaceable. The request to "redefine a trigger" implies passing a new trigger function and an old trigger function to one of the "on_event()" functions.
ru: Триггеры можно заменять. Запрос на "замену триггера" подразумевает передачу новой триггерной функции и старой триггерной функции в одну из функций обработки событий "on_event()".

source: The "on_event()" functions all have parameters which are function pointers, and they all return function pointers. Remember that a Lua function definition such as "function f() x = x + 1 end" is the same as "f = function () x = x + 1 end" -- in both cases ``f`` gets a function pointer. And "trigger = box.session.on_connect(f)" is the same as "trigger = box.session.on_connect(function () x = x + 1 end)" -- in both cases ``trigger`` gets the function pointer which was passed.
ru: Во всех функциях обработки событий "on_event()" есть параметры, которые представляют собой указатели функции, и все они возвращают указатели функции. Следует запомнить, что определение Lua-функции, например, "function f() x = x + 1 end" совпадает с "f = function () x = x + 1 end" -- в обоих случаях ``f`` получит указатель функции. А "trigger = box.session.on_connect(f)" -- это то же самое, что "trigger = box.session.on_connect(function () x = x + 1 end)" -- в обоих случаях ``trigger`` получит переданный указатель функции.

source: To get a list of triggers, you can use:
ru: Чтобы получить список триггеров, можно использовать следующее:

source: on_connect() – with no arguments – to return a table of all connect-trigger functions;
ru: on_connect() – без аргументов – чтобы вернуть таблицу со всеми триггерными функциями для обработки соединений;

source: on_auth() to return all authentication-trigger functions;
ru: on_auth(), чтобы вернуть все триггерные функции для обработки аутентификации;

source: on_disconnect() to return all disconnect-trigger functions;
ru: on_disconnect(), чтобы вернуть все триггерные функции для обработки отключений;

source: on_replace() to return all replace-trigger functions made for on_replace().
ru: on_replace(), чтобы вернуть все триггерные функции для обработки замены, сделанные для on_replace().

source: before_replace() to return all replace-trigger functions made for before_replace().
ru: before_replace(), чтобы вернуть все триггерные функции для обработки замены, сделанные для before_replace().

source: Here we log connect and disconnect events into Tarantool server log.
ru: Здесь мы записываем события подключения и отключения в журнал на сервере Tarantool'а.

source: Connectors
ru: Коннекторы

source: This chapter documents APIs for various programming languages.
ru: В этой главе описаны API для различных языков программирования.

source: Protocol
ru: Протокол

source: Tarantool's binary protocol was designed with a focus on asynchronous I/O and easy integration with proxies. Each client request starts with a variable-length binary header, containing request id, request type, instance id, log sequence number, and so on.
ru: Бинарный протокол для передачи данных в Tarantool'е был разработан с учетом потребностей асинхронного ввода-вывода для облегчения интеграции с прокси-серверами. Каждый клиентский запрос начинается с бинарного заголовка переменной длины. В заголовке указывается идентификатор и тип запроса, идентификатор экземпляра, номер записи в журнале и т.д.

source: The mandatory length, present in request header simplifies client or proxy I/O. A response to a request is sent to the client as soon as it is ready. It always carries in its header the same type and id as in the request. The id makes it possible to match a request to a response, even if the latter arrived out of order.
ru: Также в заголовке обязательно указывается длина запроса, что облегчает обработку данных. Ответ на запрос посылается по мере готовности. В заголовке ответа указывается тот же идентификатор и тип запроса, что и в изначальном запросе. По идентификатору можно легко соотнести запрос с ответом, даже если ответ был получен не в порядке отсылки запросов.

source: Unless implementing a client driver, you needn't concern yourself with the complications of the binary protocol. Language-specific drivers provide a friendly way to store domain language data structures in Tarantool. A complete description of the binary protocol is maintained in annotated Backus-Naur form in the source tree: please see the page about :ref:`Tarantool's binary protocol <box_protocol-iproto_protocol>`.
ru: Вдаваться в тонкости реализации Tarantool-протокола нужно только при разработке нового коннектора для Tarantool'а -- см. :ref:`полное описание бинарного протокола в Tarantool'е <box_protocol-iproto_protocol>` в виде аннотированных BNF-диаграмм (Backus-Naur Form). В остальных случаях достаточно взять уже существующий коннектор для нужного вам языка программирования. Такие коннекторы позволяют легко хранить структуры данных из разных языков в формате Tarantool'а.

source: Packet example
ru: Пример пакета данных

source: The Tarantool API exists so that a client program can send a request packet to a server instance, and receive a response. Here is an example of a what the client would send for ``box.space[513]:insert{'A', 'BB'}``. The BNF description of the components is on the page about :ref:`Tarantool's binary protocol <box_protocol-iproto_protocol>`.
ru: С помощью API Tarantool'а клиентские программы могут отправлять пакеты с запросами в адрес экземпляра и получать на них ответы. Вот пример для запроса :code:`box.space[513]:insert{'A', 'BB'}`. Описания компонентов запроса (в виде BNF-диаграмм) вы найдете на странице о :ref:`бинарном протоколе в Tarantool'е <box_protocol-iproto_protocol>`.

source: Component
ru: Компонент

source: Byte #0
ru: Байт #0

source: Byte #1
ru: Байт #1

source: Byte #2
ru: Байт #2

source: Byte #3
ru: Байт #3

source: code for insert
ru: код для вставки

source: rest of header
ru: остаток заголовка

source: 2-digit number: space id
ru: число из 2 цифр: ID спейса

source: code for tuple
ru: код для кортежа

source: 1-digit number: field count = 2
ru: число из 1 цифры: количество полей = 2

source: 1-character string: field[1]
ru: строка из 1 символа: поле[1]

source: 2-character string: field[2]
ru: строка из 2 символов: поле[2]

source: Now, you could send that packet to the Tarantool instance, and interpret the response (the page about :ref:`Tarantool's binary protocol <box_protocol-iproto_protocol>` has a description of the packet format for responses as well as requests). But it would be easier, and less error-prone, if you could invoke a routine that formats the packet according to typed parameters. Something like ``response = tarantool_routine("insert", 513, "A", "B");``. And that is why APIs exist for drivers for Perl, Python, PHP, and so on.
ru: Теперь получившийся пакет можно послать в адрес экземпляра Tarantool'а и затем расшифровать ответ (описания формата пакета ответов и вопросов вы найдете на той же странице о :ref:`бинарном протоколе в Tarantool'е <box_protocol-iproto_protocol>`). Но более простым и верным способом будет вызвать процедуру, которая сформирует готовый пакет с заданными параметрами. Что-то вроде ``response = tarantool_routine("insert", 513, "A", "B");``. Для этого и существуют API для драйверов для Perl, Python, PHP и т.д.

source: Setting up the server for connector examples
ru: Настройка окружения для примеров работы с коннекторами

source: This chapter has examples that show how to connect to a Tarantool instance via the Perl, PHP, Python, node.js, and C connectors. The examples contain hard code that will work if and only if the following conditions are met:
ru: В этой главе приводятся примеры того, как можно установить соединение с Tarantool-сервером с помощью коннекторов для языков Perl, PHP, Python, node.js и C. Обратите внимание, что в примерах указаны фиксированные значения, поэтому для корректной работы всех примеров нужно соблюсти следующие условия:

source: the Tarantool instance (tarantool) is running on localhost (127.0.0.1) and is listening on port 3301 (``box.cfg.listen = '3301'``),
ru: экземпляр (Tarantool) запущен на локальной машине (``localhost = 127.0.0.1``), а прослушивание для него настроено на порту 3301 (``box.cfg.listen = '3301'``),

source: space ``examples`` has id = 999 (``box.space.examples.id = 999``) and has a primary-key index for a numeric field (``box.space[999].index[0].parts[1].type = "unsigned"``),
ru: в базе есть спейс``examples`` с идентификатором 999 (``box.space.examples.id = 999``), и у него есть первичный индекс, построенный по ключу числового типа (``box.space[999].index[0].parts[1].type = "unsigned"``),

source: user 'guest' has privileges for reading and writing.
ru: для пользователя 'guest' настроены права на чтение и запись.

source: It is easy to meet all the conditions by starting the instance and executing this script:
ru: Можно легко соблюсти все условия, запустив экземпляр и выполнив следующий скрипт:

source: See http://github.com/tarantool/tarantool-java/.
ru: См. http://github.com/tarantool/tarantool-java/.

source: Please see https://github.com/mialinx/go-tarantool.
ru: См. https://github.com/mialinx/go-tarantool.

source: See https://github.com/thekvs/tarantoolr.
ru: См. https://github.com/thekvs/tarantoolr.

source: See `Erlang tarantool driver <https://github.com/stofel/taran>`_.
ru: См. `Erlang-драйвер для Tarantool'а <https://github.com/stofel/taran>`_.

source: The most commonly used Perl driver is `tarantool-perl <https://github.com/tarantool/tarantool-perl>`_. It is not supplied as part of the Tarantool repository; it must be installed separately. The most common way to install it is by cloning from GitHub.
ru: Самый используемый драйвер для Perl -- `tarantool-perl <https://github.com/tarantool/tarantool-perl>`_. Он не входит в репозиторий Tarantool'а, его необходимо устанавливать отдельно. Проще всего установить его путем клонирования с GitHub.

source: To avoid minor warnings that may appear the first time ``tarantool-perl`` is installed, start with installing some other modules that ``tarantool-perl`` uses, with `CPAN, the Comprehensive Perl Archive Network <https://en.wikipedia.org/wiki/Cpan>`_:
ru: Во избежание незначительных предупреждений, которые может выдать система после первой установки ``tarantool-perl``, начните установку с некоторых других модулей, которые использует ``tarantool-perl``, с `CPAN, the Comprehensive Perl Archive Network (Всеобъемлющая сеть архивов Perl) <https://ru.wikipedia.org/wiki/CPAN>`_:

source: Then, to install ``tarantool-perl`` itself, say:
ru: Затем для установки самого ``tarantool-perl``, выполните:

source: Here is a complete Perl program that inserts ``[99999,'BB']`` into ``space[999]`` via the Perl API. Before trying to run, check that the server instance is listening at ``localhost:3301`` and that the space ``examples`` exists, as :ref:`described earlier <index-connector_setting>`. To run, paste the code into a file named :file:`example.pl` and say :samp:`perl example.pl`. The program will connect using an application-specific definition of the space. The program will open a socket connection with the Tarantool instance at ``localhost:3301``, then send an :ref:`space_object:INSERT<box_space-insert>` request, then — if all is well — end without displaying any messages. If Tarantool is not running on ``localhost`` with :ref:`listen<cfg_basic-listen>` port = 3301, the program will print “Connection refused”.
ru: Далее приводится пример полноценной программы на языке Perl, которая осуществляет вставку кортежа ``[99999,'BB']`` в спейс ``space[999]`` с помощью API для языка Perl. Перед запуском проверьте, что у экземпляра задан порт для прослушивания на ``localhost:3301``, и в базе создан спейс ``examples``, как :ref:`описано выше <index-connector_setting>`. Чтобы запустить программу, сохраните код в файл с именем :file:`example.pl` и выполните команду :samp:`perl example.pl`. Программа установит соединение, используя определение спейса для этой цели, откроет сокет для соединения с экземпляром по ``localhost:3301``, пошлет запрос :ref:`space_object:INSERT<box_space-insert>`, а затем -- если всё хорошо -- закончит работу без каких-либо сообщений. Если Tarantool не запущен на ``localhost`` на :ref:`прослушивание <cfg_basic-listen>` по порту = 3301, то программа выдаст сообщение об ошибке "Connection refused".

source: #!/usr/bin/perl use DR::Tarantool ':constant', 'tarantool'; use DR::Tarantool ':all'; use DR::Tarantool::MsgPack::SyncClient; my $tnt = DR::Tarantool::MsgPack::SyncClient->connect( host => '127.0.0.1', # look for tarantool on localhost port => 3301, # on port 3301 user => 'guest', # username. for 'guest' we do not also say 'password=>...' spaces => { 999 => { # definition of space[999] ... name => 'examples', # space[999] name = 'examples' default_type => 'STR', # space[999] field type is 'STR' if undefined fields => [ { # definition of space[999].fields ... name => 'field1', type => 'NUM' } ], # space[999].field[1] name='field1',type='NUM' indexes => { # definition of space[999] indexes ... 0 => { name => 'primary', fields => [ 'field1' ] } } } } ); $tnt->insert('examples' => [ 99999, 'BB' ]);
ru: #!/usr/bin/perl use DR::Tarantool ':constant', 'tarantool'; use DR::Tarantool ':all'; use DR::Tarantool::MsgPack::SyncClient; my $tnt = DR::Tarantool::MsgPack::SyncClient->connect( host => '127.0.0.1', # поиск Tarantool-сервера по адресу localhost port => 3301, # на порту 3301 user => 'guest', # имя пользователя; здесь же можно добавить 'password=>...' spaces => { 999 => { # определение спейса space[999] ... name => 'examples', # имя спейса space[999] = 'examples' default_type => 'STR', # если тип поля в space[999] не задан, то = 'STR' fields => [ { # определение полей в спейсе space[999] ... name => 'field1', type => 'NUM' } ], # имя поля space[999].field[1]='field1', тип ='NUM' indexes => { # определение индексов спейса space[999] ... 0 => { name => 'primary', fields => [ 'field1' ] } } } } ); $tnt->insert('examples' => [ 99999, 'BB' ]);

source: The example program uses field type names 'STR' and 'NUM' instead of :ref:`'string' and 'unsigned'<box_space-create_index>`, due to a temporary Perl limitation.
ru: Из-за временных ограничений в языке Perl, вместо полей типа :ref:`'string' и 'unsigned'<box_space-create_index>` в тестовой программе указаны поля типа 'STR' и 'NUM'.

source: The example program only shows one request and does not show all that's necessary for good practice. For that, please see the `tarantool-perl repository <https://github.com/tarantool/tarantool-perl>`_.
ru: В этой программе мы привели пример использования лишь одного запроса. Для полноценной работы с Tarantool'ом обратитесь к документации из `репозитория tarantool-perl <https://github.com/tarantool/tarantool-perl>`_.

source: The example program only shows one request and does not show all that's necessary for good practice. For that, please see `tarantool/tarantool-php <https://github.com/tarantool/tarantool-php>`_ project at GitHub.
ru: В этой программе мы привели пример использования лишь одного запроса. Для полноценной работы с Tarantool'ом обратитесь к документации из `проекта tarantool-php на GitHub <https://github.com/tarantool/tarantool-php>`_.

source: Here is a complete Python program that inserts ``[99999,'Value','Value']`` into space ``examples`` via the high-level Python API.
ru: Далее приводится пример полноценной программы на языке Python, которая осуществляет вставку ``[99999,'Value','Value']`` в спейс ``examples`` с помощью высокоуровневого API для языка Python.
