Repository: tarantool/doc
Catalog: locale/*/LC_MESSAGES/doc.po
Languages: ru

source: Do not include any of these in source files. People have their own personal editor configurations, and your source files should not override them. This includes markers for indentation and mode configuration. People may use their own custom mode, or may have some other magic method for making indentation work correctly.
ru: Не включайте их в исходные файлы. У людей есть свои собственные настройки редакторов, и ваши исходные файлы не должны их переопределять. Это относится к маркерам для отступов и конфигурации режима. У других людей могут быть свои собственные режимы или другие волшебные методы для правильной работы отступов.

source: Appendix I: References
ru: Приложение I: Источники

source: `The C Programming Language, Second Edition <https://en.wikipedia.org/wiki/The_C_Programming_Language>`_ by Brian W. Kernighan and Dennis M. Ritchie. |br| Prentice Hall, Inc., 1988. |br| ISBN 0-13-110362-8 (paperback), 0-13-110370-9 (hardback).
ru: Керниган Брайан В., Ричи Деннис М. `Язык программирования Си <https://ru.wikipedia.org/wiki/%D0%AF%D0%B7%D1%8B%D0%BA_%D0%BF%D1%80%D0%BE%D0%B3%D1%80%D0%B0%D0%BC%D0%BC%D0%B8%D1%80%D0%BE%D0%B2%D0%B0%D0%BD%D0%B8%D1%8F_%D0%A1%D0%B8_(%D0%BA%D0%BD%D0%B8%D0%B3%D0%B0)>`_. |br| Prentice Hall, Inc., 1988. |br| ISBN 0-13-110362-8 (в мягкой обложке), 0-13-110370-9 (в твердом переплете).

source: `The Practice of Programming <https://en.wikipedia.org/wiki/The_Practice_of_Programming>`_ by Brian W. Kernighan and Rob Pike. |br| Addison-Wesley, Inc., 1999. |br| ISBN 0-201-61586-X.
ru: Керниган Брайан В., Пайк Роб. `Практика программирования <https://en.wikipedia.org/wiki/The_Practice_of_Programming>`_. |br| Addison-Wesley, Inc., 1999. |br| ISBN 0-201-61586-X.

source: `GNU manuals <http://www.gnu.org/manual/>`_ - where in compliance with K&R and this text - for **cpp**, **gcc**, **gcc internals** and **indent**
ru: `Рекомендации GNU <http://www.gnu.org/manual/>`_ в соответствии с K&R и данным текстом -- для **cpp**, **gcc**, **gcc internals** и **indent**

source: `WG14 International standardization workgroup for the programming language C <http://www.open-std.org/JTC1/SC22/WG14/>`_
ru: `Рабочая группа по международной стандартизации языка программирования C WG14 <http://www.open-std.org/JTC1/SC22/WG14/>`_

source: `Kernel CodingStyle, by greg@kroah.com at OLS 2002 <http://www.kroah.com/linux/talks/ols_2002_kernel_codingstyle_talk/html/>`_
ru: `Стиль программирования ядра, автор greg@kroah.com, презентация на OLS 2002 <http://www.kroah.com/linux/talks/ols_2002_kernel_codingstyle_talk/html/>`_

source: Developer guidelines
ru: Рекомендации для разработчиков

source: How to work on a bug
ru: Как работать над дефектами

source: Any defect, even minor, if it changes the user-visible server behavior, needs a bug report. Report a bug at http://github.com/tarantool/tarantool/issues.
ru: На любой дефект, даже незначительный, если он изменяет доступное пользователю поведение сервера, необходимо составить отчет об ошибке. Сообщите о дефекте по ссылке http://github.com/tarantool/tarantool/issues.

source: When reporting a bug, try to come up with a test case right away. Set the current maintenance milestone for the bug fix, and specify the series. Assign the bug to yourself. Put the status to 'In progress' Once the patch is ready, put the bug the bug to 'In review' and solicit a review for the fix.
ru: Когда вы сообщаете об ошибке, постарайтесь сразу же приступить к тестовому сценарию. Установите текущую контрольную точку для исправления ошибки и укажите серию. Назначьте задачу на себя. Укажите статус "In progress" (выполняется). Как только патч готов, укажите статус ошибки "In review" (на рассмотрении) и отправьте версию с исправленными ошибками на рассмотрение.

source: Once there is a positive code review, push the patch and set the status to 'Closed'
ru: После успешного рассмотрения кода опубликуйте патч и укажите статус "Closed" (закрыт).

source: Patches for bugs should contain a reference to the respective Launchpad bug page or at least bug id. Each patch should have a test, unless coming up with one is difficult in the current framework, in which case QA should be alerted.
ru: Патчи для исправления ошибок должны содержать ссылку на соответствующую страницу дефекта Launchpad или хотя бы идентификатор дефекта. Каждому патча должен соответствовать отдельный тест, если только это не слишком трудно сделать в текущем окружении, и в этом случае следует предупредить тестировщиков.

source: There are two things you need to do when your patch makes it into the master:
ru: Когда ваш патч доходит до главной ветки проекта, нужно сделать следующее:

source: put the bug to 'fix committed',
ru: перевести статус ошибки в 'fix committed' (исправлено),

source: delete the remote branch.
ru: удалить отдельную ветку.

source: How to write a commit message
ru: Как писать сообщение о коммите

source: Any commit needs a helpful message. Mind the following guidelines when committing to any of Tarantool repositories at GitHub.
ru: Любой коммит следует описать в полезном сообщении. Следуйте нижеприведенным рекомендациям при коммитах в любой репозиторий Tarantool'а на GitHub.

source: Separate subject from body with a blank line.
ru: Отделяйте тему от тела сообщения пустой строкой.

source: Try to limit the subject line to **50 characters** or so.
ru: Постарайтесь ограничить тему сообщения примерно **50 символами**.

source: Start the subject line with a capital letter unless it prefixed with a subsystem name and semicolon:
ru: Начните тему сообщения с прописной буквы, если ей не предшествует префикс с именем подсистемы и точка с запятой:

source: Do not end the subject line with a period.
ru: Не заканчивайте тему сообщения точкой.

source: Do not put "gh-xx", "closes #xxx" to the subject line.
ru: Не пишите "gh-xx", "closes #xxx" в строке темы.

source: Use the imperative mood in the subject line. A properly formed Git commit subject line should always be able to complete the following sentence: "If applied, this commit will */your subject line here/*".
ru: В теме сообщения используйте повелительное наклонение. Правильно оформленная тема Git-коммита должна корректно дополнять следующее предложение: "Если применить, коммит */здесь тема сообщения/*".

source: Wrap the body to **72 characters** or so.
ru: Уместите тело сообщения в примерно **72 символа**.

source: Use the body to explain **what and why** vs. how.
ru: Используйте тело сообщения, чтобы объяснить, **что и почему**, а не как.

source: Link GitHub issues on the lasts lines (`see how <https://help.github.com/articles/closing-issues-via-commit-messages>`_).
ru: Привяжите задачи на GitHub в последних строках (`см. как <https://help.github.com/articles/closing-issues-via-commit-messages>`_).

source: Use your real name and real email address. For Tarantool team members, **@tarantool.org** email is preferred, but not mandatory.
ru: Используйте настоящие имя и адрес электронной почты. Членам проектной команды Tarantool'а рекомендуется указывать почту на **@tarantool.org**, но это необязательно.

source: A template:
ru: Шаблон:

source: Summarize changes in 50 characters or less More detailed explanatory text, if necessary. Wrap it to 72 characters or so. In some contexts, the first line is treated as the subject of the commit, and the rest of the text as the body. The blank line separating the summary from the body is critical (unless you omit the body entirely); various tools like `log`, `shortlog` and `rebase` can get confused if you run the two together. Explain the problem that this commit is solving. Focus on why you are making this change as opposed to how (the code explains that). Are there side effects or other unintuitive consequences of this change? Here's the place to explain them. Further paragraphs come after blank lines. - Bullet points are okay, too. - Typically a hyphen or asterisk is used for the bullet, preceded by a single space, with blank lines in between, but conventions vary here. Fixes: #123 Closes: #456 Needed for: #859 See also: #343, #789
ru: Кратко сформулируйте изменения в пределах 50 символов. При необходимости, более подробные объяснения. Уместите детали в примерно 72 символов. Иногда первая строка считается темой коммита, а остальной текст -- телом сообщения. Критически важна пустая строка, которая отделяет тему от тела сообщения (если только тело не отсутствует совсем); различные средства, такие как `log`, `shortlog` и `rebase` могут их перепутать, если нет разделения. Объясните проблему, которую решает данный коммит. Уделите внимание тому, почему вы вносите эти изменения, а не как (это объясняется в коде). Есть ли побочные эффекты или другие неочевидные последствия применения этих изменений? Здесь можно объяснить их. Следующие абзацы идут после пустых строк. - Можно также использовать элементы в списке. - Как правило, в качестве маркера применяется дефис или звездочка, которой предшествует пробел, а между строками вставляются пустые строки, но в данном случае условные обозначения могут разниться. Исправляет: #123 Закрывает: #456 Необходим для: #859 См. также: #343, #789

source: Some real-world examples:
ru: Некоторые реальные примеры:

source: Based on [1_] and [2_].
ru: Основано на [1_] и [2_].

source: How to submit a patch for review
ru: Как отправить патч на рассмотрение

source: We don't accept GitHub pull requests. Instead, all patches should be sent as plain-text messages to tarantool-patches@freelists.org. Please subscribe to our mailing list at https://www.freelists.org/list/tarantool-patches to ensure that your messages are added to the archive.
ru: Мы не принимаем запросы на включение в проект на GitHub. Вместо этого все патчи следует отправлять в виде обычного текстового сообщения по адресу tarantool-patches@freelists.org. Просьба подписаться на рассылку https://www.freelists.org/list/tarantool-patches, чтобы убедиться, что ваши сообщения добавляются в архив.

source: **Preparing a patch**
ru: **Подготовка патча**

source: Once you have committed a patch to your local git repository, you can submit it for review.
ru: После коммита патча в локальный репозиторий git вы можете отправить его на рассмотрение.

source: To prepare an email, use ``git format-patch`` command:
ru: Чтобы подготовить сообщение, воспользуйтесь командой ``git format-patch``:

source: It will format the commit at the top of your local git repository as a plain-text email and write it to a file in the current directory. The file name will look like ``0001-your-commit-subject-line.patch``. To specify a different directory, use ``-o`` option:
ru: В результате последний коммит в локальном репозитории git будет отформатирован в виде обычного текстового сообщения в файл в текущей директории. Название файла будет выглядеть так: ``0001-тема-коммита.patch``. Чтобы указать другую директорию, используйте опцию ``-o``:

source: Once the patch has been formatted, you can view and edit it with your favorite text editor (after all, it is a plain-text file!). We strongly recommend adding:
ru: После форматирования патча его можно просмотреть и отредактировать в вашем любимом текстовом редакторе (всё-таки это файл с обычным текстом!) Мы настоятельно рекомендуем добавить следующее:

source: a hyperlink to the branch where this patch can be found at GitHub, and
ru: ссылка на ветку, где можно найти этот патч на GitHub, а также

source: a hyperlink to the GitHub issue your patch is supposed to fix, if any.
ru: ссылку на проблему на GitHub, которую решает ваш патч.

source: If there is just one patch, the change log should go right after ``---`` in the message body (it will be ignored by ``git am`` then).
ru: Если патч всего один, журнал изменений должен идти сразу после ``---`` в теле сообщения (тогда ``git am`` проигнорирует его).

source: If there are multiple patches you want to submit in one go (e.g. this is a big feature which requires some preparatory patches to be committed first), you should send each patch in a separate email in reply to a cover letter. To format a patch series accordingly, pass the following options to ``git format-patch``:
ru: Если же вы хотите отправить сразу несколько патчей (например, это важная функция, для которой нужны несколько предварительных патчей), каждый из них следует отправлять в отдельном сообщении в ответ на сопроводительное письмо. Чтобы соответствующим образом отформатировать серию патчей, передайте следующие опции в ``git format-patch``:

source: ``--cover-letter`` will make ``git format-patch`` generate a cover letter;
ru: ``--cover-letter`` заставит ``git format-patch`` сгенерировать сопроводительное письмо;

source: ``--thread=shallow`` will mark each formatted patch email to be sent in reply to the cover letter;
ru: ``--thread=shallow`` отметит каждое сообщение с отформатированными патчами, которые следует отправить в ответ на сопроводительное письмо;

source: ``HEAD~2`` (we now use it instead of ``-1``) will make ``git format-patch`` format the first two patches at the top of your local git branch instead of just one. To format three patches, use ``HEAD~3``, and so forth.
ru: ``HEAD~2`` (мы используем вместо ``-1``) заставит ``git format-patch`` форматировать последние два патча в локальной ветке git, а не один. Чтобы форматировать три патча, используйте ``HEAD~3``, и так далее.

source: After the command has been successfully executed, you will find all your patches formatted as separate emails in your current directory (or in the directory specified via ``-o`` option):
ru: После успешного выполнения этой команды все ваши патчи будут отформатированы в виде отдельных сообщений в текущей директории (или в директории, указанной с помощью опции ``-o``):

source: The cover letter will have BLURB in its subject and body. You'll have to edit it before submitting (again, it is a plain text file). Please write:
ru: В теме и теле сопроводительного письма будут рекламные аннотации. Вам нужно их отредактировать перед отправкой (опять же, это обычный текст). Просьба указать следующее:

source: a short series description in the subject line;
ru: короткое описание в теме сообщения;

source: a few words about each patch of the series in the body.
ru: несколько слов о каждом патче в теле сообщения.

source: And don't forget to add hyperlinks to the GitHub issue and branch where your series can be found. In this case you don't need to put links or any additional information to each individual email -- the cover letter will cover everything.
ru: Кроме того, не забудьте добавить ссылки на проблему на GitHub и на ветку, где можно найти серию патчей. В таком случае нет необходимости указывать ссылки или дополнительную информацию в каждом отдельном письме, поскольку всё необходимое уже будет в сопроводительном письме.

source: To omit ``--cover-letter`` and ``--thread=shallow`` options, you can add the following lines to your gitconfig:
ru: Чтобы не указывать опции ``--cover-letter`` и ``--thread=shallow``, можно добавить в gitconfig следующие строки:

source: **Sending a patch**
ru: **Отправка патча**

source: Once you have formatted your patches, they are ready to be sent via email. Of course, you can send them with your favorite mail agent, but it is much easier to use ``git send-email`` for this. Before using this command, you need to configure it.
ru: После форматирования патчей их можно отправлять по электронной почте. Конечно, можно воспользоваться и любимым почтовым клиентом, но гораздо проще отправить их с помощью ``git send-email``. Перед использованием команды ее необходимо настроить.

source: If you use a GMail account, add the following code to your ``.gitconfig``:
ru: Если используется учетная запись GMail, добавьте следующий код в ``.gitconfig``:

source: For mail.ru users, the configuration will be slightly different:
ru: Для пользователей mail.ru настройки будут слегка отличаться:

source: If your email account is hosted by another service, consult your service provider about your SMTP settings.
ru: Если ваша учетная запись электронной почты находится на другом ресурсе, уточните SMTP-настройки у поставщика услуг.

source: Once configured, use the following command to send your patches:
ru: После настройки используйте следующую команду для отправки патчей:

source: (``00*`` wildcard will be expanded by your shell to the list of patches generated at the previous step.)
ru: (подстановочный символ ``00*`` будет распространяться на список патчей, сгенерированных в предыдущем шаге.)

source: If you want someone in particular to review your patch, add them to the list of recipients by passing ``--to`` or ``--cc`` once per each recipient.
ru: Если вы бы хотели, чтобы определенный человек рассматривал ваш патч, добавьте его в список получателей, передав ``--to`` или ``--cc`` для каждого получателя.

source: It is useful to check that ``git send-email`` will work as expected without sending anything to the world. Use ``--dry-run`` option for that.
ru: Неплохо проверить, что ``git send-email`` будет работать должным образом, не отправив ничего на весь мир. Для этого воспользуйтесь опцией ``--dry-run``.

source: **Review process**
ru: **Процесс рассмотрения**

source: After having sent your patches, you just wait for a review. The reviewer will send their comments back to you in reply to the email that contains the patch that in their opinion needs to be fixed.
ru: После отправки патчей вы ожидаете их рассмотрения. Редактор отправит свои комментарии в ответ на сообщение с патчем, который нуждается в доработке, по его мнению.

source: Upon receiving an email with review remarks, you carefully read it and reply about whether you agree or disagree with. Please note that we use the interleaved reply style (aka "inline reply") for communications over email.
ru: Получив электронное письмо с примечаниями, вы внимательно читаете его и отвечаете, согласны вы или нет. Обратите внимание, что мы используем стиль ответа с чередованием (он же "встроенный ответ") в сообщениях электронной почты.

source: Upon reaching an agreement, you send a fixed patch in reply to the email that ended the discussion. To send a patch, you can either attach a plain diff (created by ``git diff`` or ``git format-patch``) to email and send it with your favorite mail agent, or use ``--in-reply-to`` option of ``git send-email`` command.
ru: Достигнув соглашения, вы отправляете доработанный патч в ответ на последнее сообщение в обсуждении. Чтобы отправить патч, вы можете либо вложить простой diff (созданный с помощью ``git diff`` или ``git format-patch``) в сообщение электронной почте и отправить его с помощью вашего любимого почтового клиента, либо использовать опцию ``--in-reply-to`` команды ``git send-email``.

source: If you feel that the accumulated change set is large enough to send the whole series anew and restart the review process in a different thread, you generate the patch email(s) again with ``git format-patch``, this time adding v2 (then v3, v4, and so forth) to the subject and a change log to the message body. To modify the subject line accordingly, use the ``--subject-prefix`` option to ``git format-patch`` command:
ru: Если вы считаете, что общий набор изменений достаточно велик, чтобы отправить всю серию заново и перезапустить процесс рассмотрения в рамках нового обсуждения, вы снова генерируете сообщения с патчами с помощью ``git format-patch``, на этот раз добавив v2 (затем v3, v4 и так далее) в тему и журнал изменений в тело сообщения. Чтобы соответствующим образом изменить тему сообщения, используйте опцию ``--subject-prefix`` в команде ``git format-patch``:

source: To add a change log, open the generated email with you favorite text editor and edit the message body. If there is just one patch, the change log should go right after ``---`` in the message body (it will be ignored by ``git am`` then). If there is more than one patch, the change log should be added to the cover letter. Here is an example of a good change log:
ru: Чтобы добавить журнал изменений, откройте созданное сообщение с помощью любимого текстового редактора и отредактируйте тело сообщения. Если патч всего один, журнал изменений должен идти сразу после ``---`` в теле сообщения (тогда ``git am`` проигнорирует его). Если патчей несколько, журнал изменений следует добавить в сопроводительное письмо. Хороший пример журнала изменений:

source: It is also a good practice to add a reference to the previous version of your patch set (via a hyperlink or message id).
ru: Также правильно будет добавить ссылку на предыдущую версию набора патчей (гиперссылку или идентификатор сообщения).

source: Do not disagree with the reviewer without providing a good argument supporting your point of view.
ru: Не спорьте с редактором без веских аргументов в свою поддержку.

source: Do not take every word the reviewer says for granted. Reviewers are humans too, hence fallible.
ru: Не принимайте любые слова редактора без доказательств. Редакторы -- тоже люди, которые могут ошибаться.

source: Do not expect that the reviewer will tell you how to do your thing. It is not their job. The reviewer might suggest alternative ways to tackle the problem, but in general it is your responsibility.
ru: Не ждите, что редактор скажет вам, как что делать. Это не их работа. Редактор может предложить пути решения проблемы, но вообще говоря, это ваша обязанность.

source: Do not forget to update your remote git branch every time you send a new version of your patch.
ru: Не забывайте обновлять удаленную ветку git каждый раз, когда отправляете новую версию патча.

source: Do follow the guidelines above. If you do not comply, your patches are likely to be silently ignored.
ru: Соблюдайте вышеуказанные рекомендации. Если вы не будете их соблюдать, ваши патчи могут быть молча проигнорированы.

source: Documentation guidelines
ru: Рекомендации по написанию документации

source: These guidelines are updated on the on-demand basis, covering only those issues that cause pains to the existing writers. At this point, we do not aim to come up with an exhaustive Documentation Style Guide for the Tarantool project.
ru: Данные рекомендации обновляются по запросу, охватывая только те проблемы, которые вызывают вопросы у авторов документации. На данный момент мы не стремимся разработать исчерпывающее руководство по написанию документации для проекта Tarantool.

source: Markup issues
ru: Вопросы по разметке

source: Wrapping text
ru: Перенос текста

source: The limit is 80 characters per line for plain text, and no limit for any other constructions when wrapping affects ReST readability and/or HTML output. Also, it makes no sense to wrap text into lines shorter than 80 characters unless you have a good reason to do so.
ru: Строка ограничена 80 символами для обычного текста и никак не ограничена для любых других конструкций, когда обтекание влияет на читаемость ReST и / или HTML-вывод. Кроме того, нет смысла переносить текст в строках короче 80 символов, если у вас для этого нет веских оснований.

source: The 80-character limit comes from the ISO/ANSI 80x24 screen resolution, and it's unlikely that readers/writers will use 80-character consoles. Yet it's still a standard for many coding guidelines (including Tarantool). As for writers, the benefit is that an 80-character page guide allows keeping the text window rather narrow most of the time, leaving more space for other applications in a wide-screen environment.
ru: Ограничение в 80 символов исходит из разрешения экрана ISO/ANSI 80x24, и маловероятно, что читатели/писатели будут использовать 80-символьные консоли. Тем не менее, такое ограничение по-прежнему является стандартом во многих рекомендациях по программированию (включая Tarantool). Что касается писателей, то благодаря ограничению размера страницы окно с текстом может быть довольно узким, оставляя больше места для других приложений в широкоэкранном окружении.
