Repository: tarantool/doc
Catalog: locale/*/LC_MESSAGES/doc.po
Languages: ru

source: Instructs Tarantool to open an interactive console port for incoming connections.
ru: Требует от Tarantool’а открыть порт с интерактивной консолью для входящих подключений.

source: Attaches to the Tarantool server inside the container under 'admin' user via a standard Unix socket.
ru: Подключается через стандартный Unix-сокет к Tarantool-серверу, запущенному внутри контейнера, из-под пользователя 'admin’.

source: Tarantool displays a prompt:
ru: Tarantool показывает приглашение командной строки:

source: While you're attached to the console, let's create a simple test database.
ru: Подключившись к консоли, давайте создадим простую тестовую базу данных.

source: Stopping a container
ru: Остановка контейнера

source: When the testing is over, stop the container politely:
ru: После завершения тестирования для корректной остановки контейнера выполните эту команду:

source: This was a temporary container, and its disk/memory data were flushed when you stopped it. But since you mounted a data directory from the host in the container, Tarantool's data files were persisted to the host's disk. Now if you start a new container and mount that data directory in it, Tarantool will recover all data from disk and continue working with the persisted data.
ru: Это был временный контейнер, поэтому после остановки содержимое его диска/памяти обнулилось. Но так как вы монтировали локальную директорию в контейнер, все данные Tarantool’а сохранились на диске вашей машины. Если вы запустите новый контейнер и смонтируете в него ту же директорию с данными, Tarantool восстановит все данные с диска и продолжит с ними работать.

source: User's Guide
ru: Руководство пользователя

source: Preface
ru: Предисловие

source: Welcome to Tarantool! This is the User's Guide. We recommend reading it first, and consulting :ref:`Reference <reference>` materials for more detail afterwards, if needed.
ru: Добро пожаловать в мир Tarantool! Сейчас вы читаете "Руководство пользователя". Мы советуем начинать именно с него, а затем переходить к :ref:`"Справочникам" <reference>`, если вам понадобятся более подробные сведения.

source: How to read the documentation
ru: Как пользоваться документацией

source: To get started, you can install and launch Tarantool using :ref:`a Docker container <getting_started-using_docker>`, :ref:`a binary package <getting_started-using_binary>`, or the online Tarantool server at http://try.tarantool.org. Either way, as the first tryout, you can follow the introductory exercises from :ref:`Chapter 2 "Getting started" <getting_started>`. If you want more hands-on experience, proceed to :ref:`Tutorials <tutorials>` after you are through with Chapter 2.
ru: Для начала можно установить и запустить Tarantool, используя :ref:`Docker-контейнер <getting_started-using_docker>`, :ref:`бинарный пакет <getting_started-using_binary>` или онлайн-сервер Tarantool'а http://try.tarantool.org. В любом случае для пробы можно сделать вводные упражнения из :ref:`главы 2 "Руководство для начинающих" <getting_started>`. Если хотите получить практический опыт, переходите к :ref:`Практическим заданиям <tutorials>` после работы с главой 2.

source: :ref:`Chapter 3 "Database" <database-chapter>` is about using Tarantool as a NoSQL DBMS, whereas :ref:`Chapter 4 "Application server" <app_server>` is about using Tarantool as an application server.
ru: В :ref:`главе 3 "Функциональность СУБД" <database-chapter>` рассказано о возможностях Tarantool'а как NoSQL СУБД, а в :ref:`главе 4 "Сервер приложений" <app_server>` -- о возможностях Tarantool'а как сервера приложений Lua.

source: :ref:`Chapter 5 "Server administration" <admin>` and :ref:`Chapter 6 "Replication" <replication>` are primarily for administrators.
ru: :ref:`Глава 5 "Администрирование серверной части" <admin>` и :ref:`Глава 6 "Репликация" <replication>` предназначены в первую очередь для системных администраторов.

source: :ref:`Chapter 7 "Connectors" <index-box_connectors>` is strictly for users who are connecting from a different language such as C or Perl or Python — other users will find no immediate need for this chapter.
ru: :ref:`Глава 7 "Коннекторы" <index-box_connectors>` актуальна только для тех пользователей, которые хотят устанавливать соединение с Tarantool'ом с помощью программ на других языках программирования (например C, Perl или Python) -- для прочих пользователей эта глава неактуальна.

source: :ref:`Chapter 8 "FAQ" <faq>` gives answers to some frequently asked questions about Tarantool.
ru: :ref:`Глава 8 "Вопросы и ответы" <faq>` содержит ответы на некоторые часто задаваемые вопросы о Tarantool'е.

source: For experienced users, there are also :ref:`Reference <reference>` materials, a :ref:`Contributor's Guide <contrib_guide>` and an extensive set of comments in the source code.
ru: Опытным же пользователям будут полезны :ref:`"Справочники" <reference>`, :ref:`"Руководство участника проекта" <contrib_guide>` и комментарии в исходном коде.

source: Getting in touch with the Tarantool community
ru: Как связаться с сообществом разработчиков Tarantool'а

source: Please report bugs or make feature requests at http://github.com/tarantool/tarantool/issues.
ru: Оставить сообщение о найденных дефектах или сделать запрос на новые функции можно тут: http://github.com/tarantool/tarantool/issues

source: You can contact developers directly in `telegram <http://telegram.me/tarantool>`_ or in a Tarantool discussion group (`English <https://groups.google.com/forum/#!forum/tarantool>`_ or `Russian <https://googlegroups.com/group/tarantool-ru>`_).
ru: Пообщаться напрямую с командой разработки Tarantool'а можно в `telegram <http://telegram.me/tarantool>`_ или на форумах (`англоязычном <https://groups.google.com/forum/#!forum/tarantool>`_ или `русскоязычном <https://googlegroups.com/group/tarantool-ru>`_).

source: Conventions used in this manual
ru: Условные обозначения, используемые в руководстве

source: Square brackets [ and ] enclose optional syntax.
ru: В квадратные скобки [ и ] включается синтаксис необязательных элементов.

source: Two dots in a row .. mean the preceding tokens may be repeated.
ru: Две точки подряд .. означают, что предыдущие токены могут повторяться.

source: A vertical bar | means the preceding and following tokens are mutually exclusive alternatives.
ru: Вертикальная черта | означает, что предыдущий и последующий токены представляют собой взаимоисключающие альтернативы.

source: Replication allows multiple Tarantool instances to work on copies of the same databases. The databases are kept in sync because each instance can communicate its changes to all the other instances.
ru: Механизм репликации позволяет сразу многим экземплярам Tarantool'а работать с копиями одних и тех же баз данных. При этом все базы остаются в синхронизированном состоянии благодаря тому, что каждый экземпляр может сообщать другим экземплярам о совершенных им изменениях.

source: Adding instances
ru: Добавление экземпляров

source: Adding a replica
ru: Добавление реплики

source: To add a second **replica** instance to the **master-replica** set from our :ref:`bootstrapping example <replication-master_replica_bootstrap>`, we need an analog of the instance file that we created for the first replica in that set:
ru: Чтобы добавить вторую **реплику** в набор реплик с конфигурацией **мастер-реплика** из нашего :ref:`примера настройки <replication-master_replica_bootstrap>`, необходим аналог файла экземпляра, который мы создали для первой реплики в этом наборе:

source: -- instance file for replica #2 box.cfg{ listen = 3301, replication = ('replicator:password@192.168.0.101:3301', -- master URI 'replicator:password@192.168.0.102:3301', -- replica #1 URI 'replicator:password@192.168.0.103:3301'), -- replica #2 URI read_only = true } box.once("schema", function() box.schema.user.create('replicator', {password = 'password'}) box.schema.user.grant('replicator', 'replication’) -- grant replication role box.schema.space.create("test") box.space.test:create_index("primary") print('box.once executed on replica #2') end)
ru: -- файл экземпляра для реплики №2 box.cfg{ listen = 3301, replication = ('replicator:password@192.168.0.101:3301', -- URI мастера 'replicator:password@192.168.0.102:3301', -- URI реплики№1 'replicator:password@192.168.0.103:3301'), -- URI реплики№2 read_only = true } box.once("schema", function() box.schema.user.create('replicator', {password = 'password'}) box.schema.user.grant('replicator', 'replication’) -- предоставить роль для репликации box.schema.space.create("test") box.space.test:create_index("primary") print('box.once executed on replica #2') end)

source: $ # launching replica #2 $ tarantool replica2.lua 2017-06-14 14:54:33.927 [46945] main/101/replica2.lua C> version 1.7.4-52-g980d30092 2017-06-14 14:54:33.927 [46945] main/101/replica2.lua C> log level 5 2017-06-14 14:54:33.928 [46945] main/101/replica2.lua I> mapping 268435456 bytes for tuple arena... 2017-06-14 14:54:33.930 [46945] main/104/applier/replicator@192.168.0.10 I> remote master is 1.7.4 at 192.168.0.101:3301 2017-06-14 14:54:33.930 [46945] main/104/applier/replicator@192.168.0.10 I> authenticated 2017-06-14 14:54:33.930 [46945] main/101/replica2.lua I> bootstrapping replica from 192.168.0.101:3301 2017-06-14 14:54:33.933 [46945] main/104/applier/replicator@192.168.0.10 I> initial data received 2017-06-14 14:54:33.933 [46945] main/104/applier/replicator@192.168.0.10 I> final data received 2017-06-14 14:54:33.934 [46945] snapshot/101/main I> saving snapshot `/var/lib/tarantool/replica2/00000000000000000010.snap.inprogress' 2017-06-14 14:54:33.934 [46945] snapshot/101/main I> done 2017-06-14 14:54:33.935 [46945] main/101/replica2.lua I> vinyl checkpoint done 2017-06-14 14:54:33.935 [46945] main/101/replica2.lua I> ready to accept requests 2017-06-14 14:54:33.935 [46945] main/101/replica2.lua I> set 'read_only' configuration option to true 2017-06-14 14:54:33.936 [46945] main C> entering the event loop
ru: $ # запуск реплики №2 $ tarantool replica2.lua 2017-06-14 14:54:33.927 [46945] main/101/replica2.lua C> version 1.7.4-52-g980d30092 2017-06-14 14:54:33.927 [46945] main/101/replica2.lua C> log level 5 2017-06-14 14:54:33.928 [46945] main/101/replica2.lua I> mapping 268435456 bytes for tuple arena... 2017-06-14 14:54:33.930 [46945] main/104/applier/replicator@192.168.0.10 I> remote master is 1.7.4 at 192.168.0.101:3301 2017-06-14 14:54:33.930 [46945] main/104/applier/replicator@192.168.0.10 I> authenticated 2017-06-14 14:54:33.930 [46945] main/101/replica2.lua I> bootstrapping replica from 192.168.0.101:3301 2017-06-14 14:54:33.933 [46945] main/104/applier/replicator@192.168.0.10 I> initial data received 2017-06-14 14:54:33.933 [46945] main/104/applier/replicator@192.168.0.10 I> final data received 2017-06-14 14:54:33.934 [46945] snapshot/101/main I> saving snapshot `/var/lib/tarantool/replica2/00000000000000000010.snap.inprogress' 2017-06-14 14:54:33.934 [46945] snapshot/101/main I> done 2017-06-14 14:54:33.935 [46945] main/101/replica2.lua I> vinyl checkpoint done 2017-06-14 14:54:33.935 [46945] main/101/replica2.lua I> ready to accept requests 2017-06-14 14:54:33.935 [46945] main/101/replica2.lua I> set 'read_only' configuration option to true 2017-06-14 14:54:33.936 [46945] main C> entering the event loop

source: Adding a master
ru: Добавление мастера

source: To add a third master instance to the **master-master** set from our :ref:`bootstrapping example <replication-master_master_bootstrap>`, we need an analog of the instance files that we created to bootstrap the other master instances in that set:
ru: Чтобы добавить третьего мастера в набор реплик с конфигурацией **мастер-мастер** из нашего :ref:`примера настройки <replication-master_master_bootstrap>`, необходим аналог файлов экземпляров, которые мы создали для настройки других мастеров в этом наборе:

source: -- instance file for master #3 box.cfg{ listen = 3301, replication = {'replicator:password@192.168.0.101:3301', -- master#1 URI 'replicator:password@192.168.0.102:3301', -- master#2 URI 'replicator:password@192.168.0.103:3301'}, -- master#3 URI read_only = true, -- temporarily read-only } box.once("schema", function() box.schema.user.create('replicator', {password = 'password'}) box.schema.user.grant('replicator', 'replication’) -- grant "replication" role box.schema.space.create("test") box.space.test:create_index("primary") end)
ru: -- файл экземпляра для мастера№3 box.cfg{ listen = 3301, replication = {'replicator:password@192.168.0.101:3301', -- URI мастера №1 'replicator:password@192.168.0.102:3301', -- URI мастера №2 'replicator:password@192.168.0.103:3301'}, -- URI мастера №3 read_only = true, -- temporarily read-only } box.once("schema", function() box.schema.user.create('replicator', {password = 'password'}) box.schema.user.grant('replicator', 'replication’) -- предоставить роль для репликации box.schema.space.create("test") box.space.test:create_index("primary") end)

source: Here we make the following changes:
ru: Здесь мы вносим следующие изменения:

source: Temporarily specify :ref:`read_only=true <cfg_basic-read_only>` to disable data-change operations on the instance. After launch, master #3 will act as a replica until it retrieves all data from the other masters in the replica set.
ru: Временно укажите :ref:`read_only=true <cfg_basic-read_only>`, чтобы отключить операции по изменению данных на этом экземпляре. После запуска мастер №3 будет работать в качестве реплики, пока не получит все данные от других мастеров в наборе реплик.

source: $ # launching master #3 $ tarantool master3.lua 2017-06-14 17:10:00.556 [47121] main/101/master3.lua C> version 1.7.4-52-g980d30092 2017-06-14 17:10:00.557 [47121] main/101/master3.lua C> log level 5 2017-06-14 17:10:00.557 [47121] main/101/master3.lua I> mapping 268435456 bytes for tuple arena... 2017-06-14 17:10:00.559 [47121] iproto/101/main I> binary: bound to [::]:3301 2017-06-14 17:10:00.559 [47121] main/104/applier/replicator@192.168.0.10 I> remote master is 1.7.4 at 192.168.0.101:3301 2017-06-14 17:10:00.559 [47121] main/105/applier/replicator@192.168.0.10 I> remote master is 1.7.4 at 192.168.0.102:3301 2017-06-14 17:10:00.559 [47121] main/106/applier/replicator@192.168.0.10 I> remote master is 1.7.4 at 192.168.0.103:3301 2017-06-14 17:10:00.559 [47121] main/105/applier/replicator@192.168.0.10 I> authenticated 2017-06-14 17:10:00.559 [47121] main/101/master3.lua I> bootstrapping replica from 192.168.0.102:3301 2017-06-14 17:10:00.562 [47121] main/105/applier/replicator@192.168.0.10 I> initial data received 2017-06-14 17:10:00.562 [47121] main/105/applier/replicator@192.168.0.10 I> final data received 2017-06-14 17:10:00.562 [47121] snapshot/101/main I> saving snapshot `/Users/e.shebunyaeva/work/tarantool-test-repl/master3_dir/00000000000000000009.snap.inprogress' 2017-06-14 17:10:00.562 [47121] snapshot/101/main I> done 2017-06-14 17:10:00.564 [47121] main/101/master3.lua I> vinyl checkpoint done 2017-06-14 17:10:00.564 [47121] main/101/master3.lua I> ready to accept requests 2017-06-14 17:10:00.565 [47121] main/101/master3.lua I> set 'read_only' configuration option to true 2017-06-14 17:10:00.565 [47121] main C> entering the event loop 2017-06-14 17:10:00.565 [47121] main/104/applier/replicator@192.168.0.10 I> authenticated
ru: $ # запуск мастера №3 $ tarantool master3.lua 2017-06-14 17:10:00.556 [47121] main/101/master3.lua C> version 1.7.4-52-g980d30092 2017-06-14 17:10:00.557 [47121] main/101/master3.lua C> log level 5 2017-06-14 17:10:00.557 [47121] main/101/master3.lua I> mapping 268435456 bytes for tuple arena... 2017-06-14 17:10:00.559 [47121] iproto/101/main I> binary: bound to [::]:3301 2017-06-14 17:10:00.559 [47121] main/104/applier/replicator@192.168.0.10 I> remote master is 1.7.4 at 192.168.0.101:3301 2017-06-14 17:10:00.559 [47121] main/105/applier/replicator@192.168.0.10 I> remote master is 1.7.4 at 192.168.0.102:3301 2017-06-14 17:10:00.559 [47121] main/106/applier/replicator@192.168.0.10 I> remote master is 1.7.4 at 192.168.0.103:3301 2017-06-14 17:10:00.559 [47121] main/105/applier/replicator@192.168.0.10 I> authenticated 2017-06-14 17:10:00.559 [47121] main/101/master3.lua I> bootstrapping replica from 192.168.0.102:3301 2017-06-14 17:10:00.562 [47121] main/105/applier/replicator@192.168.0.10 I> initial data received 2017-06-14 17:10:00.562 [47121] main/105/applier/replicator@192.168.0.10 I> final data received 2017-06-14 17:10:00.562 [47121] snapshot/101/main I> saving snapshot `/Users/e.shebunyaeva/work/tarantool-test- repl/master3_dir/00000000000000000009.snap.inprogress' 2017-06-14 17:10:00.562 [47121] snapshot/101/main I> done 2017-06-14 17:10:00.564 [47121] main/101/master3.lua I> vinyl checkpoint done 2017-06-14 17:10:00.564 [47121] main/101/master3.lua I> ready to accept requests 2017-06-14 17:10:00.565 [47121] main/101/master3.lua I> set 'read_only' configuration option to true 2017-06-14 17:10:00.565 [47121] main C> entering the event loop 2017-06-14 17:10:00.565 [47121] main/104/applier/replicator@192.168.0.10 I> authenticated

source: # adding master #3 URI to replication sources tarantool> box.cfg{replication = > {'replicator:password@192.168.0.101:3301', > 'replicator:password@192.168.0.102:3301', > 'replicator:password@192.168.0.103:3301'}} --- ...
ru: # добавление URI мастера №3 в источники репликации tarantool> box.cfg{replication = > {'replicator:password@192.168.0.101:3301', > 'replicator:password@192.168.0.102:3301', > 'replicator:password@192.168.0.103:3301'}} --- ...

source: When master #3 catches up with the other masters' state, we can disable read-only mode for this instance:
ru: Когда мастер №3 получает все необходимые изменения от других мастеров, можно отключить режим только для чтения:

source: # making master #3 a real master tarantool> box.cfg{read_only=false} --- ...
ru: # определение мастера №3 настоящим мастером tarantool> box.cfg{read_only=false} --- ...

source: We also recommend to specify master #3 URI in all instance files in order to keep all the files consistent with each other and with the current replication topology.
ru: Также рекомендуется указать URI мастера №3 во всех файлах экземпляра, чтобы сохранить единообразие файлов и согласовать их с текущей топологией репликации.

source: Server startup with replication
ru: Запуск сервера с репликацией

source: the distant replica's replica set UUID,
ru: UUID набора реплик, в который входит удаленная реплика

source: the contents of the distant replica's .snap file. |br| When the local replica receives this information, it puts the replica set UUID in its ``_schema`` space, puts the distant replica's UUID and connection information in its ``_cluster`` space, and makes a snapshot containing all the data sent by the distant replica. Then, if the local replica has data in its WAL .xlog files, it sends that data to the distant replica. The distant replica will receive this and update its own copy of the data, and add the local replica's UUID to its ``_cluster`` space.
ru: содержимое файла снимка .snap удаленной реплики. |br| Когда локальная реплика получает эту информацию, она размещает UUID набора реплики в своем спейсе ``_schema``, UUID удаленной реплики и информацию о подключении в своем спейсе ``_cluster``, а затем создает снимок, который содержит все данные, отправленные удаленной репликой. Затем, если в WAL-файлах .xlog локальной реплики содержатся данные, они отправляются на удаленную реплику. Удаленная реплика получается данные и обновляет свою копию данных, а затем добавляет UUID локальной реплики в свой спейс ``_cluster``.

source: the distant replica compares its own copy of the replica set UUID to the one in the on-connect handshake. If there is no match, then the handshake fails and the local replica will display an error.
ru: удаленная реплика сопоставляет свою версию UUID набора реплик с UUID, переданным в ходе подтверждения связи при подключении. Если они не совпадают, связь не устанавливается, и локальная реплика отобразит ошибку.

source: the distant replica looks for a record of the connecting instance in its ``_cluster`` space. If there is none, then the handshake fails. |br| Otherwise the handshake is successful. The distant replica will read any new information from its own .snap and .xlog files, and send the new requests to the local replica.
ru: удаленная реплика ищет запись о подключающемся экземпляре в своем спейсе ``_cluster``. Если такой записи нет, связь не устанавливается. |br| Если есть, связь подтверждается. Удаленная реплика выполняет чтение любой новой информации из своих файлов .snap и .xlog и отправляет новые запросы на локальную реплику.

source: *If there is a snapshot file and replication source is not empty*: |br| first the local replica goes through the recovery process described in the previous section, using its own .snap and .xlog files. Then it sends a "subscribe" request to all the other replicas of the replica set. The subscribe request contains the server vector clock. The vector clock has a collection of pairs 'server id, lsn' for every replica in the ``_cluster`` system space. Each distant replica, upon receiving a subscribe request, will read its .xlog files' requests and send them to the local replica if (lsn of .xlog file request) is greater than (lsn of the vector clock in the subscribe request). After all the other replicas of the replica set have responded to the local replica's subscribe request, the replica startup is complete.
ru: *Если есть файл снимка и указан источник репликаци*: |br| сначала локальная реплика проходит процесс восстановления, описанный в предыдущем разделе, используя свои собственные файлы .snap и .xlog. Затем она отправляет запрос подписки всем репликам в наборе реплик. Запрос подписки содержит векторные часы сервера. Векторные часы включают набор пар 'идентификатор сервера, LSN' для каждой реплики в системном спейсе ``_cluster``. Каждая удаленная реплика, получив запрос подписки, выполняет чтение запросов из файла .xlog и отправляет их на локальную реплику, если LSN из запроса файла .xlog больше, чем LSN векторных часов из запроса подписки. После того, как все реплики из набора реплик отправили ответ на запрос подписки локальной реплики, запуск реплики завершен.

source: The URIs in the ``replication`` parameter should all be in the same order on all replicas. This is not mandatory but is an aid to consistency.
ru: URI в параметре ``replication`` должны быть указаны в одинаковом порядке на всех репликах. Это необязательно, но помогает соблюдать консистентность.

source: The replicas of a replica set should be started up at slightly different times. This is not mandatory but prevents a situation where each replica is waiting for the other replica to be ready.
ru: Реплики в наборе реплик должны запускаться не одновременно. Это необязательно, но помогает избежать ситуации, когда все реплики ждут готовности друг друга.

source: Replication architecture
ru: Архитектура механизма репликации

source: Replication mechanism
ru: Механизм репликации

source: A pack of instances which operate on copies of the same databases make up a **replica set**. Each instance in a replica set has a role, **master** or **replica**.
ru: Набор экземпляров, которые работают на копиях одной базы данных, составляют **набор реплик**. У каждого экземпляра в наборе реплик есть роль: **мастер** или **реплика**.
