Repository: tarantool/doc
Catalog: locale/*/LC_MESSAGES/doc.po
Languages: ru

source: ``char tuple[1024];`` is used here as just a quick way of saying "allocate more than enough bytes". For serious programs the developer must be careful to allow enough space for all the bytes that the ``mp_encode`` routines will use up.
ru: ``char tuple[1024];`` используется здесь просто в качестве быстрого способа ввода команды "выделить байтов с запасом". В серьезных программах разработчику следует обратить внимание на то, чтобы выделить достаточно места, которое будут использовать процедуры ``mp_encode``.

source: Now, still on the client, execute this request:
ru: Затем всё еще в клиенте выполните следующий запрос:

source: This proves that the ``hardest()`` function succeeded, but where did :ref:`box_space_id_by_name() <box-box_space_id_by_name>` and :ref:`box_insert() <box-box_insert>` come from? Answer: the :ref:`C API <index-c_api_reference>`.
ru: Это доказывает, что функция ``hardest()`` была успешно выполнена, но откуда взялись :ref:`box_space_id_by_name() <box-box_space_id_by_name>` и :ref:`box_insert() <box-box_insert>`? Ответ: :ref:`API для языка C <index-c_api_reference>`.

source: Go back to the shell where the ``easy.c`` and the ``harder.c`` and the ``hardest.c`` programs were created.
ru: Вернитесь в терминал, где были созданы программы ``easy.c``, ``harder.c`` и ``hardest.c``.

source: Create a file. Name it ``read.c``. Put these 43 lines in it:
ru: Создайте файл. Назовите его ``read.c``. Запишите в него следующие 43 строки:

source: Compile the program, producing a library file named ``read.so``:
ru: Скомпилируйте программу, что создаст файл библиотеки под названием ``read.so``:

source: This time the C function is doing four things:
ru: На этот раз C-функция выполняет четыре действия:

source: once again, finding the numeric identifier of the ``capi_test`` space by calling ``box_space_id_by_name()``;
ru: снова найдет числовой идентификатор спейса ``capi_test`` путем вызова ``box_space_id_by_name()``;

source: formatting a search key = 10000 using more ``msgpuck.h`` functions;
ru: форматирует ключ поиска = 10 000, используя другие функции ``msgpuck.h``;

source: getting a tuple using ``box_index_get()``;
ru: получает кортеж с помощью ``box_index_get()``;

source: going through the tuple's fields with ``box_tuple_get()`` and then decoding each field depending on its type. In this case, since what we are getting is the tuple that we inserted with ``hardest.c``, we know in advance that the type is either MP_UINT or MP_STR; however, it's very common to have a case statement here with one option for each possible type.
ru: проходит по полям каждого кортежа с помощью ``box_tuple_get()``. а затем декодирует каждое поле в зависимости от его типа. В данном случае, поскольку мы получаем кортеж, который сами вставили с помощью ``hardest.c``, мы знаем заранее, что его тип будет MP_UINT или MP_STR. Однако, весьма часто здесь употребляется оператор выбора case с одной опцией для каждого возможного типа.

source: The result of ``capi_connection:call('read')`` should look like this:
ru: В результате вызова ``capi_connection:call('read')`` должны получить:

source: This proves that the ``read()`` function succeeded. Once again the important functions that start with `box` -- :ref:`box_index_get() <c_api-box_index-box_index_get>` and :ref:`box_tuple_field() <c_api-tuple-box_tuple_field>` -- came from the :ref:`C API <index-c_api_reference>`.
ru: Это доказывает, что функция ``read()`` была успешно выполнена. И снова важные функции, которые начинаются с `box` -- :ref:`box_index_get() <c_api-box_index-box_index_get>` и :ref:`box_tuple_field() <c_api-tuple-box_tuple_field>` -- пришли из :ref:`API для языка C <index-c_api_reference>`.

source: Go back to the shell where the programs ``easy.c``, ``harder.c``, ``hardest.c`` and ``read.c`` were created.
ru: Вернитесь в терминал, где были созданы программы ``easy.c``, ``harder.c``, ``hardest.c`` и ``read.c``.

source: Create a file. Name it ``write.c``. Put these 24 lines in it:
ru: Создайте файл. Назовите его ``write.c``. Запишите в него следующие 24 строки:

source: Compile the program, producing a library file named ``write.so``:
ru: Скомпилируйте программу, что создаст файл библиотеки под названием ``write.so``:

source: This time the C function is doing six things:
ru: На этот раз C-функция выполняет шесть действий:

source: making a new tuple;
ru: создает новый кортеж;

source: starting a transaction;
ru: начинает транзакцию;

source: replacing a tuple in ``box.space.capi_test``
ru: заменяет кортеж в ``box.space.capi_test``

source: ending a transaction;
ru: заканчивает транзакцию;

source: the final line is a replacement for the loop in ``read.c`` -- instead of getting each field and printing it, use the ``box_return_tuple(...)`` function to return the entire tuple to the caller and let the caller display it.
ru: последняя строка заменяет цикл ``read.c`` -- вместо получения и вывода каждого поля, использует функцию ``box_return_tuple(...)`` для возврата всего кортежа вызывающему клиенту, чтобы вывести его на экран.

source: The result of ``capi_connection:call('write')`` should look like this:
ru: В результате вызова ``capi_connection:call('write')`` должны получить:

source: This proves that the ``write()`` function succeeded. Once again the important functions that start with `box` -- :ref:`box_txn_begin() <txn-box_txn_begin>`, :ref:`box_txn_commit() <txn-box_txn_commit>` and :ref:`box_return_tuple() <box-box_return_tuple>` -- came from the :ref:`C API <index-c_api_reference>`.
ru: Это доказывает, что функция ``write()`` была успешно выполнена. И снова важные функции, которые начинаются с `box` -- :ref:`box_txn_begin() <txn-box_txn_begin>`, :ref:`box_txn_commit() <txn-box_txn_commit>` и :ref:`box_return_tuple() <box-box_return_tuple>` -- пришли из :ref:`API для языка C <index-c_api_reference>`.

source: Conclusion: the long description of the whole C API is there for a good reason. All of the functions in it can be called from C functions which are called from Lua. So C "stored procedures" have full access to the database.
ru: Вывод: длинное описание всего API для языка C необходимо в силу весомых причин. Все функции можно вызвать из C-функций, которые вызываются из Lua. Таким образом, хранимые процедуры на языке C получают полный доступ к базе данных.

source: **Cleaning up**
ru: **Очистка данных**

source: Get rid of each of the function tuples with :ref:`box.schema.func.drop <box_schema-func_drop>`.
ru: Удалите все кортежи с функцией с помощью :ref:`box.schema.func.drop <box_schema-func_drop>`.

source: Get rid of the ``capi_test`` space with :ref:`box.schema.capi_test:drop() <box_space-drop>`.
ru: Удалите спейс ``capi_test`` с помощью :ref:`box.schema.capi_test:drop() <box_space-drop>`.

source: Remove the ``.c`` and ``.so`` files that were created for this tutorial.
ru: Удалите файлы с разрешением ``.c`` и ``.so``, созданные для данного практического задания.

source: **An example in the test suite**
ru: **Пример из набора тестов**

source: Download the source code of Tarantool. Look in a subdirectory :code:`test/box`. Notice that there is a file named :code:`tuple_bench.test.lua` and another file named :code:`tuple_bench.c`. Examine the Lua file and observe that it is calling a function in the C file, using the same techniques that this tutorial has shown.
ru: Скачайте исходный код Tarantool'а. Откройте поддиректорию :code:`test/box`. Проверьте наличие файла под названием :code:`tuple_bench.test.lua` и еще одного файла под названием :code:`tuple_bench.c`. Изучите Lua-файл на предмет вызова функции в C-файле с использованием методов, описанных в данном практическом задании.

source: Conclusion: parts of the standard test suite use C stored procedures, and they must work, because releases don't happen if Tarantool doesn't pass the tests.
ru: Вывод: некоторые тесты из стандартного набора используют хранимые процедуры на языке C, а они должны работать, поскольку мы не можем выпустить Tarantool, если он не прошел тестирование.

source: Tutorials
ru: Практикум

source: `libslave` tutorial
ru: Практические задания по `libslave`

source: ``libslave`` is a C++ library for reading data changes done by MysQL and, optionally, writing them to a Tarantool database. It works by acting as a replication slave. The MySQL server writes data-change information to a "binary log", and transfers the information to any client that says "I want to see the information starting with this file and this record, continuously". So, ``libslave`` is primarily good for making a Tarantool database replica (much faster than using a conventional MySQL slave server), and for keeping track of data changes so they can be searched.
ru: ``libslave`` представляет собой библиотеку C++ для считывания изменений данных, внесенных с помощью MySQL, а также -- опционально -- для записи их в базу данных Tarantool'а. Она выступает в качестве ведомого в схеме репликации. Сервер MySQL записывает информацию об изменении данных в бинарный журнал и передает ее на любой клиент, который запрашивает: "Хочу увидеть всю информацию, начиная с этого файла и этой записи, безостановочно". Таким образом, библиотека ``libslave``, прежде всего, используется для создания реплик базы данных Tarantool'а (намного быстрее, чем используя традиционный ведомый сервер MySQL) и для отслеживания изменений данных, чтобы они были пригодны для поиска.

source: We will not go into the many details here -- the `API documentation <https://github.com/vozbu/libslave/wiki/API>`_ has them. We will only show an exercise: a minimal program that uses the library.
ru: Здесь мы не будем подробно рассматривать библиотеку -- информация есть в `документации по API <https://github.com/vozbu/libslave/wiki/API>`_. Мы лишь дадим упражнение: минимальная программа с использованием библиотеки.

source: Use a test machine. Do not use a production machine.
ru: Используйте тестовый сервер. Не используйте боевой сервер.

source: STEP 1: Make sure you have:
ru: ШАГ 1: Убедитесь в наличии следующего:

source: a recent version of Linux (versions such as Ubuntu 14.04 will not do),
ru: последняя версия Linux (например, Ubuntu версии 14.04 не подойдет),

source: a recent version of MySQL 5.6 or MySQL 5.7 server (MariaDB will not do),
ru: сервер MySQL версии 5.6 или 5.7 (MariaDB не подойдет),

source: MySQL client development package. For example, on Ubuntu you can download it with this command:
ru: пакет программ для разработки клиента MySQL. Например, на Ubuntu можно загрузить его с помощью следующей команды:

source: STEP 2: Download ``libslave``.
ru: ШАГ 2: Установите ``libslave``.

source: The recommended source is https://github.com/tarantool/libslave/. Downloads include the source code only.
ru: Рекомендуется источник по ссылке https://github.com/tarantool/libslave/. Загрузки включают в себя только исходный код.

source: If you see an error message mentioning the word "vector", edit ``field.h`` and add this line:
ru: Если система выдаст сообщение с ошибкой со словом "vector", отредактируйте ``field.h``, добавив следующую строку:

source: STEP 3: Start the MySQL server. On the command line, add appropriate switches for doing replication. For example:
ru: ШАГ 3: Запустите сервер MySQL. В командной строке добавьте соответствующие коммутаторы для выполнения репликации. Например:

source: STEP 4: For purposes of this exercise, we are assuming you have:
ru: ШАГ 4: Для целей данного упражнения, предполагаем, что у вас есть:

source: a "root" user with password "root" with privileges,
ru: пользователь "root" с паролем "root" с правами,

source: a "test" database with a table named "test",
ru: тестовая база данных "test" с тестовой таблицей под названием "test",

source: a binary log named "mysql-bin",
ru: бинарный журнал под названием "mysql-bin",

source: a server with server id = 1.
ru: сервер с идентификатором 1.

source: The values are hard-coded in the program, though of course you can change the program -- it's easy to see their settings.
ru: Значения заданы в программе, хотя программу, конечно, можно изменить -- посмотреть настройки несложно.

source: STEP 5: Look at the program:
ru: ШАГ 5: Обратите внимание на программу:

source: Everything unnecessary has been stripped so that you can see quickly how it works. At the start of ``main()``, there are some settings used for connecting -- host, port, user, password. Then there is an initialization call with the binary log file name = "mysql-bin". Pay particular attention to the ``setCallback`` statement, which passes database name = "test", table name = "test", and callback function address = callback. The program will be looping and invoking this callback function. See how, earlier in the program, the callback function prints "UPDATE" or "DELETE" or "INSERT" depending on what is passed to it.
ru: Всё лишнее почистили, чтобы можно было ясно увидеть, как это работает. В начале функции ``main()`` есть некоторые настройки, используемые для установки соединения -- хост, порт, пользователь, пароль. Затем есть вызов инициализации с именем файла бинарного журнала = "mysql-bin". Обратите особое внимание на оператор ``setCallback``, который передает имя базы данных = "test", имя таблицы = "test" и адрес функции обратного вызова = callback. Программа войдет в цикл и будет вызывать эту функцию обратного вызова. Посмотрите, как на ранних этапах программы функция обратного вызова выводит "UPDATE", "DELETE" или "INSERT" в зависимости от переданных данных.

source: STEP 5: Put the program in the ``tarantool-libslave`` directory and name it ``example.cpp``.
ru: ШАГ 5: Поместите программу в директорию ``tarantool-libslave`` и назовите ее ``example.cpp``.

source: Step 6: Compile and build:
ru: ШАГ 6: Выполните компиляцию и сборку:

source: Replace ``tarantool-libslave/include`` with the full directory name.
ru: Замените ``tarantool-libslave/include`` на полное имя директории.

source: Notice that the name of the static library is ``libslave_a.a``, not ``libslave.a``.
ru: Обратите внимание, что имя статической библиотеки -- ``libslave_a.a``, а не ``libslave.a``.

source: Step 7: Run:
ru: ШАГ 7: Выполните:

source: The result will be nothing -- the program is looping, waiting for the MySQL server to write to the replication binary log.
ru: Результат нет -- программа в цикле ожидает, пока сервер MySQL запишет данные в бинарный журнал репликации.

source: Step 8: Start a MySQL client program -- any client program will do. Enter these statements:
ru: ШАГ 8: Запустите клиентскую программу MySQL -- подойдет любая клиентская программа. Введите следующие операторы:

source: Watch what happens in ``example.cpp`` output -- it displays:
ru: Проверьте, что происходит в выводе программы ``example.cpp`` -- отображается следующее:

source: This is row-based replication, so you see two DELETEs, because there are two rows.
ru: Репликация является построчной, поэтому видим DELETE два раза -- потому что есть две строки.

source: What the exercise has shown is:
ru: В результате выполнения упражнения видим:

source: the library can be built, and
ru: можно собрать библиотеку, а

source: programs that use the library can access everything that the MySQL server dumps.
ru: программы, которые используют библиотеку, могут получить доступ ко всему, что сохраняет сервер MySQL.

source: For the many details and examples of usage in the field, see:
ru: Более подробную информацию и примеры использования см. ниже:

source: Our downloadable ``libslave`` version:
ru: Загрузить нашу версию ``libslave`` можно по ссылке:

source: The version it was forked from (with a different README):
ru: Ответвление сделано из версии по ссылке (с другим файлом README):

source: `How to speed up your MySQL with replication to in-memory database <http://highscalability.com/blog/2017/3/29/how-to-speed-up-your-mysql-with-replication-to-in-memory-dat.html>`_ article
ru: Статья `How to speed up your MySQL with replication to in-memory database <http://highscalability.com/blog/2017/3/29/how-to-speed-up-your-mysql-with-replication-to-in-memory-dat.html>`_ (на английском)

source: `Replicating data from MySQL to Tarantool <https://habrahabr.ru/company/mailru/blog/323870/>`_ article (in Russian)
ru: Статья `Репликация из MySQL в Tarantool <https://habrahabr.ru/company/mailru/blog/323870/>`_

source: `Asynchronous replication uncensored <https://habrahabr.ru/company/oleg-bunin/blog/313594/>`_ article (in Russian)
ru: Статья `Асинхронная репликация без цензуры <https://habrahabr.ru/company/oleg-bunin/blog/313594/>`_

source: Lua tutorials
ru: Практические задания на Lua

source: Here are three tutorials on using Lua stored procedures with Tarantool:
ru: Практические задания по использованию хранимых процедур на языке Lua в работе с Tarantool'ом:

source: :ref:`Insert one million tuples with a Lua stored procedure <c_lua_tutorial-insert_one_million_tuples>`,
ru: :ref:`Вставка 1 млн кортежей с помощью хранимой процедуры на языке Lua <c_lua_tutorial-insert_one_million_tuples>`,

source: :ref:`Sum a JSON field for all tuples <c_lua_tutorial-sum_a_json_field>`,
ru: :ref:`Подсчет суммы по JSON-полям во всех кортежах <c_lua_tutorial-sum_a_json_field>`,

source: :ref:`Indexed pattern search <c_lua_tutorial-indexed_pattern_search>`.
ru: :ref:`Индексированный поиск по шаблонам <c_lua_tutorial-indexed_pattern_search>`.

source: Insert one million tuples with a Lua stored procedure
ru: Вставка 1 млн кортежей с помощью хранимой процедуры на языке Lua

source: This is an exercise assignment: “Insert one million tuples. Each tuple should have a constantly-increasing numeric primary-key field and a random alphabetic 10-character string field.”
ru: Задание по данному практикуму: “Вставьте 1 миллион кортежей. В каждом кортеже должно быть поле, которое соответствует ключу в первичном индексе, в виде постоянно возрастающего числа, а также поле в виде буквенной строки со случайным значением из 10 символов.”

source: The purpose of the exercise is to show what Lua functions look like inside Tarantool. It will be necessary to employ the Lua math library, the Lua string library, the Tarantool box library, the Tarantool box.tuple library, loops, and concatenations. It should be easy to follow even for a person who has not used either Lua or Tarantool before. The only requirement is a knowledge of how other programming languages work and a memory of the first two chapters of this manual. But for better understanding, follow the comments and the links, which point to the Lua manual or to elsewhere in this Tarantool manual. To further enhance learning, type the statements in with the tarantool client while reading along.
ru: Цель данного упражнения состоит в том, чтобы показать, как выглядят Lua-функции в Tarantool'е. Необходимо будет работать с математической библиотекой Lua, библиотекой для работы со строками интерпретатора Lua, Tarantool-библиотекой ``box``, Tarantool-библиотекой ``box.tuple``, циклами и конкатенацией. Инструкции легко будет выполнять даже тем, кто никогда не использовал раньше Lua или Tarantool. Единственное требование -- знание того, как работают другие языки программирования, и изучение первых двух глав данного руководства. Но для лучшего понимания можно следовать по комментариям и ссылкам на руководство по Lua или другим пунктам в данном руководстве по Tarantool'у. А чтобы облегчить изучение, читайте инструкции параллельно с вводом операторов в Tarantool-клиент.

source: Configure
ru: Настройка

source: We are going to use the Tarantool sandbox that was created for our :ref:`"Getting started" exercises <getting_started>`. So there is a single space, and a numeric primary key, and a running Tarantool server instance which also serves as a client.
ru: Будем использовать Tarantool-песочницу, которую создавали для :ref:`упражнений раздела "Руководство для начинающих" <getting_started>`. Таким образом, у нас есть один спейс и числовой ключ первичного индекса, а также экземпляр Tarantool'а, который также выступает в виде клиента.

source: Delimiter
ru: Разделитель

source: In earlier versions of Tarantool, multi-line functions had to be enclosed within "delimiters". They are no longer necessary, and so they will not be used in this tutorial. However, they are still supported. Users who wish to use delimiters, or users of older versions of Tarantool, should check the syntax description for :ref:`declaring a delimiter <console-delimiter>` before proceeding.
ru: В более ранних версиях Tarantool'а многострочные функции обрамляются символами-разделителями. Сейчас в них нет необходимости, поэтому в данном практическом задании они использоваться не будут. Однако они все еще поддерживаются. Если вы хотите использовать разделители или используете более раннюю версию Tarantool'а, перед работой проверьте описание синтаксиса для :ref:`объявления разделителя <console-delimiter>`.

source: Create a function that returns a string
ru: Создание функции, которая возвращает строку

source: We will start by making a function that returns a fixed string, “Hello world”.
ru: Начнем с создания функции, которая возвращает заданную строку -- “Hello world”.

source: The word "``function``" is a Lua keyword -- we're about to go into Lua. The function name is string_function. The function has one executable statement, ``return "hello world"``. The string "hello world" is enclosed in double quotes here, although Lua doesn't care -- one could use single quotes instead. The word "``end``" means “this is the end of the Lua function declaration.” To confirm that the function works, we can say
ru: Слово "``function``" (функция) -- ключевое слово в языке Lua. Рассмотрим подробно работу с языком Lua. Имя функции -- string_function (строковая_функция). В функции есть один исполняемый оператор, ``return "hello world"`` (вернуть "hello world"). Строка "hello world" здесь заключена в двойные кавычки, хотя в Lua это не имеет значения, можно использовать одинарные кавычки. Слово "``end``" означает, что “это конец объявления Lua-функции.” Чтобы проверить работу функции, можем выполнить команду

source: Sending ``function-name()`` means “invoke the Lua function.” The effect is that the string which the function returns will end up on the screen.
ru: Отправка ``function-name()`` (имя-функции) означает команду вызова Lua-функции. В результате возвращаемая функцией строка появится на экране.

source: For more about Lua strings see Lua manual `chapter 2.4 "Strings"`_ . For more about functions see Lua manual `chapter 5 "Functions"`_.
ru: Для получения подробной информации о строках в языке Lua, см. `Главу 2.4 "Строки"`_ в руководстве по языку Lua. Для получения подробной информации о функциях см. Главу 5 "Функции" в руководстве по языку Lua (`chapter 5 "Functions"`_).

source: The screen now looks like this:
ru: Теперь вывод на экране выглядит следующим образом:

source: Create a function that calls another function and sets a variable
ru: Создание функции, которая вызывает другую функцию и определяет переменную

source: Now that ``string_function`` exists, we can invoke it from another function.
ru: Теперь у нас есть функция ``string_function``, и можно вызвать ее с помощью другой функции.
