Repository: tarantool/doc
Catalog: locale/*/LC_MESSAGES/doc.po
Languages: ru

source: We begin by declaring a variable "``string_value``". The word "``local``" means that string_value appears only in ``main_function``. If we didn't use "``local``" then ``string_value`` would be visible everywhere - even by other users using other clients connected to this server instance! Sometimes that's a very desirable feature for inter-client communication, but not this time.
ru: Сначала объявим переменную "``string_value``" (значение_строки). Слово "``local``" (локально) означает, что string_value появится только в ``main_function`` (основная_функция). Если бы мы не использовали "``local``", то ``string_value`` увидели бы даже пользователи других клиентов, которые подключились к данному экземпляру! Иногда это может быть очень полезно при взаимодействии клиентов, но не в нашем случае.

source: Then we assign a value to ``string_value``, namely, the result of ``string_function()``. Soon we will invoke ``main_function()`` to check that it got the value.
ru: Затем определим значение для ``string_value``, а именно, результат функции ``string_function()``. Сейчас вызовем ``main_function()``, чтобы проверить, что значение определено.

source: For more about Lua variables see Lua manual `chapter 4.2 "Local Variables and Blocks"`_ .
ru: Для получения подробной информации о переменных в языке Lua, см. Главу 4.2 "Локальные переменные и блоки" в руководстве по языку Lua (`chapter 4.2 "Local Variables and Blocks"`_).

source: Modify the function so it returns a one-letter random string
ru: Изменение функции для возврата строки из одной случайной буквы

source: Now that it's a bit clearer how to make a variable, we can change ``string_function()`` so that, instead of returning a fixed literal "Hello world", it returns a random letter between 'A' and 'Z'.
ru: Сейчас стало понятно, как задавать переменную, поэтому можно изменить функцию ``string_function()`` так, чтобы вместо возврата заданной фразы "Hello world", она возвращала случайным образом выбранную букву от 'A' до 'Z'.

source: It is not necessary to destroy the old ``string_function()`` contents, they're simply overwritten. The first assignment invokes a random-number function in Lua's math library; the parameters mean “the number must be an integer between 65 and 90.” The second assignment invokes an integer-to-character function in Lua's string library; the parameter is the code point of the character. Luckily the ASCII value of 'A' is 65 and the ASCII value of 'Z' is 90 so the result will always be a letter between A and Z.
ru: Нет необходимости стирать содержание старой функции ``string_function()``, оно просто перезаписывается. Первый оператор вызывает функцию из математической библиотеки Lua, которая возвращает случайное число; параметры означают, что число должно быть целым от 65 до 90. Второй оператор вызывает функцию из библиотеки Lua для работы со строками, которая преобразует число в символ; параметр представляет собой кодовую точку символа. К счастью, в кодировке ASCII символу 'A' соответствует значение 65, а 'Z' -- 90, так что в результате всегда получим букву от A до Z.

source: For more about Lua math-library functions see Lua users "`Math Library Tutorial`_". For more about Lua string-library functions see Lua users "`String Library Tutorial`_" .
ru: Для получения подробной информации о функциях математической библиотеки в языке Lua, см. Практическое задание по математической библиотеке для пользователей Lua (`Math Library Tutorial`_). Для получения подробной информации о функциях библиотеки для работы со строками в языке Lua, см. Практическое задание по библиотеке для работы со строками для пользователей Lua (`String Library Tutorial`_).

source: Once again the ``string_function()`` can be invoked from main_function() which can be invoked with ``main_function()``.
ru: И снова функцию ``string_function()`` можно вызвать из main_function(), которую можно вызвать с помощью ``main_function()``.

source: ... Well, actually it won't always look like this because ``math.random()`` produces random numbers. But for the illustration purposes it won't matter what the random string values are.
ru: ... На самом деле, вывод не всегда будет именно таким, поскольку функция ``math.random()`` вызывает случайные числа. Но для наглядности случайные значения в строке не важны.

source: Modify the function so it returns a ten-letter random string
ru: Изменение функции для возврата строки из десяти случайных букв

source: Now that it's clear how to produce one-letter random strings, we can reach our goal of producing a ten-letter string by concatenating ten one-letter strings, in a loop.
ru: Сейчас стало понятно, как вызывать строки из одной случайной буквы, поэтому можно перейти к нашей цели -- возврату строки из десяти букв с помощью конкатенации десяти строк из одной случайной буквы в цикле.

source: The words "for x = 1,10,1" mean “start with x equals 1, loop until x equals 10, increment x by 1 for each iteration.” The symbol ".." means "concatenate", that is, add the string on the right of the ".." sign to the string on the left of the ".." sign. Since we start by saying that random_string is "" (a blank string), the end result is that random_string has 10 random letters. Once again the ``string_function()`` can be invoked from ``main_function()`` which can be invoked with ``main_function()``.
ru: Слова "for x = 1,10,1" означают: “начать с x, равного 1, зацикливать до тех пор, пока x не будет равен 10, увеличивать x на 1 на каждом шаге цикла”. Символ ".." означает "конкатенацию", то есть добавление строки справа от знака ".." к строке слева от знака "..". Поскольку в начале определяется, что random_string (случайная_строка) представляет собой "" (пустую строку), в результате получим, что в random_string 10 случайных букв. И снова функцию ``string_function()`` можно вызвать из ``main_function()``, которую можно вызвать с помощью ``main_function()``.

source: For more about Lua loops see Lua manual `chapter 4.3.4 "Numeric for"`_.
ru: Для получения подробной информации о циклах в языке Lua, см. Главу 4.3.4 "Числовой оператор for" в руководстве по языку Lua (`chapter 4.3.4 "Numeric for"`_).

source: Make a tuple out of a number and a string
ru: Составление кортежа из числа и строки

source: Now that it's clear how to make a 10-letter random string, it's possible to make a tuple that contains a number and a 10-letter random string, by invoking a function in Tarantool's library of Lua functions.
ru: Сейчас стало понятно, как создать строку из 10 случайных букв, поэтому можно создать кортеж, который будет содержать число и строку из 10 случайных букв, с помощью функции в Tarantool-библиотеке Lua-функций.

source: Once this is done, t will be the value of a new tuple which has two fields. The first field is numeric: 1. The second field is a random string. Once again the ``string_function()`` can be invoked from ``main_function()`` which can be invoked with ``main_function()``.
ru: После этого, "t" будет представлять собой значение нового кортежа с двумя полями. Первое поле является числовым: "1". Второе поле представляет собой случайную строку. И снова функцию ``string_function()`` можно вызвать из ``main_function()``, которую можно вызвать с помощью ``main_function()``.

source: For more about Tarantool tuples see Tarantool manual section :ref:`Submodule box.tuple <box_tuple>`.
ru: Для получения подробной информации о кортежах в Tarantool'е, см. раздел :ref:`Вложенный модуль box.tuple <box_tuple>` руководства по Tarantool'у.

source: Modify main_function to insert a tuple into the database
ru: Изменение основной функции main_function для вставки кортежа в базу данных

source: Now that it's clear how to make a tuple that contains a number and a 10-letter random string, the only trick remaining is putting that tuple into tester. Remember that tester is the first space that was defined in the sandbox, so it's like a database table.
ru: Сейчас стало понятно, как создавать кортеж, который содержит число и строку из десяти случайных букв, поэтому осталось только поместить этот кортеж в спейс tester. Следует отметить, что tester -- это первый спейс, определенный в песочнице, поэтому он представляет собой таблицу в базе данных.

source: The new line here is ``box.space.tester:replace(t)``. The name contains 'tester' because the insertion is going to be to tester. The second parameter is the tuple value. To be perfectly correct we could have said ``box.space.tester:insert(t)`` here, rather than ``box.space.tester:replace(t)``, but "replace" means “insert even if there is already a tuple whose primary-key value is a duplicate”, and that makes it easier to re-run the exercise even if the sandbox database isn't empty. Once this is done, tester will contain a tuple with two fields. The first field will be 1. The second field will be a random 10-letter string. Once again the ``string_function(``) can be invoked from ``main_function()`` which can be invoked with ``main_function()``. But ``main_function()`` won't tell the whole story, because it does not return t, it only puts t into the database. To confirm that something got inserted, we'll use a SELECT request.
ru: Здесь новая строка -- ``box.space.tester:replace(t)``. Имя содержит слово 'tester', потому что вставка будет осуществляться в спейс tester. Второй параметр представляет собой значение в кортеже. Для абсолютной точности мы могли ввести команду ``box.space.tester:insert(t)``, а не ``box.space.tester:replace(t)``, но слово "replace" (заменить) означает “вставить, даже если уже существует кортеж, у которого значение первичного ключа совпадает”, и это облегчит повтор упражнения, даже если песочница не пуста. После того, как это будет выполнено, спейс tester будет содержать кортеж с двумя полями. Первое поле будет 1. Второе поле будет представлять собой строку из десяти случайных букв. И снова функцию ``string_function()`` можно вызвать из ``main_function()``, которую можно вызвать с помощью ``main_function()``. Но функция ``main_function()`` не может полностью отразить ситуацию, поскольку она не возвращает t, она только размещает t в базе данных. Чтобы убедиться, что произошла вставка, используем SELECT-запрос.

source: For more about Tarantool insert and replace calls, see Tarantool manual section :ref:`Submodule box.space <box_space>`, :ref:`space_object:insert() <box_space-insert>`, and :ref:`space_object:replace() <box_space-replace>`.
ru: Для получения подробной информации о вызовах insert и replace в Tarantool'е, см. разделы :ref:`Вложенный модуль box.space <box_space>`, :ref:`space_object:insert() <box_space-insert>` и :ref:`space_object:replace() <box_space-replace>` руководства по Tarantool'у.

source: Modify main_function to insert a million tuples into the database
ru: Изменение основной функции main_function для вставки миллиона кортежей в базу данных

source: Now that it's clear how to insert one tuple into the database, it's no big deal to figure out how to scale up: instead of inserting with a literal value = 1 for the primary key, insert with a variable value = between 1 and 1 million, in a loop. Since we already saw how to loop, that's a simple thing. The only extra wrinkle that we add here is a timing function.
ru: Сейчас стало понятно, как вставить кортеж в базу данных, поэтому несложно догадаться, как можно увеличить масштаб: вместо того, чтобы вставлять значение 1 для первичного ключа, вставьте значение переменной от 1 до миллиона в цикле. Поскольку уже рассматривалось, как заводить цикл, это будет несложно. Мы лишь добавим небольшой штрих -- функцию распределения во времени.

source: The standard Lua function `os.clock() <http://www.lua.org/manual/5.1/manual.html#pdf-os.clock>`_ will return the number of CPU seconds since the start. Therefore, by getting start_time = number of seconds just before the inserting, and then getting end_time = number of seconds just after the inserting, we can calculate (end_time - start_time) = elapsed time in seconds. We will display that value by putting it in a request without any assignments, which causes Tarantool to send the value to the client, which prints it. (Lua's answer to the C ``printf()`` function, which is ``print()``, will also work.)
ru: Стандартная Lua-функция `os.clock() <http://www.lua.org/manual/5.1/manual.html#pdf-os.clock>`_ вернет время ЦП в секундах с момента начала программы. Таким образом, выводя start_time = number of seconds (время_начала = число секунд) прямо перед вставкой, а затем выводя end_time = number of seconds (время_окончания = число секунд) сразу после вставки, можно рассчитать (время_окончания - время_начала) = затраченное время в секундах. Отобразим это значение путем ввода в запрос без операторов, что приведет к тому, что Tarantool отправит значение на клиент, который выведет это значение. (Ответ Lua на C-функцию ``printf()``, а именно ``print()``, также сработает.)

source: For more on Lua ``os.clock()`` see Lua manual `chapter 22.1 "Date and Time"`_. For more on Lua print() see Lua manual `chapter 5 "Functions"`_.
ru: Для получения подробной информации о функции ``os.clock()`` см. Главу 22.1 "Дата и время" в руководстве по языку Lua (`chapter 22.1 "Date and Time"`_). Для получения подробной информации о функции print() см. Главу 5 "Функции" в руководстве по языку Lua (`chapter 5 "Functions"`_).

source: Since this is the grand finale, we will redo the final versions of all the necessary requests: the request that created ``string_function()``, the request that created ``main_function()``, and the request that invokes ``main_function()``.
ru: И поскольку наступает кульминация -- повторно введем окончательные варианты всех необходимых запросов: запрос, который создает ``string_function()``, запрос, который создает ``main_function()``, и запрос, который вызывает ``main_function()``.

source: What has been shown is that Lua functions are quite expressive (in fact one can do more with Tarantool's Lua stored procedures than one can do with stored procedures in some SQL DBMSs), and that it's straightforward to combine Lua-library functions and Tarantool-library functions.
ru: Итак, мы доказали, что возможности Lua-функций довольно многообразны (на самом деле, с помощью хранимых процедур на языке Lua в Tarantool'е можно сделать больше, чем с помощью хранимых процедур в некоторых SQL СУБД), и несложно комбинировать функции Lua-библиотек и функции Tarantool-библиотек.

source: What has also been shown is that inserting a million tuples took 37 seconds. The host computer was a Linux laptop. By changing :ref:`wal_mode <cfg_binary_logging_snapshots-wal_mode>` to 'none' before running the test, one can reduce the elapsed time to 4 seconds.
ru: Также мы показали, что вставка миллиона кортежей заняла 37 секунд. Хостом выступил ноутбук с ОС Linux. А изменив значение :ref:`wal_mode <cfg_binary_logging_snapshots-wal_mode>` на 'none' перед запуском теста, можно уменьшить затраченное время до 4 секунд.

source: Sum a JSON field for all tuples
ru: Подсчет суммы по JSON-полям во всех кортежах

source: This is an exercise assignment: “Assume that inside every tuple there is a string formatted as JSON. Inside that string there is a JSON numeric field. For each tuple, find the numeric field's value and add it to a 'sum' variable. At end, return the 'sum' variable.” The purpose of the exercise is to get experience in one way to read and process tuples.
ru: Задание по данному практикуму: “Предположим, что в каждом кортеже есть строка в формате JSON. В каждой строке есть числовое поле формата JSON. Для каждого кортежа необходимо найти значение числового поля и прибавить его к переменной 'sum' (сумма). В конце функция должна вернуть переменную 'sum'.” Цель данного упражнения -- получить опыт в прочтении и обработке кортежей одновременно.

source: **LINE 3: WHY "LOCAL".** This line declares all the variables that will be used in the function. Actually it's not necessary to declare all variables at the start, and in a long function it would be better to declare variables just before using them. In fact it's not even necessary to declare variables at all, but an undeclared variable is "global". That's not desirable for any of the variables that are declared in line 1, because all of them are for use only within the function.
ru: **СТРОКА 3: ЗАЧЕМ НУЖЕН "LOCAL".** Эта строка объявляет все переменные, которые будут использоваться в функции. На самом деле, нет необходимости в начале объявлять все переменные, а в длинной функции лучше объявить переменные прямо перед их использованием. Фактически объявлять переменные вообще необязательно, но необъявленная переменная будет "глобальной". Это представляется нежелательным для всех переменных, объявленных в строке 1, поскольку все они используются только в рамках функции.

source: **LINE 5: WHY "PAIRS()".** Our job is to go through all the rows and there are two ways to do it: with :ref:`box.space.space_object:pairs() <box_space-pairs>` or with ``variable = select(...)`` followed by :samp:`for i, {n}, 1 do {some-function}(variable[i]) end`. We preferred ``pairs()`` for this example.
ru: **СТРОКА 5: ЗАЧЕМ НУЖЕН "PAIRS()".** Наша задача -- пройти по всем строкам, что можно сделать двумя способами: с помощью :ref:`box.space.space_object:pairs() <box_space-pairs>` или с помощью ``variable = select(...)`` с указанием :samp:`for i, {n}, 1 do {некая-функция}(variable[i]) end`. Для данного примера мы предпочли использовать ``pairs()``.

source: **LINE 5: START THE MAIN LOOP.** Everything inside this "``for``" loop will be repeated as long as there is another index key. A tuple is fetched and can be referenced with variable :code:`t`.
ru: **СТРОКА 5: НАЧАЛО ОСНОВНОГО ЦИКЛА.** Всё внутри цикла "``for``" будет повторяться до тех пор, пока не кончатся индекс-ключи. На полученный кортеж можно сослаться с помощью переменной :code:`t`.

source: **LINE 6: WHY "PCALL".** If we simply said ``lua_table = json.decode(t[2]))``, then the function would abort with an error if it encountered something wrong with the JSON string - a missing colon, for example. By putting the function inside "``pcall``" (`protected call`_), we're saying: we want to intercept that sort of error, so if there's a problem just set ``is_valid_json = false`` and we will know what to do about it later.
ru: **СТРОКА 6: ЗАЧЕМ НУЖЕН "PCALL".** Если бы мы просто ввели ``lua_table = json.decode(t[2]))``, то функция завершила бы работу с ошибкой, обнаружив любое несоответствие в JSON-строке, например отсутствие запятой. Заключив функцию в "``pcall``" (`protected call`_ -- защищенный вызов), мы заявляем следующее: хотим перехватывать ошибки такого рода, поэтому в случае ошибки следует просто указать ``is_valid_json = false``, и позднее мы решим, что с этим делать.

source: **LINE 6: MEANING.** The function is :ref:`json.decode <json-decode>` which means decode a JSON string, and the parameter is t[2] which is a reference to a JSON string. There's a bit of hard coding here, we're assuming that the second field in the tuple is where the JSON string was inserted. For example, we're assuming a tuple looks like
ru: **СТРОКА 6: ЗНАЧЕНИЕ.** Функция :ref:`json.decode <json-decode>` означает декодирование JSON-строки, а параметр t[2] представляет собой ссылку на JSON-строку. Здесь есть заранее заданные значения, а мы предполагаем, что JSON-строка была вставлена во второе поле кортежа. Например, предположим, что кортеж выглядит следующим образом:

source: meaning that the tuple's first field, the primary key field, is a number while the tuple's second field, the JSON string, is a string. Thus the entire statement means "decode ``t[2]`` (the tuple's second field) as a JSON string; if there's an error set ``is_valid_json = false``; if there's no error set ``is_valid_json = true`` and set ``lua_table =`` a Lua table which has the decoded string".
ru: что означает, что первое поле кортежа, первичное поле, представляет собой число, а второе поле кортежа, JSON-строка, является строкой. Таким образом, значение оператора будет следующим: "декодировать ``t[2]`` (второе поле кортежа) как JSON-строку; если обнаружится ошибка, то указать ``is_valid_json = false``; если ошибок нет, указать ``is_valid_json = true`` и ``lua_table =`` Lua-таблица, в которой находится декодированная строка".

source: **LINE 8.** At last we are ready to get the JSON field value from the Lua table that came from the JSON string. The value in field_name, which is the parameter for the whole function, must be a name of a JSON field. For example, inside the JSON string ``'{"Hello": "world", "Quantity": 15}'``, there are two JSON fields: "Hello" and "Quantity". If the whole function is invoked with ``sum_json_field("Quantity")``, then ``field_value = lua_table[field_name]`` is effectively the same as ``field_value = lua_table["Quantity"]`` or even ``field_value = lua_table.Quantity``. Those are just three different ways of saying: for the Quantity field in the Lua table, get the value and put it in variable :code:`field_value`.
ru: **СТРОКА 8.** Наконец, мы готовы получить значение JSON-поля из Lua-таблицы, взятое из JSON-строки. Значение в field_name (имя_поля), которое является параметром всей функции, должно представлять собой JSON-поле. Например, в JSON-строке ``'{"Hello": "world", "Quantity": 15}'`` есть два JSON-поля: "Hello" и "Quantity". Если вся функция вызывается с помощью ``sum_json_field("Quantity")``, тогда ``field_value = lua_table[field_name]`` (значение_поля = Lua_таблица[имя_поля]) по сути аналогично ``field_value = lua_table["Quantity"]`` или даже ``field_value = lua_table.Quantity``. Итак, этими тремя способами можно ввести следующую команду: получить значение поля Quantity в Lua-таблице и поместить его в переменную :code:`field_value`.

source: **LINE 9: WHY "IF".** Suppose that the JSON string is well formed but the JSON field is not a number, or is missing. In that case, the function would be aborted when there was an attempt to add it to the sum. By first checking ``type(field_value) == "number"``, we avoid that abortion. Anyone who knows that the database is in perfect shape can skip this kind of thing.
ru: **СТРОКА 9: ЗАЧЕМ НУЖЕН "IF".** Предположим, что JSON-строка не содержит синтаксических ошибок, но JSON-поле не является числовым или вовсе отсутствует. В таком случае выполнение функции прервется при попытке прибавить значение к сумме. Если сначала проверить, ``type(field_value) == "number"`` (тип(значение_поля) == "число"), можно избежать прерывания функции. Если вы уверены, что база данных в идеальном состоянии, этот шаг можно пропустить.

source: And the function is complete. Time to test it. Starting with an empty database, defined the same way as the sandbox database in our :ref:`"Getting started" exercises <getting_started>`,
ru: И функция готова. Пора протестировать ее. Начинаем с пустой базы данных так же, как с песочницы в :ref:`упражнения в "Руководстве для начинающих" <getting_started>`,

source: -- if tester is left over from some previous test, destroy it box.space.tester:drop() box.schema.space.create('tester') box.space.tester:create_index('primary', {parts = {1, 'unsigned'}})
ru: -- если спейс tester остался от предыдущего задания, удалите его box.space.tester:drop() box.schema.space.create('tester') box.space.tester:create_index('primary', {parts = {1, 'unsigned'}})

source: then add some tuples where the first field is a number and the second field is a string.
ru: затем добавим несколько кортежей, где первое поле является числовым, а второе поле представляет собой строку.
