Repository: tarantool/doc
Catalog: locale/*/LC_MESSAGES/doc.po
Languages: ru

source: Can fail only if there is not enough memory for the fiber structure or fiber stack.
ru: Может не сработать, только если недостаточно памяти для структуры файбера или стека файбера.

source: The created fiber automatically returns itself to the fiber cache if has a default stack size when its "main" function completes.
ru: Созданный файбер автоматически возвращается в кэш файберов, если у него размер стека по умолчанию, когда выполнена его основная функция.

source: fiber attributes container
ru: контейнер с атрибутами файбера

source: function to run inside the fiber
ru: функция для выполнения в файбере

source: Start execution of created fiber.
ru: Запуск созданного файбера.

source: fiber to start
ru: запускаемый файбер

source: arguments to start the fiber with
ru: аргументы для запуска файбера

source: Return control to another fiber and wait until it'll be woken.
ru: Передача управления другому файберу и ожидание его пробуждения.

source: See also: :ref:`fiber_wakeup()<c_api-fiber-fiber_wakeup>`
ru: См. также :ref:`fiber_wakeup()<c_api-fiber-fiber_wakeup>`

source: Interrupt a synchronous wait of a fiber
ru: Прерывание синхронного ожидания файбера

source: fiber to be woken up
ru: пробуждаемый файбер

source: Cancel the subject fiber (set ``FIBER_IS_CANCELLED`` flag)
ru: Отмена файбера (установка флага ``FIBER_IS_CANCELLED``)

source: If target fiber's flag ``FIBER_IS_CANCELLABLE`` set, then it would be woken up (maybe prematurely). Then current fiber yields until the target fiber is dead (or is woken up by :ref:`fiber_wakeup()<c_api-fiber-fiber_wakeup>`).
ru: Если на нужном файбере установлен фалг ``FIBER_IS_CANCELLABLE``, он пробудится (возможно досрочно). Тогда текущий файбер передает управление до тех пор, пока нужный файбер не будет удален (или пробудится с помощью :ref:`fiber_wakeup()<c_api-fiber-fiber_wakeup>`).

source: fiber to be cancelled
ru: отменяемый файбер

source: Make it possible or not possible to wakeup the current fiber immediately when it's cancelled.
ru: Возможность или невозможность пробуждения текущего файбера сразу после его отмены.

source: fiber
ru: файбер

source: status to set
ru: назначаемый статус

source: previous state
ru: предыдущий статус

source: Set fiber to be joinable (``false`` by default).
ru: Определение файбера как присоединяемого (по умолчанию ``false``)

source: Wait until the fiber is dead and then move its execution status to the caller. The fiber must not be detached.
ru: Ожидание удаления файбера, а затем передача статуса его выполнения вызывающему клиенту. Файбер не должен быть открепленным.

source: Before: ``FIBER_IS_JOINABLE`` flag is set.
ru: Ранее: установлен флаг ``FIBER_IS_JOINABLE``.

source: See also: :ref:`fiber_set_joinable()<c_api-fiber-fiber_set_joinable>`
ru: См. также :ref:`fiber_set_joinable()<c_api-fiber-fiber_set_joinable>`

source: Put the current fiber to sleep for at least 's' seconds.
ru: Перевод текущего файбера в режим ожидания как минимум на 's' секунд.

source: time to sleep
ru: время ожидания

source: Note: this is a cancellation point.
ru: Примечание: это и есть точка отмены.

source: See also: :ref:`fiber_is_cancelled()<c_api-fiber-fiber_is_cancelled>`
ru: См. также :ref:`fiber_is_cancelled()<c_api-fiber-fiber_is_cancelled>`

source: Check current fiber for cancellation (it must be checked manually).
ru: Проверка отмены текущего файбера (это делается вручную).

source: Report loop begin time as double (cheap).
ru: Сообщение времени начала цикла в виде числа двойной точности.

source: Report loop begin time as 64-bit int.
ru: Сообщение времени начала цикла в виде 64-битного целого числа.

source: Reschedule fiber to end of event loop cycle.
ru: Перенос файбера для завершения событийного цикла.

source: Return ``slab_cache`` suitable to use with ``tarantool/small`` library
ru: Возврат ``slab_cache``, подходящего для использования с библиотекой ``tarantool/small``

source: Return the current fiber.
ru: Возврат текущего файбера.

source: Create a new fiber attributes container and initialize it with default parameters.
ru: Создание нового контейнера с атрибутами файбера и его инициализация с параметрами по умолчанию.

source: Can be used for creating many fibers: corresponding fibers will not take ownership.
ru: Можно использовать для создания множества файберов: смена владельца не произойдет.

source: Delete the ``fiber_attr`` and free all allocated resources. This is safe when fibers created with this attribute still exist.
ru: Удаление ``fiber_attr`` и освобождение всех выделенных ресурсов. Используется, когда есть файберы, созданные с данным атрибутом.

source: Set the fiber's stack size in the fiber attributes container.
ru: Определение размера стека файбера в контейнере с атрибутами файбера.

source: stack size for new fibers (in bytes)
ru: размер стека для новых файберов (в байтах)

source: -1 on failure (if ``stack_size`` is smaller than the minimum allowable fiber stack size)
ru: -1, если не выполнено (если размер стека ``stack_size`` меньше минимально допустимого размера стека файбера)

source: Get the fiber's stack size from the fiber attributes container.
ru: Получение размера стека файбера из контейнера с атрибутами файбера.

source: fiber attributes container, or NULL for default
ru: контейнер с атрибутами файбера или NULL, по умолчанию

source: stack size (in bytes)
ru: размер стека (в байтах)

source: A conditional variable: a synchronization primitive that allow fibers in Tarantool's :ref:`cooperative multitasking <atomic-cooperative_multitasking>` environment to yield until some predicate is satisfied.
ru: Условная переменная: примитив синхронизации, который позволяет файберам в среде :ref:`кооперативной многозадачности <atomic-cooperative_multitasking>` Tarantool'а передавать управление до выполнения какого-либо предиката.

source: Fiber conditions have two basic operations -- "wait" and "signal", -- where "wait" suspends the execution of a fiber (i.e. yields) until "signal" is called.
ru: Условия работы файбера поддерживают две основные операции -- "wait" (ожидание) и "signal" (сигнал), -- где "wait" откладывает выполнение файбера (то есть передает управление) до тех пор, пока не будет вызван "signal".

source: Unlike ``pthread_cond``, ``fiber_cond`` doesn't require mutex/latch wrapping.
ru: В отличие от ``pthread_cond``, ``fiber_cond`` не требует функции-обертки в виде мьютекса или защелки.

source: Create a new conditional variable.
ru: Создание новой условной переменной.

source: Delete the conditional variable.
ru: Удаление условной переменной.

source: Note: behavior is undefined if there are fibers waiting for the conditional variable.
ru: Примечание: поведение не определено, если есть файберы, ожидающие условной переменной.

source: conditional variable to delete
ru: удаляемая условная переменная

source: Wake up **one** (any) of the fibers waiting for the conditional variable.
ru: Пробуждение **одного** (любого) файбера, ожидающего условной переменной.

source: Does nothing if no one is waiting.
ru: Не делает ничего, если нет ожидающих файберов.

source: conditional variable
ru: условная переменная

source: Wake up **all** fibers waiting for the conditional variable.
ru: Пробуждение **всех** файберов, ожидающих условной переменной.

source: Suspend the execution of the current fiber (i.e. yield) until :ref:`fiber_cond_signal() <c_api-fiber_cond_signal>` is called.
ru: Приостановление выполнения текущего файбера (т.е. передача управления) до вызова :ref:`fiber_cond_signal() <c_api-fiber_cond_signal>`.

source: Like ``pthread_cond``, ``fiber_cond`` can issue spurious wake ups caused by explicit :ref:`fiber_wakeup()<c_api-fiber-fiber_wakeup>` or :ref:`fiber_cancel()<c_api-fiber-fiber_cancel>` calls. It is highly recommended to wrap calls to this function into a loop and check the actual predicate and :ref:`fiber_is_cancelled()<c_api-fiber-fiber_is_cancelled>` on every iteration.
ru: Как и ``pthread_cond``, ``fiber_cond`` может отправлять ложные сигналы пробуждения с помощью вызова :ref:`fiber_wakeup()<c_api-fiber-fiber_wakeup>` или :ref:`fiber_cancel()<c_api-fiber-fiber_cancel>`. Настоятельно рекомендуется заключать вызовы данной функции в цикл и проверять предикат и :ref:`fiber_is_cancelled()<c_api-fiber-fiber_is_cancelled>` при каждой итерации.

source: timeout in seconds
ru: время ожидания в секундах

source: 0 on :ref:`fiber_cond_signal() <c_api-fiber_cond_signal>` call or a spurious wake up
ru: 0 при вызове :ref:`fiber_cond_signal() <c_api-fiber_cond_signal>` или ложном пробуждении

source: -1 on timeout, and the error code is set to 'TimedOut'
ru: -1 в случае ожидания, и задается код ошибки 'TimedOut' (истекло время ожидания)

source: Shortcut for :ref:`fiber_cond_wait_timeout() <c_api-fiber_cond_wait_timeout>`.
ru: Ускоренный метод для :ref:`fiber_cond_wait_timeout() <c_api-fiber_cond_wait_timeout>`.

source: C API reference
ru: Справочник по C API

source: List of C API headers
ru: Список API для языка C

source: Module `latch`
ru: Модуль `latch`

source: A lock for cooperative multitasking environment
ru: Блокировка среды кооперативной многозадачности

source: Allocate and initialize the new latch.
ru: Выделение и инициализация новой защелки.

source: allocated latch object
ru: выделенная защелка

source: Return type
ru: Возвращаемый тип

source: Destroy and free the latch.
ru: Удаление и освобождение защелки.

source: latch to destroy
ru: удаляемая защелка

source: Lock a latch. Waits indefinitely until the current fiber can gain access to the latch.
ru: Применение защелки. Бесконечно ожидает момента, когда текущий файбер может получить доступ к защелке.

source: latch to lock
ru: применяемая защелка

source: Try to lock a latch. Return immediately if the latch is locked.
ru: Попытка применить защелку. Возвращается незамедлительно, если защелка поставлена.

source: status of operation. 0 - success, 1 - latch is locked
ru: статус операции. 0 -- успешно, 1 -- защелка поставлена

source: int
ru: целое число

source: Unlock a latch. The fiber calling this function must own the latch.
ru: Отмена защелки. Файбер, который вызывает данную функцию, должен иметь права на защелку.

source: latch to unlock
ru: отменяемая защелка

source: Module `say` (logging)
ru: Модуль `say` (запись в журнал)

source: do not use this value directly
ru: не используйте непосредственно данное значение

source: Format and print a message to Tarantool log file.
ru: Форматирование и запись сообщения в файл журнала Tarantool'а.

source: ``printf()``-like format string
ru: строка в формате типа ``printf()``

source: See also :manpage:`printf(3)`, :ref:`say_level<c_api-say-say_level>`
ru: См. также :manpage:`printf(3)`, :ref:`say_level<c_api-say-say_level>`

source: Module `schema`
ru: Модуль `schema`

source: Start of the reserved range of system spaces.
ru: Начало выделенного диапазона системных спейсов.

source: Space id of _schema.
ru: Идентификатор спейса _schema.

source: Space id of _space.
ru: Идентификатор спейса _space.

source: Space id of _vspace view.
ru: Идентификатор виртуального спейса _vspace.

source: Space id of _index.
ru: Идентификатор спейса _index.

source: Space id of _vindex view.
ru: Идентификатор виртуального спейса _vindex.

source: Space id of _func.
ru: Идентификатор спейса _func.

source: Space id of _vfunc view.
ru: Идентификатор виртуального спейса _vfunc.

source: Space id of _user.
ru: Идентификатор спейса _user.

source: Space id of _vuser view.
ru: Идентификатор виртуального спейса _vuser.

source: Space id of _priv.
ru: Идентификатор спейса _priv.

source: Space id of _vpriv view.
ru: Идентификатор виртуального спейса _vpriv.

source: Space id of _cluster.
ru: Идентификатор спейса _cluster.

source: Space id of _truncate.
ru: Идентификатор спейса _truncate.

source: End of reserved range of system spaces.
ru: Окончание выделенного диапазона системных спейсов.

source: NULL value, returned on error.
ru: Нулевое значение NULL возвращается в случае ошибки.

source: Module `trivia/config`
ru: Модуль `trivia/config`

source: Extern modifier for all public functions.
ru: Внешний модификатор для всех доступных функций.

source: System configuration dir (e.g ``/etc``)
ru: Директория для системной конфигурации (например, ``/etc``)

source: Install prefix (e.g. ``/usr``)
ru: Префикс установки (например, ``/usr``)

source: Build type, e.g. Debug or Release
ru: Тип сборки, например, отладочная сборка или релиз.

source: CMake build type signature, e.g. ``Linux-x86_64-Debug``
ru: Подпись типа сборки CMake, например, ``Linux-x86_64-Debug``

source: Command line used to run CMake.
ru: Командная строка для запуска CMake.

source: Pathes to C and CXX compilers.
ru: Пути к компиляторам C и CXX.

source: C compile flags used to build Tarantool.
ru: Флаги компиляции C, используемые для сборки Tarantool'а.

source: CXX compile flags used to build Tarantool.
ru: Флаги компиляции CXX, используемые для сборки Tarantool'а.

source: A path to install ``*.lua`` module files.
ru: Путь для установки файлов модуля ``*.lua``.

source: A path to install ``*.so``/``*.dylib`` module files.
ru: Путь для установки файлов модуля ``*.so``/``*.dylib``

source: A path to Lua includes (the same directory where this file is contained)
ru: Путь к Lua (директория, где хранится этот файл).

source: A constant added to ``package.path`` in Lua to find ``*.lua`` module files.
ru: Постоянная, добавляемая к ``package.path`` в Lua для поиска файлов модуля ``*.lua``.

source: A constant added to ``package.cpath`` in Lua to find ``*.so`` module files.
ru: Постоянная, добавляемая к ``package.cpath`` в Lua для поиска файлов модуля ``*.so``.

source: Module `tuple`
ru: Модуль `tuple`

source: Tuple format.
ru: Формат кортежа.

source: Each Tuple has an associated format (class). Default format is used to create tuples which are not attached to any particular space.
ru: Каждому кортежу соответствует определенный формат (класс). По умолчанию, используется формат для создания кортежей, не привязанных к определенному спейсу.

source: Allocate and initialize a new tuple from raw MsgPack Array data.
ru: Выделение и инициализация нового кортежа из сырых данных MsgPack-массива.

source: tuple format. Use :ref:`box_tuple_format_default()<c_api-tuple-box_tuple_format_default>` to create space-independent tuple.
ru: формат кортежа. Используйте :ref:`box_tuple_format_default()<c_api-tuple-box_tuple_format_default>` для создания кортежа независимо от спейса.

source: tuple data in MsgPack Array format ([field1, field2, ...])
ru: данные кортежа в формате MsgPack-массива ([ field1, field2, ...])

source: the end of ``data``
ru: конец данных ``data``

source: NULL on out of memory
ru: NULL при нехватке памяти

source: tuple otherwise
ru: в остальных случаях кортеж

source: See also: :ref:`box.tuple.new()<box_tuple-new>`
ru: См. также :ref:`box.tuple.new()<box_tuple-new>`

source: When working with tuples, it is the developer's responsibility to ensure that enough space is allocated, taking especial caution when writing to them with msgpuck functions such as ``mp_encode_array()``.
ru: При работе с кортежами в обязанности разработчика входит выделение достаточного места, уделяя особое внимание записи данных с помощью таких msgpuck-функций, как ``mp_encode_array()``.

source: Increase the reference counter of tuple.
ru: Увеличение значения счетчика количества ссылок на кортеж.

source: Tuples are reference counted. All functions that return tuples guarantee that the last returned tuple is reference counted internally until the next call to API function that yields or returns another tuple.
ru: Для кортежей подсчитываются ссылки. Все функции, которые возвращают кортежи, обеспечивают внутренний подсчет ссылок для последнего возвращенного кортежа до следующего вызова API-функции, которая передает управление или возвращает другой кортеж.

source: a tuple
ru: кортеж

source: -1 on error
ru: -1 в случае ошибки

source: See also: :ref:`box_tuple_unref()<c_api-tuple-box_tuple_unref>`
ru: См. также :ref:`box_tuple_unref()<c_api-tuple-box_tuple_unref>`

source: Decrease the reference counter of tuple.
ru: Увеличение значения счетчика количества ссылок на кортеж.

source: See also: :ref:`box_tuple_ref()<c_api-tuple-box_tuple_ref>`
ru: См. также :ref:`box_tuple_ref()<c_api-tuple-box_tuple_ref>`

source: Return the number of fields in a tuple (the size of MsgPack Array).
ru: Возврат количества полей в кортеже (размер MsgPack-массива).

source: Return the number of bytes used to store internal tuple data (MsgPack Array).
ru: Возврат количества байтов, используемых для хранения внутренних данных кортежа (MsgPack-массив).

source: Dump raw MsgPack data to the memory buffer ``buf`` of size ``size``.
ru: Передача сырых MsgPack-данных в буфер памяти ``buf`` размера ``size``.

source: Store tuple fields in the memory buffer.
ru: Хранение полей кортежа в буфере памяти.

source: Upon successful return, the function returns the number of bytes written. If buffer size is not enough then the return value is the number of bytes which would have been written if enough space had been available.
ru: При успешном выполнении функция возвращает количество записанных байтов. Если размер буфера недостаточный, возвращается количество байтов, которое было бы записано, если бы было достаточно места.

source: number of bytes written on success.
ru: количество записанных байтов при успешном выполнении.

source: Return the associated format.
ru: Возврат взаимосвязанного формата.

source: tuple format
ru: формат кортежа

source: Return the raw tuple field in MsgPack format. The result is a pointer to raw MessagePack data which can be decoded with mp_decode functions, for an example see the tutorial program :ref:`read.c <f_c_tutorial-read>`.
ru: Возврат поля кортежа в MsgPack-формате. Результатом будет указатель на сырые данные в формате MessagePack, которые можно расшифровать с помощью функций mp_decode. Пример можно увидеть в программе практикума :ref:`read.c <f_c_tutorial-read>`.

source: The buffer is valid until the next call to a ``box_tuple_*`` function.
ru: Буфер действует до следующего вызова функции ``box_tuple_*``.

source: zero-based index in MsgPack array.
ru: индекс с основанием 0 в MsgPack-массиве.

source: NULL if i >= :ref:`box_tuple_field_count()<c_api-tuple-box_tuple_field_count>`
ru: NULL, если i >= :ref:`box_tuple_field_count()<c_api-tuple-box_tuple_field_count>`

source: msgpack otherwise
ru: в остальных случаях msgpack

source: Possible data types for tuple fields.
ru: Допустимые типы данных для полей кортежа.

source: One cannot use STRS/ENUM macros for types because there is a mismatch between enum name (STRING) and type name literal ("STR"). STR is already used as a type in Objective C.
ru: Нельзя использовать макросы STRS/ENUM для типов, поскольку есть несоответствие между именем enum (STRING) и литералом имени типа ("STR"). STR уже используется в качестве типа в Objective-C.

source: Key definition
ru: Определение ключа

source: Create a key definition with the key fields with passed types on passed positions.
ru: Создание определения ключа с полям ключа с переданными типами по переданным позициям.

source: May be used for tuple format creation and/or tuple comparison.
ru: Можно использовать для создания формата кортежа и/или сопоставления кортежей.

source: array with key field identifiers
ru: массив с идентификаторами поля ключа

source: array with key :ref:`field types <capi-tuple_field_type>`
ru: массив с :ref:`типами поля <capi-tuple_field_type>` ключа

source: the number of key fields
ru: количество полей ключа

source: Delete a key definition
ru: Удаление определения ключа

source: key definition to delete
ru: удаляемое определение ключа

source: Return new in-memory tuple format based on passed key definitions
ru: Возврат нового формата кортежа на основании переданных определений ключа

source: array of keys defined for the format
ru: массив ключей, определенный для формата

source: count of keys
ru: количество ключей

source: new tuple format on success
ru: новый формат кортежа, если выполнено

source: Increment tuple format reference count
ru: Увеличение значения подсчета ссылок на формат кортежа

source: tuple format to ref
ru: формат кортежа для ссылок

source: Decrement tuple format reference count
ru: Уменьшение значения подсчета ссылок на формат кортежа

source: tuple format to unref
ru: формат кортежа для уменьшения

source: Compare tuples using key definition
ru: Сопоставление кортежей, используя определение ключа

source: the first tuple
ru: первый кортеж

source: the second tuple
ru: второй кортеж

source: key definition
ru: определение ключа

source: 0 if ``key_fields(tuple_a)`` == ``key_fields(tuple_b)``
ru: 0, если ``key_fields(tuple_a)`` == ``key_fields(tuple_b)``

source: <0 if ``key_fields(tuple_a)`` < ``key_fields(tuple_b)``
ru: <0, если ``key_fields(tuple_a)`` < ``key_fields(tuple_b)``

source: >0 if ``key_fields(tuple_a)`` > ``key_fields(tuple_b)``
ru: >0, если ``key_fields(tuple_a)`` > ``key_fields(tuple_b)``

source: See also: enum :ref:`field_type <capi-tuple_field_type>`
ru: См. также enum :ref:`field_type <capi-tuple_field_type>`

source: Compare a tuple with a key using key definition
ru: Сопоставление кортежа с ключом, используя определение ключа

source: key with MessagePack array header
ru: ключ с заголовком MessagePack-массива

source: 0 if ``key_fields(tuple)`` == ``parts(key)``
ru: 0, если ``key_fields(tuple)`` == ``parts(key)``

source: <0 if ``key_fields(tuple)`` < ``parts(key)``
ru: <0, если ``key_fields(tuple)`` < ``parts(key)``

source: >0 if ``key_fields(tuple)`` > ``parts(key)``
ru: >0, если ``key_fields(tuple)`` > ``parts(key)``

source: Tuple iterator
ru: Итератор кортежей

source: Allocate and initialize a new tuple iterator. The tuple iterator allows iterating over fields at the root level of a MsgPack array.
ru: Выделение и инициализация нового итератора кортежей. Итератор кортежей позволяет проводить итерацию по полям на корневом уровне MsgPack-массива.

source: box_tuple_iterator_t* it = box_tuple_iterator(tuple); if (it == NULL) { // error handling using box_error_last() } const char* field; while (field = box_tuple_next(it)) { // process raw MsgPack data } // rewind the iterator to the first position box_tuple_rewind(it) assert(box_tuple_position(it) == 0); // rewind three fields field = box_tuple_seek(it, 3); assert(box_tuple_position(it) == 4); box_iterator_free(it);
ru: box_tuple_iterator_t* it = box_tuple_iterator(tuple); if (it == NULL) { // обработка ошибок с помощью box_error_last() } const char* field; while (field = box_tuple_next(it)) { // обработка сырых MsgPack-данных } // перемотка итератора на начальное положение box_tuple_rewind(it) assert(box_tuple_position(it) == 0); // перемотка на три поля field = box_tuple_seek(it, 3); assert(box_tuple_position(it) == 4); box_iterator_free(it);

source: Destroy and free tuple iterator
ru: Удаление и освобождение итератора кортежей

source: Return zero-based next position in iterator. That is, this function returnы the field id of the field that will be returned by the next call to :ref:`box_tuple_next()<c_api-tuple-box_tuple_next>`. Returned value is zero after initialization or rewind and :ref:`box_tuple_field_count()<c_api-tuple-box_tuple_field_count>` after the end of iteration.
ru: Возврат следующего положения с основанием 0 в итераторе. То есть функция возвращает идентификатор поля, который вернется при следующем вызове :ref:`box_tuple_next()<c_api-tuple-box_tuple_next>`. Возвращается значение 0 после инициализации или перемотки и :ref:`box_tuple_field_count()<c_api-tuple-box_tuple_field_count>` по окончании итерации.

source: a tuple iterator
ru: итератор кортежей

source: position
ru: положение

source: Rewind iterator to the initial position.
ru: Перемотка итератора в начальное положение.
