Repository: tarantool/doc
Catalog: locale/*/LC_MESSAGES/doc.po
Languages: ru

source: The ``update`` function supports operations on fields — assignment, arithmetic (if the field is numeric), cutting and pasting fragments of a field, deleting or inserting a field. Multiple operations can be combined in a single update request, and in this case they are performed atomically and sequentially. Each operation requires specification of a field number. When multiple operations are present, the field number for each operation is assumed to be relative to the most recent state of the tuple, that is, as if all previous operations in a multi-operation update have already been applied. In other words, it is always safe to merge multiple ``update`` invocations into a single invocation, with no change in semantics.
ru: Функция ``update`` поддерживает операции над полями -- присваивание, арифметические операции (если поле числовое), вырезание и вставку фрагментов поля, удаление или вставку поля. Несколько операций можно объединить в отдельный запрос обновления, и в таком случае они будут выполняться атомарно и последовательно. Для каждой операции необходимо указать номер поля. Если выполняются несколько операций, то номер поля для каждой операции считается относительно последнего состояния кортежа, то есть как если бы все предыдущие операции в обновлении с несколькими операциями уже были выполнены. Другими словами, всегда лучше объединить несколько вызовов ``update`` в один без изменений семантики.

source: Possible operators are:
ru: Возможные операторы:

source: ``+`` for addition (values must be numeric)
ru: ``+`` для сложения (значения должны быть числовыми)

source: ``-`` for subtraction (values must be numeric)
ru: ``-`` для вычитания (значения должны быть числовыми)

source: ``&`` for bitwise AND (values must be unsigned numeric)
ru: ``&`` для поразрядной операции И (значения должны быть беззнаковыми числами)

source: ``|`` for bitwise OR (values must be unsigned numeric)
ru: ``|`` для поразрядной операции ИЛИ (значения должны быть беззнаковыми числами)

source: ``^`` for bitwise :abbr:`XOR(exclusive OR)` (values must be unsigned numeric)
ru: ``^`` для поразрядной операции Исключающее ИЛИ (значения должны быть беззнаковыми числами)

source: ``:`` for string splice
ru: ``:`` для разделения строк

source: ``!`` for insertion
ru: ``!`` для вставки

source: ``#`` for deletion
ru: ``#`` для удаления

source: ``=`` for assignment
ru: ``=`` для присваивания

source: For ``!`` and ``=`` operations the field number can be ``-1``, meaning the last field in the tuple.
ru: Для операций ``!`` и ``=`` номер поля может быть ``-1``, что означает последнее поле в кортеже.

source: **Possible errors:** it is illegal to modify a primary-key field.
ru: **Возможные ошибки:** нельзя изменять поле первичного ключа.

source: **Complexity factors:** Index size, Index type, number of indexes accessed, WAL settings.
ru: **Факторы сложности** Размер индекса, тип индекса, количество кортежей, к которым получен доступ, настройки журнала упреждающей записи (WAL).

source: Thus, in the instruction:
ru: Таким образом, в инструкции:

source: the primary-key value is ``44``, the operators are ``'+'`` and ``'='`` meaning *add a value to a field and then assign a value to a field*, the first affected field is field ``1`` and the value which will be added to it is ``55``, the second affected field is field ``3`` and the value which will be assigned to it is ``'x'``.
ru: значение первичного ключа равно ``44``, заданы операторы ``'+'`` и ``'='``, что означает *прибавление значение к полю, а затем присваивание значения полю*, первое затронутое поле -- это поле ``1``, к нему прибавляется значение ``55``, второе затронутое поле -- это поле ``3``, ему присваивается значение ``'x'``.

source: Assume that initially there is a space named ``tester`` with a primary-key index whose type is ``unsigned``. There is one tuple, with ``field[1]`` = ``999`` and ``field[2]`` = ``'A'``.
ru: Предположим, что изначально есть спейс под названием ``tester`` с первичным индексом, тип которого -- ``unsigned``. Есть один кортеж с полем №1 ``field[1]`` = ``999`` и полем №2 ``field[2]`` = ``'A'``.

source: In the update: |br| ``box.space.tester:update(999, {{'=', 2, 'B'}})`` |br| The first argument is ``tester``, that is, the affected space is ``tester``. The second argument is ``999``, that is, the affected tuple is identified by primary key value = 999. The third argument is ``=``, that is, there is one operation — *assignment to a field*. The fourth argument is ``2``, that is, the affected field is ``field[2]``. The fifth argument is ``'B'``, that is, ``field[2]`` contents change to ``'B'``. Therefore, after this update, ``field[1]`` = ``999`` and ``field[2]`` = ``'B'``.
ru: В обновлении: |br| ``box.space.tester:update(999, {{'=', 2, 'B'}})`` |br| Первый аргумент -- это ``tester``, то есть обновление происходит в спейсе ``tester``. Второй аргумент -- ``999``, то есть затронутый кортеж определяется по значению первичного ключа = 999. Третий аргумент -- ``=``, то есть будет одна операция -- *присваивание полю*. Четвертый аргумент -- ``2``, то есть будет затронуто поле №2 ``field[2]``. Пятый аргумент -- ``'B'``, то есть содержимое ``field[2]`` изменится на ``'B'``. Таким образом, после данного обновления ``field[1]`` = ``999``, а ``field[2]`` = ``'B'``.

source: In the update: |br| ``box.space.tester:update({999}, {{'=', 2, 'B'}})`` |br| the arguments are the same, except that the key is passed as a Lua table (inside braces). This is unnecessary when the primary key has only one field, but would be necessary if the primary key had more than one field. Therefore, after this update, ``field[1]`` = ``999`` and ``field[2]`` = ``'B'`` (no change).
ru: В обновлении: |br| ``box.space.tester:update({999}, {{'=', 2, 'B'}})`` |br| Аргументы повторяются за исключением того, что ключ передается в виде Lua-таблицы (в фигурных скобках). В этом нет необходимости, если первичный ключ содержит только одно поле, но было бы необходимо, если бы в первичном ключе было больше одного поля. Таким образом, после данного обновления ``field[1]`` = ``999``, а ``field[2]`` = ``'B'`` (без изменений).

source: In the update: |br| ``box.space.tester:update({999}, {{'=', 3, 1}})`` |br| the arguments are the same, except that the fourth argument is ``3``, that is, the affected field is ``field[3]``. It is okay that, until now, ``field[3]`` has not existed. It gets added. Therefore, after this update, ``field[1]`` = ``999``, ``field[2]`` = ``'B'``, ``field[3]`` = ``1``.
ru: В обновлении: |br| ``box.space.tester:update({999}, {{'=', 3, 1}})`` |br| Аргументы повторяются за исключением того, что четвертым аргументом будет ``3``, то есть будет затронуто поле №3 ``field[3]``. Ничего страшного, что до этого поле ``field[3]`` не существовало. Оно добавится. Таким образом, после данного обновления ``field[1]`` = ``999``, ``field[2]`` = ``'B'``, ``field[3]`` = ``1``.

source: In the update: |br| ``box.space.tester:update({999}, {{'+', 3, 1}})`` |br| the arguments are the same, except that the third argument is ``'+'``, that is, the operation is addition rather than assignment. Since ``field[3]`` previously contained ``1``, this means we're adding ``1`` to ``1``. Therefore, after this update, ``field[1]`` = ``999``, ``field[2]`` = ``'B'``, ``field[3]`` = ``2``.
ru: В обновлении: |br| ``box.space.tester:update({999}, {{'+', 3, 1}})`` |br| Аргументы повторяются за исключением того, что третьим аргументом будет ``'+'``, то есть будет операция добавления, а не присваивания. Поскольку``field[3]`` ранее содержало значение ``1``, это означает, что к ``1`` прибавится ``1``. Таким образом, после данного обновления ``field[1]`` = ``999``, ``field[2]`` = ``'B'``, ``field[3]`` = ``2``.

source: In the update: |br| ``box.space.tester:update({999}, {{'|', 3, 1}, {'=', 2, 'C'}})`` |br| the idea is to modify two fields at once. The formats are ``'|'`` and ``=``, that is, there are two operations, OR and assignment. The fourth and fifth arguments mean that ``field[3]`` gets OR'ed with ``1``. The seventh and eighth arguments mean that ``field[2]`` gets assigned ``'C'``. Therefore, after this update, ``field[1]`` = ``999``, ``field[2]`` = ``'C'``, ``field[3]`` = ``3``.
ru: В обновлении: |br| ``box.space.tester:update({999}, {{'|', 3, 1}, {'=', 2, 'C'}})`` |br| Основная идея состоит в том, чтобы изменить одновременно два поля. Форматами будут ``'|'`` и ``=``, то есть имеем две операции: ИЛИ и присваивание. Четвертый и пятый аргументы означают, что над полем ``field[3]`` проводится операция ИЛИ со значением ``1``. Седьмой и восьмой аргументы означают, что полю ``field[2]`` присваивается ``'C'``. Таким образом, после данного обновления ``field[1]`` = ``999``, ``field[2]`` = ``'C'``, ``field[3]`` = ``3``.

source: In the update: |br| ``box.space.tester:update({999}, {{'#', 2, 1}, {'-', 2, 3}})`` |br| The idea is to delete ``field[2]``, then subtract ``3`` from ``field[3]``. But after the delete, there is a renumbering, so ``field[3]`` becomes ``field[2]`` before we subtract ``3`` from it, and that's why the seventh argument is ``2``, not ``3``. Therefore, after this update, ``field[1]`` = ``999``, ``field[2]`` = ``0``.
ru: В обновлении: |br| ``box.space.tester:update({999}, {{'#', 2, 1}, {'-', 2, 3}})`` |br| Основная идея состоит в том, чтобы удалить поле ``field[2]``, а затем вычесть ``3`` из ``field[3]``. Но после удаления, произойдет перенумерация, поэтому поле ``field[3]`` становится ``field[2]`` до того, как мы вычтем из него ``3``, вот почему седьмым аргументом будет ``2``, а не ``3``. Таким образом, после данного обновления ``field[1]`` = ``999``, ``field[2]`` = ``0``.

source: In the update: |br| ``box.space.tester:update({999}, {{'=', 2, 'XYZ'}})`` |br| we're making a long string so that splice will work in the next example. Therefore, after this update, ``field[1]`` = ``999``, ``field[2]`` = ``'XYZ'``.
ru: В обновлении: |br| ``box.space.tester:update({999}, {{'=', 2, 'XYZ'}})`` |br| Создаем длинную строку, чтобы в следующем примере сработало разделение. Таким образом, после данного обновления ``field[1]`` = ``999``, ``field[2]`` = ``'XYZ'``.

source: In the update: |br| ``box.space.tester:update({999}, {{':', 2, 2, 1, '!!'}})`` |br| The third argument is ``':'``, that is, this is the example of splice. The fourth argument is ``2`` because the change will occur in ``field[2]``. The fifth argument is 2 because deletion will begin with the second byte. The sixth argument is 1 because the number of bytes to delete is 1. The seventh argument is ``'!!'``, because ``'!!'`` is to be added at this position. Therefore, after this update, ``field[1]`` = ``999``, ``field[2]`` = ``'X!!Z'``.
ru: В обновлении: |br| ``box.space.tester:update({999}, {{':', 2, 2, 1, '!!'}})`` |br| Третьим аргументом будет ``':'``, то есть это пример разделения. Четвертым аргументом будет ``2``, поскольку изменение произойдет в поле ``field[2]``. Пятым аргументом будет 2, поскольку удаление начнется со второго байта. Шестым аргументом будет 1, количество удаляемых байтов -- 1. Седьмым аргументом будет ``'!!'``, поскольку в данном положении будет добавляться ``'!!'``. Таким образом, после данного обновления ``field[1]`` = ``999``, ``field[2]`` = ``'X!!Z'``.

source: Update or insert a tuple.
ru: Обновление или вставка кортежа.

source: If there is an existing tuple which matches the key fields of ``tuple_value``, then the request has the same effect as :ref:`space_object:update() <box_space-update>` and the ``{{operator, field_no, value}, ...}`` parameter is used. If there is no existing tuple which matches the key fields of ``tuple_value``, then the request has the same effect as :ref:`space_object:insert() <box_space-insert>` and the ``{tuple_value}`` parameter is used. However, unlike ``insert`` or ``update``, ``upsert`` will not read a tuple and perform error checks before returning -- this is a design feature which enhances throughput but requires more caution on the part of the user.
ru: Если существует кортеж, который совпадает с полями ключа ``tuple_value``, запрос приведет к тому же результату, что и :ref:`space_object:update() <box_space-update>`, и используется параметр ``{{operator, field_no, value}, ...}``. Если нет кортежа, который совпадает с полями ключа ``tuple_value``, запрос приведет к тому же результату, что и :ref:`space_object:insert() <box_space-insert>`, и используется параметр ``{tuple_value}``. Однако, в отличие от ``insert`` или ``update``, ``upsert`` не считывает кортеж и не проверяет на ошибки перед возвратом -- это конструктивная особенность, которая увеличивает быстродействие, но требует большей осторожности со стороны пользователя.

source: default tuple to be inserted, if analogue isn't found
ru: вставляемый по умолчанию кортеж, если не найдет аналог

source: It is illegal to modify a primary-key field.
ru: Нельзя изменять поле первичного ключа.

source: It is illegal to use upsert with a space that has a unique secondary index.
ru: Нельзя проводить операцию upsert в спейсе, в котором есть уникальный вторичный индекс.

source: Whether or not this space is enabled. The value is ``false`` if the space has no index.
ru: Определение активности спейса. Значение ``false`` указывает на отсутствие индекса.

source: The required field count for all tuples in this space. The field_count can be set initially with:
ru: Необходимость подсчета полей всех кортежей в спейсе, который можно изначально задать следующим образом:

source: The default value is ``0``, which means there is no required field count.
ru: По умолчанию, будет использоваться значение ``0``, что указывает на отсутствие необходимости подсчета полей.

source: Ordinal space number. Spaces can be referenced by either name or number. Thus, if space ``tester`` has ``id = 800``, then ``box.space.tester:insert{0}`` and ``box.space[800]:insert{0}`` are equivalent requests.
ru: Порядковый номер спейса. На спейс можно ссылаться либо по имени, либо по номеру. Таким образом, если идентификатором спейса ``tester`` будет ``id = 800``, то ``box.space.tester:insert{0}`` и ``box.space[800]:insert{0}`` представляют собой равнозначные запросы.

source: A container for all defined indexes. There is a Lua object of type :ref:`box.index <box_index>` with methods to search tuples and iterate over them in predefined order.
ru: Контейнер для всех определенных индексов. Есть Lua-объект типа :ref:`box.index <box_index>` с методами поиска кортежей и итерации по ним в заданном порядке.

source: # checking the number of indexes for space 'tester' tarantool> #box.space.tester.index --- - 1 ... # checking the type of index 'primary' tarantool> box.space.tester.index.primary.type --- - TREE ...
ru: # проверка количества индексов для спейса 'tester' tarantool> #box.space.tester.index --- - 1 ... # проверка типа индекса 'primary' tarantool> box.space.tester.index.primary.type --- - TREE ...

source: ``_cluster`` is a system space for support of the :ref:`replication feature <replication>`.
ru: ``_cluster`` -- это системный спейс для поддержки :ref:`функции репликации <replication>`.

source: ``_func`` is a system space with function tuples made by :ref:`box.schema.func.create() <box_schema-func_create>`.
ru: ``_func`` -- это системный спейс, который содержит кортежи с функциями, созданными с помощью :ref:`box.schema.func.create() <box_schema-func_create>`.

source: Tuples in this space contain the following fields:
ru: Кортежи в данном спейсе включают в себя следующие поля:

source: the numeric function id, a number,
ru: числовой идентификатор функции, число,

source: the function name,
ru: имя функции,

source: flag,
ru: флаг,

source: a language name (optional): 'LUA' (default) or 'C'.
ru: название языка (необязательно): 'LUA' (по умолчанию) or 'C'.

source: The ``_func`` space does not include the function’s body. You continue to create Lua functions in the usual way, by saying ``function function_name () ... end``, without adding anything in the ``_func`` space. The ``_func`` space only exists for storing function tuples so that their names can be used within :ref:`grant/revoke <authentication-owners_privileges>` functions.
ru: Спейс ``_func`` не содержит саму функцию. Lua-функции создаются по-прежнему с помощью ``function имя_функции () ... end`` без каких-либо добавлений в спейс ``_func``. Спейс ``_func`` предназначен лишь для хранения кортежей с функциями так, чтобы их имена могли использоваться в функциях :ref:`выдачи/отмены прав <authentication-owners_privileges>`.

source: You can:
ru: Доступны следующие операции:

source: Create a ``_func`` tuple with :ref:`box.schema.func.create() <box_schema-func_create>`,
ru: Создание кортежа в ``_func`` с помощью :ref:`box.schema.func.create() <box_schema-func_create>`,

source: Drop a ``_func`` tuple with :ref:`box.schema.func.drop() <box_schema-func_drop>`,
ru: Удаление кортежа в ``_func`` с помощью :ref:`box.schema.func.drop() <box_schema-func_drop>`,

source: Check whether a ``_func`` tuple exists with :ref:`box.schema.func.exists() <box_schema-func_exists>`.
ru: Проверка наличия кортежа в ``_func`` с помощью :ref:`box.schema.func.exists() <box_schema-func_exists>`.

source: In the following example, we create a function named ‘f7’, put it into Tarantool's ``_func`` space and grant 'execute' privilege for this function to 'guest' user.
ru: В следующем примере создадим функцию с именем ‘f7’, поместим ее в спейс ``_func`` в Tarantool'е и выдадим права на 'выполнение' этой функции пользователю 'guest'.

source: ``_index`` is a system space.
ru: ``_index`` -- это системный спейс.

source: ``id`` (= id of space),
ru: ``id`` (= идентификатор спейса),

source: ``iid`` (= index number within space),
ru: ``iid`` (= номер индекса в спейсе),

source: ``opts`` (e.g. unique option), [``tuple-field-no``, ``tuple-field-type`` ...].
ru: ``opts`` (например, уникальная опция), [``tuple-field-no``, ``tuple-field-type`` ...].

source: Here is what ``_index`` contains in a typical installation:
ru: Вот что при обычной установке включает в себя спейс ``_index``:

source: ``_priv`` is a system space where :ref:`privileges <authentication-owners_privileges>` are stored.
ru: ``_priv`` -- это системный спейс, где хранятся :ref:`права <authentication-owners_privileges>`.

source: the numeric id of the user who gave the privilege ("grantor_id"),
ru: числовой идентификатор пользователя, который выдал права ("grantor_id"),

source: the numeric id of the user who received the privilege ("grantee_id"),
ru: числовой идентификатор пользователя, который получил права ("grantee_id"),

source: the type of object: 'space', 'function', 'sequence' or 'universe',
ru: тип объекта: 'space' (спейс), 'function' (функция), 'sequence' (последовательность) или 'universe' (вселенная),

source: the numeric id of the object,
ru: числовой идентификатор объекта,

source: the type of operation: "read" = 1, "write" = 2, "execute" = 4, "create" = 32, "drop" = 64, "alter" = 128, or a combination such as "read,write,execute".
ru: тип операции: "read" = 1, "write" = 2, "execute" = 4, "create" = 32, "drop" = 64, "alter" = 128, или их комбинация, например "read,write,execute".

source: Grant a privilege with :ref:`box.schema.user.grant() <box_schema-user_grant>`.
ru: Выдача прав с помощью :ref:`box.schema.user.grant() <box_schema-user_grant>`.

source: Revoke a privilege with :ref:`box.schema.user.revoke() <box_schema-user_revoke>`.
ru: Отмена прав с помощью :ref:`box.schema.user.revoke() <box_schema-user_revoke>`.

source: Generally, privileges are granted or revoked by the owner of the object (the user who created it), or by the 'admin' user.
ru: Как правило, права выдаются или отменяются владельцем объекта (пользователем, который создал его) или пользователем 'admin'.

source: Before dropping any objects or users, make sure that all their associated privileges have been revoked.
ru: До удаления любых объектов или пользователей, убедитесь, что отменили все связанные с ними права.

source: Only the :ref:`'admin' user <authentication-owners_privileges>` can grant privileges for the 'universe'.
ru: Только пользователь :ref:`'admin' <authentication-owners_privileges>` может выдавать права на 'universe'.

source: Only the 'admin' user or the creator of a space can drop, alter, or truncate the space.
ru: Только пользователь 'admin' или создатель спейса может удалить, изменить или очистить спейс.

source: Only the 'admin' user or the creator of a user can change a different user’s password.
ru: Только пользователь 'admin' или создатель спейса может изменять change a different user’s password.

source: ``_schema`` is a system space.
ru: ``_schema`` -- это системный спейс.

source: This space contains the following tuples:
ru: Этот спейс включает в себя следующие кортежи:

source: ``version`` tuple with version information for this Tarantool instance,
ru: кортеж ``version`` с информацией о версии данного экземпляра Tarantool'а,

source: ``cluster`` tuple with the instance's replica set ID,
ru: кортеж ``cluster`` с идентификатором набора реплик данного экземпляра,

source: ``max_id`` tuple with the maximal space ID,
ru: кортеж ``max_id`` с максимальным ID спейса,

source: ``once...`` tuples that correspond to specific :ref:`box.once() <box-once>` blocks from the instance's :ref:`initialization file <index-init_label>`. The first field in these tuples contains the ``key`` value from the corresponding ``box.once()`` block prefixed with 'once' (e.g. `oncehello`), so you can easily find a tuple that corresponds to a specific ``box.once()`` block.
ru: кортежи ``once...``, которые соответствуют определенным блокам :ref:`box.once() <box-once>` из :ref:`файла инициализации <index-init_label>` экземпляра. Первое поле в таких кортежах содержит значение ключа ``key`` из соответствующего блока ``box.once()`` с префиксом 'once' (например, `oncehello`), поэтому можно легко найти кортеж, который соответствует определенному блоку ``box.once()``.

source: Here is what ``_schema`` contains in a typical installation (notice the tuples for two ``box.once()`` blocks, ``'oncebye'`` and ``'oncehello'``):
ru: Вот что при обычной установке включает в себя спейс ``_schema`` (обратите внимание на кортежи для двух блоков ``box.once()``: ``'oncebye'`` и ``'oncehello'``):

source: ``_sequence`` is a system space for support of the :ref:`sequence feature <index-box_sequence>`. It contains persistent information that was established by :ref:`box.schema.sequence.create() <box_schema-sequence_create>` or :ref:`box.schema.sequence.alter() <box_schema-sequence_alter>`.
ru: ``_sequence`` -- это системный спейс для поддержки :ref:`последовательностей <index-box_sequence>`. Он содержит персистентную информацию, определенную с помощью :ref:`box.schema.sequence.create() <box_schema-sequence_create>` или :ref:`box.schema.sequence.alter() <box_schema-sequence_alter>`.

source: ``_sequence_data`` is a system space for support of the :ref:`sequence feature <index-box_sequence>`.
ru: ``_sequence_data`` -- это системный спейс для поддержки :ref:`последовательностей <index-box_sequence>`.

source: Each tuple in ``_sequence_data`` contains two fields:
ru: Каждый кортеж в спейсе ``_sequence_data`` содержит два поля:

source: the id of the sequence, and
ru: идентификатор последовательности и

source: the last value that the sequence generator returned (non-persistent information).
ru: последнее значение, возвращенное генератором последовательностей (временная информация).

source: ``_space`` is a system space.
ru: ``_space`` -- это системный спейс.

source: ``owner`` (= id of user who owns the space),
ru: ``owner`` (= идентификатор пользователя, которому принадлежит спейс),

source: ``flags`` (e.g. temporary),
ru: ``flags`` (например, временный),

source: ``format`` (as made by a :ref:`format clause <box_space-format>`).
ru: ``format`` (как задано через :ref:`оператор формата <box_space-format>`).
