Repository: tarantool/doc
Catalog: locale/*/LC_MESSAGES/doc.po
Languages: ru

source: Mode bits can be passed as a number or as string constants, for example ``S_IWUSR``. Mode bits can be combined by enclosing them in braces.
ru: Биты режима работы можно передать в виде числа или строковых постоянных, например ``S_IWUSR``. Биты режима работы можно комбинировать путем обрамления их в фигурные скобки.

source: (If no error) true. |br| (If error) two return values: false, error message.
ru: (Если ошибки нет) true. |br| (В случае ошибки) возвращаются два значения: false, сообщение об ошибке.

source: Change working directory. For details type ``man 2 chdir``.
ru: Изменение рабочей директории. Для получения более подробной информации введите ``man 2 chdir``.

source: (If success) true. (If failure) false.
ru: (Если выполнено) true. (Если не выполнено) false.

source: List files in directory. The result is similar to the result from the ``ls`` command.
ru: Вывод списка файлов в директории. Результат похож на результат команды ``ls``.

source: (If no error) a list of files. |br| (If error) two return values: null, error message.
ru: (Если ошибки нет) список файлов. |br| (В случае ошибки) возвращаются два значения: null, сообщение об ошибке.

source: Return a list of files that match an input string. The list is constructed with a single flag that controls the behavior of the function: ``GLOB_NOESCAPE``. For details type ``man 3 glob``.
ru: Возврат списка файлов, имена которых совпадают с введенной строкой. Список составляется с одним флагом, который контролирует поведение функции: ``GLOB_NOESCAPE``. Для получения подробной информации введите ``man 3 glob``.

source: path-name, which may contain wildcard characters.
ru: путь к файлу, который может содержать специальные символы.

source: list of files whose names match the input string
ru: список файлов, имена которых совпадают с введенной строкой.

source: **Possible errors:** nil.
ru: **Возможные ошибки:** nil.

source: Return the name of a directory that can be used to store temporary files.
ru: Возврат имени директории, которую можно использовать для хранения временных файлов.

source: Return the name of the current working directory.
ru: Возврат имени текущей рабочей директории.

source: Copy everything in the from-path, including subdirectory contents, to the to-path. The result is similar to the result that one gets from the ``cp -r`` command. The to-path should be empty.
ru: Копирование всего из директории from-path, включая поддиректории, в to-path. Результат аналогичен результату введения команды ``cp -r``. Директория to-path должна быть пустой.

source: path-name.
ru: путь.

source: Create the path, including subdirectories, but without file contents. The result is similar to the result that one gets from the ``mkdir`` command.
ru: Создание пути, включая поддиректории, но без содержимого файла. Результат аналогичен результату введения команды ``mkdir``.

source: Remove the directory indicated by path-name, including subdirectories. The result is similar to the result that one gets from the ``rmdir`` command, recursively. The directory must be empty.
ru: Удаление указанной директории, включая поддиректории. Результат аналогичен результату введения команды ``rmdir``. Директория должна быть пустой.

source: (If no error) true. |br| (If error) two return values: null, error message.
ru: (Если ошибки нет) true. |br| (В случае ошибки) возвращаются два значения: null, сообщение об ошибке.

source: Functions to create and delete links. For details type ``man readlink``, ``man 2 link``, ``man 2 symlink``, ``man 2 unlink``.
ru: Функции для создания и удаления ссылок. Для получения подробной информации введите ``man readlink``, ``man 2 link``, ``man 2 symlink``, ``man 2 unlink``.

source: existing file name.
ru: имя существующего файла.

source: linked name.
ru: связанное имя.

source: (If no error) ``fio.link`` and ``fio.symlink`` and ``fio.unlink`` return true, ``fio.readlink`` returns the link value. |br| (If error) two return values: false|null, error message.
ru: (Если ошибки нет) ``fio.link``, ``fio.symlink`` и ``fio.unlink`` возвращают true (правда), ``fio.readlink`` возвращает ссылку. |br| (В случае ошибки) возвращаются два значения: false|null, сообщение об ошибке.

source: Rename a file or directory. For details type ``man 2 rename``.
ru: Переименование файла или директории. Для получения подробной информации введите ``man 2 rename``.

source: original name.
ru: первоначальное имя.

source: new name.
ru: новое имя.

source: Copy a file. The effect is similar to the effect that one gets with the ``cp`` command.
ru: Копирование файла. Результат аналогичен результату введения команды ``cp``.

source: path to original file.
ru: путь к первоначальному файлу.

source: path to new file.
ru: путь к новому файлу.

source: Manage the rights to file objects, or ownership of file objects. For details type ``man 2 chown`` or ``man 2 chmod``.
ru: Управление правами на использование и правами владения объектами файла. Для получения подробной информации введите ``man 2 chown`` или ``man 2 chmod``.

source: new user uid.
ru: новый UID пользователя.

source: new group uid.
ru: новый UID группы.

source: new permissions
ru: новые права

source: Reduce file size to a specified value. For details type ``man 2 truncate``.
ru: Уменьшение размера файла до указанного значения. Для получения подробной информации введите ``man 2 truncate``.

source: Ensure that changes are written to disk. For details type ``man 2 sync``.
ru: Проверка записи изменений на диск. Для получения подробной информации введите ``man 2 sync``.

source: true if success, false if failure.
ru: true -- если выполнено, false -- если не выполнено.

source: Open a file in preparation for reading or writing or seeking.
ru: Открытие файла в процессе подготовки к чтению, записи или поиску.

source: Full path to the file to open.
ru: Полный путь к открываемому файлу.

source: Flags can be passed as a number or as string constants, for example '``O_RDONLY``', '``O_WRONLY``', '``O_RDWR``'. Flags can be combined by enclosing them in braces. On Linux the full set of flags as described on the `Linux man page <http://man7.org/linux/man-pages/man2/open.2.html>`_ is: * O_APPEND (start at end of file), * O_ASYNC (signal when IO is possible), * O_CLOEXEC (enable a flag related to closing), * O_CREAT (create file if it doesn't exist), * O_DIRECT (do less caching or no caching), * O_DIRECTORY (fail if it's not a directory), * O_EXCL (fail if file cannot be created), * O_LARGEFILE (allow 64-bit file offsets), * O_NOATIME (no access-time updating), * O_NOCTTY (no console tty), * O_NOFOLLOW (no following symbolic links), * O_NONBLOCK (no blocking), * O_PATH (get a path for low-level use), * O_SYNC (force writing if it's possible), * O_TMPFILE (the file will be temporary and nameless), * O_TRUNC (truncate) ... and, always, one of: * O_RDONLY (read only), * O_WRONLY (write only), or * O_RDWR (either read or write).
ru: Флаги могут передаваться в виде числа или в виде строковых постоянных, например '``O_RDONLY``', '``O_WRONLY``', '``O_RDWR``'. Флаги можно комбинировать путем обрамления их в фигурные скобки. Все флаги в Linux, как описано на странице `руководства по Linux <http://man7.org/linux/man-pages/man2/open.2.html>`_, представлены ниже: * O_APPEND (открывать файл в режиме добавления), * O_ASYNC (включать ввод-вывод, управляемый сигналом), * O_CLOEXEC (устанавливать флаг, связанный с закрытием), * O_CREAT (создать файл, если он не существует), * O_DIRECT (минимизировать или отключать кэширование), * O_DIRECTORY (завершать вызов с ошибкой, если путь не является директорией), * O_EXCL (завершать вызов с ошибкой, если файл не может быть создан), * O_LARGEFILE (открывать 64-битные файлы), * O_NOATIME (не обновлять время последнего доступа к файлу), * O_NOCTTY (не делать терминальное устройство управляющим терминалом tty), * O_NOFOLLOW (не открывать символьные ссылки), * O_NONBLOCK (открывать в неблокирующем режиме), * O_PATH (получить путь для низкоуровневого использования), * O_SYNC (включить принудительную запись, если возможно), * O_TMPFILE (создать безымянный временный файл), * O_TRUNC (урезать) ... и всегда используется один из флагов: * O_RDONLY (только для чтения), * O_WRONLY (только для записи) или * O_RDWR (для чтения и записи).

source: Flags can be passed as a number or as string constants, for example '``O_RDONLY``', '``O_WRONLY``', '``O_RDWR``'. Flags can be combined by enclosing them in braces. On Linux the full set of flags as described on the `Linux man page <http://man7.org/linux/man-pages/man2/open.2.html>`_ is:
ru: Флаги могут передаваться в виде числа или в виде строковых постоянных, например '``O_RDONLY``', '``O_WRONLY``', '``O_RDWR``'. Флаги можно комбинировать путем обрамления их в фигурные скобки. Все флаги в Linux, как описано на странице `руководства по Linux <http://man7.org/linux/man-pages/man2/open.2.html>`_, представлены ниже:

source: O_APPEND (start at end of file),
ru: O_APPEND (открывать файл в режиме добавления),

source: O_ASYNC (signal when IO is possible),
ru: O_ASYNC (включать ввод-вывод, управляемый сигналом),

source: O_CLOEXEC (enable a flag related to closing),
ru: O_CLOEXEC (устанавливать флаг, связанный с закрытием),

source: O_CREAT (create file if it doesn't exist),
ru: O_CREAT (создать файл, если он не существует),

source: O_DIRECT (do less caching or no caching),
ru: O_DIRECT (минимизировать или отключать кэширование),

source: O_DIRECTORY (fail if it's not a directory),
ru: O_DIRECTORY (завершать вызов с ошибкой, если путь не является директорией),

source: O_EXCL (fail if file cannot be created),
ru: O_EXCL (завершать вызов с ошибкой, если файл не может быть создан),

source: O_LARGEFILE (allow 64-bit file offsets),
ru: O_LARGEFILE (открывать 64-битные файлы),

source: O_NOATIME (no access-time updating),
ru: O_NOATIME (не обновлять время последнего доступа к файлу),

source: O_NOCTTY (no console tty),
ru: O_NOCTTY (не делать терминальное устройство управляющим терминалом tty),

source: O_NOFOLLOW (no following symbolic links),
ru: O_NOFOLLOW (не открывать символьные ссылки),

source: O_NONBLOCK (no blocking),
ru: O_NONBLOCK (открывать в неблокирующем режиме),

source: O_PATH (get a path for low-level use),
ru: O_PATH (получить путь для низкоуровневого использования),

source: O_SYNC (force writing if it's possible),
ru: O_SYNC (включить принудительную запись, если возможно),

source: O_TMPFILE (the file will be temporary and nameless),
ru: O_TMPFILE (создать безымянный временный файл),

source: O_TRUNC (truncate)
ru: O_TRUNC (урезать)

source: ... and, always, one of:
ru: ... и всегда используется один из флагов:

source: O_RDONLY (read only),
ru: O_RDONLY (только для чтения),

source: O_WRONLY (write only), or
ru: O_WRONLY (только для записи) или

source: O_RDWR (either read or write).
ru: O_RDWR (для чтения и записи).

source: Mode bits can be passed as a number or as string constants, for example ``S_IWUSR``. Mode bits are significant if flags include ``O_CREAT`` or ``O_TMPFILE``. Mode bits can be combined by enclosing them in braces.
ru: Биты режима работы можно передать в виде числа или строковых постоянных, например ``S_IWUSR``. Биты режима работы имеют значение, если указаны флаги ``O_CREAT`` или ``O_TMPFILE``. Биты режима работы можно комбинировать путем обрамления их в фигурные скобки.

source: (If no error) file handle (abbreviated as 'fh' in later description). |br| (If error) two return values: null, error message.
ru: (Если ошибки нет) дескриптор файла (далее сокращенно 'fh'). |br| (В случае ошибки) возвращаются два значения: null, сообщение об ошибке.

source: **Example 1:**
ru: **Пример 1:**

source: tarantool> fh = fio.open('/home/username/tmp.txt', {'O_RDWR', 'O_APPEND'}) --- ... tarantool> fh -- display file handle returned by fio.open --- - fh: 11 ...
ru: tarantool> fh = fio.open('/home/username/tmp.txt', {'O_RDWR', 'O_APPEND'}) --- ... tarantool> fh -- отображение дескриптора файла, который возвращает fio.open --- - fh: 11 ...

source: **Example 2:**
ru: **Пример 2:**

source: Using ``fio.open()`` with ``tonumber('N', 8)`` to set permissions as an octal number:
ru: Использование ``fio.open()`` с ``tonumber('N', 8)`` для определения прав в виде восьмеричного числа:

source: Close a file that was opened with ``fio.open``. For details type ``man 2 close``.
ru: Закрытие файла, который был открыт с помощью ``fio.open``. Для получения подробной информации введите ``man 2 close``.

source: file-handle as returned by ``fio.open()``.
ru: дескриптор файла, который возвращает ``fio.open()``.

source: tarantool> fh:close() -- where fh = file-handle --- - true ...
ru: tarantool> fh:close() -- где fh = дескриптор файла --- - true ...

source: Perform random-access read operation on a file, without affecting the current seek position of the file. For details type ``man 2 pread``.
ru: Чтение файла с произвольным доступом независимо от текущего положения в поиске. Для получения подробной информации введите ``man 2 pread``.

source: where to read into (if the format is ``pread(buffer, count, offset)``)
ru: откуда читать (если формат -- ``pread(buffer, count, offset)``)

source: number of bytes to read
ru: количество байтов для чтения

source: offset within file where reading begins
ru: смещение в файле -- где начинается чтение

source: If the format is ``pread(count, offset)`` then return a string containing the data that was read from the file, or nil if failure.
ru: Если формат -- ``pread(count, offset)``, возвращается строка с данными, прочитанными из файла, либо нулевое значение nil, если не выполнено.

source: If the format is ``pread(buffer, count, offset)`` then return the data to the buffer. (Buffers can be acquired with :ref:`buffer.ibuf <buffer-module>`.)
ru: Если формат -- ``pread(buffer, count, offset)``, возвращаются данные в буфер. (Буферы можно ввести с помощью :ref:`buffer.ibuf <buffer-module>`.)

source: Perform random-access write operation on a file, without affecting the current seek position of the file. For details type ``man 2 pwrite``.
ru: Запись в файл с произвольным доступом независимо от текущего положения в поиске. Для получения подробной информации введите ``man 2 pwrite``.

source: value to write
ru: записываемое значение

source: number of bytes to write (if the format is ``pwrite(buffer, count, offset)``)
ru: количество записываемых байтов (если формат -- ``pwrite(buffer, count, offset)``)

source: offset within file where writing begins
ru: смещение в файле -- где начинается запись

source: If the format is ``pwrite(new-string, offset)`` then the returned string is written to the file, as far as the end of the string.
ru: Если формат --``pwrite(new-string, offset)``, строка записывается в файл до конца строки.

source: If the format is ``pwrite(buffer, count, offset)`` then the buffer contents are written to the file, for ``count`` bytes. (Buffers can be acquired with :ref:`buffer.ibuf <buffer-module>`.)
ru: Если формат -- ``pwrite(buffer, count, offset)``, содержимое буфера записывается в файл в объеме, указанном в ``count``. (Буферы можно ввести с помощью :ref:`buffer.ibuf <buffer-module>`.)

source: Perform non-random-access read on a file. For details type ``man 2 read`` or ``man 2 write``.
ru: Чтение файла не с произвольным доступом. Для получения подробной информации введите ``man 2 read`` или ``man 2 write``.

source: ``fh:read`` and ``fh:write`` affect the seek position within the file, and this must be taken into account when working on the same file from multiple fibers. It is possible to limit or prevent file access from other fibers with ``fiber.ipc``.
ru: ``fh:read`` и ``fh:write`` влияют на положение поиска по файлу, и это следует учитывать при работе нескольких файберов над одним файлом. Существует возможность ограничения или запрета на доступ к файлу с помощью ``fiber.ipc``.

source: where to read into (if the format is ``read(buffer, count)``)
ru: откуда читать (если формат -- ``read(buffer, count)``)

source: If the format is ``read()`` -- omitting ``count`` -- then read all bytes in the file.
ru: Если формат -- ``read()`` -- без ``count`` -- считываются все байты в файле.

source: If the format is ``read()`` or ``read([count])`` then return a string containing the data that was read from the file, or nil if failure.
ru: Если формат -- ``read()`` или ``read([count])``, возвращается строка с данными, прочитанными из файла, либо нулевое значение nil, если не выполнено.

source: If the format is ``read(buffer, count)`` then return the data to the buffer. (Buffers can be acquired with :ref:`buffer.ibuf <buffer-module>`.)
ru: Если формат -- ``read(buffer, count)``, возвращаются данные в буфер. (Буферы можно ввести с помощью :ref:`buffer.ibuf <buffer-module>`.)

source: Perform non-random-access write on a file. For details type ``man 2 write``.
ru: Запись в файл не с произвольным доступом. Для получения подробной информации введите ``man 2 write``.

source: number of bytes to write (if the format is ``write(buffer, count)``)
ru: количество записываемых байтов (если формат -- ``write(buffer, count)``)

source: If the format is ``write(new-string)`` then the returned string is written to the file, as far as the end of the string.
ru: Если формат -- ``write(new-string)``, строка записывается в файл до конца строки.

source: If the format is ``write(buffer, count)`` then the buffer contents are written to the file, for ``count`` bytes. (Buffers can be acquired with :ref:`buffer.ibuf <buffer-module>`.)
ru: Если формат -- ``write(buffer, count)``, содержимое буфера записывается в файл в объеме, указанном в ``count``. (Буферы можно ввести с помощью :ref:`buffer.ibuf <buffer-module>`.)

source: Change the size of an open file. Differs from ``fio.truncate``, which changes the size of a closed file.
ru: Изменение размера открытого файла. Отличается от функции ``fio.truncate``, которая изменяет размер закрытого файла.

source: Shift position in the file to the specified position. For details type ``man 2 seek``.
ru: Изменение положения в файле на указанное. Для получения подробной информации введите ``man 2 seek``.

source: position to seek to
ru: искомое положение

source: '``SEEK_END``' = end of file, '``SEEK_CUR``' = current position, '``SEEK_SET``' = start of file.
ru: '``SEEK_END``' = конец файла, '``SEEK_CUR``' = текущее положение, '``SEEK_SET``' = начало файла.

source: the new position if success
ru: новое положение, если выполнено

source: Return statistics about an open file. This differs from ``fio.stat`` which return statistics about a closed file. For details type ``man 2 stat``.
ru: Возврат статистики об открытом файле. Отличается от функции ``fio.stat``, которая возвращает статистику о закрытом файле. Для получения подробной информации введите ``man 2 stat``.

source: details about the file.
ru: подробная информация о файле.

source: Ensure that file changes are written to disk, for an open file. Compare ``fio.sync``, which is for all files. For details type ``man 2 fsync`` or ``man 2 fdatasync``.
ru: Проверка записи изменений в открытом файле на диск. Ср. с ``fio.sync`` для всех файлов. Для получения подробной информации введите ``man 2 fsync`` or ``man 2 fdatasync``.

source: FIO constants
ru: Постоянные для файлового ввода-вывода

source: Table with constants which are the same as POSIX flag values on the target platform (see ``man 2 stat``).
ru: Таблица с постоянными, которые совпадают с флаговыми значениями в POSIX на целевой платформе (см. ``man 2 stat``).

source: Module `fun`
ru: Модуль `fun`

source: Luafun, also known as the Lua Functional Library, takes advantage of the features of LuaJIT to help users create complex functions. Inside the module are "sequence processors" such as ``map``, ``filter``, ``reduce``, ``zip`` -- they take a user-written function as an argument and run it against every element in a sequence, which can be faster or more convenient than a user-written loop. Inside the module are "generators" such as ``range``, ``tabulate``, and ``rands`` -- they return a bounded or boundless series of values. Within the module are "reducers", "filters", "composers" ... or, in short, all the important features found in languages like Standard ML, Haskell, or Erlang.
ru: Luafun, также известная как библиотека для функционального программирования в Lua, пользуется преимуществами LuaJIT, чтобы помочь пользователям создавать сложные функции. Модуль включает в себя "последовательные процессоры", такие как ``map``, ``filter``, ``reduce``, ``zip`` -- они берут написанную пользователем функцию в качестве аргумента и применяют ее к каждому элементу в последовательности, что может работать быстрее или более удобно, чем написанный пользователем цикл. Модуль включает в себя "генераторы", такие как ``range``, ``tabulate`` и ``rands`` -- они возвращают ограниченный или неограниченный ряд значений. Модуль включает в себя "преобразователи", "фильтры", "компоновщики" ... или, коротко говоря, все важные функции из таких языков, как Standard ML, Haskell или Erlang.

source: The full documentation is `On the luafun section of github`_. However, the first chapter can be skipped because installation is already done, it's inside Tarantool. All that is needed is the usual ``require`` request. After that, all the operations described in the Lua fun manual will work, provided they are preceded by the name returned by the ``require`` request. For example:
ru: Вся документация находится по ссылке `On the luafun section of github`_. Однако, первую главу можно пропустить, поскольку установка уже выполнена в пределах Tarantool'а. Единственное, что нужно сделать, -- выполнить обычный запрос ``require``. После этого сработают все операции, описанные в руководстве по работе с библиотекой для функционального программирования в Lua, при условии, что перед ними указывается имя, возвращенное запросом ``require``. Например:

source: Module `http`
ru: Модуль `http`

source: The ``http`` module, specifically the ``http.client`` submodule, provides the functionality of an HTTP client with support for HTTPS and keepalive. It uses routines in the `libcurl <https://curl.haxx.se/libcurl/>`_ library.
ru: Модуль ``http``, в частности вложенный модуль ``http.client`` , обеспечивать функциональные возможности HTTP-клиента с поддержкой HTTPS и механизма поддержания в активном состоянии keepalive. Модуль использует процедуры из библиотеки `libcurl <https://curl.haxx.se/libcurl/>`_.

source: Below is a list of all ``http`` functions.
ru: Ниже приведен перечень всех функций модуля ``http``.

source: Create an HTTP client instance
ru: Создание экземпляра HTTP-клиента

source: Perform an HTTP request
ru: Выполнение HTTP-запроса

source: Get a table with statistics
ru: Получение таблицы со статистикой

source: Construct a new HTTP client instance.
ru: Создание нового экземпляра HTTP-клиента.

source: the maximum number of entries in the connection cache.
ru: максимальное количество записей в кэше соединения.

source: a new HTTP client instance
ru: новый экземпляр HTTP-клиента

source: If ``http_client`` is an HTTP client instance, ``http_client:request()`` will perform an HTTP request and, if there is a successful connection, will return a table with connection information.
ru: Если ``http_client`` -- это экземпляр HTTP-клиента, ``http_client:request()`` выполнит HTTP-запрос, и в случае успешного подключения вернет таблицу с информацией о подключении.

source: HTTP method, for example 'GET' or 'POST' or 'PUT'
ru: HTTP-метод, например 'GET', 'POST' или 'PUT'

source: location, for example 'https://tarantool.org/doc'
ru: расположение, например 'https://tarantool.org/doc'

source: optional initial message, for example 'My text string!'
ru: необязательное начальное сообщение, например 'My text string!'
