Repository: tarantool/doc
Catalog: locale/*/LC_MESSAGES/doc.po
Languages: ru

source: Accept a new client connection and create a new connected socket. It is good practice to set the socket's blocking mode explicitly after accepting.
ru: Принятие нового клиентского соединения и создание нового подключенного сокета. Установка блокирующего режима на сокете явным образом после принятия соединения приведет к эффективной работе.

source: new socket if success.
ru: новый сокет, если выполнено.

source: Possible errors: nil.
ru: Возможные ошибки: nil.

source: Send a message on a UDP socket to a specified host.
ru: Отправка сообщения по UDP-сокету на указанный хост.

source: Possible errors: on error, returns nil and may return status, errno, errstr.
ru: Возможные ошибки: в случае ошибки возвращает nil, а также может вернуть статус, errno, errstr.

source: Receive a message on a UDP socket.
ru: Получение сообщения по UDP-сокету.

source: message, a table containing "host", "family" and "port" fields.
ru: сообщение, таблица с полями "host", "family" и "port".

source: string, table
ru: строка, таблица

source: Possible errors: on error, returns status, errno, errstr.
ru: Возможные ошибки: в случае ошибки возвращает nil, статус, errno, errstr.

source: After ``message_content, message_sender = recvfrom(1)`` the value of ``message_content`` might be a string containing 'X' and the value of ``message_sender`` might be a table containing
ru: После ``message_content, message_sender = recvfrom(1)`` значением ``message_content`` может быть строка, которая содержит 'X', а значением ``message_sender`` может быть таблица, которая содержит

source: Shutdown a reading end, a writing end, or both ends of a socket.
ru: Отключение передачи данных на чтение, на запись или в обоих направлениях.

source: true or false.
ru: true (правда) или false (ложь).

source: true on success, false on error. For example, if sock is already closed, sock:close() returns false.
ru: true (правда), если выполнено, false (ложь) в случае ошибки. Например, если сокет sock уже закрыт, sock:close() вернет false.

source: Retrieve information about the last error that occurred on a socket, if any. Errors do not cause throwing of exceptions so these functions are usually necessary.
ru: Получение информации о последней ошибке на сокете, если таковая была. Ошибки не выдают исключения, поэтому данные функции необходимы.

source: result for ``sock:errno()``, result for ``sock:error()``. If there is no error, then ``sock:errno()`` will return 0 and ``sock:error()``.
ru: результат ``sock:errno()``, результат ``sock:error()``. Если ошибки нет, то ``sock:errno()`` вернет 0 и ``sock:error()``.

source: number, string
ru: число, строка

source: Set socket flags. The argument values are the same as in the `Linux getsockopt(2) man page <http://man7.org/linux/man-pages/man2/setsockopt.2.html>`_. The ones that Tarantool accepts are:
ru: Определение флагов сокета. Значения аргумента будут такими же, что и на `странице getsockopt(2) руководства по Linux <http://man7.org/linux/man-pages/man2/setsockopt.2.html>`_. Tarantool принимает следующие:

source: Setting SO_LINGER is done with ``sock:linger(active)``.
ru: Установка флага SO_LINGER осуществляется с помощью ``sock:linger(active)``.

source: Get socket flags. For a list of possible flags see ``sock:setsockopt()``.
ru: Получение флагов сокета. Список возможных флагов см. с помощью ``sock:setsockopt()``.

source: Set or clear the SO_LINGER flag. For a description of the flag, see the `Linux man page <http://man7.org/linux/man-pages/man1/loginctl.1.html>`_.
ru: Установить или убрать флаг SO_LINGER. Описание флага см. в `руководстве по Linux <http://man7.org/linux/man-pages/man1/loginctl.1.html>`_.

source: new active and timeout values.
ru: новые значения active и timeout.

source: ``sock:nonblock()`` returns the current flag value.
ru: ``sock:nonblock()`` возвращает текущее значение флага.

source: ``sock:nonblock(false)`` sets the flag to false and returns false.
ru: ``sock:nonblock(false)`` устанавливает флаг на false и возвращает false.

source: ``sock:nonblock(true)`` sets the flag to true and returns true.
ru: ``sock:nonblock(true)`` устанавливает флаг на true и возвращает true.

source: This function may be useful before invoking a function which might otherwise block indefinitely.
ru: Эту функцию можно использовать до вызова функции, которая в противном случае будет блокировать бесконечно.

source: Wait until something is readable, or until a timeout value expires.
ru: Ожидание доступности чего-либо для чтения или до истечения времени ожидания.

source: true if the socket is now readable, false if timeout expired;
ru: true, если сокет доступен для чтения, false, если истекло время ожидания;

source: Wait until something is writable, or until a timeout value expires.
ru: Ожидание доступности чего-либо для записи или до истечения времени ожидания.

source: true if the socket is now writable, false if timeout expired;
ru: true, если сокет доступен для записи, false, если истекло время ожидания;

source: Wait until something is either readable or writable, or until a timeout value expires.
ru: Ожидание доступности чего-либо для чтения или записи, или до истечения времени ожидания.

source: 'R' if the socket is now readable, 'W' if the socket is now writable, 'RW' if the socket is now both readable and writable, '' (empty string) if timeout expired;
ru: 'R', если сокет доступен для чтения, 'W', если сокет доступен для записи, 'RW', если сокет доступен и для чтения, и для записи, '' (пустая строка), если истекло время ожидания;

source: The ``sock:name()`` function is used to get information about the near side of the connection. If a socket was bound to ``xyz.com:45``, then ``sock:name`` will return information about ``[host:xyz.com, port:45]``. The equivalent POSIX function is ``getsockname()``.
ru: Функция ``sock:name()`` используется для получения информации о ближней стороне соединения. Если сокет привязан к ``xyz.com:45``, то ``sock:name`` вернет информацию о ``[host:xyz.com, port:45]``. Аналогичная функция в POSIX -- ``getsockname()``.

source: The ``sock:peer()`` function is used to get information about the far side of a connection. If a TCP connection has been made to a distant host ``tarantool.org:80``, ``sock:peer()`` will return information about ``[host:tarantool.org, port:80]``. The equivalent POSIX function is ``getpeername()``.
ru: Функция ``sock:peer()`` используется для получения информации о дальней стороне соединения. Если TCP-соединение установлено с удаленным хостом ``tarantool.org:80``, то ``sock:peer()`` вернет информацию о ``[host:tarantool.org, port:80]``. Аналогичная функция в POSIX -- ``getpeername()``.

source: The ``socket.iowait()`` function is used to wait until read-or-write activity occurs for a file descriptor.
ru: Функция ``socket.iowait()`` используется для ожидания, пока дескриптор файла не будет активен для чтения или записи.

source: file descriptor
ru: дескриптор файла

source: 'R' or 1 = read, 'W' or 2 = write, 'RW' or 3 = read|write.
ru: 'R' или 1 = чтение, 'W' или 2 = запись, 'RW' или 3 = чтение|запись.

source: number of seconds to wait
ru: количество секунд ожидания

source: If the fd parameter is nil, then there will be a sleep until the timeout. If the timeout parameter is nil or unspecified, then timeout is infinite.
ru: Если значение параметра fd -- nil, то будет режим ожидания до истечения времени, указанного в параметре timeout. Если timeout -- nil или не указан, время ожидания считается бесконечным.

source: Ordinarily the return value is the activity that occurred ('R' or 'W' or 'RW' or 1 or 2 or 3). If the timeout period goes by without any reading or writing, the return is an error = ETIMEDOUT.
ru: Как правило, возвращается значение совершенного действия ('R' или 'W', или 'RW', или 1, или 2, или 3). Если время ожидания в timeout проходит без действий чтения или записи, возвращается ошибка = ETIMEDOUT.

source: Example: ``socket.iowait(sock:fd(), 'r', 1.11)``
ru: Пример: ``socket.iowait(sock:fd(), 'r', 1.11)``

source: Use of a TCP socket over the Internet
ru: Использование TCP-сокета в интернете

source: In this example a connection is made over the internet between a Tarantool instance and tarantool.org, then an HTTP "head" message is sent, and a response is received: "``HTTP/1.1 200 OK``" or something else if the site has moved. This is not a useful way to communicate with this particular site, but shows that the system works.
ru: В данном примере устанавливается соединение по интернету между экземпляром Tarantool'а и tarantool.org, затем отправляется HTTP-сообщение заголовка "head" и возвращается ответ: "``HTTP/1.1 200 OK``" или что-то другое, если сайт перемещен. Так не слишком удобно взаимодействовать с определенным сайтом, но пример показывает работу системы.

source: Use of a UDP socket on localhost
ru: Использование UDP-сокета на localhost

source: Here is an example with datagrams. Set up two connections on 127.0.0.1 (localhost): ``sock_1`` and ``sock_2``. Using ``sock_2``, send a message to ``sock_1``. Using ``sock_1``, receive a message. Display the received message. Close both connections. |br| This is not a useful way for a computer to communicate with itself, but shows that the system works.
ru: Ниже приведен пример с датаграммами. Устанавливается два соединения с 127.0.0.1 (localhost): ``sock_1`` и ``sock_2``. С помощью ``sock_2`` отправляется сообщение на ``sock_1``. С помощью ``sock_1`` получается сообщение. Отображается полученное сообщение. Оба соединения закрываются. |br| Компьютеру так не слишком удобно взаимодействовать с самим собой, но пример показывает работу системы.

source: Use tcp_server to accept file contents sent with socat
ru: Использование tcp_server для получения содержимого файла, отправленного по socat

source: Here is an example of the tcp_server function, reading strings from the client and printing them. On the client side, the Linux socat utility will be used to ship a whole file for the tcp_server function to read.
ru: Ниже приведен пример функции ``tcp_server``, которая читает строки с клиента и выводит результат. На клиентской стороне утилита ``socat`` в Linux будет использоваться для отправки целого файла на чтение функции ``tcp_server``.

source: Start two shells. The first shell will be a server instance. The second shell will be the client.
ru: Запустите две оболочки. Первая оболочка будет экземпляром сервера. Вторая оболочка будет клиентом.

source: On the first shell, start Tarantool and say:
ru: В первой оболочке запустите Tarantool и выполните:

source: The above code means: use `tcp_server()` to wait for a connection from any host on port 3302. When it happens, enter a loop that reads on the socket and prints what it reads. The "delimiter" for the read function is "\\n" so each `read()` will read a string as far as the next line feed, including the line feed.
ru: Вышеуказанный код означает: использовать `tcp_server()` для ожидания подключения с любого хоста по порту 3302. Когда это произойдет, ввести цикл, который читает по сокету и выводит результат чтения. Разделителем для функции чтения будет "\\n", поэтому каждое выполнение `read()` выполнит чтение строки до перевода строки, включая перевод строки.

source: On the second shell, create a file that contains a few lines. The contents don't matter. Suppose the first line contains A, the second line contains B, the third line contains C. Call this file "tmp.txt".
ru: Во второй оболочке создайте файл, который содержит несколько строк. Содержимое не имеет значения. Предположим, что первая строка содержит A, вторая строка содержит B, третья строка содержит C. Вызвать этот файл "tmp.txt".

source: On the second shell, use the socat utility to ship the tmp.txt file to the server instance's host and port:
ru: Во второй оболочке используйте утилиту socat для отправки файла tmp.txt на экземпляр сервера по хосту и порту:

source: Now watch what happens on the first shell. The strings "A", "B", "C" are printed.
ru: Теперь смотрите, что происходит в первой оболочке. Выводятся строки "A", "B", "C".

source: Module `strict`
ru: Модуль `strict`

source: The :code:`strict` module has functions for turning "strict mode" on or off. When strict mode is on, an attempt to use an undeclared global variable will cause an error. A global variable is considered "undeclared" if it has never had a value assigned to it. Often this is an indication of a programming error.
ru: Модуль :code:`strict` включает в себя функции для включения или отключения строгого режима "strict mode". Когда включен строгий режим, попытка использовать необъявленную глобальную переменную приведет к ошибке. Глобальная переменная считается необъявленной, если ей никогда не было присвоено значение. Часто это указывает на ошибку программирования.

source: By default strict mode is off, unless tarantool was built with the ``-DCMAKE_BUILD_TYPE=Debug`` option -- see the description of build options in section :ref:`building-from-source <building_from_source>`.
ru: По умолчанию, строгий режим отключен, не считая случаев, когда сборка Tarantool'а производилась с помощью ``-DCMAKE_BUILD_TYPE=Debug`` -- см. варианты сборки в разделе :ref:`сборка из исходников <building_from_source>`.

source: tarantool> strict = require('strict') --- ... tarantool> strict.on() --- ... tarantool> a = b -- strict mode is on so this will cause an error --- - error: ... variable ''b'' is not declared' ... tarantool> strict.off() --- ... tarantool> a = b -- strict mode is off so this will not cause an error --- ...
ru: tarantool> strict = require('strict') --- ... tarantool> strict.on() --- ... tarantool> a = b -- строгий режим включен, поэтому появляется ошибка --- - error: ... variable ''b'' is not declared' ... tarantool> strict.off() --- ... tarantool> a = b -- строгий режим отключен, поэтому ошибки нет --- ...

source: Module `string`
ru: Модуль `string`

source: The :code:`string` module has everything in the `standard Lua string library <https://www.lua.org/pil/20.html>`_, and some Tarantool extensions.
ru: Модуль :code:`string` включает в себя всё из `стандартной библиотеки для работы со строками в Lua <https://www.lua.org/pil/20.html>`_, а также некоторые расширения специально для Tarantool'а.

source: In this section we only discuss the additional functions that the Tarantool developers have added.
ru: В данном разделе мы рассматриваем только дополнительные функции, добавленные разработчиками Tarantool'а.

source: Below is a list of all additional ``string`` functions.
ru: Ниже приведен перечень всех функций библиотеки ``string``.

source: Left-justify a string
ru: Выравнивание строки по левому полю

source: Right-justify a string
ru: Выравнивание строки по правому полю

source: Get the hexadecimal value of a string
ru: Получение шестнадцатеричного значения строки

source: Check if a string starts with a given substring
ru: Проверка, начинается ли строка с заданной подстроки

source: Check if a string ends with a given substring
ru: Проверка, заканчивается ли строка на заданную подстроку

source: Remove spaces on the left of a string
ru: Удаление пробелов слева от строки

source: Remove spaces on the right of a string
ru: Удаление пробелов справа от строки

source: Remove spaces on the left and right of a string
ru: Удаление пробелов слева и справа от строки

source: Return the string left-justified in a string of length ``width``.
ru: Возврат строки, выровненной по левому краю, шириной, указанной в ``width``.

source: (string) the string to left-justify
ru: (строка) строка для выравнивания по левому краю

source: (integer) the width of the string after left-justifying
ru: (целое число) ширина строки после выравнивания по левому краю

source: (string) a single character, default = 1 space
ru: (строка) отдельный символ, по умолчанию = 1 пробел

source: left-justified string (unchanged if width <= string length)
ru: выровненная по левому краю строка (не изменяется, если ширина <= длине строки)

source: Return the string right-justified in a string of length ``width``.
ru: Возврат строки, выровненной по правому краю, шириной, указанной в ``width``.

source: (string) the string to right-justify
ru: (строка) строка для выравнивания по правому краю

source: (integer) the width of the string after right-justifying
ru: (целое число) ширина строки после выравнивания по правому краю

source: right-justified string (unchanged if width <= string length)
ru: выровненная по правому краю строка (не изменяется, если ширина <= длине строки)

source: Return the hexadecimal value of the input string.
ru: Возврат шестнадцатеричного значения введенной строки.

source: (string) the string to process
ru: (строка) обрабатываемая строка

source: hexadecimal, 2 hex-digit characters for each input character
ru: шестнадцатеричное число, два символа шестнадцатеричных цифр для каждого введенного символа

source: Return True if ``input-string`` starts with ``start-string``, otherwise return False.
ru: Возврат true (правда), если ``input-string`` начинается со ``start-string``, в противном случае, возврат false (ложь).

source: (string) the string where ``start-string`` should be looked for
ru: (строка) строка, где производится поиск данных из ``start-string``

source: (string) the string to look for
ru: (строка) искомая строка

source: (integer) position: where to start looking within ``input-string``
ru: (целое число) положение: где начинать искать в пределах ``input-string``

source: (integer) position: where to end looking within ``input-string``
ru: (целое число) положение: где заканчивать искать в пределах ``input-string``

source: ``start-pos`` and ``end-pos`` may be negative, meaning the position should be calculated from the end of the string.
ru: Значения ``start-pos`` и ``end-pos`` могут быть отрицательными, что означает, что положение вычисляется с конца строки.

source: Return True if ``input-string`` ends with ``end-string``, otherwise return False.
ru: Возврат true (правда), если ``input-string`` заканчивается на ``end-string``, в противном случае, возврат false (ложь).

source: (string) the string where ``end-string`` should be looked for
ru: (строка) строка, где производится поиск данных из ``end-string``

source: Split ``input-string`` into one or more output strings in a table. The places to split are the places where ``split-string`` occurs.
ru: Разделение ``input-string`` на одну или более выводимых строк в таблице. Места разделения указаны в ``split-string``.

source: (string) the string to split
ru: (строка) строка для разделения

source: (string) the string to find within ``input-string``. Default = space.
ru: (строка) искомая строка в пределах ``input-string``. По умолчанию = пробел.

source: table of strings that were split from ``input-string``
ru: таблица строк, которые были разделены из ``input-string``

source: Return the value of the input string, but without spaces on the left.
ru: Возврат значения введенной строки без пробелов слева.

source: result after stripping spaces from input string
ru: результат после удаления пробелов из введенной строки

source: Return the value of the input string, but without spaces on the right.
ru: Возврат значения введенной строки без пробелов справа.

source: Return the value of the input string, but without spaces on the left or the right.
ru: Возврат значения введенной строки без пробелов слева или справа.

source: Module `table`
ru: Модуль `table`

source: The :code:`table` module has everything in the `standard Lua table library <https://www.lua.org/pil/19.html>`_, and some Tarantool extensions.
ru: Модуль :code:`table` включает в себя всё из `стандартной библиотеки для работы с таблицами в Lua <https://www.lua.org/pil/19.html>`_, а также некоторые расширения специально для Tarantool'а.

source: You can see this by saying "table":
ru: Выполнив команду "table", можно увидеть доступные функции:

source: In this section we only discuss the additional function that the Tarantool developers have added: ``deepcopy``.
ru: В данном разделе мы рассматриваем только дополнительную функцию, добавленную разработчиками Tarantool'а: ``deepcopy``.

source: Return a "deep" copy of the table -- a copy which follows nested structures to any depth and does not depend on pointers, it copies the contents.
ru: Возврат детальной копии таблицы -- копии, которая включает в себя вложенные структуры любой глубины и не зависит от указателей, копируется содержимое.

source: (table) the table to copy
ru: (таблица) таблица для копирования

source: the copy of the table
ru: копия таблицы

source: Module `tap`
ru: Модуль `tap`

source: The ``tap`` module streamlines the testing of other modules. It allows writing of tests in the `TAP protocol`_. The results from the tests can be parsed by standard TAP-analyzers so they can be passed to utilities such as `prove`_. Thus one can run tests and then use the results for statistics, decision-making, and so on.
ru: Модуль ``tap`` оптимизирует тестирование других модулей. Он позволяет записывать тесты в TAP-протокол (`TAP protocol`_). Результаты тестов могут подвергаться анализу стандартными TAP-анализаторами, поэтому их можно передавать утилитам, например `prove`_. Таким образом, можно выполнять тестирование, а затем использовать результаты для выведения статистики, принятия решений и т.д.

source: Below is a list of all ``tap`` functions.
ru: Ниже приведен перечень всех функций модуля ``tap``.

source: Initialize
ru: Инициализация

source: Create a subtest and print the results
ru: Создание подтеста и вывод результатов

source: Indicate how many tests to perform
ru: Указание количества проводимых тестов

source: Check the number of tests performed
ru: Проверка количества выполненных тестов

source: Display a diagnostic message
ru: Отображение сообщения диагностики

source: Evaluate the condition and display the message
ru: Оценка состояния и отображение сообщения

source: Check if the two arguments are equal
ru: Проверка равенства двух аргументов

source: Check if the two arguments are different
ru: Проверка отличий двух аргументов

source: Recursively check if the two arguments are equal
ru: Рекурсивная проверка равенства двух аргументов

source: Check if the argument matches a pattern
ru: Проверка соответствия аргумента шаблону

source: Check if the argument does not match a pattern
ru: Проверка отличия аргумента от шаблона

source: Check if a value has a particular type
ru: Проверка соответствия значения определенному типу

source: Initialize.
ru: Инициализация.

source: The result of ``tap.test`` is an object, which will be called taptest in the rest of this discussion, which is necessary for ``taptest:plan()`` and all the other methods.
ru: Результатом ``tap.test`` является объект, который будет называться taptest в ходе данного разбора, что необходимо для ``taptest:plan()`` и всех остальных методов.

source: an arbitrary name to give for the test outputs.
ru: произвольное имя для результата теста.

source: Create a subtest (if no ``func`` argument specified), or (if all arguments are specified) create a subtest, run the test function and print the result.
ru: Создание подтеста (если не указан аргумент ``func``) или (если указаны все аргументы) создание подтеста, выполнение тестовой функции и вывод результата.

source: See the :ref:`example <tap-example>`.
ru: См. :ref:`пример <tap-example>`.

source: the test logic to run.
ru: выполняемая тестовая логика.

source: userdata or string
ru: userdata или строка

source: Indicate how many tests will be performed.
ru: Указание количества проводимых тестов.

source: Display a diagnostic message.
ru: Отображение сообщения диагностики.

source: the message to be displayed.
ru: отображаемое сообщение.
