Repository: tarantool/doc
Catalog: locale/*/LC_MESSAGES/doc.po
Languages: ru

source: ``box.space.pokemons:create_index('status', {type = 'tree', parts = {2, 'str'}})`` to create a secondary TREE index by pokémon status.
ru: ``box.space.pokemons:create_index('status', {type = 'tree', parts = {2, 'str'}})`` для создания вторичного TREE-индекса по статусу покемона.

source: Notice the ``parts =`` argument in the index specification. The pokémon ID is the first field in a Tarantool tuple since it’s the first member of the respective Avro type. So does the pokémon status. The actual JSON document may have ID or status fields at any position of the JSON map.
ru: Обратите внимание на аргумент ``parts =`` в спецификации индекса. ID покемона -- это первое поле в кортеже Tarantool'а, потому что это первый элемент соответствующего типа Avro. То же относится к статусу покемона. В самом JSON-файле поля ID или статуса могут быть в любом положении на JSON-карте.

source: The implementation of ``start()`` method looks like this:
ru: Реализация метода ``start()`` выглядит следующим образом:

source: -- create game object start = function(self) -- create spaces and indexes box.once('init', function() box.schema.create_space('pokemons') box.space.pokemons:create_index( "primary", {type = 'hash', parts = {1, 'unsigned'}} ) box.space.pokemons:create_index( "status", {type = "tree", parts = {2, 'str'}} ) end) -- create models local ok_m, pokemon = avro.create(schema.pokemon) local ok_p, player = avro.create(schema.player) if ok_m and ok_p then -- compile models local ok_cm, compiled_pokemon = avro.compile(pokemon) local ok_cp, compiled_player = avro.compile(player) if ok_cm and ok_cp then -- start the game <...> else log.error('Schema compilation failed') end else log.info('Schema creation failed') end return false end
ru: -- создать игровой объект start = function(self) -- создать спейсы и индексы box.once('init', function() box.schema.create_space('pokemons') box.space.pokemons:create_index( "primary", {type = 'hash', parts = {1, 'unsigned'}} ) box.space.pokemons:create_index( "status", {type = "tree", parts = {2, 'str'}} ) end) -- создать модели local ok_m, pokemon = avro.create(schema.pokemon) local ok_p, player = avro.create(schema.player) if ok_m and ok_p then -- скомпилировать модели local ok_cm, compiled_pokemon = avro.compile(pokemon) local ok_cp, compiled_player = avro.compile(player) if ok_cm and ok_cp then -- начать игру <...> else log.error('Schema compilation failed') end else log.info('Schema creation failed') end return false end

source: GIS
ru: ГИС

source: Now let's discuss ``catch()``, which is the main method in our gaming logic.
ru: Теперь обсудим метод ``catch()``, который является основным в логике нашей игры.

source: Here we receive the player's coordinates and the target pokémon's ID number, and we need to answer whether the player has actually caught the pokémon or not (remember that each pokémon has a chance to escape).
ru: Здесь мы получаем координаты игрока и номер ID искомого покемона, а нужен нам ответ на вопрос, поймали ли игрок покемона (помните, что у каждого покемона есть шанс убежать).

source: First thing, we validate the received player data against its :ref:`Avro schema <app_server-avro_schemas>`. And we check whether such a pokémon exists in our database and is displayed on the map (the pokémon must have the active status):
ru: Для начала проверим полученные данные об игроке по :ref:`Avro-схеме <app_server-avro_schemas>`. Также проверим, есть ли такой покемон в базе данных, и отображается ли он на карте (у покемона должен быть активный статус):

source: catch = function(self, pokemon_id, player) -- check player data local ok, tuple = self.player_model.flatten(player) if not ok then return false end -- get pokemon data local p_tuple = box.space.pokemons:get(pokemon_id) if p_tuple == nil then return false end local ok, pokemon = self.pokemon_model.unflatten(p_tuple) if not ok then return false end if pokemon.status ~= self.state.ACTIVE then return false end -- more catch logic to follow <...> end
ru: catch = function(self, pokemon_id, player) -- проверить данные игрока local ok, tuple = self.player_model.flatten(player) if not ok then return false end -- получить данные покемона local p_tuple = box.space.pokemons:get(pokemon_id) if p_tuple == nil then return false end local ok, pokemon = self.pokemon_model.unflatten(p_tuple) if not ok then return false end if pokemon.status ~= self.state.ACTIVE then return false end -- логика поимки будет дополняться <...> end

source: Next, we calculate the answer: caught or not.
ru: Далее вычисляем ответ: пойман или нет.

source: To work with geographical coordinates, we use Tarantool `gis <https://github.com/tarantool/gis>`_ module.
ru: Чтобы работать с географическими координатами, используем модуль Tarantool'а `gis <https://github.com/tarantool/gis>`_.

source: To keep things simple, we don't load any specific map, assuming that we deal with a world map. And we do not validate incoming coordinates, assuming again that all received locations are within the planet Earth.
ru: Чтобы не усложнять, не будем загружать какую-то особую карту, допуская, что рассматриваем карту мира. Также не будет проверять поступающие координаты, снова допуская, что все места находятся на планете Земля.

source: We use two geo-specific variables:
ru: Используем две географические переменные:

source: ``wgs84``, which stands for the latest revision of the World Geodetic System standard, `WGS84 <https://en.wikipedia.org/wiki/World_Geodetic_System#WGS84>`_. Basically, it comprises a standard coordinate system for the Earth and represents the Earth as an ellipsoid.
ru: ``wgs84``, что означает последнюю редакцию стандарта Мировой геодезической системы координат, `WGS84 <https://en.wikipedia.org/wiki/World_Geodetic_System#WGS84>`_. В целом, она представляет собой стандартную систему координат Земли и изображает Землю как эллипсоид.

source: ``nationalmap``, which stands for the `US National Atlas Equal Area <https://epsg.io/2163>`_. This is a projected coordinates system based on WGS84. It gives us a zero base for location projection and allows positioning our players and pokémons in meters.
ru: ``nationalmap``, что означает `Государственный атлас США в равновеликой проекции (US National Atlas Equal Area) <https://epsg.io/2163>`_. Это система спроецированных координат на основании WGS84. Она дает основу для проецирования мест и позволяет определить местоположение наших игроков и покемонов в метрах.

source: Both these systems are listed in the EPSG Geodetic Parameter Registry, where each system has a unique number. In our code, we assign these listing numbers to respective variables:
ru: Обе системы указаны в Реестре геодезических параметров EPSG, где каждой системе присвоен уникальный номер. Мы назначим эти числа соответствующим переменным в нашем коде:

source: For our game logic, we need one more variable, ``catch_distance``, which defines how close a player must get to a pokémon before trying to catch it. Let's set the distance to 100 meters.
ru: Для игровой логики необходима еще одна переменная ``catch_distance``, которая определяет, насколько близко игрок должен подойти к покемону, чтобы попытаться поймать его. Определим это расстояние в 100 метров.

source: Now we're ready to calculate the answer. We need to project the current location of both player (``p_pos``) and pokémon (``m_pos``) on the map, check whether the player is close enough to the pokémon (using ``catch_distance``), and calculate whether the player has caught the pokémon (here we generate some random value and let the pokémon escape if the random value happens to be less than 100 minus pokémon's chance value):
ru: Теперь можно рассчитать ответ. Необходимо спроецировать текущее местоположение как игрока (``p_pos``), так и покемона (``m_pos``) на карте, проверить, достаточно ли близко к покемону находится игрок (с помощью ``catch_distance``), и рассчитать, поймал ли игрок покемона (здесь мы генерируем случайное значение, и покемон убегает, если случайное значение оказывается меньше, чем 100 минус случайная величина покемона):

source: -- project locations local m_pos = gis.Point( {pokemon.location.x, pokemon.location.y}, self.wgs84 ):transform(self.nationalmap) local p_pos = gis.Point( {player.location.x, player.location.y}, self.wgs84 ):transform(self.nationalmap) -- check catch distance condition if p_pos:distance(m_pos) > self.catch_distance then return false end -- try to catch pokemon local caught = math.random(100) >= 100 - pokemon.chance if caught then -- update and notify on success box.space.pokemons:update( pokemon_id, {{'=', self.STATUS, self.state.CAUGHT}} ) self:notify(player, pokemon) end return caught
ru: -- спроецировать местоположение local m_pos = gis.Point( {pokemon.location.x, pokemon.location.y}, self.wgs84 ):transform(self.nationalmap) local p_pos = gis.Point( {player.location.x, player.location.y}, self.wgs84 ):transform(self.nationalmap) -- проверить условие близости игрока if p_pos:distance(m_pos) > self.catch_distance then return false end -- попытаться поймать покемона local caught = math.random(100) >= 100 - pokemon.chance if caught then -- обновить и сообщить об успехе box.space.pokemons:update( pokemon_id, {{'=', self.STATUS, self.state.CAUGHT}} ) self:notify(player, pokemon) end return caught

source: Index iterators
ru: Итератор с индексом

source: By our gameplay, all caught pokémons are returned back to the map. We do this for all pokémons on the map every 60 seconds using ``respawn()`` method. We iterate through pokémons by status using Tarantool index iterator function :ref:`index:pairs <box_index-index_pairs>` and reset the statuses of all "caught" pokémons back to "active" using ``box.space.pokemons:update()``.
ru: По сюжету игры все пойманные покемоны возвращаются на карту. Метод ``respawn()`` обеспечивает это для всех покемонов на карте каждые 60 секунд. Мы выполняем перебор покемонов по статусу с помощью функции Tarantool'а итератора с индексом :ref:`index:pairs <box_index-index_pairs>` и сбрасываем статусы всех "пойманных" покемонов обратно на "активный" с помощью ``box.space.pokemons:update()``.

source: For readability, we introduce named fields:
ru: Для удобства введем именованные поля:

source: The complete implementation of ``start()`` now looks like this:
ru: Реализация метода ``start()`` полностью теперь выглядит так:

source: -- create game object start = function(self) -- create spaces and indexes box.once('init', function() box.schema.create_space('pokemons') box.space.pokemons:create_index( "primary", {type = 'hash', parts = {1, 'unsigned'}} ) box.space.pokemons:create_index( "status", {type = "tree", parts = {2, 'str'}} ) end) -- create models local ok_m, pokemon = avro.create(schema.pokemon) local ok_p, player = avro.create(schema.player) if ok_m and ok_p then -- compile models local ok_cm, compiled_pokemon = avro.compile(pokemon) local ok_cp, compiled_player = avro.compile(player) if ok_cm and ok_cp then -- start the game self.pokemon_model = compiled_pokemon self.player_model = compiled_player self.respawn() log.info('Started') return true else log.error('Schema compilation failed') end else log.info('Schema creation failed') end return false end
ru: -- создать игровой объект start = function(self) -- создать спейсы и индексы box.once('init', function() box.schema.create_space('pokemons') box.space.pokemons:create_index( "primary", {type = 'hash', parts = {1, 'unsigned'}} ) box.space.pokemons:create_index( "status", {type = "tree", parts = {2, 'str'}} ) end) -- создать модели local ok_m, pokemon = avro.create(schema.pokemon) local ok_p, player = avro.create(schema.player) if ok_m and ok_p then -- скомпилировать модели local ok_cm, compiled_pokemon = avro.compile(pokemon) local ok_cp, compiled_player = avro.compile(player) if ok_cm and ok_cp then -- начать игру self.pokemon_model = compiled_pokemon self.player_model = compiled_player self.respawn() log.info('Started') return true else log.error('Schema compilation failed') end else log.info('Schema creation failed') end return false end

source: Fibers
ru: Файберы

source: But wait! If we launch it as shown above -- ``self.respawn()`` -- the function will be executed only once, just like all the other methods. But we need to execute ``respawn()`` every 60 seconds. Creating a :ref:`fiber <fiber-module>` is the Tarantool way of making application logic work in the background at all times.
ru: Но подождите! Если мы запустим функцию ``self.respawn()``, как показано выше, то она запустится только один раз, как и остальные методы. А нам необходимо запускать ``respawn()`` каждые 60 секунд. Tarantool заставляет логику приложения непрерывно работать в фоновом режиме с помощью :ref:`файбера <fiber-module>`.

source: A **fiber** exists for executing instruction sequences but it is not a thread. The key difference is that threads use preemptive multitasking, while fibers use cooperative multitasking. This gives fibers the following two advantages over threads:
ru: **Файбер** предназначен для выполнения последовательностей команд, но это не поток. Ключевое отличие в том, что потоки используют многозадачность с реализацией приоритетов, тогда как файберы используют кооперативную многозадачность. Это дает файберам два преимущества над потоками:

source: Better controllability. Threads often depend on the kernel's thread scheduler to preempt a busy thread and resume another thread, so preemption may occur unpredictably. Fibers yield themselves to run another fiber while executing, so yields are controlled by application logic.
ru: Улучшенная управляемость. Потоки часто зависят от планировщика потока ядра в вопросе вытеснения занятого потока и возобновления другого потока, поэтому вытеснение может быть непредвиденным. Файберы передают управление самостоятельно другому файберу во время работы, поэтому управление файберами осуществляется логикой приложения.

source: Higher performance. Threads require more resources to preempt as they need to address the system kernel. Fibers are lighter and faster as they don't need to address the kernel to yield.
ru: Повышенная производительность. Потокам необходимо больше ресурсов для вытеснения, поскольку они обращаются к ядру системы. Файберы легче и быстрее, поскольку для передачи управления им не нужно обращаться к ядру.

source: Yet fibers have some limitations as compared with threads, the main limitation being no multi-core mode. All fibers in an application belong to a single thread, so they all use the same CPU core as the parent thread. Meanwhile, this limitation is not really serious for Tarantool applications, because a typical bottleneck for Tarantool is the HDD, not the CPU.
ru: Однако у файберов есть определенные ограничения, по сравнению с потоками, основное из которых -- отсутствие режима работы с многоядерной системой. Все файберы в приложении относятся к одному потоку, поэтому они используют то же ядро процессора, что и родительский поток. В то же время, это ограничение незначительно для приложений Tarantool'а, поскольку узкое место Tarantool'а -- жесткий диск, а не ЦП.

source: A fiber has all the features of a Lua `coroutine <http://www.lua.org/pil/contents.html#9>`_ and all programming concepts that apply for Lua coroutines will apply for fibers as well. However, Tarantool has made some enhancements for fibers and has used fibers internally. So, although use of coroutines is possible and supported, use of fibers is recommended.
ru: У файбера есть все возможности `сопрограммы <http://www.lua.org/pil/contents.html#9>`_ на языке Lua, и все принципы программирования, которые применяются к сопрограммам на Lua, применимы и к файберам. Однако Tarantool расширил возможности файберов для внутреннего использования. Поэтому, несмотря на возможность и поддержку использования сопрограмм, рекомендуется использовать файберы.

source: Well, performance or controllability are of little importance in our case. We'll launch ``respawn()`` in a fiber to make it work in the background all the time. To do so, we'll need to amend ``respawn()``:
ru: Производительность или управляемость не слишком важны в нашем случае. Запустим ``respawn()`` в файбере для непрерывной работы в фоновом режиме. Для этого необходимо изменить ``respawn()``:

source: respawn = function(self) -- let's give our fiber a name; -- this will produce neat output in fiber.info() fiber.name('Respawn fiber') while true do for _, tuple in box.space.pokemons.index.status:pairs( self.state.CAUGHT) do box.space.pokemons:update( tuple[self.ID], {{'=', self.STATUS, self.state.ACTIVE}} ) end fiber.sleep(self.respawn_time) end end
ru: respawn = function(self) -- назовем наш файбер; -- это выполнит чистый вывод в fiber.info() fiber.name('Respawn fiber') while true do for _, tuple in box.space.pokemons.index.status:pairs( self.state.CAUGHT) do box.space.pokemons:update( tuple[self.ID], {{'=', self.STATUS, self.state.ACTIVE}} ) end fiber.sleep(self.respawn_time) end end

source: and call it as a fiber in ``start()``:
ru: и назвать его файбером в ``start()``:

source: start = function(self) -- create spaces and indexes <...> -- create models <...> -- compile models <...> -- start the game self.pokemon_model = compiled_pokemon self.player_model = compiled_player fiber.create(self.respawn, self) log.info('Started') -- errors if schema creation or compilation fails <...> end
ru: start = function(self) -- создать спейсы и индексы <...> -- создать модели <...> -- скомпилировать модели <...> -- начать игру self.pokemon_model = compiled_pokemon self.player_model = compiled_player fiber.create(self.respawn, self) log.info('Started') -- ошибки, если создание схемы или компиляция не работает <...> end

source: Logging
ru: Запись в журнал

source: One more helpful function that we used in ``start()`` was ``log.infо()`` from Tarantool :ref:`log <log-module>` module. We also need this function in ``notify()`` to add a record to the log file on every successful catch:
ru: В ``start()`` мы использовали еще одну полезную функцию -- ``log.infо()`` из :ref:`модуля log <log-module>` Tarantool'а . Эта функция также понадобится в ``notify()`` для добавления записи в файл журнала при каждой успешной поимке:

source: -- event notification notify = function(self, player, pokemon) log.info("Player '%s' caught '%s'", player.name, pokemon.name) end
ru: -- уведомление о событии notify = function(self, player, pokemon) log.info("Player '%s' caught '%s'", player.name, pokemon.name) end

source: We use default Tarantool :ref:`log settings <cfg_logging>`, so we'll see the log output in console when we launch our application in script mode.
ru: Мы используем стандартные :ref:`настройки журнала <cfg_logging>` Tarantool'а, поэтому увидим вывод записей журнала в консоли, когда запустим приложение в режиме скрипта.

source: To launch our microservice, we put both ``pokemon.lua`` module and ``game.lua`` application in the current directory, install all external modules, and launch the Tarantool instance running our ``game.lua`` application (this example is for Ubuntu):
ru: Чтобы запустить микросервис, поместим модуль ``pokemon.lua`` и приложение ``game.lua`` в текущую директорию, установим все внешние модули и запустим экземпляр Tarantool'а с работают приложением ``game.lua`` (это пример для Ubuntu):

source: Tarantool starts and initializes the database. Then Tarantool executes the demo logic from ``game.lua``: adds a pokémon named Pikachu (its chance to be caught is very high, 99.1), displays the current map (it contains one active pokémon, Pikachu) and processes catch requests from two players. Player1 is located just near the lonely Pikachu pokémon and Player2 is located far away from it. As expected, the catch results in this output are "true" for Player1 and "false" for Player2. Finally, Tarantool displays the current map which is empty, because Pikachu is caught and temporarily inactive:
ru: Tarantool запускает и инициализирует базу данных. Затем Tarantool выполняет демо-логику из ``game.lua``: добавляет покемона под названием Пикачу (Pikachu) (шанс его поимки очень высок -- 99,1), отображает текущую карту (на ней расположен один активный покемон, Пикачу) и обрабатывает запросы поимки от двух игроков. Player1 (Игрок 1) находится очень близко к одинокому покемону Пикачу, а Player2 (Игрок 2) находится очень далеко от него. Как предполагается, результаты поимки в таком выводе будут "true" для Player1 и "false" для Player2. Наконец, Tarantool отображает текущую карту, которая пуста, потому что Пикачу пойман и временно неактивен:

source: local game = require('pokemon') box.cfg{listen=3301} game:start() -- add, map and catch functions exposed to REST API function add(request, pokemon) return { result=game:add_pokemon(pokemon) } end function map(request) return { map=game:map() } end function catch(request, pid, player) local id = tonumber(pid) if id == nil then return {result=false} end return { result=game:catch(id, player) } end
ru: local game = require('pokemon') box.cfg{listen=3301} game:start() -- функции add, map и catch по REST API function add(request, pokemon) return { result=game:add_pokemon(pokemon) } end function map(request) return { map=game:map() } end function catch(request, pid, player) local id = tonumber(pid) if id == nil then return {result=false} end return { result=game:catch(id, player) } end

source: and add some Tarantool-specific parameters (see descriptions in the upstream module's `README <https://github.com/tarantool/nginx_upstream_module#directives>`_ file):
ru: и добавляем специальные параметры для Tarantool'а (см. описание в файле `README <https://github.com/tarantool/nginx_upstream_module#directives>`_ модуля upstream):

source: server { server_name tnt_test; listen 80 default deferred reuseport so_keepalive=on backlog=65535; location = / { root /usr/local/nginx/html; } location /api { # answers check infinity timeout tnt_read_timeout 60m; if ( $request_method = GET ) { tnt_method "map"; } tnt_http_rest_methods get; tnt_http_methods all; tnt_multireturn_skip_count 2; tnt_pure_result on; tnt_pass_http_request on parse_args; tnt_pass tnt; } }
ru: server { server_name tnt_test; listen 80 default deferred reuseport so_keepalive=on backlog=65535; location = / { root /usr/local/nginx/html; } location /api { # ответы проверяют бесконечное время ожидания tnt_read_timeout 60m; if ( $request_method = GET ) { tnt_method "map"; } tnt_http_rest_methods get; tnt_http_methods all; tnt_multireturn_skip_count 2; tnt_pure_result on; tnt_pass_http_request on parse_args; tnt_pass tnt; } }

source: Non-blocking IO
ru: Неблокирующий ввод-вывод
