Repository: tarantool/doc
Catalog: locale/*/LC_MESSAGES/doc.po
Languages: ru

source: for spaces created with :ref:`engine = 'vinyl' <box_schema-space_create>`; it is designed to work for spaces created with ``engine = 'memtx'``.
ru: со спейсами, созданными на движке vinyl :ref:`engine = 'vinyl' <box_schema-space_create>`; работает с движком memtx ``engine = 'memtx'``.

source: If ``replication`` is not an empty string, the instance is considered to be a Tarantool :ref:`replica <replication>`. The replica will try to connect to the master specified in ``replication`` with a :ref:`URI <index-uri>` (Universal Resource Identifier), for example:
ru: Если ``replication`` не содержит пустую строку, экземпляр считается :ref:`репликой <replication>`. Реплика попытается подключиться к мастеру, указанному в параметре ``replication`` по :ref:`URI <index-uri>` (унифицированному идентификатору ресурса), например:

source: If there is more than one replication source in a replica set, specify an array of URIs, for example (replace 'uri' and 'uri2' in this example with valid URIs):
ru: Если в наборе реплик более одного источника репликации, укажите массив URI, например (замените 'uri' и 'uri2' в данном примере на рабочие URI):

source: If one of the URIs is "self" -- that is, if one of the URIs is for the instance where ``box.cfg{}`` is being executed on -- then it is ignored. Thus it is possible to use the same ``replication`` specification on multiple server instances, as shown in :ref:`these examples <replication-bootstrap>`.
ru: Если один из URI "свой" -- то есть один URI принадлежит экземпляру, где выполняется ``box.cfg{}`` -- он не принимается во внимание. Таким образом, можно использовать одну и ту же настройку параметра ``replication`` на нескольких экземплярах сервера, как показано в :ref:`этих примерах <replication-bootstrap>`.

source: The default user name is 'guest'.
ru: По умолчанию, пользователем считается 'guest'.

source: A read-only replica does not accept data-change requests on the :ref:`listen <cfg_basic-listen>` port.
ru: Реплика в режиме только для чтения не принимает запросы по изменению данных по порту для :ref:`прослушивания <cfg_basic-listen>`.

source: The ``replication`` parameter is dynamic, that is, to enter master mode, simply set ``replication`` to an empty string and issue:
ru: Параметр ``replication`` является динамическим, то есть для входа в режим мастера необходимо просто присвоить параметру ``replication`` пустую строку и выполнить следующее:

source: :extsamp:`box.cfg{ replication = {*{new-value}*} }`
ru: :extsamp:`box.cfg{ replication = {*{новое-значение}*} }`

source: A replica sends heartbeat messages to the master every second, and the master is programmed to reconnect automatically if it doesn’t see heartbeat messages more often than ``replication_timeout`` seconds.
ru: Реплика отправляет сообщения контрольного сигнала на мастер каждую секунду, и мастер запрограммирован на автоматическое переподключение, если он не получает сообщения контрольного сигнала дольше количества секунд, указанного в ``replication_timeout``.

source: See more in :ref:`Monitoring a replica set <replication-monitoring>`.
ru: См. дополнительную информацию в разделе :ref:`Мониторинг набора реплик <replication-monitoring>`.

source: Default: 1
ru: По умолчанию: 1

source: By default a replica will try to connect to all the masters, or it will not start. (The default is recommended so that all replicas will receive the same replica set UUID.)
ru: По умолчанию, реплика попытается подключиться ко всем мастерам или не запустится. (По умолчанию, рекомендуется, чтобы у всех реплик был одинаковый UUID набора реплик).

source: However, by specifying ``replication_connect_quorum = N``, where N is a number greater than or equal to zero, users can state that the replica only needs to connect to N masters.
ru: Однако, если указать ``replication_connect_quorum = N``, где N означает число больше или равное нулю, это будет означать, что реплике нужно подключиться к N количеству мастеров.

source: Example:
ru: Пример:

source: As described in section :ref:`"Replication architecture" <replication-architecture>`, each replica set is identified by a `universally unique identifier <https://en.wikipedia.org/wiki/Universally_unique_identifier>`_ called **replica set UUID**, and each instance is identified by an **instance UUID**.
ru: Как описано в разделе :ref:`"Архитектура механизма репликации" <replication-architecture>`, каждый набор реплик идентифицируется по `Универсальному уникальному идентификатору (UUID) <https://en.wikipedia.org/wiki/Universally_unique_identifier>`_, который называется **UUID набора реплик**, и каждый экземпляр идентифицируется по **UUID экземпляра**.

source: Ordinarily it is sufficient to let the system generate and format the UUID strings which will be permanently stored.
ru: Как правило, достаточно позволить системе сгенерировать и форматировать строки, содержащие UUID, которые будут храниться постоянно.

source: However, some administrators may prefer to store Tarantool configuration information in a central repository, for example `Apache ZooKeeper <https://zookeeper.apache.org>`_. Such administrators can assign their own UUID values for either -- or both -- instances (:ref:`instance_uuid <cfg_replication-instance_uuid>`) and replica set (``replicaset_uuid``), when starting up for the first time.
ru: Однако, некоторые администраторы предпочитают сохранять конфигурацию Tarantool'а в центральном репозитории, например, `Apache ZooKeeper <https://zookeeper.apache.org>`_. Они могут самостоятельно присвоить значения экземплярам (:ref:`instance_uuid <cfg_replication-instance_uuid>`) и набору реплик (``replicaset_uuid``) при первом запуске.

source: General rules:
ru: Общие правила:

source: The values must be true unique identifiers, not shared by other instances or replica sets within the common infrastructure.
ru: Значения должны быть действительно уникальными; они не должны одновременно принадлежать другим экземплярам или наборам реплик в той же инфраструктуре.

source: The values must be used consistently, not changed after initial setup (the initial values are stored in :ref:`snapshot files <index-box_persistence>` and are checked whenever the system is restarted).
ru: Значения должны использоваться постоянно, неизменно с первого запуска (первоначальные значения хранятся в :ref:`файлах снимков <index-box_persistence>` и проверяются при каждом перезапуске системы).

source: The values must comply with `RFC 4122 <https://tools.ietf.org/html/rfc4122>`_. The `nil UUID <https://tools.ietf.org/html/rfc4122#section-4.1.7>`_ is not allowed.
ru: Значения должны соответствовать требованиям `RFC 4122 <https://tools.ietf.org/html/rfc4122>`_. `Нулевой UUID <https://tools.ietf.org/html/rfc4122#section-4.1.7>`_ не допускается.

source: The UUID format includes sixteen octets represented as 32 hexadecimal (base 16) digits, displayed in five groups separated by hyphens, in the form ``8-4-4-4-12`` for a total of 36 characters (32 alphanumeric characters and four hyphens).
ru: Формат UUID включает в себя шестнадцать октетов, представленных в виде 32 шестнадцатеричных чисел (с основанием 16) в пяти группах, разделенных дефисами в форме ``8-4-4-4-12`` -- 36 символов (32 буквенно-цифровых символа и четыре дефиса).

source: For replication administration purposes, it is possible to set the `universally unique identifiers <https://en.wikipedia.org/wiki/Universally_unique_identifier>`_ of the instance (``instance_uuid``) and the replica set (``replicaset_uuid``), instead of having the system generate the values.
ru: Для целей администрирования репликации можно самостоятельно присвоить `универсально уникальные идентификаторы <https://en.wikipedia.org/wiki/Universally_unique_identifier>`_ экземпляру (``instance_uuid``) и набору реплик (``replicaset_uuid``) вместо использования сгенерированных системой значений.

source: See the description of :ref:`replicaset_uuid <cfg_replication-replicaset_uuid>` parameter for details.
ru: Для получения подробной информации см. описание параметра :ref:`replicaset_uuid <cfg_replication-replicaset_uuid>`.

source: Networking
ru: Работа с сетями

source: The instance will sleep for io_collect_interval seconds between iterations of the event loop. Can be used to reduce CPU load in deployments in which the number of client connections is large, but requests are not so frequent (for example, each connection issues just a handful of requests per second).
ru: Экземпляр уходит в режим ожидания на io_collect_interval секунд между итерациями событийного цикла. Это можно использовать для снижения загрузки процессора в системах с большим количество клиентских соединений, но нечастыми запросами (например, каждое соединение передает лишь небольшое количество запросов в секунду).

source: The size of the read-ahead buffer associated with a client connection. The larger the buffer, the more memory an active connection consumes and the more requests can be read from the operating system buffer in a single system call. The rule of thumb is to make sure the buffer can contain at least a few dozen requests. Therefore, if a typical tuple in a request is large, e.g. a few kilobytes or even megabytes, the read-ahead buffer size should be increased. If batched request processing is not used, it’s prudent to leave this setting at its default.
ru: Размер буфера опережающего считывания, связанный с клиентским соединением. Чем больше буфер, тем больше памяти потребляет активное соединение и тем больше запросов можно считать из буфера операционной системы за отдельный системный вызов. Общее правило состоит в том, чтобы убедиться, что буфер может содержать как минимум несколько десятков соединений. Таким образом, если размер стандартного кортежа в запросе значительный, например, несколько килобайтов или даже мегабайтов, следует увеличить размер буфера опережающего считывания. Если не используется пакетная обработка запросов, будет целесообразно оставить значение, используемое по умолчанию.

source: Default: 16320
ru: По умолчанию: 16320

source: What level of detail the :ref:`log <admin-logs>` will have. There are seven levels:
ru: Уровень детализации записей :ref:`журнала <admin-logs>`. Есть 7 уровней:

source: By setting log_level, one can enable logging of all classes below or equal to the given level. Tarantool prints its logs to the standard error stream by default, but this can be changed with the :ref:`log <cfg_logging-log>` configuration parameter.
ru: Задав значение параметра log_level, можно включить запись в журнал всех событий заданного уровня или ниже. По умолчанию, Tarantool выводит записи в стандартный поток сообщений об ошибках, но это можно изменить с помощью конфигурационного параметра :ref:`log <cfg_logging-log>`.

source: Default: 5
ru: По умолчанию: 5

source: Warning: prior to Tarantool 1.7.5 there were only six levels and ``DEBUG`` was level 6. Starting with Tarantool 1.7.5 ``VERBOSE`` is level 6 and ``DEBUG`` is level 7. ``VERBOSE`` is a new level for monitoring repetitive events which would cause too much log writing if ``INFO`` were used instead.
ru: Внимание: до версии Tarantool'а 1.7.5 было только 6 уровней, из них шестым был уровень ``DEBUG``. Начиная с версии Tarantool'а 1.7.5 ``VERBOSE`` становится уровнем 6, а ``DEBUG`` -- уровнем 7. ``VERBOSE`` представляет собой новый уровень для мониторинга повторяющихся событий, которые бы привели к слишком большому количеству записей журнала при использовании уровня ``INFO``.

source: By default, Tarantool sends the log to the standard error stream (``stderr``). If ``log`` is specified, Tarantool sends the log to a file, or to a pipe, or to the system logger.
ru: По умолчанию, Tarantool выводит записи в стандартный поток сообщений об ошибках (``stderr``). Если задан параметр ``log``, Tarantool отправит записи журнала в файл, в конвейер или в системный журнал syslog.

source: box.cfg{log = 'tarantool.log'} -- or box.cfg{log = 'file: tarantool.log'}
ru: box.cfg{log = 'tarantool.log'} -- или box.cfg{log = 'file: tarantool.log'}

source: This will open the file ``tarantool.log`` for output on the server’s default directory. If the ``log`` string has no prefix or has the prefix "file:", then the string is interpreted as a file path.
ru: Откроется файл ``tarantool.log`` для вывода в директории сервера, используемой по умолчанию. Если в строке ``log`` нет префикса или есть префикс "file:", то строка считается путем к файлу.

source: box.cfg{log = '| cronolog tarantool.log'} -- or box.cfg{log = 'pipe: cronolog tarantool.log'}'
ru: box.cfg{log = '| cronolog tarantool.log'} -- или box.cfg{log = 'pipe: cronolog tarantool.log'}'

source: This will start the program `cronolog <https://linux.die.net/man/1/cronolog>`_ when the server starts, and will send all log messages to the standard input (``stdin``) of cronolog. If the ``log`` string begins with '|' or has the prefix "pipe:", then the string is interpreted as a Unix `pipeline <https://en.wikipedia.org/wiki/Pipeline_%28Unix%29>`_.
ru: Запустится программа `cronolog <https://linux.die.net/man/1/cronolog>`_ при запуске сервера, которая будет отправлять все сообщения журнала на стандартный вывод (``stdin``) в cronolog. Если строка ``log`` начинается с '|' или содержит префикс "pipe:", то строка считается Unix-`конвейером <https://en.wikipedia.org/wiki/Pipeline_%28Unix%29>`_.

source: When logging to a file, Tarantool reopens the log on `SIGHUP <https://en.wikipedia.org/wiki/SIGHUP>`_. When log is a program, its pid is saved in the :ref:`log.logger_pid <log-logger_pid>` variable. You need to send it a signal to rotate logs.
ru: При записи в файл Tarantool повторно открывает журнал при сигнале `SIGHUP <https://en.wikipedia.org/wiki/SIGHUP>`_. Если журнал является программой, его PID сохраняется в переменной :ref:`log.logger_pid <log-logger_pid>`. Необходимо отправить сигнал для ротации файлов журнала.

source: If ``log_nonblock`` equals true, Tarantool does not block on the log file descriptor when it’s not ready for write, and drops the message instead. If :ref:`log_level <cfg_logging-log_level>` is high, and many messages go to the log file, setting ``log_nonblock`` to true may improve logging performance at the cost of some log messages getting lost.
ru: Если значение ``log_nonblock`` равно true (правда), Tarantool не блокирует дескриптор файла журнала, когда он не готов вести запись, а вместо этого сбрасывает сообщение. Если задан высокий уровень :ref:`log_level <cfg_logging-log_level>`,и много сообщений попадают в файл журнала, перевод ``log_nonblock`` в true может улучшить производительность ценой потери некоторых сообщений журнала.

source: This parameter has effect only if the output is going to ``syslog`` or to a pipe.
ru: Данный параметр сработает, только если вывод производится в системный журнал ``syslog`` или в конвейер.

source: If processing a request takes longer than the given value (in seconds), warn about it in the log. Has effect only if :ref:`log_level <cfg_logging-log_level>` is more than or equal to 4 (WARNING).
ru: Если обработка запроса занимает дольше времени, чем заданное значение (в секундах), в журнал заносится соответствующее предупреждение. Сработает, только если в :ref:`log_level <cfg_logging-log_level>` задан уровень 4 (WARNING) или выше.

source: Default: 0.5
ru: По умолчанию: 0.5

source: Log entries have two possible formats:
ru: Данные в журнал записываются в двух форматах:

source: 'plain' (the default), or
ru: 'plain' (по умолчанию) или

source: 'json' (with more detail and with JSON labels).
ru: 'json' (более детально с JSON-метками).

source: Here is what a log entry looks like after ``box.cfg{log_format='plain'}``:
ru: Вот как будет выглядеть запись в журнале после выполнения ``box.cfg{log_format='plain'}``:

source: Here is what a log entry looks like after ``box.cfg{log_format='json'}``:
ru: Вот как будет выглядеть запись в журнале после выполнения ``box.cfg{log_format='json'}``:

source: The ``log_format='plain'`` entry has time, process id, cord name, :ref:`fiber_id <fiber_object-id>`, :ref:`fiber_name <fiber_object-name_get>`, :ref:`log level <cfg_logging-log_level>`, and message.
ru: В простом формате (``log_format='plain'``) запись содержит время, идентификатор процесса, имя шнура, идентификатор файбера :ref:`fiber_id <fiber_object-id>`, имя файбера :ref:`fiber_name <fiber_object-name_get>`, :ref:`уровень записи в журнал <cfg_logging-log_level>`и сообщение.

source: The ``log_format='json'`` entry has the same things along with their labels, and in addition has the file name and line number of the Tarantool source.
ru: В JSON-формате (``log_format='json'``) запись содержит все вышеперечисленное с соответствующими метками, а также имя файла и номер строки Tarantool-источника.

source: Default: 'plain'
ru: По умолчанию: 'plain'

source: Logging example
ru: Пример записи в журнал

source: This will illustrate how "rotation" works, that is, what happens when the server instance is writing to a log and signals are used when archiving it.
ru: Данный пример проиллюстрирует ротацию файлов журнала, то есть что происходит, когда экземпляр сервера производит запись в журнал? а при архивировании используются сигналы.

source: Start with two terminal shells, Terminal #1 and Terminal #2.
ru: Запустите две оболочки, терминал №1 и терминал №2.

source: On Terminal #1: start an interactive Tarantool session, then say the logging will go to `Log_file`, then put a message "Log Line #1" in the log file:
ru: На терминале №1 запустите интерактивную сессию Tarantool'а, затем укажите, что запись в журнал ведется в файл `Log_file`, а затем поместите сообщение "Log Line #1" в файл журнала:

source: On Terminal #2: use ``mv`` so the log file is now named `Log_file.bak`. The result of this is: the next log message will go to `Log_file.bak`.
ru: На терминале №2 используйте команду ``mv``, чтобы файл журнала назывался `Log_file.bak`. Результатом будет то, что следующее сообщение журнала пойдет в файл `Log_file.bak`.

source: On Terminal #1: put a message "Log Line #2" in the log file.
ru: На терминале №1 поместите сообщение "Log Line #2" в файл журнала.

source: On Terminal #2: use ``ps`` to find the process ID of the Tarantool instance.
ru: На терминале №2 используйте команду ``ps``, чтобы найти ID процесса экземпляра Tarantool'а.

source: On Terminal #2: use ``kill -HUP`` to send a SIGHUP signal to the Tarantool instance. The result of this is: Tarantool will open `Log_file` again, and the next log message will go to `Log_file`. (The same effect could be accomplished by executing log.rotate() on the instance.)
ru: На терминале №2 используйте команду ``kill -HUP`` для отправки сигнала SIGHUP на экземпляр Tarantool'а. Результат: Tarantool снова откроет `Log_file`, и следующее сообщение журнала пойдет в `Log_file`. (Тот же результат можно получить путем выполнения команды log.rotate() на экземпляре.)

source: On Terminal #1: put a message "Log Line #3" in the log file.
ru: На терминале №1 поместите сообщение "Log Line #3" в файл журнала.

source: On Terminal #2: use ``less`` to examine files. `Log_file.bak` will have these lines, except that the date and time will depend on when the example is done:
ru: На терминале №2 используйте команду ``less`` для просмотра файлов. `Log_file.bak` будет содержать следующие строки, но дата и время будут указаны в зависимости от времени выполнения примера:

source: and `Log_file` will have
ru: а `Log_file` будет содержать

source: Deprecated parameters
ru: Устаревшие параметры

source: These parameters are deprecated since Tarantool version 1.7.4:
ru: Данные параметры объявлены устаревшими с версии Tarantool'а 1.7.4:

source: **Deprecated**, do not use.
ru: **Устаревший**, не использовать.

source: **Deprecated** in favor of :ref:`log <cfg_logging-log>`. The parameter was only renamed, while the type, values and semantics remained intact.
ru: **Устаревший**, заменен параметром :ref:`log <cfg_logging-log>`. Параметр был лишь переименован, его тип, значения и семантика остались прежними.

source: **Deprecated** in favor of :ref:`log_nonblock <cfg_logging-log_nonblock>`. The parameter was only renamed, while the type, values and semantics remained intact.
ru: **Устаревший**, заменен параметром :ref:`log_nonblock <cfg_logging-log_nonblock>`. Параметр был лишь переименован, его тип, значения и семантика остались прежними.

source: **Deprecated** in favor of :ref:`force_recovery <cfg_binary_logging_snapshots-force_recovery>`.
ru: **Устаревший**, заменен параметром :ref:`force_recovery <cfg_binary_logging_snapshots-force_recovery>`.

source: If there is an error while reading a snapshot file (at server instance start), abort.
ru: Если при чтении файла снимка произошла ошибка (при запуске экземпляра сервера), прервать выполнение.

source: **Deprecated** in favor of :ref:`replication <cfg_replication-replication>`. The parameter was only renamed, while the type, values and semantics remained intact.
ru: **Устаревший**, заменен параметром :ref:`replication <cfg_replication-replication>`. Параметр был лишь переименован, его тип, значения и семантика остались прежними.

source: **Deprecated** in favor of :ref:`memtx_memory <cfg_storage-memtx_memory>`.
ru: **Устаревший**, заменен параметром :ref:`memtx_memory <cfg_storage-memtx_memory>`.

source: How much memory Tarantool allocates to actually store tuples, **in gigabytes**. When the limit is reached, INSERT or UPDATE requests begin failing with error :errcode:`ER_MEMORY_ISSUE`. While the server does not go beyond the defined limit to allocate tuples, there is additional memory used to store indexes and connection information. Depending on actual configuration and workload, Tarantool can consume up to 20% more than the limit set here.
ru: Количество памяти, которое Tarantool выделяет для фактического хранения кортежей, **в гигабайтах**. При достижении предельного значения запросы вставки INSERT или обновления UPDATE выполняться не будут, выдавая ошибку :errcode:`ER_MEMORY_ISSUE`. Сервер не выходит за установленный предел памяти ``memtx_memory`` при распределении кортежей, но есть дополнительная память, которая используется для хранения индексов и информации о подключении. В зависимости от рабочей конфигурации и загрузки, Tarantool может потреблять на 20% больше установленного предела.

source: Default: 1.0
ru: По умолчанию: 1.0

source: The multiplier for computing the sizes of memory chunks that tuples are stored in. A lower value may result in less wasted memory depending on the total amount of memory available and the distribution of item sizes.
ru: Множитель для вычисления размеров блоков памяти, в которых хранятся кортежи. Нижнее значение может привести к уменьшению потерь памяти в зависимости от общего объема доступной памяти и распределения размеров элементов.

source: Default: 1.1
ru: По умолчанию: 1.1

source: **Deprecated** in favor of :ref:`memtx_max_tuple_size <cfg_storage-memtx_max_tuple_size>`. The parameter was only renamed, while the type, values and semantics remained intact.
ru: **Устаревший**, заменен параметром :ref:`memtx_max_tuple_size <cfg_storage-memtx_max_tuple_size>`. Параметр был лишь переименован, его тип, значения и семантика остались прежними.

source: **Deprecated** in favor of :ref:`memtx_min_tuple_size <cfg_storage-memtx_min_tuple_size>`. The parameter was only renamed, while the type, values and semantics remained intact.
ru: **Устаревший**, заменен параметром :ref:`memtx_min_tuple_size <cfg_storage-memtx_min_tuple_size>`. Параметр был лишь переименован, его тип, значения и семантика остались прежними.

source: **Deprecated** in favor of :ref:`memtx_dir <cfg_basic-memtx_dir>`. The parameter was only renamed, while the type, values and semantics remained intact.
ru: **Устаревший**, заменен параметром :ref:`memtx_dir <cfg_basic-memtx_dir>`. Параметр был лишь переименован, его тип, значения и семантика остались прежними.
