Repository: tarantool/doc
Catalog: locale/*/LC_MESSAGES/doc.po
Languages: ru

source: Formatting code snippets
ru: Форматирование фрагментов кода

source: For code snippets, we mainly use the ``code-block`` directive with an appropriate highlighting language. The most commonly used highlighting languages are:
ru: Для фрагментов коды мы обычно используем директиву ``code-block`` с соответствующей подсветкой синтаксиса языка. Чаще всего используем следующее:

source: For example (a code snippet in Lua):
ru: Например (фрагмент Lua-кода):

source: In rare cases, when we need custom highlight for specific parts of a code snippet and the ``code-block`` directive is not enough, we use the per-line ``codenormal`` directive together and explicit output formatting (defined in :file:`doc/sphinx/_static/sphinx_design.css`).
ru: В редких случаях при необходимости подсветить отдельные части фрагмента кода, когда директивы ``code-block`` недостаточно, мы используем директиву ``codenormal`` построчно вместе с явным форматированием вывода (как указано в :file:`doc/sphinx/_static/sphinx_design.css`).

source: Examples:
ru: Примеры:

source: Function syntax (the placeholder `space-name` is displayed in italics):
ru: Синтаксис функции (объект-заполнитель `имя-спейса` отображается курсивом):

source: :codenormal:`box.space.`:codeitalic:`space-name`:codenormal:`:create_index('index-name')`
ru: :codenormal:`box.space.`:codeitalic:`имя-спейса`:codenormal:`:create_index('index-name')`

source: A tdb session (user input is in bold, command prompt is in blue, computer output is in green):
ru: Сессия tdb (ввод информации пользователем выделяется жирным шрифтом, приглашение на ввод команды -- синим, вывод -- зеленым):

source: Warning: Every entry of explicit output formatting (``codenormal``, ``codebold``, etc) tends to cause troubles when this documentation is translated to other languages. Please avoid using explicit output formatting unless it is REALLY needed.
ru: Внимание: Каждая запись с явным форматированием вывода (``codenormal``, ``codebold`` и т.п.) часто вызывает трудности при переводе документации на другие языки. Постарайтесь избегать специального форматирования, если только без него никак НЕЛЬЗЯ обойтись.

source: Using separated links
ru: Использование разделенных ссылок

source: Avoid separating the link and the target definition (ref), like this:
ru: Избегайте разделения ссылки и определения цели (ref), например:

source: This is a paragraph that contains `a link`_. .. _a link: http://example.com/
ru: Это абзац, который содержит `ссылку`_. .. ссылка: http://example.com/

source: Use non-separated links instead:
ru: Используйте неразделенные ссылки:

source: This is a paragraph that contains `a link <http://example.com/>`_.
ru: Это абзац, который содержит `ссылку <http://example.com/>`_.

source: Warning: Every separated link tends to cause troubles when this documentation is translated to other languages. Please avoid using separated links unless it is REALLY needed (e.g. in tables).
ru: Внимание: Каждая разделенная ссылка часто вызывает трудности при переводе документации на другие языки. Постарайтесь избегать разделенных ссылок, если только без них никак НЕЛЬЗЯ обойтись (например, в таблицах).

source: Creating labels for local links
ru: Создание меток для локальных ссылок

source: We avoid using links that sphinx generates automatically for most objects. Instead, we add our own labels for linking to any place in this documentation.
ru: Мы стараемся не использовать автоматически сгенерированные sphinx ссылки для большинства объектов. Вместо них мы добавляем собственные метки для ссылок на любое место в документации.

source: Our naming convention is as follows:
ru: Соглашение об именовании заключается в следующем:

source: Character set: a through z, 0 through 9, dash, underscore.
ru: Набор символов: от a до z, от 0 до 9, дефис, подчеркивание.

source: Format: ``path dash filename dash tag``
ru: Формат: ``путь дефис имя файла дефис тег``

source: Example: ``_c_api-box_index-iterator_type`` |br| where: |br| ``c_api`` is the directory name, |br| ``box_index`` is the file name (without ".rst"), and |br| ``iterator_type`` is the tag.
ru: Пример: ``_c_api-box_index-iterator_type`` |br| где: |br| ``c_api`` -- имя директории, |br| ``box_index`` -- имя файла (без ".rst"), а |br| ``iterator_type`` -- тег.

source: The file name is useful for knowing, when you see "ref", where it is pointing to. And if the file name is meaningful, you see that better.
ru: Имя файла используется для того, чтобы понять, куда указывает "ref". И если имя файла имеет смысл, это гораздо понятнее.

source: The file name alone, without a path, is enough when the file name is unique within ``doc/sphinx``. So, for ``fiber.rst`` it should be just "fiber", not "reference-fiber". While for "index.rst" (we have a handful of "index.rst" in different directories) please specify the path before the file name, e.g. "reference-index".
ru: Имени файла без пути достаточно, когда оно уникально в пределах ``doc/sphinx``. Поэтому для файла ``fiber.rst`` достаточно будет "fiber", а не "reference-fiber". Тогда как для "index.rst" (а у нас множество файлов "index.rst" в разных директориях) необходимо указать путь до имени файла, например, "reference-index".

source: Use a dash "-" to delimit the path and the file name. In the documentation source, we use only underscores "_" in paths and file names, reserving dash "-" as the delimiter for local links.
ru: Используйте дефис "-", чтобы разграничить путь и имя файла. В исходном коде документации мы пользуемся только символами подчеркивания "_" при указании пути и имени файла, оставляя дефисы "-" для разграничения в локальных ссылках.

source: The tag can be anything meaningful. The only guideline is for Tarantool syntax items (such as members), where the preferred tag syntax is ``module_or_object_name dash member_name``. For example, ``box_space-drop``.
ru: Тег может содержать любую значимую информацию. Единственная рекомендация дается для элементов синтаксиса Tarantool'а, где предпочтительно использовать следующий синтаксис в тегах: ``имя_объекта_или_модуля дефис имя_элемента``. Например, ``box_space-drop``.

source: Making comments
ru: Добавление комментариев

source: Sometimes we may need to leave comments in a ReST file. To make sphinx ignore some text during processing, use the following per-line notation with ".. //" as the comment marker:
ru: Иногда могут потребоваться комментарии в файле ReST. Чтобы sphinx не учитывал этот текст во время обработки, используйте следующую запись в каждой строке в качестве маркера комментария (".. //"):

source: .. // your comment here
ru: .. // здесь комментарий

source: The starting symbols ".. //" do not interfere with the other ReST markup, and they are easy to find both visually and using grep. There are no symbols to escape in grep search, just go ahead with something like this:
ru: Начальные символы ".. //" не пересекаются с другими символами разметки ReST, и их легко обнаружить как визуально, так и с помощью grep. В поиске grep нет символов, которые нужно избегать, просто выполните примерно следующее:

source: These comments don't work properly in nested documentation, though (e.g. if you leave a comment in module -> object -> method, sphinx ignores the comment and all nested content that follows in the method description).
ru: Тем не менее, эти комментарии не сработают должным образом во вложенной документации (например, если оставить комментарий в модуле -> объекте -> методе, sphinx игнорирует комментарий и всё вложенное содержимое, который следует в описании метода).

source: Language and style issues
ru: Вопросы по стилю и языку

source: US vs British spelling
ru: Британский или американский вариант английского

source: We use English US spelling.
ru: В английской версии документации мы придерживаемся американского варианта английского языка.

source: Instance vs server
ru: Экземпляр или сервер

source: We say "instance" rather than "server" to refer to an instance of Tarantool server. This keeps the manual terminology consistent with names like ``/etc/tarantool/instances.enabled`` in the Tarantool environment.
ru: Ссылаясь на экземпляр Tarantool-сервера, мы говорим "экземпляр", а не "сервер". Это обеспечивает однородность терминологии в руководстве и именами в окружении Tarantool'а (например, ``/etc/tarantool/instances.enabled`` -- активные экземпляры).

source: Wrong usage: "Replication allows multiple Tarantool *servers* to work on copies of the same databases."
ru: Неправильно: "С помощью репликации несколько *серверов* Tarantool’а могут работать на копиях одинаковых баз данных."

source: Correct usage: "Replication allows multiple Tarantool *instances* to work on copies of the same databases."
ru: Правильно: "С помощью репликации несколько *экземпляров* Tarantool’а могут работать на копиях одинаковых баз данных."

source: Examples and templates
ru: Примеры и шаблоны

source: Module and function
ru: Модуль и функция

source: Here is an example of documenting a module (``my_fiber``) and a function (``my_fiber.create``).
ru: Ниже приводится пример документирования модуля (``my_fiber``) и функции (``my_fiber.create``).

source: Create and start a ``my_fiber`` object. The object is created and begins to run immediately.
ru: Создание и запуск ``my_fiber``. Происходит создание объекта, который незамедлительно начинает работу.

source: the function to be associated with the ``my_fiber`` object
ru: функция, которая будет связана с ``my_fiber``

source: what will be passed to function
ru: что передается в функцию

source: created ``my_fiber`` object
ru: созданный объект ``my_fiber``

source: Module, class and method
ru: Модуль, класс и метод

source: Here is an example of documenting a module (``my_box.index``), a class (``my_index_object``) and a function (``my_index_object.rename``).
ru: Ниже приводится пример документирования модуля (``my_box.index``), класса (``my_index_object``) и функции (``my_index_object.rename``).

source: an object reference
ru: ссылка на объект

source: a new name for the index (type = string)
ru: новое имя для индекса (тип = строка)

source: Possible errors: index_object does not exist.
ru: Возможные ошибки: index_object не существует.

source: Complexity Factors: Index size, Index type, Number of tuples accessed.
ru: Факторы сложности: Размер индекса, тип индекса, количество кортежей, к которым получен доступ.

source: Guidelines
ru: Рекомендации

source: Contributor's Guide
ru: Руководство разработчика

source: Internals
ru: Внутреннее устройство

source: Tarantool's binary protocol
ru: Бинарный протокол Tarantool'а

source: Tarantool's binary protocol is a binary request/response protocol.
ru: Бинарный протокол Tarantool'а представляет собой бинарный запросно-ответный протокол.

source: Notation in diagrams
ru: Система обозначений в схематическом представлении

source: MsgPack data types:
ru: Типы MsgPack-данных:

source: **MP_INT** - Integer
ru: **MP_INT** - целое число

source: **MP_MAP** - Map
ru: **MP_MAP** - ассоциативный массив

source: **MP_ARR** - Array
ru: **MP_ARR** - массив

source: **MP_STRING** - String
ru: **MP_STRING** - строка

source: **MP_FIXSTR** - Fixed size string
ru: **MP_FIXSTR** - строка фиксированной длины

source: **MP_OBJECT** - Any MsgPack object
ru: **MP_OBJECT** - любой MsgPack-объект

source: **MP_BIN** - MsgPack binary format
ru: **MP_BIN** - бинарный формат MsgPack

source: Greeting packet
ru: Пакет приветствия

source: TARANTOOL'S GREETING: 0 63 +--------------------------------------+ | | | Tarantool Greeting (server version) | | 64 bytes | +---------------------+----------------+ | | | | BASE64 encoded SALT | NULL | | 44 bytes | | +---------------------+----------------+ 64 107 127
ru: ПРИВЕТСТВИЕ TARANTOOL'А: 0 63 +--------------------------------------+ | | | Приветствие Tarantool'а (версия сервера) | | 64 байта | +---------------------+----------------+ | | | | СОЛЬ в кодировке BASE64 | NULL | | 44 байта | | +---------------------+----------------+ 64 107 127

source: The server instance begins the dialogue by sending a fixed-size (128-byte) text greeting to the client. The greeting always contains two 64-byte lines of ASCII text, each line ending with a newline character ('\\n'). The first line contains the instance version and protocol type. The second line contains up to 44 bytes of base64-encoded random string, to use in the authentication packet, and ends with up to 23 spaces.
ru: Экземпляр сервера начинает диалог с отправки клиенту текста приветствия фиксированного размера (128 байтов). Приветствие всегда содержит две 64-байтные строки текста в формате ASCII, каждая строка заканчивается символом разрыва строки ('\\n'). Первая строка описывает версию экземпляра и тип протокола. Вторая строка содержит случайную строку в кодировке base64 размером до 44 байтов для использования в пакете аутентификации и заканчивается на пробелы (до 23).

source: Unified packet structure
ru: Унифицированная структура пакета

source: Once a greeting is read, the protocol becomes pure request/response and features a complete access to Tarantool functionality, including:
ru: После того, как приветствие прочитано, протокол становится простым запросно-ответным протоколом и предоставляет полный доступ к функциям Tarantool'а, включая:

source: request multiplexing, e.g. ability to asynchronously issue multiple requests via the same connection
ru: мультиплексирование запросов, т.е. возможность асинхронной отправки множества запросов по одному соединению;

source: response format that supports zero-copy writes
ru: формат ответа, который поддерживает запись в режиме без копирования (zero-copy).

source: Both :code:`<header>` and :code:`<body>` are msgpack maps:
ru: И заголовок :code:`<header>` и тело сообщения :code:`<body>` представляют собой ассоциативные массивы в формате msgpack:

source: Request/Response: 0 5 +--------+ +============+ +===================================+ | BODY + | | | | | | HEADER | | HEADER | | BODY | | SIZE | | | | | +--------+ +============+ +===================================+ MP_INT MP_MAP MP_MAP
ru: Запрос / ответ: 0 5 +--------+ +============+ +===================================+ | BODY + | | | | | | HEADER | | HEADER | | BODY | | SIZE | | | | | +--------+ +============+ +===================================+ MP_INT MP_MAP MP_MAP

source: UNIFIED HEADER: +================+================+=====================+ | | | | | 0x00: CODE | 0x01: SYNC | 0x05: SCHEMA_ID | | MP_INT: MP_INT | MP_INT: MP_INT | MP_INT: MP_INT | | | | | +================+================+=====================+ MP_MAP
ru: УНИФИЦИРОВАННЫЙ ЗАГОЛОВОК: +================+================+=====================+ | | | | | 0x00: CODE | 0x01: SYNC | 0x05: SCHEMA_ID | | MP_INT: MP_INT | MP_INT: MP_INT | MP_INT: MP_INT | | | | | +================+================+=====================+ MP_MAP

source: They only differ in the allowed set of keys and values. The key defines the type of value that follows. If a body has no keys, the entire msgpack map for the body may be missing. Such is the case, for example, for a <ping> request. ``schema_id`` may be absent in the request's header, meaning that there will be no version checking, but it must be present in the response. If ``schema_id`` is sent in the header, then it will be checked.
ru: Они различаются лишь набором допустимых ключей и значений. Ключ определяет тип следующего за ним значения. Если в теле сообщения нет ключей, может отсутствовать весь ассоциативный массив в формате msgpack для тела сообщения. Так и случится при запросе проверки связи <ping>. ``schema_id`` может отсутствовать в заголовке запроса, что означает отсутствие проверки версии, но этот ключ обязательно должен присутствовать в ответе. Если ``schema_id`` отправляется в заголовке, будет выполнена соответствующая проверка.

source: Authentication
ru: Аутентификация

source: When a client connects to the server instance, the instance responds with a 128-byte text greeting message. Part of the greeting is base-64 encoded session salt - a random string which can be used for authentication. The length of decoded salt (44 bytes) exceeds the amount necessary to sign the authentication message (first 20 bytes). An excess is reserved for future authentication schemas.
ru: Когда клиент подключается к экземпляру сервера, экземпляр отвечает 128-байтным текстовым сообщением приветствия. Часть приветствия представляет собой закодированное в формате base-64 значение соль для сессии (случайная строка), которое можно использовать для аутентификации. Длина расшифрованного значения соль (44 байта) выходит за пределы сообщения для аутентификации (первые 20 байтов). Остаток предназначается для будущих схем аутентификации.

source: PREPARE SCRAMBLE: LEN(ENCODED_SALT) = 44; LEN(SCRAMBLE) = 20; prepare 'chap-sha1' scramble: salt = base64_decode(encoded_salt); step_1 = sha1(password); step_2 = sha1(step_1); step_3 = sha1(salt, step_2); scramble = xor(step_1, step_3); return scramble; AUTHORIZATION BODY: CODE = 0x07 +==================+====================================+ | | +-------------+-----------+ | | (KEY) | (TUPLE)| len == 9 | len == 20 | | | 0x23:USERNAME | 0x21:| "chap-sha1" | SCRAMBLE | | | MP_INT:MP_STRING | MP_INT:| MP_STRING | MP_BIN | | | | +-------------+-----------+ | | | MP_ARRAY | +==================+====================================+ MP_MAP
ru: ПОДГОТОВКА КОДИРОВАНИЯ: LEN(ENCODED_SALT) = 44; LEN(SCRAMBLE) = 20; подготовить кодирование 'chap-sha1': salt = base64_decode(encoded_salt); step_1 = sha1(password); step_2 = sha1(step_1); step_3 = sha1(salt, step_2); scramble = xor(step_1, step_3); return scramble; ТЕЛО СООБЩЕНИЯ АВТОРИЗАЦИИ: CODE = 0x07 +==================+====================================+ | | +-------------+-----------+ | | (KEY) | (TUPLE)| len == 9 | len == 20 | | | 0x23:USERNAME | 0x21:| "chap-sha1" | SCRAMBLE | | | MP_INT:MP_STRING | MP_INT:| MP_STRING | MP_BIN | | | | +-------------+-----------+ | | | MP_ARRAY | +==================+====================================+ MP_MAP

source: :code:`<key>` holds the user name. :code:`<tuple>` must be an array of 2 fields: authentication mechanism ("chap-sha1" is the only supported mechanism right now) and password, encrypted according to the specified mechanism. Authentication in Tarantool is optional, if no authentication is performed, session user is 'guest'. The instance responds to authentication packet with a standard response with 0 tuples.
ru: :code:`<key>` содержит имя пользователя. :code:`<tuple>` должен представлять собой массив из 2 полей: механизм аутентификации (в данный момент поддерживается только механизм "chap-sha1") и пароль, закодированный в соответствии с указанным механизмом. Аутентификация в Tarantool'е необязательна: если аутентификация не проводится, то пользователем в сессии будет 'guest'. Экземпляр отвечает на пакет аутентификации стандартным ответом с 0 кортежей.

source: Requests
ru: Запросы

source: SELECT: CODE - 0x01 Find tuples matching the search pattern
ru: SELECT: CODE - 0x01 Поиск кортежей, соответствующих шаблону поиска

source: SELECT BODY: +==================+==================+==================+ | | | | | 0x10: SPACE_ID | 0x11: INDEX_ID | 0x12: LIMIT | | MP_INT: MP_INT | MP_INT: MP_INT | MP_INT: MP_INT | | | | | +==================+==================+==================+ | | | | | 0x13: OFFSET | 0x14: ITERATOR | 0x20: KEY | | MP_INT: MP_INT | MP_INT: MP_INT | MP_INT: MP_ARRAY | | | | | +==================+==================+==================+ MP_MAP
ru: ТЕЛО СООБЩЕНИЯ ВЫБОРКИ SELECT: +==================+==================+==================+ | | | | | 0x10: SPACE_ID | 0x11: INDEX_ID | 0x12: LIMIT | | MP_INT: MP_INT | MP_INT: MP_INT | MP_INT: MP_INT | | | | | +==================+==================+==================+ | | | | | 0x13: OFFSET | 0x14: ITERATOR | 0x20: KEY | | MP_INT: MP_INT | MP_INT: MP_INT | MP_INT: MP_ARRAY | | | | | +==================+==================+==================+ MP_MAP

source: INSERT: CODE - 0x02 Inserts tuple into the space, if no tuple with same unique keys exists. Otherwise throw *duplicate key* error.
ru: INSERT: CODE - 0x02 Вставка кортежа в спейс, если нет кортежей с такими же уникальными ключами. Если есть, выдать ошибку *duplicate key* (повторяющееся значение ключа).

source: REPLACE: CODE - 0x03 Insert a tuple into the space or replace an existing one.
ru: REPLACE: CODE - 0x03 Вставка кортежа в спейс или замена существующего кортежа.

source: INSERT/REPLACE BODY: +==================+==================+ | | | | 0x10: SPACE_ID | 0x21: TUPLE | | MP_INT: MP_INT | MP_INT: MP_ARRAY | | | | +==================+==================+ MP_MAP
ru: ТЕЛО СООБЩЕНИЯ ВСТАВКИ/ЗАМЕНЫ INSERT/REPLACE: +==================+==================+ | | | | 0x10: SPACE_ID | 0x21: TUPLE | | MP_INT: MP_INT | MP_INT: MP_ARRAY | | | | +==================+==================+ MP_MAP

source: UPDATE: CODE - 0x04 Update a tuple
ru: UPDATE: CODE - 0x04 Обновление кортежа

source: UPDATE BODY: +==================+=======================+ | | | | 0x10: SPACE_ID | 0x11: INDEX_ID | | MP_INT: MP_INT | MP_INT: MP_INT | | | | +==================+=======================+ | | +~~~~~~~~~~+ | | | | | | | | (TUPLE) | OP | | | 0x20: KEY | 0x21: | | | | MP_INT: MP_ARRAY | MP_INT: +~~~~~~~~~~+ | | | MP_ARRAY | +==================+=======================+ MP_MAP
ru: ТЕЛО СООБЩЕНИЯ ОБНОВЛЕНИЯ UPDATE: +==================+=======================+ | | | | 0x10: SPACE_ID | 0x11: INDEX_ID | | MP_INT: MP_INT | MP_INT: MP_INT | | | | +==================+=======================+ | | +~~~~~~~~~~+ | | | | | | | | (TUPLE) | OP | | | 0x20: KEY | 0x21: | | | | MP_INT: MP_ARRAY | MP_INT: +~~~~~~~~~~+ | | | MP_ARRAY | +==================+=======================+ MP_MAP

source: OP: Works only for integer fields: * Addition OP = '+' . space[key][field_no] += argument * Subtraction OP = '-' . space[key][field_no] -= argument * Bitwise AND OP = '&' . space[key][field_no] &= argument * Bitwise XOR OP = '^' . space[key][field_no] ^= argument * Bitwise OR OP = '|' . space[key][field_no] |= argument Works on any fields: * Delete OP = '#' delete <argument> fields starting from <field_no> in the space[<key>] 0 2 +-----------+==========+==========+ | | | | | OP | FIELD_NO | ARGUMENT | | MP_FIXSTR | MP_INT | MP_INT | | | | | +-----------+==========+==========+ MP_ARRAY
ru: OP: Работает только для целочисленных полей: * Сложение OP = '+' . space[key][field_no] += argument * Вычитание OP = '-' . space[key][field_no] -= argument * Побитовое И OP = '&' . space[key][field_no] &= argument * Исключающее ИЛИ OP = '^' . space[key][field_no] ^= argument * Побитовое ИЛИ OP = '|' . space[key][field_no] |= аргумент Работает для любых полей: * Удаление OP = '#' удалить поля <argument>, начиная с поля <field_no> в спейсе с ключом space[<key>] 0 2 +-----------+==========+==========+ | | | | | OP | FIELD_NO | ARGUMENT | | MP_FIXSTR | MP_INT | MP_INT | | | | | +-----------+==========+==========+ MP_ARRAY
