Repository: tarantool/doc
Catalog: locale/*/LC_MESSAGES/doc.po
Languages: ru

source: Backups
ru: Резервное копирование

source: Hot backup (memtx)
ru: Горячее резервирование (memtx)

source: This is a special case when there are only in-memory tables.
ru: Это особый случай, когда все таблицы хранятся в памяти.

source: The last :ref:`snapshot file <index-box_persistence>` is a backup of the entire database; and the :ref:`WAL <internals-wal>` files that are made after the last snapshot are incremental backups. Therefore taking a backup is a matter of copying the snapshot and WAL files.
ru: Последний созданный Tarantool'ом :ref:`файл-снимок <index-box_persistence>` является резервной копией всей базы данных; а :ref:`WAL-файлы <internals-wal>`, созданные следом за последним файлом-снимком, являются инкрементными копиями. Поэтому процедура резервирования сводится к копированию последнего файла-снимка и следующих за ним WAL-файлов.

source: Use ``tar`` to make a (possibly compressed) copy of the latest .snap and .xlog files on the :ref:`memtx_dir <cfg_basic-memtx_dir>` and :ref:`wal_dir <cfg_basic-wal_dir>` directories.
ru: С помощью ``tar`` создайте (зачастую сжатую) копию последнего .snap-файла и следующих за ним .xlog-файлов из директорий :ref:`memtx_dir <cfg_basic-memtx_dir>` и :ref:`wal_dir <cfg_basic-wal_dir>`.

source: If there is a security policy, encrypt the .tar file.
ru: Если того требуют правила безопасности, зашифруйте получившийся .tar-файл.

source: Copy the .tar file to a safe place.
ru: Скопируйте .tar-файл в надежное место.

source: Later, restoring the database is a matter of taking the .tar file and putting its contents back in the ``memtx_dir`` and ``wal_dir`` directories.
ru: В дальнейшем базу данных можно восстановить, разархивировав содержимое .tar-файла в директории ``memtx_dir`` и ``wal_dir``.

source: Hot backup (vinyl/memtx)
ru: Горячее резервирование (vinyl/memtx)

source: To take a mixed backup:
ru: Для создания смешанной резервной копии:

source: Copy the files from the list to a safe location. This will include memtx snapshot files, vinyl run and index files, at a state consistent with the last checkpoint.
ru: Скопируйте файлы из списка в надежное место. Это касается файлов-снимков memtx, выполняемых vinyl-файлов и индексных файлов, соответствующих последней контрольной точке.

source: Continuous remote backup (memtx)
ru: Непрерывное удаленное резервирование

source: The :ref:`replication <replication>` feature is useful for backup as well as for load balancing.
ru: :ref:`Репликация <replication>` используется не только для резервирования, но и для выравнивания нагрузки.

source: Therefore taking a backup is a matter of ensuring that any given replica is up to date, and doing a cold backup on it. Since all the other replicas continue to operate, this is not a cold backup from the end user’s point of view. This could be done on a regular basis, with a ``cron`` job or with a Tarantool fiber.
ru: Поэтому процесс создания резервной копии сводится к обновлению (при необходимости) одной из реплик с последующим холодным резервированием. Так как все остальные реплики продолжают функционировать, с точки зрения конечного пользователя, этот процесс не является холодным резервированием. Такое резервирование можно выполнять регулярно с помощью планировщика ``cron`` или файбера Tarantool'а.

source: Continuous backup (memtx)
ru: Непрерывное резервирование

source: The logged changes done since the last cold backup must be secured, while the system is running.
ru: По ходу работы системы необходимо сохранять записи об изменениях, внесенных со времени последнего холодного резервирования.

source: For this purpose, you need a file copy utility that will do the copying remotely and continuously, copying only the parts of a write ahead log file that are changing. One such utility is `rsync <https://en.wikipedia.org/wiki/Rsync>`_.
ru: Для этого нужна специальная утилита для копирования файлов (например, `rsync <https://en.wikipedia.org/wiki/rsync>`_), которая позволит удаленно и на постоянной основе копировать только изменившиеся части WAL-файла, а не весь файл целиком.

source: Alternatively, you need an ordinary file copy utility, but there should be frequent production of new snapshot files or new WAL files as changes occur, so that only the new files need to be copied.
ru: Можно взять и обычную утилиту для копирования целых файлов, но тогда придется создавать файлы-снимки и WAL-файлы на каждое изменение, чтобы нужно было копировать только новые файлы.

source: Bug reports
ru: Сообщения об ошибках

source: If you found a bug in Tarantool, you’re doing us a favor by taking the time to tell us about it.
ru: Если вы нашли ошибку в Tarantool, вы окажете нам услугу, сообщив о ней.

source: Please create an issue at Tarantool repository at GitHub. We encourage you to include the following information:
ru: Пожалуйста, откройте тикет в репозитории Tarantool на GitHub. Рекомендуем включить следующую информацию:

source: Steps needed to reproduce the bug, and an explanation why this differs from the expected behavior according to our manual. Please provide specific unique information. For example, instead of "I can’t get certain information", say "box.space.x:delete() didn’t report what was deleted".
ru: Шаги для воспроизведения ошибки с объяснением того, как ошибочное поведение отличается от описанного в документации ожидаемого поведения. Пожалуйста, указывайте как можно более конкретную информацию. Например, вместо "Я не могу получить определенную информацию" лучше написать "box.space.x:delete() не указывает, что именно было удалено".

source: Your operating system name and version, the Tarantool name and version, and any unusual details about your machine and its configuration.
ru: Название и версию вашей операционной системы, название и версию Tarantool и любую информацию об особенностях вашей машины и ее конфигурации.

source: Related files like a :ref:`stack trace <admin-stack_traces>` or a Tarantool :ref:`log file <admin-logs>`.
ru: Сопутствующие файлы -- такие как :ref:`трассировка стека <admin-stack_traces>` или :ref:`файл журнала <admin-logs>` Tarantool'а.

source: If this is a feature request or if it affects a special category of users, be sure to mention that.
ru: Если это запрос новой функции или это затрагивает определенную группу пользователей, не забудьте это указать.

source: Usually within one or two workdays a Tarantool team member will write an acknowledgment, or some questions, or suggestions for a workaround.
ru: Обычно член команды Tarantool отвечает в течение одного-двух рабочих дней, чтобы подтвердить, что тикет взят в работу, задать уточняющие вопросы или предложить альтернативное решение описанной проблемы.

source: Daemon supervision
ru: Контроль за фоновыми программами

source: Server signals
ru: Сигналы от сервера

source: Tarantool processes these signals during the event loop in the transaction processor thread:
ru: Во время событийного цикла в потоке обработки транзакций Tarantool обрабатывает следующие сигналы:

source: Signal
ru: Сигнал

source: Effect
ru: Эффект

source: May cause log file rotation. See the :ref:`example <cfg_logging-logging_example>` in reference on Tarantool logging parameters.
ru: Может привести к ротации журналов, см. :ref:`пример <cfg_logging-logging_example>` в справочнике по параметрам журналирования Tarantool'а.

source: May cause a database checkpoint. See :ref:`box.snapshot <box-snapshot>`.
ru: Может привести к созданию снимка состояния базы данных, см. описание функции :ref:`box.snapshot <box-snapshot>`.

source: May cause graceful shutdown (information will be saved first).
ru: Может привести к корректному завершению работы (с предварительным сохранением всех данных).

source: SIGINT (also known as keyboard interrupt)
ru: SIGINT (или "прерывание от клавиатуры")

source: May cause graceful shutdown.
ru: Может привести к корректному завершению работы.

source: Causes an immediate shutdown.
ru: Приводит к аварийному завершению работы.

source: Other signals will result in behavior defined by the operating system. Signals other than SIGKILL may be ignored, especially if Tarantool is executing a long-running procedure which prevents return to the event loop in the transaction processor thread.
ru: Остальные сигналы приводят к заданному операционной системой поведению. Все сигналы, за исключением SIGKILL, можно игнорировать, особенно если Tarantool выполняет длительную процедуру и не может вернуться в событийный цикл в потоке обработки транзакций.

source: Automatic instance restart
ru: Автоматическая перезагрузка экземпляра

source: On ``systemd``-enabled platforms, ``systemd`` automatically restarts all Tarantool instances in case of failure. To demonstrate it, let’s try to destroy an instance:
ru: На платформах, где доступна утилита ``systemd``, ``systemd`` автоматически перезагружает все экземпляры Tarantool'а при сбое. Чтобы продемонстрировать это, отключим один из экземпляров:

source: Now let’s make sure that ``systemd`` has restarted the instance:
ru: А теперь убедимся, что ``systemd`` перезапустила его:

source: Finally, let’s check the boot logs:
ru: И под конец проверим содержимое журнала загрузки:

source: $ journalctl -u tarantool@my_app -n 8 -- Logs begin at Fri 2016-01-08 12:21:53 MSK, end at Thu 2016-01-21 21:09:45 MSK. -- Jan 21 21:09:45 localhost.localdomain systemd[1]: tarantool@my_app.service: Unit entered failed state. Jan 21 21:09:45 localhost.localdomain systemd[1]: tarantool@my_app.service: Failed with result 'exit-code'. Jan 21 21:09:45 localhost.localdomain systemd[1]: tarantool@my_app.service: Service hold-off time over, scheduling restart. Jan 21 21:09:45 localhost.localdomain systemd[1]: Stopped Tarantool Database Server. Jan 21 21:09:45 localhost.localdomain systemd[1]: Starting Tarantool Database Server... Jan 21 21:09:45 localhost.localdomain tarantoolctl[5910]: /usr/bin/tarantoolctl: Found my_app.lua in /etc/tarantool/instances.available Jan 21 21:09:45 localhost.localdomain tarantoolctl[5910]: /usr/bin/tarantoolctl: Starting instance... Jan 21 21:09:45 localhost.localdomain systemd[1]: Started Tarantool Database Server.
ru: $ journalctl -u tarantool@my_app -n 8 -- Записи начинаются в пятницу 08.01.2016 12:21:53 MSK, заканчиваются в четверг 21.01.2016 2016-01-21 21:09:45 MSK. -- Jan 21 21:09:45 localhost.localdomain systemd[1]: tarantool@my_app.service: Unit entered failed state. Jan 21 21:09:45 localhost.localdomain systemd[1]: tarantool@my_app.service: Failed with result 'exit-code'. Jan 21 21:09:45 localhost.localdomain systemd[1]: tarantool@my_app.service: Service hold-off time over, scheduling restart. Jan 21 21:09:45 localhost.localdomain systemd[1]: Stopped Tarantool Database Server. Jan 21 21:09:45 localhost.localdomain systemd[1]: Starting Tarantool Database Server... Jan 21 21:09:45 localhost.localdomain tarantoolctl[5910]: /usr/bin/tarantoolctl: Found my_app.lua in /etc/tarantool/instances.available Jan 21 21:09:45 localhost.localdomain tarantoolctl[5910]: /usr/bin/tarantoolctl: Starting instance... Jan 21 21:09:45 localhost.localdomain systemd[1]: Started Tarantool Database Server.

source: Core dumps
ru: Создание дампов памяти

source: Tarantool makes a core dump if it receives any of the following signals: SIGSEGV, SIGFPE, SIGABRT or SIGQUIT. This is automatic if Tarantool crashes.
ru: Tarantool создает дамп памяти при получении одного из следующих сигналов: SIGSEGV, SIGFPE, SIGABRT или SIGQUIT. При сбое Tarantool'а дамп создается автоматически.

source: On ``systemd``-enabled platforms, ``coredumpctl`` automatically saves core dumps and stack traces in case of a crash. Here is a general "how to" for how to enable core dumps on a Unix system:
ru: На платформах, где доступна утилита ``systemd``, ``coredumpctl`` автоматически сохраняет дампы памяти и трассировку стека при аварийном завершении Tarantool-сервера. Вот как включить создание дампов памяти в Unix-системе:

source: Ensure session limits are configured to enable core dumps, i.e. say ``ulimit -c unlimited``. Check "man 5 core" for other reasons why a core dump may not be produced.
ru: Убедитесь, что лимиты для сессии установлены таким образом, чтобы можно было создавать дампы памяти, -- выполните команду ``ulimit -c unlimited``. Также проверьте "man 5 core" на другие причины, по которым дамп памяти может не создаваться.

source: Set a directory for writing core dumps to, and make sure that the directory is writable. On Linux, the directory path is set in a kernel parameter configurable via ``/proc/sys/kernel/core_pattern``.
ru: Создайте директорию для записи дампов памяти и убедитесь, что в эту директорию действительно можно производить запись. На Linux путь до директории задается в параметре ядра, который настраивается через ``/proc/sys/kernel/core_pattern``.

source: Make sure that core dumps include stack trace information. If you use a binary Tarantool distribution, this is automatic. If you build Tarantool from source, you will not get detailed information if you pass ``-DCMAKE_BUILD_TYPE=Release`` to CMake.
ru: Убедитесь, что дампы памяти включают трассировку стека. При использовании бинарного дистрибутива Tarantool'а эта информация включается автоматически. При сборке Tarantool'а из исходников, если передать CMake флаг ``-DCMAKE_BUILD_TYPE=Release``, вы не получите подробной информации.

source: To simulate a crash, you can execute an illegal command against a Tarantool instance:
ru: Для симуляции сбоя можно попытаться выполнить нелегальную команду на работающем экземпляре Tarantool'а:

source: $ # !!! please never do this on a production system !!! $ tarantoolctl enter my_app unix/:/var/run/tarantool/my_app.control> require('ffi').cast('char *', 0)[0] = 48 /bin/tarantoolctl: unix/:/var/run/tarantool/my_app.control: Remote host closed connection
ru: $ # !!! пожалуйста, никогда не делайте этого на боевом сервере !!! $ tarantoolctl enter my_app unix/:/var/run/tarantool/my_app.control> require('ffi').cast('char *', 0)[0] = 48 /bin/tarantoolctl: unix/:/var/run/tarantool/my_app.control: Remote host closed connection

source: Alternatively, if you know the process ID of the instance (here we refer to it as $PID), you can abort a Tarantool instance by running ``gdb`` debugger:
ru: Есть другой способ: если вы знаете PID экземпляра ($PID в нашем примере), можно остановить этот экземпляр, запустив отладчик ``gdb``:

source: or manually sending a SIGABRT signal:
ru: или послав вручную сигнал SIGABRT:

source: To find out the process id of the instance ($PID), you can:
ru: Чтобы узнать PID экземпляра, можно:

source: look it up in the instance's :ref:`box.info.pid <box_introspection-box_info>`,
ru: посмотреть его с помощью :ref:`box.info.pid <box_introspection-box_info>`,

source: find it with ``ps -A | grep tarantool``, or
ru: использовать команду ``ps -A | grep tarantool``, или

source: say ``systemctl status tarantool@my_app|grep PID``.
ru: выполнить ``systemctl status tarantool@my_app|grep PID``.

source: On a ``systemd-enabled`` system, to see the latest crashes of the Tarantool daemon, say:
ru: Чтобы посмотреть на последние сбои Tarantool-демона на платформах, где доступна утилита ``systemd``, выполните команду:

source: To save a core dump into a file, say:
ru: Чтобы сохранить дамп памяти в файл, выполните команду:

source: Stack traces
ru: Трассировка стека

source: Since Tarantool stores tuples in memory, core files may be large. For investigation, you normally don't need the whole file, but only a "stack trace" or "backtrace".
ru: Так как Tarantool хранит кортежи в памяти, файлы с дампами памяти могут быть довольно большими. Чтобы найти проблему, обычно целый файл не нужен -- достаточно только "трассировки стека" или "обратной трассировки".

source: To save a stack trace into a file, say:
ru: Чтобы сохранить трассировку стека в файл, выполните команду:

source: where:
ru: где:

source: "tarantool" is the path to the Tarantool executable,
ru: "tarantool" -- это путь до исполняемого файла Tarantool'а,

source: "core" is the path to the core file, and
ru: "core" -- это путь до файла с дампом памяти, и

source: "/tmp/tarantool_trace.txt" is a sample path to a file for saving the stack trace.
ru: "/tmp/tarantool_trace.txt" -- это пример пути до файла, в который сохраняется трассировка стека.

source: Occasionally, you may find that the trace file contains output without debug symbols – the lines will contain ”??” instead of names. If this happens, check the instructions on these Tarantool wiki pages: `How to debug core dump of stripped tarantool <https://github.com/tarantool/tarantool/wiki/How-to-debug-core-dump-of-stripped-tarantool>`_ and `How to debug core from different OS <https://github.com/tarantool/tarantool/wiki/How-to-debug-core-from-different-OS>`_.
ru: Иногда может оказаться, что файл с трассировкой стека не содержит отладочных символов -- в таких строках вместо имени будет стоять ”??”. Если это произошло, ознакомьтесь с инструкциями на этих двух wiki-страницах Tarantool'а: `How to debug core dump of stripped tarantool <https://github.com/tarantool/tarantool/wiki/How-to-debug-core-dump-of- stripped-tarantool>`_ и `How to debug core from different OS <https://github.com/tarantool/tarantool/wiki/How-to-debug-core-from- different-OS>`_.

source: To see the stack trace and other useful information in console, say:
ru: Чтобы получить трассировку стека и прочую полезную информацию в консоли, выполните команду:

source: Debugger
ru: Отладчик

source: To start ``gdb`` debugger on the core dump, say:
ru: Для запуска отладчика ``gdb``, выполните команду:

source: It is highly recommended to install ``tarantool-debuginfo`` package to improve ``gdb`` experience, for example:
ru: Мы очень рекомендуем установить пакет ``tarantool-debuginfo``, чтобы сделать отладку средствами ``gdb`` более эффективной. Например:

source: ``gdb`` also provides information about the debuginfo packages you need to install:
ru: С помощью ``gdb`` можно узнать, какие еще ``debuginfo``-пакеты нужно установить:

source: Symbolic names are present in stack traces even if you don’t have ``tarantool-debuginfo`` package installed.
ru: В трассировке стека присутствуют символические имена, даже если у вас не установлен пакет ``tarantool-debuginfo``.

source: Disaster recovery
ru: Аварийное восстановление

source: The minimal fault-tolerant Tarantool configuration would be a :ref:`replication cluster<replication-topologies>` that includes a master and a replica, or two masters.
ru: Минимальная отказоустойчивая конфигурация Tarantool'а -- это :ref:`репликационный кластер <replication-topologies>`, содержащий мастер и реплику или два мастера.

source: The basic recommendation is to configure all Tarantool instances in a cluster to create :ref:`snapshot files <index-box_persistence>` at a regular basis.
ru: Основная рекомендация -- настраивать все экземпляры Tarantool'а в кластере таким образом, чтобы они регулярно создавали :ref:`файлы-снимки <index-box_persistence>`.

source: Here follow action plans for typical crash scenarios.
ru: Ниже дано несколько инструкций для типовых аварийных сценариев.

source: Master-replica
ru: Мастер-реплика

source: Configuration: One master and one replica.
ru: Конфигурация: один мастер и одна реплика.

source: Problem: The master has crashed.
ru: Проблема: мастер вышел из строя.

source: Your actions:
ru: План действий:

source: Ensure the master is stopped for good. For example, log in to the master machine and use ``systemctl stop tarantool@<instance_name>``.
ru: Убедитесь, что мастер полностью остановлен. Например, подключитесь к мастеру и используйте команду ``systemctl stop tarantool@<имя_экземпляра>``.

source: Switch the replica to master mode by setting :ref:`box.cfg.read_only <cfg_basic-read_only>` parameter to *false* and let the load be handled by the replica (effective master).
ru: Переключите реплику в режим мастера, установив параметру :ref:`box.cfg.read_only <cfg_basic-read_only>` значение *false*. Теперь вся нагрузка пойдет только на реплику (по сути ставшую мастером).

source: Set up a replacement for the crashed master on a spare host, with :ref:`replication <cfg_replication-replication>` parameter set to replica (effective master), so it begins to catch up with the new master’s state. The new instance should have :ref:`box.cfg.read_only <cfg_basic-read_only>` parameter set to *true*.
ru: Настройте на свободной машине замену вышедшему из строя мастеру, установив параметру :ref:`replication <cfg_replication-replication>` в качестве значения URI реплики (которая в данный момент выполняет роль мастера), чтобы новая реплика начала синхронизироваться с текущим мастером. Значение параметра :ref:`box.cfg.read_only <cfg_basic-read_only>` в новом экземпляре должно быть установлено на *true*.

source: You lose the few transactions in the master :ref:`write ahead log file <index-box_persistence>`, which it may have not transferred to the replica before crash. If you were able to salvage the master .xlog file, you may be able to recover these. In order to do it:
ru: Все немногочисленные транзакции в :ref:`WAL-файле <index-box_persistence>` мастера, которые он не успел передать реплике до выхода из строя, будут потеряны. Однако если удастся получить .xlog-файл мастера, их можно будет восстановить. Для этого:

source: Find out the position of the crashed master, as reflected on the new master.
ru: Узнайте позицию вышедшего из строя мастера -- эта информация доступна из нового мастера.

source: Find out instance UUID from the crashed master :ref:`xlog <internals-wal>`:
ru: Посмотрите UUID экземпляра в :ref:`xlog-файле <internals-wal>` вышедшего из строя мастера:

source: On the new master, use the UUID to find the position:
ru: Используйте этот UUID на новом мастере для поиска позиции:

source: Play the records from the crashed .xlog to the new master, starting from the new master position:
ru: Запишите транзакции из .xlog-файла вышедшего из строя мастера в новый мастер, начиная с позиции нового мастера:

source: Issue this request locally at the new master's machine to find out instance ID of the new master:
ru: Локально выполните эту команду на новом мастере, чтобы узнать его ID экземпляра:

source: Play the records to the new master:
ru: Запишите транзакции в новый мастер:

source: $ tarantoolctl <new_master_uri> <xlog_file> play --from-lsn 23425 --replica 1
ru: $ tarantoolctl <uri_нового_мастера> <xlog_файл> play --from-lsn 23425 --replica 1

source: Master-master
ru: Мастер-мастер

source: Configuration: Two masters.
ru: Конфигурация: два мастера.

source: Problem: Master#1 has crashed.
ru: Проблема: мастер #1 вышел из строя.

source: Let the load be handled by master#2 (effective master) alone.
ru: Пусть вся нагрузка идет только на мастер #2 (действующий мастер).

source: 2. Follow the same steps as in the :ref:`master-replica <admin-disaster_recovery-master_replica>` recovery scenario to create a new master and salvage lost data.
ru: 2. Создайте новый мастер и восстановите данные, проделав те же шаги, что и в сценарии для конфигурации :ref:`мастер-реплика <admin-disaster_recovery-master_replica>`.

source: Data loss
ru: Потеря данных

source: Configuration: Master-master or master-replica.
ru: Конфигурация: мастер-мастер или мастер-реплика.

source: Problem: Data was deleted at one master and this data loss was propagated to the other node (master or replica).
ru: Проблема: данные были удалены на одном мастере, а затем эти изменения реплицировались на другом узле (мастере или реплике).

source: The following steps are applicable only to data in memtx storage engine. Your actions:
ru: Эта инструкция применима только для данных, хранящихся на движке memtx. План действий:
