Repository: tarantool/doc
Catalog: locale/*/LC_MESSAGES/doc.po
Languages: ru

source: Generate and return the next value
ru: Генерация и возврат следующего значения

source: Change sequence options
ru: Изменение параметров последовательности

source: Reset sequence state
ru: Сброс состояния последовательности

source: Set the new value
ru: Установка нового значения

source: Drop the sequence
ru: Удаление последовательности

source: Create an index
ru: Создание индекса

source: Create a :ref:`space <index-box_space>`.
ru: Создание :ref:`спейса <index-box_space>`.

source: see "Options for box.schema.space.create" chart, below
ru: см. таблицу "Параметры для box.schema.space.create" ниже

source: space object
ru: объект спейса

source: userdata
ru: пользовательские данные

source: **Options for box.schema.space.create**
ru: **Параметры для box.schema.space.create**

source: Default
ru: Значение по умолчанию

source: engine
ru: engine (движок)

source: 'memtx' or 'vinyl'
ru: 'memtx' или 'vinyl'

source: string
ru: string (строка)

source: field_count
ru: field_count (количество полей)

source: fixed count of :ref:`fields <index-box_tuple>`: for example if field_count=5, it is illegal to insert a tuple with fewer than or more than 5 fields
ru: заданное количество :ref:`полей <index-box_tuple>`: например, если field_count=5, нельзя вставить кортеж с количеством полей, большим или меньшим, чем 5

source: 0 i.e. not fixed
ru: 0, то есть не задано

source: format
ru: format (формат)

source: field names and types: See the illustrations of format clauses in the :ref:`space_object:format() <box_space-format>` description and in the :ref:`box.space._space <box_space-space>` example. Optional and usually not specified.
ru: имена и типы полей: см. наглядные примеры операторов в описании :ref:`space_object:format() <box_space-format>` и в :ref:`box.space._space <box_space-space>`. Необязательный параметр, обычно значение не указывается.

source: (blank)
ru: (пустое)

source: unique identifier: users can refer to spaces with the id instead of the name
ru: уникальный идентификатор: пользователи могут ссылаться на спейсы посредством идентификатора вместо имени

source: last space's id, +1
ru: идентификатор последнего спейса +1

source: if_not_exists
ru: if_not_exists (если отсутствует)

source: create space only if a space with the same name does not exist already, otherwise do nothing but do not cause an error
ru: спейс создается, только если спейса с таким же именем нет в базе данных, в противном случае эффект отсутствует, но ошибка не выдается

source: false
ru: false (ложь)

source: temporary
ru: temporary (временный)

source: space contents are temporary: changes are not stored in the :ref:`write-ahead log <internals-wal>` and there is no :ref:`replication <replication>`. Note re storage engine: vinyl does not support temporary spaces.
ru: содержимое спейса хранится временно: изменения не хранятся в :ref:`журнале упреждающей записи <internals-wal>`, и не проводится :ref:`репликация <replication>`. Примечание по движку базы данных: vinyl не поддерживает временные спейсы.

source: user
ru: user (пользователь)

source: name of the user who is considered to be the space's :ref:`owner <authentication-owners_privileges>` for authorization purposes
ru: имя пользователя, который считается :ref:`владельцем <authentication-owners_privileges>` спейса, для целей авторизации

source: current user's name
ru: имя текущего пользователя

source: There are three :ref:`syntax variations <app_server-object_reference>` for object references targeting space objects, for example :samp:`box.schema.space.drop({space-id})` will drop a space. However, the common approach is to use functions attached to the space objects, for example :ref:`space_object:drop() <box_space-drop>`.
ru: Существуют три :ref:`варианта синтаксиса <app_server-object_reference>` для ссылок на объекты спейса, например, :samp:`box.schema.space.drop({id-спейса})` удалит спейс. Однако общий подход заключается в использовании функций, прикрепленных к объектам спейса, например :ref:`space_object:drop() <box_space-drop>`.

source: After a space is created, usually the next step is to :ref:`create an index <box_space-create_index>` for it, and then it is available for insert, select, and all the other :ref:`box.space <box_space>` functions.
ru: Следующим шагом после создания спейса будет :ref:`создание индекса <box_space-create_index>` для него, после чего можно будет выполнять вставку, выборку и другие функции :ref:`box.space <box_space>`.

source: Create a user. For explanation of how Tarantool maintains user data, see section :ref:`Users<authentication-users>` and reference on :ref:`_user <box_space-user>` space.
ru: Создание пользователя. Чтобы получить информацию о том, как происходит управление данными пользователя в Tarantool'е, см. раздел :ref:`Пользователи <authentication-users>` и справочник по спейсу :ref:`_user <box_space-user>`.

source: The possible options are:
ru: Возможные параметры:

source: ``if_not_exists`` = ``true|false`` (default = ``false``) - boolean; ``true`` means there should be no error if the user already exists,
ru: ``if_not_exists`` (если отсутствует) = ``true|false`` (правда/ложь, по умолчанию ложь) - логическое значение boolean; ``true`` (правда) означает, что ошибка не выпадет, если пользователь уже существует,

source: ``password`` (default = '') - string; the ``password`` = *password* specification is good because in a :ref:`URI <index-uri>` (Uniform Resource Identifier) it is usually illegal to include a user-name without a password.
ru: ``password`` (пароль) -- строка; указать ``password`` = *password* неплохо, поскольку в :ref:`URI <index-uri>` (унифицированный идентификатор ресурса) обычно нельзя включать имя пользователя без пароля.

source: The maximum number of users is 32.
ru: Максимальное количество пользователей -- 32.

source: **Examples:**
ru: **Примеры:**

source: Drop a user. For explanation of how Tarantool maintains user data, see section :ref:`Users <authentication-users>` and reference on :ref:`_user <box_space-user>` space.
ru: Удаление пользователя. Чтобы получить информацию о том, как происходит управление данными пользователя в Tarantool'е, см. раздел :ref:`Пользователи <authentication-users>` и справочник по спейсу :ref:`_user <box_space-user>`.

source: the name of the user
ru: имя пользователя

source: ``if_exists`` = ``true|false`` (default = ``false``) - boolean; ``true`` means there should be no error if the user does not exist.
ru: ``if_exists`` (если существует) = ``true|false`` (правда/ложь, по умолчанию ложь) - логическое значение boolean; ``true`` (правда) означает, что ошибка не выпадет, если такой пользователь не существует,

source: Return ``true`` if a user exists; return ``false`` if a user does not exist. For explanation of how Tarantool maintains user data, see section :ref:`Users <authentication-users>` and reference on :ref:`_user <box_space-user>` space.
ru: Возврат ``true`` (правда), если пользователь существует; возврат ``false`` (ложь), если пользователь отсутствует. Чтобы получить информацию о том, как происходит управление данными пользователя в Tarantool'е, см. раздел :ref:`Пользователи <authentication-users>` и справочник по спейсу :ref:`_user <box_space-user>`.

source: bool
ru: логическое значение bool

source: Grant :ref:`privileges <authentication-owners_privileges>` to a user or to another role.
ru: Выдача :ref:`прав <authentication-owners_privileges>` пользователю или другой роли.

source: the name of the user.
ru: имя пользователя.

source: 'read' or 'write' or 'execute' or 'create' or 'alter' or 'drop' or a combination.
ru: 'read' (чтение) или 'write' (запись), или 'execute' (выполнение), или 'create' (создание), или 'alter' (изменение), или 'drop' (удаление) или их сочетание.

source: 'space' or 'function' or 'sequence'.
ru: 'space' (спейс) или 'function' (функция), или 'sequence' (последовательность).

source: name of object to grant permissions to.
ru: имя объекта, на который выдаются права.

source: name of role to grant to user.
ru: имя роли, которая назначается пользователю.

source: If :samp:`'function','{object-name}'` is specified, then a _func tuple with that object-name must exist.
ru: Если есть :samp:`'function','{имя-объекта}'`, то должен существовать кортеж в _func с таким именем объекта.

source: **Variation:** instead of ``object-type, object-name`` say 'universe' which means 'all object-types and all objects'. In this case, object name is omitted.
ru: **Вариант:** вместо ``object-type, object-name`` введите 'universe', что означает 'все типы объектов и все объекты'. В таком случае имя объекта опускается.

source: **Variation:** instead of ``privilege, object-type, object-name`` say ``role-name`` (see section :ref:`Roles <authentication-roles>`).
ru: **Вариант:** вместо ``privilege, object-type, object-name`` введите ``role-name`` (имя роли) (см. раздел :ref:`Роли <authentication-roles>`).

source: ``grantor`` = *grantor_name_or_id* -- string or number, for custom grantor,
ru: ``grantor`` = *grantor_name_or_id* -- строка или номер для заданного пользователя, выдающего права,

source: ``if_not_exists`` = ``true|false`` (default = ``false``) - boolean; ``true`` means there should be no error if the user already has the privilege.
ru: ``if_not_exists`` (если отсутствует) = ``true|false`` (правда/ложь, по умолчанию ложь) - логическое значение boolean; ``true`` (правда) означает, что ошибка не выпадет, если у пользователя уже есть права.

source: Revoke :ref:`privileges <authentication-owners_privileges>` from a user or from another role.
ru: Отмена :ref:`прав <authentication-owners_privileges>` пользователя или другой роли.

source: the name of a function or space or sequence.
ru: имя функции, спейса или последовательности.

source: The user must exist, and the object must exist, but it is not an error if the user does not have the privilege.
ru: Должен существовать пользователь, должен существовать объект, но ошибка не выпадет, если у пользователя нет прав.

source: **Variation:** instead of ``object-type, object-name`` say 'universe' which means 'all object-types and all objects'.
ru: **Вариант:** вместо ``object-type, object-name`` введите 'universe', что означает 'все типы объектов и все объекты'.

source: Return a hash of a user's password. For explanation of how Tarantool maintains passwords, see section :ref:`Passwords <authentication-passwords>` and reference on :ref:`_user <box_space-user>` space.
ru: Возврат хеша пароля пользователя. Чтобы получить информацию о том, как происходит управление паролями в Tarantool'е, см. раздел :ref:`Пароли <authentication-passwords>` и справочник по спейсу :ref:`_user <box_space-user>`.

source: If a non-'guest' user has no password, it’s **impossible** to connect to Tarantool using this user. The user is regarded as “internal” only, not usable from a remote connection. Such users can be useful if they have defined some procedures with the :ref:`SETUID <box_schema-func_create>` option, on which privileges are granted to externally-connectable users. This way, external users cannot create/drop objects, they can only invoke procedures.
ru: Если у пользователя, который не является пользователем 'guest' нет пароля, **невозможно** подключиться к Tarantool'у через этого пользователя. Пользователь считается только “внутренним”, его нельзя использовать для удаленного подключения. Такие пользователи могут работать, если они определили какие-либо процедуры с помощью :ref:`SETUID <box_schema-func_create>`, на которые есть доступ у пользователей с внешним подключением. Таким образом, внешние пользователи могут не создавать/удалять объекты, а только вызывать процедуры.

source: For the 'guest' user, it’s impossible to set a password: that would be misleading, since 'guest' is the default user on a newly-established connection over a :ref:`binary port <admin-security>`, and Tarantool does not require a password to establish a :ref:`binary connection <box_protocol-iproto_protocol>`. It is, however, possible to change the current user to ‘guest’ by providing the :ref:`AUTH packet <box_protocol-authentication>` with no password at all or an empty password. This feature is useful for connection pools, which want to reuse a connection for a different user without re-establishing it.
ru: Для пользователя 'guest' невозможно установить пароль: это бы привело к путанице, поскольку 'guest' является пользователем по умолчанию для любого установленного подключения по :ref:`бинарному порту <admin-security>`, а Tarantool не требует пароль при установке :ref:`бинарного подключения <box_protocol-iproto_protocol>`. Тем не менее, можно сменить текущего пользователя на пользователя ‘guest’, предоставив :ref:`AUTH-пакет <box_protocol-authentication>` (пакет авторизации) без пароля или с пустым паролем. Данная функция полезна для пулов соединений, которые хотят повторно использовать соединение для другого пользователя без повторного подключения.

source: password to be hashed
ru: пароль для хеширования

source: Associate a password with the user who is currently logged in, or with the user specified by user-name. The user must exist and must not be 'guest'.
ru: Ассоциация пароля с авторизованным пользователем или с указанным именем пользователя. Такой пользователь должен существовать и не быть пользователем 'guest'.

source: Users who wish to change their own passwords should use ``box.schema.user.passwd(password)`` syntax.
ru: Если пользователь хочет поменять свой пароль, ему следует использовать синтаксис ``box.schema.user.passwd(password)``.

source: Administrators who wish to change passwords of other users should use ``box.schema.user.passwd(user-name, password)`` syntax.
ru: Если администратор хочет поменять пароль других пользователей, ему следует использовать синтаксис ``box.schema.user.passwd(user-name, password)``.

source: user-name
ru: имя пользователя

source: password
ru: пароль

source: Return a description of a user's :ref:`privileges <authentication-owners_privileges>`. For explanation of how Tarantool maintains user data, see section :ref:`Users <authentication-users>` and reference on :ref:`_user <box_space-user>` space.
ru: Возврат описания :ref:`прав <authentication-owners_privileges>` пользователя. Чтобы получить информацию о том, как происходит управление данными пользователя в Tarantool'е, см. раздел :ref:`Пользователи <authentication-users>` и справочник по спейсу :ref:`_user <box_space-user>`.

source: the name of the user. This is optional; if it is not supplied, then the information will be for the user who is currently logged in.
ru: имя пользователя. Необязательный параметр; если не указать, информация будет для авторизованного пользователя.

source: Create a role. For explanation of how Tarantool maintains role data, see section :ref:`Roles <authentication-roles>`.
ru: Создание роли. Чтобы получить информацию о том, как происходит управление данными о ролях в Tarantool'е, см. раздел :ref:`Роли <authentication-roles>`.

source: ``if_not_exists`` = ``true|false`` (default = ``false``) - boolean; ``true`` means there should be no error if the role already exists
ru: ``if_not_exists`` (если отсутствует) = ``true|false`` (правда/ложь, по умолчанию ложь) - логическое значение boolean; ``true`` (правда) означает, что ошибка не выпадет, если роль уже существует,

source: Drop a role. For explanation of how Tarantool maintains role data, see section :ref:`Roles <authentication-roles>`.
ru: Удаление роли. Чтобы получить информацию о том, как происходит управление данными о ролях в Tarantool'е, см. раздел :ref:`Роли <authentication-roles>`.

source: the name of the role
ru: имя роли

source: ``if_exists`` = ``true|false`` (default = ``false``) - boolean; ``true`` means there should be no error if the role does not exist.
ru: ``if_exists`` (если существует) = ``true|false`` (правда/ложь, по умолчанию ложь) - логическое значение boolean; ``true`` (правда) означает, что ошибка не выпадет, если такая роль не существует,

source: Return ``true`` if a role exists; return ``false`` if a role does not exist.
ru: Возврат ``true`` (правда), если роль существует; возврат ``false`` (ложь), если роль отсутствует.

source: Grant :ref:`privileges <authentication-owners_privileges>` to a role.
ru: Выдача :ref:`прав <authentication-owners_privileges>` роли.

source: the name of the role.
ru: имя роли.

source: ``if_not_exists`` = ``true|false`` (default = ``false``) - boolean; ``true`` means there should be no error if the role already has the privilege.
ru: ``if_not_exists`` (если отсутствует) = ``true|false`` (правда/ложь, по умолчанию ложь) - логическое значение boolean; ``true`` (правда) означает, что ошибка не выпадет, если у роли уже есть права.

source: The role must exist, and the object must exist.
ru: Должна существовать роль, должен существовать объект.

source: **Variation:** instead of ``privilege, object-type, object-name`` say ``role-name`` -- to grant a role to a role.
ru: **Вариант:** вместо ``privilege, object-type, object-name`` введите ``role-name``, чтобы назначить роль для роли.

source: Revoke :ref:`privileges <authentication-owners_privileges>` from a role.
ru: Отмена :ref:`прав <authentication-owners_privileges>` роли.

source: The role must exist, and the object must exist, but it is not an error if the role does not have the privilege.
ru: Должна существовать роль, должен существовать объект, но ошибка не выпадет, если у роли нет прав.

source: **Variation:** instead of ``privilege, object-type, object-name`` say ``role-name``.
ru: **Вариант:** вместо ``privilege, object-type, object-name`` введите ``role-name`.

source: Return a description of a role's privileges.
ru: Возврат описания прав роли.

source: Create a function :ref:`tuple <index-box_tuple>`. This does not create the function itself -- that is done with Lua -- but if it is necessary to grant privileges for a function, box.schema.func.create must be done first. For explanation of how Tarantool maintains function data, see reference on :ref:`_func <box_space-func>` space.
ru: Создание :ref:`кортежа <index-box_tuple>` с функцией. Сама функция не создается -- это делается с помощью Lua -- но если необходимо выдать права функции, следует сначала выполнить box.schema.func.create. Чтобы получить информацию о том, как происходит управление данными функций в Tarantool'е, см. справочник по спейсу :ref:`_func <box_space-func>`.

source: ``if_not_exists`` = ``true|false`` (default = ``false``) - boolean; ``true`` means there should be no error if the ``_func`` tuple already exists.
ru: ``if_not_exists`` (если отсутствует) = ``true|false`` (правда/ложь, по умолчанию ложь) - логическое значение boolean; ``true`` (правда) означает, что ошибка не выпадет, если кортеж в ``_func`` уже существует.

source: ``setuid`` = ``true|false`` (default = false) - with ``true`` to make Tarantool treat the function’s caller as the function’s creator, with full privileges. Remember that SETUID works only over :ref:`binary ports <admin-security>`. SETUID doesn't work if you invoke a function via an :ref:`admin console <admin-security>` or inside a Lua script.
ru: ``setuid`` = ``true|false`` (по умолчанию, false) -- значение ``true`` (правда) заставит Tarantool рассматривать пользователя, вызвавшего функцию, в качестве владельца функции с полными правами. Следует помнить, что SETUID работает только по :ref:`бинарным портам <admin-security>`. SETUID не сработает, если вызвать функцию через :ref:`административную консоль <admin-security>` или в Lua-скрипте.

source: ``language`` = 'LUA'|'C' (default = ‘LUA’).
ru: ``language`` = 'LUA'|'C' (выбор языка из Lua и C; по умолчанию, ‘LUA’).

source: Drop a function tuple. For explanation of how Tarantool maintains function data, see reference on :ref:`_func space <box_space-func>`.
ru: Удаление кортежа с функцией. Чтобы получить информацию о том, как происходит управление данными функций в Tarantool'е, см. справочник по спейсу :ref:`_func <box_space-func>`.

source: the name of the function
ru: имя функции

source: ``if_exists`` = ``true|false`` (default = ``false``) - boolean; ``true`` means there should be no error if the _func tuple does not exist.
ru: ``if_exists`` (если существует) = ``true|false`` (правда/ложь, по умолчанию ложь) - логическое значение boolean; ``true`` (правда) означает, что ошибка не выпадет, если кортеж в _func не существует.

source: Return true if a function tuple exists; return false if a function tuple does not exist.
ru: Возврат true (правда), если кортеж с функцией существует; возврат false (ложь), если кортеж с функцией отсутствует.

source: Reload a C module with all its functions without restarting the server.
ru: Перезагрузка модуля на C (со всеми его функциями) без перезапуска сервера.

source: Under the hood, Tarantool loads a new copy of the module (``*.so`` shared library) and starts routing all new request to the new version. The previous version remains active until all started calls are finished. All shared libraries are loaded with ``RTLD_LOCAL`` (see "man 3 dlopen"), therefore multiple copies can co-exist without any problems.
ru: С точки зрения внутреннего устройства, Tarantool загружает новую копию модуля (библиотека общего пользования ``*.so``) и запускает маршрутизацию всех новых запросов на новую версию. Предыдущая версия остается активной до тех пор, пока не завершатся все начатые вызовы. Все библиотеки общего пользования загружены с ``RTLD_LOCAL`` (см. "man 3 dlopen"), таким образом, множество копий могут работать одновременно без каких-либо проблем.

source: Reload will fail if a module was loaded from Lua script with `ffi.load() <http://luajit.org/ext_ffi_api.html#ffi_load>`_.
ru: Перезагрузка не сработает, если модуль был загружен из Lua-скрипта с `ffi.load() <http://luajit.org/ext_ffi_api.html#ffi_load>`_.

source: the name of the module to reload
ru: имя модуля для перезагрузки

source: -- reload the entire module contents box.schema.func.reload('module')
ru: -- перегрузить целиком всё содержимое модуля box.schema.func.reload('module')

source: Sequences
ru: Последовательности

source: An introduction to sequences is in the :ref:`Sequences <index-box_sequence>` section of the "Data model" chapter. Here are the details for each function and option.
ru: Вводная информация о последовательностях дается в разделе :ref:`Последовательности <index-box_sequence>` главы "Модель данных". Здесь же приведена подробная информация о каждой функции и каждом параметре.

source: Create a new sequence generator.
ru: Создание нового генератора последовательностей.

source: the name of the sequence
ru: имя последовательности

source: see a quick overview in the "Options for ``box.schema.sequence.create()``" :ref:`chart <index-box_sequence-options>` (in the :ref:`Sequences <index-box_sequence>` section of the "Data model" chapter), and see more details below.
ru: см. краткий обзор в :ref:`таблице <index-box_sequence-options>` "Параметры для ``box.schema.sequence.create()``" (в разделе :ref:`Последовательности <index-box_sequence>` главы "Модель данных"), а более подробную информацию ниже.

source: a reference to a new sequence object.
ru: ссылка на новый объект последовательности.

source: Options:
ru: Параметры:

source: ``start`` -- the STARTS WITH value. Type = integer, Default = 1.
ru: ``start`` -- НАЧАЛЬНОЕ значение. Тип = целое число, по умолчанию = 1.

source: ``min`` -- the MINIMUM value. Type = integer, Default = 1.
ru: ``min`` -- МИНИМАЛЬНОЕ значение. Тип = целое число, по умолчанию = 1.

source: ``max`` - the MAXIMUM value. Type = integer, Default = 9223372036854775807.
ru: ``max`` --МАКСИМАЛЬНОЕ значение. Тип = целое число, по умолчанию = 9223372036854775807.
