Repository: tarantool/doc
Catalog: locale/*/LC_MESSAGES/doc.po
Languages: ru

source: See also :ref:`box.session.storage <box_session-storage>`.
ru: См. также :ref:`box.session.storage <box_session-storage>`.

source: current system time (in seconds since the epoch) as a Lua number. The time is taken from the event loop clock, which makes this call very cheap, but still useful for constructing artificial tuple keys.
ru: текущее системное время (в секундах с начала отсчета) в виде Lua-числа. Время берется из часов событийного цикла, поэтому вызов полезен лишь для создания искусственных ключей кортежа.

source: current system time (in microseconds since the epoch) as a 64-bit integer. The time is taken from the event loop clock.
ru: текущее системное время (в микросекундах с начала отсчета) в виде 64-битного целого числа. Время берется из часов событийного цикла.

source: Make the function which will be associated with the fiber. This function contains an infinite loop (``while 0 == 0`` is always true). Each iteration of the loop adds 1 to a global variable named gvar, then goes to sleep for 2 seconds. The sleep causes an implicit :ref:`fiber.yield() <fiber-yield>`.
ru: Создание функции, которая будет связана с файбером. Такая функция содержит бесконечный цикл (``while 0 == 0`` всегда будет правдой). Каждая итерация цикла прибавляет 1 к глобальной переменной под названием gvar, затем уходит в режим ожидания на 2 секунды. Ожидание вызывает неявную передачу управления :ref:`fiber.yield() <fiber-yield>`.

source: Make a fiber, associate function_x with the fiber, and start function_x. It will immediately "detach" so it will be running independently of the caller.
ru: Создание файбера, ассоциация функции function_x с файбером и запуск function_x. Она сразу же "отсоединится", то есть будет работать отдельно от вызывающего метода.

source: Get the id of the fiber (fid), to be used in later displays.
ru: Получение ID файбера (fid) для последующего вывода.

source: Pause for a while, while the detached function runs. Then ... Display the fiber id, the fiber status, and gvar (gvar will have gone up a bit depending how long the pause lasted). The status is suspended because the fiber spends almost all its time sleeping or yielding.
ru: Небольшая остановка, пока работает отсоединенная функция. Затем ... Отображение идентификатора файбера, статуса файбера и переменной gvar (значение gvar немного увеличится в зависимости от длительности паузы). Статус будет "suspended" (приостановлен), потому что файбер практически всё время проводит в режиме ожидания или передачи управления.

source: Pause for a while, while the detached function runs. Then ... Cancel the fiber. Then, once again ... Display the fiber id, the fiber status, and gvar (gvar will have gone up a bit more depending how long the pause lasted). This time the status is dead because the cancel worked.
ru: Небольшая остановка, пока работает отсоединенная функция. Затем ... Отмена файбера. Затем снова отображение идентификатора файбера, статуса файбера и переменной gvar (значение gvar немного увеличится в зависимости от длительности паузы). На этот раз статус будет "dead" (недоступен), потому что произошла отмена.

source: Channels
ru: Каналы

source: Call ``fiber.channel()`` to allocate space and get a channel object, which will be called channel for examples in this section.
ru: Вызов ``fiber.channel()`` для выделения спейса и получение объекта канала, который будет называться "channel" в примерах данного раздела.

source: Call the other routines, via channel, to send messages, receive messages, or check channel status.
ru: Вызов других процедур по каналу для отправки сообщений, получения сообщений или проверки статуса канала.

source: Create a new communication channel.
ru: Создание нового канала связи.

source: the maximum number of slots (spaces for ``channel:put`` messages) that can be in use at once. The default is 0.
ru: максимальное количество слотов (спейсы для сообщений ``channel:put``), которые можно использовать одновременно. По умолчанию, 0.

source: new channel.
ru: новый канал.

source: userdata, possibly including the string "channel ...".
ru: пользовательские данные, возможно включая строку "channel ...".

source: Send a message using a channel. If the channel is full, ``channel:put()`` waits until there is a free slot in the channel.
ru: Отправка сообщения по каналу связи. Если канал заполнен, ``channel:put()`` ожидает, пока не освободится слот в канале.

source: what will be sent, usually a string or number or table
ru: то, что отправляется, как правило, строка, число или таблица

source: maximum number of seconds to wait for a slot to become free
ru: максимальное количество секунд ожидания, чтобы слот освободился

source: If timeout is specified, and there is no free slot in the channel for the duration of the timeout, then the return value is ``false``. If the channel is closed, then the return value is ``false``. Otherwise, the return value is ``true``, indicating success.
ru: Если указан параметр времени ожидания timeout, и в канале нет свободного слота в течение указанного времени, возвращается значение ``false`` (ложь). Если канал закрыт, возвращается значение ``false``. В остальных случаях возвращается значение ``true`` (правда), которое указывает на успешную отправку.

source: Close the channel. All waiters in the channel will stop waiting. All following ``channel:get()`` operations will return ``nil``, and all following ``channel:put()`` operations will return ``false``.
ru: Закрытие канала. Все, кто находится в режиме ожидания в канале, отключаются. Все последующие операции ``channel:get()`` вернут нулевое значение ``nil``, а все последующие операции ``channel:put()`` вернут ``false`` (ложь).

source: Fetch and remove a message from a channel. If the channel is empty, ``channel:get()`` waits for a message.
ru: Перехват и удаление сообщения из канала. Если канал пуст, ``channel:get()`` будет ожидать сообщения.

source: maximum number of seconds to wait for a message
ru: максимальное количество секунд ожидания сообщения

source: If timeout is specified, and there is no message in the channel for the duration of the timeout, then the return value is ``nil``. If the channel is closed, then the return value is ``nil``. Otherwise, the return value is the message placed on the channel by ``channel:put()``.
ru: Если указан параметр времени ожидания timeout, и в канале нет сообщения в течение указанного времени, возвращается нулевое значение ``nil``. Если канал закрыт, возвращается значение ``nil``. В остальных случаях возвращается сообщение, отправленное на канал с помощью ``channel:put()``.

source: usually string or number or table, as determined by ``channel:put``
ru: как правило, строка, число или таблица, как определяет ``channel:put()``

source: Check whether the channel is empty (has no messages).
ru: Проверка пустоты канала (отсутствие сообщений).

source: ``true`` if the channel is empty. Otherwise ``false``.
ru: ``true`` (правда), если канал пуст. В противном случае, ``false`` (ложь).

source: Find out how many messages are in the channel.
ru: Определение количества сообщений в канале.

source: the number of messages.
ru: количество сообщений.

source: Check whether the channel is full.
ru: Проверка заполненности канала.

source: ``true`` if the channel is full (the number of messages in the channel equals the number of slots so there is no room for a new message). Otherwise ``false``.
ru: ``true`` (правда), если канал заполнен (количество сообщений в канале равно количеству слотов, то есть нет места для новых сообщений). В противном случае, ``false`` (ложь).

source: Check whether readers are waiting for a message because they have issued ``channel:get()`` and the channel is empty.
ru: Проверка пустого канала на наличие читателей в состоянии ожидания сообщения после отправки запросов ``channel:get()``.

source: ``true`` if readers are waiting. Otherwise ``false``.
ru: ``true`` (правда), если на канале есть читатели в ожидании сообщения. В противном случае, ``false`` (ложь).

source: Check whether writers are waiting because they have issued ``channel:put()`` and the channel is full.
ru: Проверка полного канала на наличие писателей в состоянии ожидания после отправки запросов ``channel:put()``.

source: ``true`` if writers are waiting. Otherwise ``false``.
ru: ``true`` (правда), если на канале есть писатели в состоянии ожидании. В противном случае, ``false`` (ложь).

source: ``true`` if the channel is already closed. Otherwise ``false``.
ru: ``true`` (правда), если канал уже закрыт. В противном случае, ``false`` (ложь).

source: This example should give a rough idea of what some functions for fibers should look like. It's assumed that the functions would be referenced in :ref:`fiber.create() <fiber-create>`.
ru: В данном примере дается примерное представление о том, как должны выглядеть функции для файберов. Предполагается, что на функции ссылается :ref:`fiber.create() <fiber-create>`.

source: fiber = require('fiber') channel = fiber.channel(10) function consumer_fiber() while true do local task = channel:get() ... end end function consumer2_fiber() while true do -- 10 seconds local task = channel:get(10) if task ~= nil then ... else -- timeout end end end function producer_fiber() while true do task = box.space...:select{...} ... if channel:is_empty() then -- channel is empty end if channel:is_full() then -- channel is full end ... if channel:has_readers() then -- there are some fibers -- that are waiting for data end ... if channel:has_writers() then -- there are some fibers -- that are waiting for readers end channel:put(task) end end function producer2_fiber() while true do task = box.space...select{...} -- 10 seconds if channel:put(task, 10) then ... else -- timeout end end end
ru: fiber = require('fiber') channel = fiber.channel(10) function consumer_fiber() while true do local task = channel:get() ... end end function consumer2_fiber() while true do -- 10 секунд local task = channel:get(10) if task ~= nil then ... else -- время ожидания end end end function producer_fiber() while true do task = box.space...:select{...} ... if channel:is_empty() then -- канал пуст end if channel:is_full() then -- канал полон end ... if channel:has_readers() then -- есть файберы -- которые ожидают данные end ... if channel:has_writers() then -- есть файберы -- которые ожидают читателей end channel:put(task) end end function producer2_fiber() while true do task = box.space...select{...} -- 10 секунд if channel:put(task, 10) then ... else -- время ожидания end end end

source: Condition variables
ru: Условные переменные

source: Call ``fiber.cond()`` to create a named condition variable, which will be called 'cond' for examples in this section.
ru: Вызов ``fiber.cond()`` используется для создания именованной условной переменной, которая будет называться 'cond' для примеров данного раздела.

source: Call ``cond:wait()`` to make a fiber wait for a signal via a condition variable.
ru: Вызов ``cond:wait()`` используется, чтобы заставить файбер ожидать сигнал, с помощью условной переменной.

source: Call ``cond:signal()`` to send a signal to wake up a single fiber that has executed ``cond:wait()``.
ru: Вызов ``cond:signal()`` используется, чтобы отправить сигнал для пробуждения отдельного файбера, который выполнил запрос ``cond:wait()``.

source: Call ``cond:broadcast()`` to send a signal to all fibers that have executed ``cond:wait()``.
ru: Вызов ``cond:broadcast()`` используется для отправки сигнала всем файберам, которые выполнили ``cond:wait()``.

source: Create a new condition variable.
ru: Создание новой условной переменной.

source: new condition variable.
ru: новая условная переменная.

source: Make the current fiber go to sleep, waiting until another fiber invokes the ``signal()`` or ``broadcast()`` method on the cond object. The sleep causes an implicit :ref:`fiber.yield() <fiber-yield>`.
ru: Перевод файбера в режим ожидания до пробуждения другим файбером с помощью метода ``signal()`` или ``broadcast()``. Переход в режим ожидания вызывает неявную передачу управления :ref:`fiber.yield() <fiber-yield>`.

source: number of seconds to wait, default = forever.
ru: количество секунд ожидания, по умолчанию = всегда.

source: If timeout is provided, and a signal doesn't happen for the duration of the timeout, ``wait()`` returns false. If a signal or broadcast happens, ``wait()`` returns true.
ru: Если указан параметр времени ожидания timeout, и сигнал не передается в течение указанного времени, ``wait()`` вернет значение false (ложь). Если передается ``signal()`` или ``broadcast()``, ``wait()`` вернет true (правда).

source: Wake up a single fiber that has executed ``wait()`` for the same variable.
ru: Пробуждение отдельного файбера, который выполнил ``wait()`` для той же переменной.

source: Wake up all fibers that have executed ``wait()`` for the same variable.
ru: Пробуждение всех файберов, которые выполнили ``wait()`` для той же переменной.

source: Assume that a tarantool instance is running and listening for connections on localhost port 3301. Assume that guest users have privileges to connect. We will use the tarantoolctl utility to start two clients.
ru: Предположим, что запущен экземпляр Tarantool'а на прослушивание на localhost по порту 3301. Предположим, что у пользователя guest есть права на подключение. Используем утилиту tarantoolctl для запуска двух клиентов.

source: On terminal #1, say
ru: В первом терминале введите:

source: The job will hang because ``cond:wait()`` -- without an optional timeout argument -- will go to sleep until the condition variable changes.
ru: Задача повиснет, поскольку ``cond:wait()`` -- без дополнительного аргумента времени ожидания timeout -- уйдет в режим ожидания до изменения условной переменной.

source: On terminal #2, say
ru: Во втором терминале введите:

source: Now look again at terminal #1. It will show that the waiting stopped, and the ``cond:wait()`` function returned ``true``.
ru: Теперь снова взгляните на терминал №1. Он покажет, что ожидание прекратилось, и функция ``cond:wait()`` вернула значение ``true``.

source: This example depended on the use of a global conditional variable with the arbitrary name ``cond``. In real life, programmers would make sure to use different conditional variable names for different applications.
ru: В данном примере показана зависимость от использования глобальной условной переменной с произвольным именем ``cond``. В реальной жизни разработчики следят за использованием различных имен для условных переменных в разных приложениях.

source: Module `fio`
ru: Модуль `fio`

source: Tarantool supports file input/output with an API that is similar to POSIX syscalls. All operations are performed asynchronously. Multiple fibers can access the same file simultaneously.
ru: Tarantool поддерживает файловый ввод-вывод с помощью API, который аналогичен системным вызовам POSIX. Все операции проводятся асинхронно. Несколько файберов могут получать доступ к одному файлу одновременно.

source: The ``fio`` module contains:
ru: Модуль ``fio`` включает в себя:

source: functions for :ref:`common pathname manipulations <fio-pathname>`,
ru: функции для :ref:`стандартных действий с путем к файлу <fio-pathname>`,

source: functions for :ref:`directory or file existence and type checks<fio-checks>`,
ru: функции для :ref:`проверки наличия и типа директории или файла <fio-checks>`,

source: functions for :ref:`common file manipulations <fio-file>`, and
ru: функции для :ref:`стандартных действий с файлами <fio-file>`, а также

source: :ref:`constants <fio-c>` which are the same as POSIX flag values (for example ``fio.c.flag.O_RDONLY`` = POSIX O_RDONLY).
ru: :ref:`постоянные <fio-c>`., которые совпадают с флаговыми значениями POSIX (например, ``fio.c.flag.O_RDONLY`` = POSIX O_RDONLY).

source: Below is a list of all ``fio`` functions and members.
ru: Ниже приведен перечень всех функций и элементов модуля ``fio``.

source: Form a path name from one or more partial strings
ru: Формирование пути к файлу из одной или более частей строки

source: Get a file name
ru: Получение имени файла

source: Get a directory name
ru: Получение имени директории

source: Get a directory and file name
ru: Получение имен директории и файла

source: Check if file or directory exists
ru: Проверка наличия файла или директории

source: Check if file or directory is a directory
ru: Проверка, является ли файл или директория директорией

source: Check if file or directory is a file
ru: Проверка, является ли файл или директория файлом

source: Check if file or directory is a link
ru: Проверка, является ли файл или директория ссылкой

source: Set mask bits
ru: Определение битов маски

source: Get information about a file object
ru: Получение информации об объекте файла

source: Create or delete a directory
ru: Создание или удаление директории

source: Change working directory
ru: Изменение рабочей директории

source: List files in a directory
ru: Вывод списка файлов в директории

source: Get files whose names match a given string
ru: Получение файлов, имена которых совпадают с заданной строкой

source: Get the name of a directory for storing temporary files
ru: Получение имени директории для хранения временных файлов

source: Get the name of the current working directory
ru: Получение имени текущей рабочей директории

source: Create and delete directories
ru: Создание и удаление директорий

source: Create and delete links
ru: Создание и удаление ссылок

source: Rename a file or directory
ru: Переименование файла или директории

source: Copy a file
ru: Копирование файла

source: Manage rights to and ownership of file objects
ru: Управление правами на использование и правами владения объектами файла

source: Reduce the file size
ru: Уменьшение размера файла

source: Ensure that changes are written to disk
ru: Проверка записи изменений на диск

source: Open a file
ru: Открытие файла

source: Close a file
ru: Закрытие файла

source: Perform random-access read or write on a file
ru: Чтение или запись в файл с произвольным доступом

source: Perform non-random-access read or write on a file
ru: Чтение или запись в файл не с произвольным доступом

source: Change the size of an open file
ru: Изменение размера открытого файла

source: Change position in a file
ru: Изменение позиции в файле

source: Get statistics about an open file
ru: Получение статистики об открытом файле

source: Ensure that changes made to an open file are written to disk
ru: Проверка записи изменений в открытом файле на диск

source: Table of constants similar to POSIX flag values
ru: Таблица переменных, аналогичных флаговым значениям POSIX

source: Common pathname manipulations
ru: Стандартные действия с путем к файлу

source: Concatenate partial string, separated by '/' to form a path name.
ru: Конкатенация частей строки, разделенных '/' для формирования пути к файлу.

source: one or more strings to be concatenated.
ru: одна или более строк для конкатенации.

source: path name
ru: путь к файлу

source: Given a full path name, remove all but the final part (the file name). Also remove the suffix, if it is passed.
ru: Удаление из полного пути к файлу всего, за исключением последней части (имени файла). Также удаление суффикса, если он передается.

source: suffix
ru: суффикс

source: file name
ru: имя файла

source: Given a full path name, remove the final part (the file name).
ru: Удаление последней части (имени файла) из полного пути к файлу.

source: directory name, that is, path name except for file name.
ru: имя директории, то есть путь к файлу без имени файла.

source: Given a final part (the file name), return the full path name.
ru: Возврат полного пути к файлу на основании последней части (имени файла).

source: directory name, that is, path name including file name.
ru: имя директории, то есть путь к файлу с именем файла.

source: Directory or file existence and type checks
ru: Проверка наличия и типа директории или файла

source: Functions in this section are similar to some `Python os.path <https://docs.python.org/2/library/os.path.htmll>`_ functions.
ru: Функции в данном разделе подобны некоторым функциям `Python os.path <https://docs.python.org/2/library/os.path.htmll>`_.

source: path to directory or file.
ru: путь к директории или файлу.

source: true if path-name refers to a directory or file that exists and is not a broken symbolic link; otherwise false
ru: true (правда), если путь к файлу ссылается на директорию или файл, которые присутствуют в системе, и не представляет собой нерабочую символьную ссылку; в противном случае, false (ложь)

source: true if path-name refers to a directory; otherwise false
ru: true (правда), если путь к файлу ссылается на директорию; в противном случае, false (ложь)

source: true if path-name refers to a file; otherwise false
ru: true (правда), если путь к файлу ссылается на файл; в противном случае, false (ложь)

source: true if path-name refers to a symbolic link; otherwise false
ru: true (правда), если путь к файлу ссылается на символьную ссылку; в противном случае, false (ложь)

source: true if path-name refers to a directory or file that exists or is a broken symbolic link; otherwise false
ru: true (правда), если путь к файлу ссылается на директорию или файл, которые присутствуют в системе, и представляет собой нерабочую символьную ссылку; в противном случае, false (ложь)

source: Common file manipulations
ru: Стандартные действия с файлом

source: Set the mask bits used when creating files or directories. For a detailed description type ``man 2 umask``.
ru: Определение битов маски при создании файлов или директорий. Для получения более подробного описания введите ``man 2 umask``.

source: mask bits.
ru: биты маски.

source: previous mask bits.
ru: предыдущие биты маски.

source: Returns information about a file object. For details type ``man 2 lstat`` or ``man 2 stat``.
ru: Возврат информации об объекте файла. Для получения более подробной информации введите ``man 2 lstat`` или ``man 2 stat``.

source: path name of file.
ru: путь к файлу.

source: (If no error) table of fields which describe the file's block size, creation time, size, and other attributes. |br| (If error) two return values: null, error message.
ru: (Если ошибки нет) таблица с полями, которые описывают размер блока файла, время создания, размер и прочие атрибуты. |br| (В случае ошибки) возвращаются два значения: null, сообщение об ошибке.

source: table.
ru: таблица.

source: Additionally, the result of ``fio.stat('file-name')`` will include methods equivalent to POSIX macros:
ru: Кроме того, результат ``fio.stat('имя-файла')`` будет включать в себя методы, которые аналогичны макросам в POSIX:

source: ``is_blk()`` = POSIX macro S_ISBLK,
ru: ``is_blk()`` = макрос S_ISBLK в POSIX,

source: ``is_chr()`` = POSIX macro S_ISCHR,
ru: ``is_chr()`` = макрос S_ISCHR в POSIX

source: ``is_dir()`` = POSIX macro S_ISDIR,
ru: ``is_dir()`` = макрос S_ISDIR в POSIX,

source: ``is_fifo()`` = POSIX macro S_ISFIFO,
ru: ``is_fifo()`` = макрос S_ISFIFO в POSIX,

source: ``is_link()`` = POSIX macro S_ISLINK,
ru: ``is_link()`` = макрос S_ISLINK в POSIX,

source: ``is_reg()`` = POSIX macro S_ISREG,
ru: ``is_reg()`` = макрос S_ISREG в POSIX,

source: ``is_sock()`` = POSIX macro S_ISSOCK.
ru: ``is_sock()`` = макрос S_ISSOCK в POSIX.

source: For example, ``fio.stat('/'):is_dir()`` will return true.
ru: Например, ``fio.stat('/'):is_dir()`` вернет true.

source: Create or delete a directory. For details type ``man 2 mkdir`` or ``man 2 rmdir``.
ru: Создание или удаление директории. Для получения подробной информации введите ``man 2 mkdir`` или ``man 2 rmdir``.

source: path of directory.
ru: путь к директории.
