Repository: tarantool/doc
Catalog: locale/*/LC_MESSAGES/doc.po
Languages: ru

source: A replica gets all updates from the master by continuously fetching and applying its :ref:`write ahead log (WAL)<internals-wal>`. Each record in the WAL represents a single Tarantool data-change request such as :ref:`INSERT<box_space-insert>`, :ref:`UPDATE<box_space-update>` or :ref:`DELETE<box_space-delete>`, and is assigned a monotonically growing log sequence number (**LSN**). In essence, Tarantool replication is **row-based**: each data-change request is fully deterministic and operates on a single :ref:`tuple<index-box_tuple>`. However, unlike a classical row-based log, which contains entire copies of the changed rows, Tarantool's WAL contains copies of the requests. For example, for UPDATE requests, Tarantool only stores the primary key of the row and the update operations, to save space.
ru: Реплика получает все обновления от мастера, постоянно запрашивая и применяя данные :ref:`журнала упреждающей записи (WAL)<internals-wal>`. Каждая запись в WAL представляет собой отдельный запрос на изменение данных в Tarantool’е, например, :ref:`INSERT<box_space-insert>`, :ref:`UPDATE<box_space-update>` или :ref:`DELETE<box_space-delete>`. Такой записи присваивается монотонно возрастающее число, представляющее регистрационный номер в журнале (**LSN**). По сути, репликация в Tarantool’е является **построчной**: каждая команда на изменение данных полностью детерминирована и относится к отдельному :ref:`кортежу<index-box_tuple>`. Однако в отличие от типичного построчного журнала, который содержит копии измененных строк полностью, WAL в Tarantool'е включает в себя копии запросов. Например, для запросов типа UPDATE (обновление) Tarantool сохранит только первичный ключ строки и операции обновления для экономии места.

source: Invocations of **stored programs** are not written to the WAL. Instead, records of the actual **data-change requests, performed by the Lua code**, are written to the WAL. This ensures that possible non-determinism of Lua does not cause replication to go out of sync.
ru: Вызовы **хранимых процедур** не регистрируются в журнале упреждающей записи. Между тем, события по запросам **изменения фактических данных, которые выполняют Lua-скрипты**, регистрируются в журнале. Таким образом, возможное недетерминированное выполнение Lua гарантированно не приведет к рассинхронизации.

source: Data definition operations on **temporary spaces**, such as creating/dropping, adding indexes, truncating, etc., are written to the WAL, since information about temporary spaces is stored in non-temporary system spaces, such as :ref:`box.space._space <box_space-space>`. Data change operations on temporary spaces are not written to the WAL and are not replicated.
ru: Операции по определению данных во **временных спейсах**, такие как создание/удаление, добавление индексов, усечение и т.д., регистрируются в журнале, поскольку информация о временных спейсах хранится в постоянных системных спейсах, например :ref:`box.space._space <box_space-space>`. Операции по изменению данных во временных спейсах не регистрируются в журнале и не реплицируются.

source: To create a valid initial state, to which WAL changes can be applied, every instance of a replica set requires a start set of :ref:`checkpoint files <index-box_persistence>`, such as .snap files for memtx and .run files for vinyl. A replica joining an existing replica set, chooses an existing master and automatically downloads the initial state from it. This is called an **initial join**.
ru: Чтобы создать подходящее начальное состояние, к которому можно применить изменения из WAL-файла, для каждого экземпляра из набора реплик должен быть исходный набор :ref:`файлов контрольной точки <index-box_persistence>` -- .snap-файлы для memtx и .run-файлы для vinyl. Когда реплика включается в существующий набор реплик, она выбирает существующего мастера и автоматически загружает с него начальное состояние. Это называется **начальным включением**.

source: When a replica contacts a master (there can be many masters) for the first time, it becomes part of a replica set. On subsequent occasions, it should always contact a master in the same replica set. Once connected to the master, the replica requests all changes that happened after the latest local LSN (there can be many LSNs -- each master has its own LSN).
ru: Когда реплика впервые подключается к мастеру (может быть много мастеров), она становится частью набора реплик. В последующих случаях она всегда должна подключаться к мастеру в этом наборе реплик. После подключения к мастеру реплика запрашивает все изменения, произошедшие с момента последнего локального LSN (может быть много LSN -- у каждого мастера свой LSN).

source: Here the instance ID is ``1`` (unique within the replica set), and the instance UUID is ``88580b5c-4474-43ab-bd2b-2409a9af80d2`` (globally unique).
ru: Здесь ID экземпляра -- ``1`` (уникальный номер в рамках набора реплик), а UUID экземпляра -- ``88580b5c-4474-43ab-bd2b-2409a9af80d2`` (глобально уникальный).

source: Starting in Tarantool 1.7.7, it is possible for administrators to assign the instance UUID and the replica set UUID values, rather than let the system generate them -- see the description of the :ref:`replicaset_uuid <cfg_replication-replicaset_uuid>` configuration parameter.
ru: Начиная с Tarantool 1.7.7, появилась возможность для администраторов назначать UUID экземпляра и UUID набора реплик вместо сгенерированных системой значений -- см. описание конфигурационного параметра :ref:`replicaset_uuid <cfg_replication-replicaset_uuid>`.

source: Replication setup
ru: Настройка репликации

source: To enable replication, you need to specify two parameters in a ``box.cfg{}`` request:
ru: Чтобы включить репликацию, необходимо указать два параметра в запросе ``box.cfg{}``:

source: Both these parameters are "dynamic". This allows a replica to become a master and vice versa on the fly with the help of a ``box.cfg{}`` request.
ru: "Динамические" параметры репликации можно менять на лету, что позволяет назначать реплику на роль мастера и наоборот. Для этого используется запрос ``box.cfg{}``.

source: Replication roles: master and replica
ru: Роли в репликации: мастер и реплика

source: In a master-replica configuration, every change that happens on the master will be visible on the replicas, but not vice versa.
ru: В конфигурации мастер-реплика каждое изменение, сделанное на мастере, будет отображаться на репликах, но не наоборот.

source: A simple two-instance replica set with the master on one machine and the replica on a different machine provides two benefits:
ru: Простой набор реплик с двумя экземплярами, один из которых является мастером и расположен на одной машине, а другой -- реплика -- расположен на другой машине, дает два преимущества:

source: **failover**, because if the master goes down then the replica can take over, and
ru: **восстановление после отказа**, поскольку в случае отказа мастера реплика может взять работу на себя, и

source: **load balancing**, because clients can connect to either the master or the replica for read requests.
ru: **балансировка нагрузки**, потому что клиенты во время запросов чтения могут подключаться к мастеру или к реплике.

source: In a **master-master** configuration (also called "multi-master"), every change that happens on either instance will be visible on the other one.
ru: В конфигурации **мастер-мастер** (которая также называется "многомастерной") каждое изменение на любом экземпляре будет также отображаться на другом.

source: The failover benefit in this case is still present, and the load-balancing benefit is enhanced, because any instance can handle both read and write requests. Meanwhile, for multi-master configurations, it is necessary to understand the **replication guarantees** provided by the asynchronous protocol that Tarantool implements.
ru: Восстановление после отказа в таком случае также будет преимуществом, а балансировка нагрузки улучшится, поскольку любой экземпляр может обрабатывать запросы и на чтение, и на запись. В то же время, при многомастерной конфигурации необходимо понимать **гарантии репликации**, которые обеспечивает асинхронный протокол, внедренный в Tarantool.

source: UPDATE operations, however, can easily go out of sync. For example, assignment and increment are not commutative, and may yield different results if applied in different order on different instances.
ru: Однако операции обновления UPDATE могут с легкостью привести к рассинхронизации. Например, операции присваивания и увеличения не обладают коммутативностью и могут привести к различным результатам, если применять их в различном порядке на разных экземплярах.

source: More generally, it is only safe to use Tarantool master-master replication if all database changes are **commutative**: the end result does not depend on the order in which the changes are applied. You can start learning more about conflict-free replicated data types `here <https://en.wikipedia.org/wiki/Conflict-free_replicated_data_type>`_.
ru: В общем смысле, безопасно использовать репликацию мастер-мастер в Tarantool'е, если все изменения в базе данных являются **коммутативными**: конечный результат не зависит от порядка, в котором применяются изменения. Дополнительную информацию о бесконфликтных типах реплицируемых данных можно получить `здесь <https://en.wikipedia.org/wiki/Conflict-free_replicated_data_type>`_.

source: Replication topologies: cascade, ring and full mesh
ru: Топологии репликации: каскадная, кольцевая и полная ячеистая

source: Some database products offer **cascading replication** topologies: creating a replica on a replica. Tarantool does not recommend such setup.
ru: Некоторые СУБД предлагают топологии **каскадной репликации**: создание реплики на реплике. Tarantool не рекомендует такие настройки.

source: We have a chain of three instances. Instance #1 contains entries for instances #1 and #2 in its ``_cluster`` space. Instances #2 and #3 contain entries for instances #1, #2 and #3 in their ``_cluster`` spaces.
ru: У нас есть цепочка из трех экземпляров. Экземпляр №1 содержит записи для экземпляров №1 и №2 в спейсе ``_cluster``. Экземпляры №2 и №3 содержат записи для экземпляров №1, №2 и №3 в своих спейсах ``_cluster``.

source: Now instance #2 is faulty. Instance #3 tries connecting to instance #1 as its new master, but the master refuses the connection since it has no entry for instance #3.
ru: Теперь экземпляр №2 неисправен. Экземпляр №3 пытается подключиться к экземпляру №1, как к новому мастеру, но мастер отклоняет подключение, поскольку не содержит запись для экземпляра №3.

source: **Ring replication** topology is, however, supported:
ru: Тем не менее, **кольцевая топология** поддерживается:

source: So, if you need a cascading topology, you may first create a ring to ensure all instances know each other’s UUID, and then disconnect the chain in the place you desire.
ru: Поэтому если необходима каскадная топология, можно первоначально создать кольцо, чтобы все экземпляры знали UUID друг друга, а затем разъединить цепочку в необходимом месте.

source: A stock recommendation for a master-master replication topology, however, is a **full mesh**:
ru: Как бы то ни было, для репликации мастер-мастер рекомендуется **полная ячеистая** топология:

source: This ensures full cluster availability in case of a local failure, e.g. one of the instances failing in one of the data centers, as well as in case of an entire data center failure.
ru: Таким образом можно обеспечить доступность всего кластера в случае локального отказа, например отказа одного экземпляра в одном центре обработки данных, а также в случае отказа всего центра обработки данных.

source: The maximal number of replicas in a mesh is 32.
ru: Максимальное количество реплик в ячейке -- 32.

source: Bootstrapping a replica set
ru: Настройка набора реплик

source: Master-replica bootstrap
ru: Настройка репликации мастер-реплика

source: Here is an example of the master's instance file:
ru: Ниже пример файла экземпляра для мастера:

source: -- instance file for the master box.cfg{ listen = 3301, replication = {'replicator:password@192.168.0.101:3301', -- master URI 'replicator:password@192.168.0.102:3301'}, -- replica URI read_only = false } box.once("schema", function() box.schema.user.create('replicator', {password = 'password'}) box.schema.user.grant('replicator', 'replication') -- grant replication role box.schema.space.create("test") box.space.test:create_index("primary") print('box.once executed on master') end)
ru: -- файл экземпляра для мастера box.cfg{ listen = 3301, replication = {'replicator:password@192.168.0.101:3301', -- URI мастера 'replicator:password@192.168.0.102:3301'}, -- URI реплики read_only = false } box.once("schema", function() box.schema.user.create('replicator', {password = 'password'}) box.schema.user.grant('replicator', 'replication') -- настроить роль для репликации box.schema.space.create("test") box.space.test:create_index("primary") print('box.once executed on master') end)

source: Replication requires privileges. We can grant privileges for accessing spaces directly to the user who will start the instance. However, it is more usual to grant privileges for accessing spaces to a :ref:`role <authentication-roles>`, and then grant the role to the user who will start the replica.
ru: Репликация требует настройки прав. Права на доступ к спейсам можно задать напрямую для пользователя, под чьим именем запущен экземпляр. Но обычно права на доступ к спейсам задаются с помощью :ref:`роли <authentication-roles>`, которая затем присваивается пользователю, под чьим именем запущена реплика.

source: -- instance file for the replica box.cfg{ listen = 3301, replication = {'replicator:password@192.168.0.101:3301', -- master URI 'replicator:password@192.168.0.102:3301'}, -- replica URI read_only = true } box.once("schema", function() box.schema.user.create('replicator', {password = 'password'}) box.schema.user.grant('replicator', 'replication') -- grant replication role box.schema.space.create("test") box.space.test:create_index("primary") print('box.once executed on replica') end)
ru: -- файл экземпляра для реплики box.cfg{ listen = 3301, replication = {'replicator:password@192.168.0.101:3301', -- URI мастера 'replicator:password@192.168.0.102:3301'}, -- URI реплики read_only = true } box.once("schema", function() box.schema.user.create('replicator', {password = 'password'}) box.schema.user.grant('replicator', 'replication') -- настроить роль для репликации box.schema.space.create("test") box.space.test:create_index("primary") print('box.once executed on replica') end)

source: Now we can launch the two instances. The master...
ru: Теперь можно запустить два экземпляра. Мастер...

source: $ # launching the master $ tarantool master.lua 2017-06-14 14:12:03.847 [18933] main/101/master.lua C> version 1.7.4-52-g980d30092 2017-06-14 14:12:03.848 [18933] main/101/master.lua C> log level 5 2017-06-14 14:12:03.849 [18933] main/101/master.lua I> mapping 268435456 bytes for tuple arena... 2017-06-14 14:12:03.859 [18933] iproto/101/main I> binary: bound to [::]:3301 2017-06-14 14:12:03.861 [18933] main/105/applier/replicator@192.168.0. I> can't connect to master 2017-06-14 14:12:03.861 [18933] main/105/applier/replicator@192.168.0. coio.cc:105 !> SystemError connect, called on fd 14, aka 192.168.0.102:56736: Connection refused 2017-06-14 14:12:03.861 [18933] main/105/applier/replicator@192.168.0. I> will retry every 1 second 2017-06-14 14:12:03.861 [18933] main/104/applier/replicator@192.168.0. I> remote master is 1.7.4 at 192.168.0.101:3301 2017-06-14 14:12:19.878 [18933] main/105/applier/replicator@192.168.0. I> remote master is 1.7.4 at 192.168.0.102:3301 2017-06-14 14:12:19.879 [18933] main/101/master.lua I> initializing an empty data directory 2017-06-14 14:12:19.908 [18933] snapshot/101/main I> saving snapshot `/var/lib/tarantool/master/00000000000000000000.snap.inprogress' 2017-06-14 14:12:19.914 [18933] snapshot/101/main I> done 2017-06-14 14:12:19.914 [18933] main/101/master.lua I> vinyl checkpoint done 2017-06-14 14:12:19.917 [18933] main/101/master.lua I> ready to accept requests 2017-06-14 14:12:19.918 [18933] main/105/applier/replicator@192.168.0. I> failed to authenticate 2017-06-14 14:12:19.918 [18933] main/105/applier/replicator@192.168.0. xrow.cc:431 E> ER_LOADING: Instance bootstrap hasn't finished yet box.once executed on master 2017-06-14 14:12:19.920 [18933] main C> entering the event loop
ru: $ # запуск мастера $ tarantool master.lua 2017-06-14 14:12:03.847 [18933] main/101/master.lua C> version 1.7.4-52-g980d30092 2017-06-14 14:12:03.848 [18933] main/101/master.lua C> log level 5 2017-06-14 14:12:03.849 [18933] main/101/master.lua I> mapping 268435456 bytes for tuple arena... 2017-06-14 14:12:03.859 [18933] iproto/101/main I> binary: bound to [::]:3301 2017-06-14 14:12:03.861 [18933] main/105/applier/replicator@192.168.0. I> can't connect to master 2017-06-14 14:12:03.861 [18933] main/105/applier/replicator@192.168.0. coio.cc:105 !> SystemError connect, called on fd 14, aka 192.168.0.102:56736: Connection refused 2017-06-14 14:12:03.861 [18933] main/105/applier/replicator@192.168.0. I> will retry every 1 second 2017-06-14 14:12:03.861 [18933] main/104/applier/replicator@192.168.0. I> remote master is 1.7.4 at 192.168.0.101:3301 2017-06-14 14:12:19.878 [18933] main/105/applier/replicator@192.168.0. I> remote master is 1.7.4 at 192.168.0.102:3301 2017-06-14 14:12:19.879 [18933] main/101/master.lua I> initializing an empty data directory 2017-06-14 14:12:19.908 [18933] snapshot/101/main I> saving snapshot `/var/lib/tarantool/master/00000000000000000000.snap.inprogress' 2017-06-14 14:12:19.914 [18933] snapshot/101/main I> done 2017-06-14 14:12:19.914 [18933] main/101/master.lua I> vinyl checkpoint done 2017-06-14 14:12:19.917 [18933] main/101/master.lua I> ready to accept requests 2017-06-14 14:12:19.918 [18933] main/105/applier/replicator@192.168.0. I> failed to authenticate 2017-06-14 14:12:19.918 [18933] main/105/applier/replicator@192.168.0. xrow.cc:431 E> ER_LOADING: Instance bootstrap hasn't finished yet box.once executed on master 2017-06-14 14:12:19.920 [18933] main C> entering the event loop

source: $ # launching the replica $ tarantool replica.lua 2017-06-14 14:12:19.486 [18934] main/101/replica.lua C> version 1.7.4-52-g980d30092 2017-06-14 14:12:19.486 [18934] main/101/replica.lua C> log level 5 2017-06-14 14:12:19.487 [18934] main/101/replica.lua I> mapping 268435456 bytes for tuple arena... 2017-06-14 14:12:19.494 [18934] iproto/101/main I> binary: bound to [::]:3311 2017-06-14 14:12:19.495 [18934] main/104/applier/replicator@192.168.0. I> remote master is 1.7.4 at 192.168.0.101:3301 2017-06-14 14:12:19.495 [18934] main/105/applier/replicator@192.168.0. I> remote master is 1.7.4 at 192.168.0.102:3302 2017-06-14 14:12:19.496 [18934] main/104/applier/replicator@192.168.0. I> failed to authenticate 2017-06-14 14:12:19.496 [18934] main/104/applier/replicator@192.168.0. xrow.cc:431 E> ER_LOADING: Instance bootstrap hasn't finished yet
ru: $ # запуск реплики $ tarantool replica.lua 2017-06-14 14:12:19.486 [18934] main/101/replica.lua C> version 1.7.4-52-g980d30092 2017-06-14 14:12:19.486 [18934] main/101/replica.lua C> log level 5 2017-06-14 14:12:19.487 [18934] main/101/replica.lua I> mapping 268435456 bytes for tuple arena... 2017-06-14 14:12:19.494 [18934] iproto/101/main I> binary: bound to [::]:3311 2017-06-14 14:12:19.495 [18934] main/104/applier/replicator@192.168.0. I> remote master is 1.7.4 at 192.168.0.101:3301 2017-06-14 14:12:19.495 [18934] main/105/applier/replicator@192.168.0. I> remote master is 1.7.4 at 192.168.0.102:3302 2017-06-14 14:12:19.496 [18934] main/104/applier/replicator@192.168.0. I> failed to authenticate 2017-06-14 14:12:19.496 [18934] main/104/applier/replicator@192.168.0. xrow.cc:431 E> ER_LOADING: Instance bootstrap hasn't finished yet

source: $ # bootstrapping the replica (from the master's log) <...> 2017-06-14 14:12:20.503 [18933] main/106/main I> initial data sent. 2017-06-14 14:12:20.505 [18933] relay/[::ffff:192.168.0.101]:/101/main I> recover from `/var/lib/tarantool/master/00000000000000000000.xlog' 2017-06-14 14:12:20.505 [18933] main/106/main I> final data sent. 2017-06-14 14:12:20.522 [18933] relay/[::ffff:192.168.0.101]:/101/main I> recover from `/Users/e.shebunyaeva/work/tarantool-test-repl/master_dir/00000000000000000000.xlog' 2017-06-14 14:12:20.922 [18933] main/105/applier/replicator@192.168.0. I> authenticated
ru: $ # настройка реплики (из журнала мастера) <...> 2017-06-14 14:12:20.503 [18933] main/106/main I> initial data sent. 2017-06-14 14:12:20.505 [18933] relay/[::ffff:192.168.0.101]:/101/main I> recover from `/var/lib/tarantool/master/00000000000000000000.xlog' 2017-06-14 14:12:20.505 [18933] main/106/main I> final data sent. 2017-06-14 14:12:20.522 [18933] relay/[::ffff:192.168.0.101]:/101/main I> recover from `/Users/e.shebunyaeva/work/tarantool-test-repl/master_dir/00000000000000000000.xlog' 2017-06-14 14:12:20.922 [18933] main/105/applier/replicator@192.168.0. I> authenticated

source: $ # bootstrapping the replica (from the replica's log) <...> 2017-06-14 14:12:20.498 [18934] main/104/applier/replicator@192.168.0. I> authenticated 2017-06-14 14:12:20.498 [18934] main/101/replica.lua I> bootstrapping replica from 192.168.0.101:3301 2017-06-14 14:12:20.512 [18934] main/104/applier/replicator@192.168.0. I> initial data received 2017-06-14 14:12:20.512 [18934] main/104/applier/replicator@192.168.0. I> final data received 2017-06-14 14:12:20.517 [18934] snapshot/101/main I> saving snapshot `/var/lib/tarantool/replica/00000000000000000005.snap.inprogress' 2017-06-14 14:12:20.518 [18934] snapshot/101/main I> done 2017-06-14 14:12:20.519 [18934] main/101/replica.lua I> vinyl checkpoint done 2017-06-14 14:12:20.520 [18934] main/101/replica.lua I> ready to accept requests 2017-06-14 14:12:20.520 [18934] main/101/replica.lua I> set 'read_only' configuration option to true 2017-06-14 14:12:20.520 [18934] main C> entering the event loop
ru: $ # настройка реплики (из журнала реплики) <...> 2017-06-14 14:12:20.498 [18934] main/104/applier/replicator@192.168.0. I> authenticated 2017-06-14 14:12:20.498 [18934] main/101/replica.lua I> bootstrapping replica from 192.168.0.101:3301 2017-06-14 14:12:20.512 [18934] main/104/applier/replicator@192.168.0. I> initial data received 2017-06-14 14:12:20.512 [18934] main/104/applier/replicator@192.168.0. I> final data received 2017-06-14 14:12:20.517 [18934] snapshot/101/main I> saving snapshot `/var/lib/tarantool/replica/00000000000000000005.snap.inprogress' 2017-06-14 14:12:20.518 [18934] snapshot/101/main I> done 2017-06-14 14:12:20.519 [18934] main/101/replica.lua I> vinyl checkpoint done 2017-06-14 14:12:20.520 [18934] main/101/replica.lua I> ready to accept requests 2017-06-14 14:12:20.520 [18934] main/101/replica.lua I> set 'read_only' configuration option to true 2017-06-14 14:12:20.520 [18934] main C> entering the event loop

source: Notice that ``box.once()`` was executed only at the master, although we added ``box.once()`` to both instance files.
ru: Обратите внимание, что функция ``box.once()`` была выполнена только на мастере, хотя мы добавили ``box.once()`` в оба файла экземпляра.

source: We could as well launch the replica first:
ru: Также можно было сначала запустить реплику.
