Repository: tarantool/doc
Catalog: locale/*/LC_MESSAGES/doc.po
Languages: ru

source: Get an environment variable
ru: Получение переменной окружения

source: Remove a file or directory
ru: Удаление файла или директории

source: Get a formatted date
ru: Получение даты в формате

source: Exit the program
ru: Выход из программы

source: Get the number of seconds since the epoch
ru: Получение числа секунд с начала отсчета

source: Get the number of CPU seconds since the program start
ru: Получение числа времени ЦП в секундах с момента начала программы

source: Get the name of a temporary file
ru: Получение имени временного файла

source: Get a table with all environment variables
ru: Получение таблицы со всеми переменными окружения

source: Set an environment variable
ru: Определение переменной окружения

source: Change the locale
ru: Изменение локали

source: Get the number of seconds between two times
ru: Получение числа секунд между двумя значениями времени

source: Execute by passing to the shell.
ru: Выполнение путем передачи в ОС.

source: what to execute.
ru: что выполнить.

source: Rename a file or directory.
ru: Переименование файла или директории.

source: name of existing file or directory,
ru: имя существующего файла или директории,

source: changed name of file or directory.
ru: измененное имя файла или директории.

source: Get environment variable.
ru: Получение переменной окружения.

source: Parameters: (string) variable-name = environment variable name.
ru: Параметры: (string) variable-name = имя переменной окружения.

source: Remove file or directory.
ru: Удаление файла или директории.

source: Parameters: (string) name = name of file or directory which will be removed.
ru: Parameters: (string) name = имя файла или директории, которые будут удалены.

source: Return a formatted date.
ru: Возврат даты в формате.

source: Parameters: (string) format-string = instructions; (string) time-since-epoch = number of seconds since 1970-01-01. If time-since-epoch is omitted, it is assumed to be the current time.
ru: Parameters: (string) format-string = инструкции; (string) time-since-epoch = число секунд с 1970-01-01. Если не указать time-since-epoch, предполагается использование текущего времени.

source: Exit the program. If this is done on a server instance, then the instance stops.
ru: Выход из программы. Если выполняется на экземпляре сервера, останавливается работа экземпляра.

source: Return the number of seconds since the epoch.
ru: Возврат числа секунд с начала отсчета.

source: Return the number of CPU seconds since the program start.
ru: Возврат числа времени ЦП в секундах с момента начала программы.

source: Return a name for a temporary file.
ru: Возврат имени временного файла.

source: Return a table containing all environment variables.
ru: Возврат таблицы со всеми переменными окружения.

source: Set an environment variable.
ru: Определение переменной окружения.

source: Change the locale. If new-locale-string is not specified, return the current locale.
ru: Изменение локали. Если не указать new-locale-string, вернется текущая локаль.

source: Return the number of seconds between two times.
ru: Возврат числа секунд между двумя значениями времени.

source: Miscellaneous
ru: Разное

source: Below is a list of miscellaneous functions.
ru: Ниже приведен перечень разных доступных функций.

source: Convert a string or a Lua number to a 64-bit integer
ru: Конвертация строки или Lua-числа в 64-битное целое число

source: Parse and execute an arbitrary chunk of Lua code
ru: Анализ и выполнение произвольного Lua-кода

source: Convert a string or a Lua number to a 64-bit integer. The input value can be expressed in decimal, binary (for example 0b1010), or hexadecimal (for example -0xffff). The result can be used in arithmetic, and the arithmetic will be 64-bit integer arithmetic rather than floating-point arithmetic. (Operations on an unconverted Lua number use floating-point arithmetic.) The ``tonumber64()`` function is added by Tarantool; the name is global.
ru: Конвертация строки или Lua-числа в 64-битное целое число. Входное значение может быть выражено десятичным, двоичным (например, 0b1010) или шестнадцатеричным (например, -0xffff) числом. Результат может использоваться в арифметике, причем скорее в 64-битной целочисленной арифметике, а не в арифметике в системе с плавающей запятой. (Операции с неконвертированными Lua-числами выполняются в арифметике в системе с плавающей запятой.) Функция ``tonumber64()`` в Tarantool'е является глобальной.

source: Parse and execute an arbitrary chunk of Lua code. This function is mainly useful to define and run Lua code without having to introduce changes to the global Lua environment.
ru: Анализ и выполнение произвольного Lua-кода. Данная функция используется преимущественно для определения и выполнения Lua-кода без необходимости внесения изменений в глобальное Lua-окружение.

source: Lua code
ru: Lua-код

source: zero or more scalar values which will be appended to, or substitute for, items in the Lua chunk.
ru: ноль или другие скалярные значения, которые заменяются или к которым прибавляются значения.

source: whatever is returned by the Lua code chunk.
ru: то, что возвращает Lua-код.

source: Possible errors: If there is a compilation error, it is raised as a Lua error.
ru: Возможные ошибки: Ошибка компиляции появляется как Lua-ошибка.

source: Module `pickle`
ru: Модуль `pickle`

source: Below is a list of all ``pickle`` functions.
ru: Ниже приведен перечень всех функций модуля ``pickle``.

source: Convert Lua variables to binary format
ru: Конвертация Lua-переменных в двоичный формат

source: Convert Lua variables back from binary format
ru: Конвертация Lua-переменных в двоичный формат

source: To use Tarantool binary protocol primitives from Lua, it's necessary to convert Lua variables to binary format. The ``pickle.pack()`` helper function is prototyped after Perl 'pack_'.
ru: Чтобы использовать примитивы бинарного протокола Tarantool'а из Lua, необходимо конвертировать Lua-переменные в двоичный формат. Прототипом вспомогательной функции ``pickle.pack()`` выступила функция 'pack_' из Perl.

source: **Format specifiers**
ru: **Спецификаторы формата**

source: converts Lua scalar value to a 1-byte integer, and stores the integer in the resulting string
ru: конвертирует скалярное Lua-значение в 1-байтное целое число и хранит целое число в полученной строке

source: converts Lua scalar value to a 2-byte integer, and stores the integer in the resulting string, low byte first
ru: конвертирует скалярное Lua-значение в 2-байтное целое число и хранит целое число в полученной строке, сначала младший байт

source: converts Lua scalar value to a 4-byte integer, and stores the integer in the resulting string, low byte first
ru: конвертирует скалярное Lua-значение в 4-байтное целое число и хранит целое число в полученной строке, сначала младший байт

source: converts Lua scalar value to an 8-byte integer, and stores the integer in the resulting string, low byte first
ru: конвертирует скалярное Lua-значение в 8-байтное целое число и хранит целое число в полученной строке, сначала младший байт

source: converts Lua scalar value to a 2-byte integer, and stores the integer in the resulting string, big endian,
ru: конвертирует скалярное Lua-значение в 2-байтное целое число и хранит целое число в полученной строке, порядок от старшего к младшему,

source: converts Lua scalar value to a 4-byte integer, and stores the integer in the resulting string, big
ru: конвертирует скалярное Lua-значение в 4-байтное целое число и хранит целое число в полученной строке, порядок от старшего к младшему,

source: converts Lua scalar value to an 8-byte integer, and stores the integer in the resulting string, big endian,
ru: конвертирует скалярное Lua-значение в 8-байтное целое число и хранит целое число в полученной строке, порядок от старшего к младшему,

source: converts Lua scalar value to a 4-byte float, and stores the float in the resulting string
ru: конвертирует скалярное Lua-значение в 4-байтное число с плавающей запятой и хранит число с плавающей запятой в полученной строке

source: converts Lua scalar value to a 8-byte double, and stores the double in the resulting string
ru: конвертирует скалярное Lua-значение в 8-байтное число двойной точности и хранит число двойной точности в полученной строке

source: converts Lua scalar value to a sequence of bytes, and stores the sequence in the resulting string
ru: конвертирует скалярное Lua-значение в последовательность байтов и хранит последовательность в полученной строке

source: string containing format specifiers
ru: строка со спецификаторами формата

source: scalar values to be formatted
ru: скалярные значения к форматированию

source: a binary string containing all arguments, packed according to the format specifiers.
ru: бинарная строка, которая содержит все аргументы, упакованные в соответствии со спецификаторами формата.

source: A scalar value can be either a variable or a literal. Remember that large integers should be entered with :ref:`tonumber64() or LL or ULL suffixes <index-box_number>`.
ru: Скалярное значение может быть либо переменной, либо литеральным значением. Следует помнить, что большие целые числа нужно вводить с :ref:`tonumber64() или суффиксами LL или ULL <index-box_number>`.

source: Possible errors: unknown format specifier.
ru: Возможные ошибки: неизвестный спецификатор формата.

source: Counterpart to ``pickle.pack()``. Warning: if format specifier 'A' is used, it must be the last item.
ru: Противоположность ``pickle.pack()``. Внимание: если используется спецификатор формата 'A', он должен идти последним.

source: A list of strings or numbers.
ru: Список строк или чисел.

source: Module `socket`
ru: Модуль `socket`

source: The ``socket`` module allows exchanging data via BSD sockets with a local or remote host in connection-oriented (TCP) or datagram-oriented (UDP) mode. Semantics of the calls in the ``socket`` API closely follow semantics of the corresponding POSIX calls. Function names and signatures are mostly compatible with `luasocket`_.
ru: Модуль ``socket`` позволяет обмениваться данными с локальным или удаленным хостом по BSD-сокетам в режиме с установлением соединений (TCP) или на основе датаграмм (UDP). Семантика вызовов в API модуля ``socket`` точно соответствует семантике соответствующих вызовов в POSIX. Имена и сигнатуры функций по большей части совместимы с `luasocket`_.

source: The functions for setting up and connecting are ``socket``, ``sysconnect``, ``tcp_connect``. The functions for sending data are ``send``, ``sendto``, ``write``, ``syswrite``. The functions for receiving data are ``recv``, ``recvfrom``, ``read``. The functions for waiting before sending/receiving data are ``wait``, ``readable``, ``writable``. The functions for setting flags are ``nonblock``, ``setsockopt``. The functions for stopping and disconnecting are ``shutdown``, ``close``. The functions for error checking are ``errno``, ``error``.
ru: Функции для настройки и подключения: ``socket``, ``sysconnect``, ``tcp_connect``. Функции для отправки данных: ``send``, ``sendto``, ``write``, ``syswrite``. Функции для получения данных: ``recv``, ``recvfrom``, ``read``. Функции для ожидания отправки/получения данных: ``wait``, ``readable``, ``writable``. Функции для установки флагов: ``nonblock``, ``setsockopt``. Функции для остановки и отключения: ``shutdown``, ``close``. Функции для проверки ошибок: ``errno``, ``error``.

source: Below is a list of all ``socket`` functions.
ru: Ниже приведен перечень всех функций модуля ``socket``.

source: Create a socket
ru: Создание сокета

source: Connect a socket to a remote host
ru: Подключение к удаленному хосту с помощью сокета

source: Get information about a remote site
ru: Получение информации об удаленном узле

source: Make Tarantool act as a TCP server
ru: Использование Tarantool'а в качестве TCP-сервера

source: Send data over a connected socket
ru: Отправка данных по подключенному сокету

source: Write data to the socket buffer if non-blocking
ru: Запись данных в буфер сокета без блокировки

source: Read from a connected socket
ru: Чтение с подключенного сокета

source: Read data from the socket buffer if non-blocking
ru: Чтение данных из буфера сокета без блокировки

source: Bind a socket to the given host/port
ru: Привязка сокета к данному хосту/порту

source: Start listening for incoming connections
ru: Начало прослушивания входящих соединений

source: Accept a client connection + create a connected socket
ru: Принятие запроса клиента на соединение + создание подключенного сокета

source: Send a message on a UDP socket to a specified host
ru: Отправка сообщения по UDP-сокету на указанный хост

source: Receive a message on a UDP socket
ru: Получение сообщения по UDP-сокету

source: Shut down a reading end, a writing end, or both
ru: Отключение передачи данных на чтение, на запись или в обоих направлениях

source: Close a socket
ru: Закрытие сокета

source: Get information about the last error on a socket
ru: Получение информации о последней ошибке на сокете

source: Set socket flags
ru: Определение флагов сокета

source: Get socket flags
ru: Получение флагов сокета

source: Set/clear the SO_LINGER flag
ru: Установить/убрать флаг SO_LINGER

source: Set/get the flag value
ru: Определить/получить значение флага

source: Wait until something is readable
ru: Ожидание доступности чего-либо для чтения

source: Wait until something is writable
ru: Ожидание доступности чего-либо для записи

source: Wait until something is either readable or writable
ru: Ожидание доступности чего-либо для чтения или записи

source: Get information about the connection's near side
ru: Получение информации о ближней стороне соединения

source: Get information about the connection's far side
ru: Получение информации о дальней стороне соединения

source: Wait for read/write activity
ru: Ожидание активности чтения/записи

source: Typically a socket session will begin with the setup functions, will set one or more flags, will have a loop with sending and receiving functions, will end with the teardown functions -- as an example at the end of this section will show. Throughout, there may be error-checking and waiting functions for synchronization. To prevent a fiber containing socket functions from "blocking" other fibers, the :ref:`implicit yield rules <atomic-implicit-yields>` will cause a yield so that other processes may take over, as is the norm for :ref:`cooperative multitasking <atomic-cooperative_multitasking>`.
ru: Как правило, сессия сокета начинается с функций настройки, определяет один или более флагов, запустит цикл с функциями отправки и получения и закончится функциями завершения -- как в примере в конце данного раздела. В течение сессии может быть проверка на ошибки и ожидание синхронизации функции. Чтобы файбер с сокетом не блокировал другие файберы, :ref:`правила неявной передачи управления <atomic-implicit-yields>` заставят его передать управление другим процессам в рамках :ref:`кооперативной многозадачности <atomic-cooperative_multitasking>`.

source: For all examples in this section the socket name will be sock and the function invocations will look like ``sock:function_name(...)``.
ru: Для всех примеров в данном разделе имя сокета будет sock, а вызов функции будет выглядеть как ``sock:имя_функции(...)``.

source: Create a new TCP or UDP socket. The argument values are the same as in the `Linux socket(2) man page <http://man7.org/linux/man-pages/man2/socket.2.html>`_.
ru: Создание нового TCP-сокета или UDP-сокета. Значения аргумента остаются теми же, что и на `странице socket(2) руководства по Linux <http://man7.org/linux/man-pages/man2/socket.2.html>`_.

source: an unconnected socket, or nil.
ru: неподключенный сокет или nil.

source: Connect a socket to a remote host.
ru: Подключение к удаленному хосту с помощью сокета.

source: URL or IP address
ru: URL или IP-адрес

source: port number
ru: номер порта

source: timeout
ru: время ожидания

source: a connected socket, if no error.
ru: подключенный сокет, если нет ошибки.

source: The ``socket.getaddrinfo()`` function is useful for finding information about a remote site so that the correct arguments for ``sock:sysconnect()`` can be passed. This function may use the :ref:`worker_pool_threads <cfg_basic-worker_pool_threads>` configuration parameter.
ru: Функция ``socket.getaddrinfo()`` используется для поиска информации об удаленном узле, чтобы можно было передать правильные аргументы для ``sock:sysconnect()``. Эта функция может использовать конфигурационный параметр :ref:`worker_pool_threads <cfg_basic-worker_pool_threads>`.

source: A table containing these fields: "host", "family", "type", "protocol", "port".
ru: Таблица со следующими полями: "host", "family", "type", "protocol", "port".

source: The ``socket.tcp_server()`` function makes Tarantool act as a server that can accept connections. Usually the same objective is accomplished with :ref:`box.cfg{listen=...} <cfg_basic-listen>`.
ru: Функция ``socket.tcp_server()`` заставляет Tarantool выступать в качестве сервера для принятия подключений. Обычно для этой же цели используется :ref:`box.cfg{listen=...} <cfg_basic-listen>`.

source: host name or IP
ru: имя или IP хоста

source: host port, may be 0
ru: порт хоста, может быть 0

source: what to execute when a connection occurs
ru: что выполнить после подключения

source: number of seconds to wait before timing out
ru: количество секунд ожидания

source: The handler-function parameter may be a function name (for example ``function_55``), a function declaration (for example ``function () print('!') end``), or a table including handler = function (for example ``{handler=function_55, name='A'}``).
ru: Параметр handler-function может представлять собой имя функции (например, ``function_55``), объявление функции (например, ``function () print('!') end``) или таблицу с handler = функция (например, ``{handler=function_55, name='A'}``).

source: Connect an existing socket to a remote host. The argument values are the same as in :ref:`tcp_connect() <socket-tcp_connect>`. The host must be an IP address.
ru: Подключение к удаленному хосту с помощью существующего сокета. Значения аргументов будут такие же, как в :ref:`tcp_connect() <socket-tcp_connect>`. Хост должен представлять собой IP-адрес.

source: Parameters:
ru: Параметры:

source: Either:
ru: Либо:

source: host - a string representation of an IPv4 address or an IPv6 address;
ru: host -- строковое представление IPv4 адреса или IPv6 адреса;

source: port - a number.
ru: port -- число.

source: Or:
ru: Либо:

source: host - a string containing "unix/";
ru: host -- строка, которая содержит "unix/";

source: port - a string containing a path to a unix socket.
ru: port -- строка, которая содержит путь к Unix-сокету.

source: host - a number, 0 (zero), meaning "all local interfaces";
ru: host -- число, 0 (ноль), что означает "все локальные интерфейсы";

source: port - a number. If a port number is 0 (zero), the socket will be bound to a random local port.
ru: port -- число. Если номер порта -- 0 (ноль), сокет будет привязан к случайному локальному порту.

source: the socket object value may change if sysconnect() succeeds.
ru: значение объекта сокета может изменяться, если будет выполнена функция sysconnect().

source: Send data over a connected socket.
ru: Отправка данных по подключенному сокету.

source: what is to be sent
ru: что отправляется

source: the number of bytes sent.
ru: количество отправляемых байтов.

source: Possible errors: nil on error.
ru: Возможные ошибки: nil в случае ошибки.

source: Write as much data as possible to the socket buffer if non-blocking. Rarely used. For details see `this description`_.
ru: Запись максимально возможного количества данных в буфер сокета без блокировки. Используется редко. Для получения подробной информации см. описание по ссылке `this description`_.

source: Read ``size`` bytes from a connected socket. An internal read-ahead buffer is used to reduce the cost of this call.
ru: Чтение количества байтов, определенного в ``size``, из подключенного сокета. Внутренний буфер опережающего считывания используется для уменьшения использования ресурсов на вызов.

source: a string of the requested length on success.
ru: строка запрошенной длины, если выполнено.

source: Possible errors: On error, returns an empty string, followed by status, errno, errstr. In case the writing side has closed its end, returns the remainder read from the socket (possibly an empty string), followed by "eof" status.
ru: Возможные ошибки: В случае ошибки возвращается пустая строка, после чего статус, errno, errstr. Если передача данных на запись закрыта с другой стороны, возвращаются оставшиеся для чтения данные из сокета (возможно, пустая строка), после чего идет статус "eof" (конец файла).

source: Read from a connected socket until some condition is true, and return the bytes that were read. Reading goes on until ``limit`` bytes have been read, or a delimiter has been read, or a timeout has expired.
ru: Чтение данных из подключенного сокета до выполнения какого-либо условия и возврат прочтенных байтов. Чтение данных производится в таком количестве, которое указано в параметре ``limit``, либо до символа-разделителя, либо до истечения времени ожидания.

source: maximum number of bytes to read, for example 50 means "stop after 50 bytes"
ru: максимальное количество байтов для чтения, например, 50 означает "остановиться на 50 байтах"

source: separator for example '?' means "stop after a question mark"
ru: разделитель, например, '?' означает "остановиться после знака вопроса"

source: maximum number of seconds to wait for example 50 means "stop after 50 seconds".
ru: максимальное количество секунд ожидания, например, 50 означает "остановиться через 50 секунд".

source: an empty string if there is nothing more to read, or a nil value if error, or a string up to ``limit`` bytes long, which may include the bytes that matched the ``delimiter`` expression.
ru: пустая строка, если нет данных для чтения, либо нулевое значение nil в случае ошибки, либо строка, ограниченная количеством байтов в ``limit``, которая может включать в себя байты, совпадающие с выражением ``delimiter``.

source: Return data from the socket buffer if non-blocking. In case the socket is blocking, ``sysread()`` can block the calling process. Rarely used. For details, see also `this description <https://github.com/tarantool/tarantool/wiki/sockets%201.6>`_.
ru: Возврат данных из буфера сокета без блокировки.Если сокет с блокировкой, ``sysread()`` может блокировать процесс вызова. Используется редко. Для получения подробной информации, см. `описание <https://github.com/tarantool/tarantool/wiki/sockets%201.6>`_.

source: an empty string if there is nothing more to read, or a nil value if error, or a string up to ``size`` bytes long.
ru: пустая строка, если нет данных для чтения, либо нулевое значение nil в случае ошибки, либо строка, ограниченная количеством байтов в ``size``.

source: Bind a socket to the given host/port. A UDP socket after binding can be used to receive data (see :ref:`socket_object.recvfrom <socket-recvfrom>`). A TCP socket can be used to accept new connections, after it has been put in listen mode.
ru: Привязка сокета к данному хосту/порту. UDP-сокет после привязки может использоваться для получения данных (см. :ref:`socket_object.recvfrom <socket-recvfrom>`). TCP-сокет может использоваться для принятия новых соединений после перевода в режим прослушивания.

source: Start listening for incoming connections.
ru: Начало прослушивания входящих соединений.

source: true for success, false for error.
ru: true (правда), если выполнено, false (ложь) в случае ошибки.

source: boolean.
ru: boolean (логический).
