Repository: tarantool/doc
Catalog: locale/*/LC_MESSAGES/doc.po
Languages: ru

source: While sometimes it's okay to put an if/for/while with a small body on the same line, never do this for multi-clause statements. Also avoid folding such long lines!
ru: Иногда можно разместить тело цикла if/for/while в той же строке, но если операторов несколько, никогда так не делайте. И избегайте свертывания таких длинных строк!

source: Definitely not::
ru: Точно неправильно:

source: Comments
ru: Комментарии

source: Comments that contradict the code are worse than no comments. Always make a priority of keeping the comments up-to-date when the code changes!
ru: Комментарии, которые противоречат коду, хуже, чем отсутствие комментариев. Всегда считайте первоочередной задачей исправить комментарии, если меняется код!

source: Comments should be complete sentences. If a comment is a phrase or sentence, its first word should be capitalized, unless it is an identifier that begins with a lower case letter (never alter the case of identifiers!).
ru: Комментарии должны представлять собой законченные предложения. Если комментарием будет фраза или предложение, первое слово должно быть написано с заглавной буквы, если только это не идентификатор, который пишется со строчной буквы (никогда не меняйте регистр идентификаторов!).

source: If a comment is short, the period at the end can be omitted. Block comments generally consist of one or more paragraphs built out of complete sentences, and each sentence should end in a period.
ru: Если комментарий короткий, точку в конце предложения можно опустить. Блок комментариев обычно состоит из одного или более абзацев, составленных из полных предложений, поэтому каждое предложение должно заканчиваться точкой.

source: You should use two spaces after a sentence-ending period.
ru: После точки в конце предложения следует ставить два пробела.

source: When writing English, Strunk and White apply.
ru: Если вы пишете на английском языке, не забывайте о рекомендациях Странка и Уайта по стилю.

source: Python coders from non-English speaking countries: please write your comments in English, unless you are 120% sure that the code will never be read by people who don't speak your language.
ru: Разработчики на языке Python из неанглоязычных стран, пишите комментарии на английском, если только вы не уверены на 120%, что ваш код никогда не будут читать люди, не знающие вашего родного языка.

source: Block Comments
ru: Блок комментариев

source: Block comments generally apply to some (or all) code that follows them, and are indented to the same level as that code. Each line of a block comment starts with a ``#`` and a single space (unless it is indented text inside the comment).
ru: Блок комментариев обычно сопровождает фрагмент кода (или весь код), который за ним следует, и находится на том же уровне отступов, что и сам код. Каждая строка блока комментариев должна начинаться с символа ``#`` и одного пробела после него (если только в самом тексте комментария нет отступов).

source: Paragraphs inside a block comment are separated by a line containing a single ``#``.
ru: Абзацы в пределах блока комментариев отделяются строкой, состоящей из одного символа ``#``.

source: Inline Comments
ru: Комментарии в строке с кодом

source: Use inline comments sparingly.
ru: Старайтесь реже использовать подобные комментарии.

source: An inline comment is a comment on the same line as a statement. Inline comments should be separated by at least two spaces from the statement. They should start with a # and a single space.
ru: Встроенный комментарий находится в той же строке, что и оператор. Такие комментарии должны отделяться от оператора хотя бы двумя пробелами. Они должны начинаться с символа # и одного пробела.

source: Inline comments are unnecessary and in fact distracting if they state the obvious. Don't do this::
ru: Комментарии в строке с кодом не нужны и в действительности отвлекают от чтения, если они объясняют очевидное. Не пишите так:

source: x = x + 1 # Increment x
ru: x = x + 1 # Увеличение x

source: But sometimes, this is useful::
ru: Иногда, впрочем, они полезны:

source: x = x + 1 # Compensate for border
ru: x = x + 1 # Место для рамки окна

source: Documentation Strings
ru: Строки документации

source: Conventions for writing good documentation strings (a.k.a. "docstrings") are immortalized in PEP 257.
ru: Соглашения о написании хорошей документации (docstrings) увековечены в PEP 257.

source: Write docstrings for all public modules, functions, classes, and methods. Docstrings are not necessary for non-public methods, but you should have a comment that describes what the method does. This comment should appear after the ``def`` line.
ru: Пишите документацию для всех доступных модулей, функций, классов, методов. Строки документации необязательны для внутренних методов, но нужно добавить комментарий о том, что делает метод. Комментарий должен идти после строки ``def``.

source: PEP 257 describes good docstring conventions. Note that most importantly, the ``"""`` that ends a multiline docstring should be on a line by itself, and preferably preceded by a blank line, e.g.::
ru: PEP 257 объясняет, как правильно и хорошо писать документацию. Следует отметить, что очень важно, чтобы закрывающие ``"""`` стояли на отдельной строке, а предпочтительно, чтобы перед ними была и пустая строка, например:

source: For one liner docstrings, it's okay to keep the closing ``"""`` on the same line.
ru: Для однострочной документации можно оставить закрывающие ``"""`` на той же строке.

source: Version Bookkeeping
ru: Контроль версий

source: If you have to have Subversion, CVS, or RCS crud in your source file, do it as follows. ::
ru: Если вам нужно использовать Subversion, CVS или RCS в ваших исходных кодах, делайте это следующим образом:

source: These lines should be included after the module's docstring, before any other code, separated by a blank line above and below.
ru: Эти строки следует указывать после документации модуля перед любым другим кодом, отделяя их пустыми строками сверху и снизу.

source: Naming Conventions
ru: Соглашения по именованию

source: The naming conventions of Python's library are a bit of a mess, so we'll never get this completely consistent -- nevertheless, here are the currently recommended naming standards. New modules and packages (including third party frameworks) should be written to these standards, but where an existing library has a different style, internal consistency is preferred.
ru: Соглашения по именованию переменных в Python довольно запущены, поэтому полной согласованности невозможно будет добиться. Тем не менее, ниже мы приводим список рекомендованных стандартов именования. Новые модули и пакеты (включая сторонние) должны быть написаны в соответствии с этими стандартами, но если уже существующая библиотека написана в другом стиле, предпочтительно поддерживать согласованность.

source: Descriptive: Naming Styles
ru: Описание: Стили имен

source: There are a lot of different naming styles. It helps to be able to recognize what naming style is being used, independently from what they are used for.
ru: Существует много различных стилей именования. Полезно распознавать, какой стиль именования используется независимо от того, для чего он используется.

source: The following naming styles are commonly distinguished:
ru: Обычно различают следующие стили именования:

source: ``b`` (single lowercase letter)
ru: ``b`` (отдельная строчная буква)

source: ``B`` (single uppercase letter)
ru: ``B`` (отдельная заглавная буква)

source: ``lowercase``
ru: ``lowercase`` (слово в нижнем регистре)

source: ``lower_case_with_underscores``
ru: ``lower_case_with_underscores`` (слова из строчных букв с символами подчеркивания)

source: ``UPPERCASE``
ru: ``UPPERCASE`` (заглавные буквы)

source: ``UPPER_CASE_WITH_UNDERSCORES``
ru: UPPERCASE_WITH_UNDERSCORES (слова из заглавных букв с символами подчеркивания)

source: ``CapitalizedWords`` (or CapWords, or CamelCase -- so named because of the bumpy look of its letters [3]_). This is also sometimes known as StudlyCaps.
ru: ``CapitalizedWords`` (слова с заглавными буквами, или CapWords, или CamelCase -- называется так, потому что прописные буквы внутри слова напоминают горбы верблюда [3]_). Иногда называется StudlyCaps.

source: Note: When using abbreviations in CapWords, capitalize all the letters of the abbreviation. Thus HTTPServerError is better than HttpServerError.
ru: Примечание: когда вы используете аббревиатуры в стиле CapWords, пишите все буквы аббревиатуры заглавными. HTTPServerError выглядит лучше, чем HttpServerError.

source: ``mixedCase`` (differs from CapitalizedWords by initial lowercase character!)
ru: mixedCase (отличается от CapitalizedWords тем, что первое слово начинается со строчной буквы!)

source: ``Capitalized_Words_With_Underscores`` (ugly!)
ru: Capitalized_Words_With_Underscores (слова с заглавными буквами и символами подчеркивания -- уродливо!)

source: There's also the style of using a short unique prefix to group related names together. This is not used much in Python, but it is mentioned for completeness. For example, the ``os.stat()`` function returns a tuple whose items traditionally have names like ``st_mode``, ``st_size``, ``st_mtime`` and so on. (This is done to emphasize the correspondence with the fields of the POSIX system call struct, which helps programmers familiar with that.)
ru: Еще есть стиль, в котором к именам из одной логической группы добавляется короткий уникальный префикс. Этот стиль редко используется в Python, но упомянем его для полноты изложения. Например, функция ``os.stat()`` возвращает кортеж, имена в котором традиционно выглядят так: ``st_mode``, ``st_size``, ``st_mtime`` и так далее. (Так сделано, чтобы подчеркнуть соответствие этих полей структуре системных вызовов POSIX, что помогает знакомым с ней разработчикам).

source: The X11 library uses a leading X for all its public functions. In Python, this style is generally deemed unnecessary because attribute and method names are prefixed with an object, and function names are prefixed with a module name.
ru: В библиотеке X11 используется префикс Х для всех доступных функций. В Python этот стиль считается лишним, потому что перед полями и именами методов стоит имя объекта, а перед именами функций стоит имя модуля.

source: In addition, the following special forms using leading or trailing underscores are recognized (these can generally be combined with any case convention):
ru: Кроме того, используются следующие специальные формы записи имен с добавлением символа подчеркивания в начало или конец имени (их можно использовать с любым типом регистра):

source: ``_single_leading_underscore``: weak "internal use" indicator. E.g. ``from M import *`` does not import objects whose name starts with an underscore.
ru: ``_single_leading_underscore``: слабый индикатор "для внутреннего пользования". Например, ``from M import *`` не будет импортировать объекты, имена которых начинаются с символа подчеркивания.

source: ``single_trailing_underscore_``: used by convention to avoid conflicts with Python keyword, e.g. ::
ru: ``single_trailing_underscore_``: используется по соглашению во избежание конфликтов с ключевыми словами Python, например:

source: ``__double_leading_underscore``: when naming a class attribute, invokes name mangling (inside class FooBar, ``__boo`` becomes ``_FooBar__boo``; see below).
ru: ``__double_leading_underscore``: изменяет имя атрибута класса (в классе FooBar, ``__boo`` становится ``_FooBar__boo``; см. ниже).

source: ``__double_leading_and_trailing_underscore__``: "magic" objects or attributes that live in user-controlled namespaces. E.g. ``__init__``, ``__import__`` or ``__file__``. Never invent such names; only use them as documented.
ru: ``__double_leading_and_trailing_underscore__``: "волшебные" объекты или атрибуты, которые находятся в live in в пространствах имен, управляемых пользователем. Например, ``__init__``, ``__import__`` или ``__file__``. Не придумывайте такие имена, используйте их только так, как написано в документации.

source: Prescriptive: Naming Conventions
ru: Предписания: соглашения по именованию

source: Names to Avoid
ru: Имена, которых следует избегать

source: Never use the characters 'l' (lowercase letter el), 'O' (uppercase letter oh), or 'I' (uppercase letter eye) as single character variable names.
ru: Никогда не используйте символы 'l' (строчная латинская буква эль), 'O' (заглавная латинская буква о) или 'I' (заглавная латинская буква ай) в качестве однобуквенных имен переменных.

source: In some fonts, these characters are indistinguishable from the numerals one and zero. When tempted to use 'l', use 'L' instead.
ru: В некоторых шрифтах эти символы неотличимы от цифр один и ноль. Если нельзя обойтись без 'l', пишите вместо нее 'L'.

source: Package and Module Names
ru: Имена модулей и пакетов

source: Modules should have short, all-lowercase names. Underscores can be used in the module name if it improves readability. Python packages should also have short, all-lowercase names, although the use of underscores is discouraged.
ru: Имена модулей должны быть короткими и состоять из строчных букв. Можно использовать и символы подчеркивания, если это улучшает читаемость. Имена пакетов Python также должны быть короткими и состоять из строчных букв, но здесь символы подчеркивания не приветствуются.

source: Since module names are mapped to file names, and some file systems are case insensitive and truncate long names, it is important that module names be chosen to be fairly short -- this won't be a problem on Unix, but it may be a problem when the code is transported to older Mac or Windows versions, or DOS.
ru: Так как имена модулей отображаются в именах файлов, а некоторые файловые системы являются нечувствительными к регистру символов и обрезают длинные имена, очень важно использовать достаточно короткие имена модулей -- это не проблема в Unix, но может стать проблемой при переносе кода в старые версии Windows, Mac или DOS.

source: When an extension module written in C or C++ has an accompanying Python module that provides a higher level (e.g. more object oriented) interface, the C/C++ module has a leading underscore (e.g. ``_socket``).
ru: Если для модуля расширения, написанного на С или C++, есть сопутствующий Python-модуль, содержащий интерфейс более высокого уровня (например, более объектно-ориентированный), модуль С/С++ начинается с символа подчеркивания (например, ``_socket``).

source: Class Names
ru: Имена классов

source: Almost without exception, class names use the CapWords convention. Classes for internal use have a leading underscore in addition.
ru: Все имена классов должны соответствовать CapWords почти без исключений. Классы для внутреннего использования могут также начинаться с символа подчеркивания.

source: Exception Names
ru: Имена исключений

source: Because exceptions should be classes, the class naming convention applies here. However, you should use the suffix "Error" on your exception names (if the exception actually is an error).
ru: Так как исключения должны быть классами, к исключениям применяются правила именования классов. Однако вы можете добавить суффикс "Error" в конце имени (если исключение действительно является ошибкой).

source: Global Variable Names
ru: Имена глобальных переменных

source: (Let's hope that these variables are meant for use inside one module only.) The conventions are about the same as those for functions.
ru: (Будем надеяться, что такие имена используются только в пределах одного модуля.) Применяются те же правила, что и для имен функций.

source: Modules that are designed for use via ``from M import *`` should use the ``__all__`` mechanism to prevent exporting globals, or use the older convention of prefixing such globals with an underscore (which you might want to do to indicate these globals are "module non-public").
ru: В модули, которые предназначены для использования с помощью ``from M import *``, следует добавить механизм ``__all__``, чтобы предотвратить экспорт глобальных переменных, или же использовать старое соглашение, добавляя перед именами таких глобальных переменных один символ подчеркивания (которым можно обозначить глобальные переменные, которые используются только внутри модуля).

source: Function Names
ru: Имена функций

source: Function names should be lowercase, with words separated by underscores as necessary to improve readability.
ru: Имена функций должны состоять из строчных букв, а слова разделяться символами подчеркивания, чтобы улучшить читаемость.

source: mixedCase is allowed only in contexts where that's already the prevailing style (e.g. threading.py), to retain backwards compatibility.
ru: mixedCase допускается только в тех местах, где уже преобладает такой стиль (например, threading.py), для обратной совместимости.

source: Function and method arguments
ru: Аргументы функций и методов

source: Always use ``self`` for the first argument to instance methods.
ru: Всегда используйте ``self`` в качестве первого аргумента метода экземпляра.

source: Always use ``cls`` for the first argument to class methods.
ru: Всегда используйте ``cls`` в качестве первого аргумента метода класса.

source: If a function argument's name clashes with a reserved keyword, it is generally better to append a single trailing underscore rather than use an abbreviation or spelling corruption. Thus ``class_`` is better than ``clss``. (Perhaps better is to avoid such clashes by using a synonym.)
ru: Если имя аргумента функции конфликтует с зарезервированным ключевым словом, обычно лучше добавить в конец имени символ подчеркивания, а не сокращать слово или искажать его. Таким образом, ``class_`` лучше, чем ``clss``. (Возможно, будет лучше избегать конфликта имен путем подбора синонима).

source: Method Names and Instance Variables
ru: Имена методов и переменные экземпляров

source: Use the function naming rules: lowercase with words separated by underscores as necessary to improve readability.
ru: Используйте тот же стиль, что и для имен функций: они должны состоять из строчных букв, а слова разделяться символами подчеркивания, чтобы улучшить читаемость.

source: Use one leading underscore only for non-public methods and instance variables.
ru: Используйте только один символ подчеркивания в начале слова для внутренних методов и переменных экземпляров.

source: To avoid name clashes with subclasses, use two leading underscores to invoke Python's name mangling rules.
ru: Чтобы избежать конфликта имен с подклассами, добавьте два символа подчеркивания в начале слова, чтобы включить механизм изменения имен в Python.

source: Python mangles these names with the class name: if class Foo has an attribute named ``__a``, it cannot be accessed by ``Foo.__a``. (An insistent user could still gain access by calling ``Foo._Foo__a``.) Generally, double leading underscores should be used only to avoid name conflicts with attributes in classes designed to be subclassed.
ru: Python изменяет эти имена: если в классе Foo есть атрибут с именем ``__a``, к нему нельзя обратиться через ``Foo.__a``. (Настойчивый пользователь всё равно может получить доступ через ``Foo._Foo__a``.) Вообще, двойное подчеркивание в начале имени должно использоваться только во избежание конфликта имен с атрибутами классов, предназначенных для разделения на подклассы.

source: Note: there is some controversy about the use of __names (see below).
ru: Примечание: есть некоторые разногласия по поводу использования имен __names (см. ниже).

source: Constants
ru: Постоянные

source: Constants are usually defined on a module level and written in all capital letters with underscores separating words. Examples include ``MAX_OVERFLOW`` and ``TOTAL``.
ru: Постоянные обычно объявляются на уровне модуля и записываются только заглавными буквами, а слова разделяются символами подчеркивания. Например: MAX_OVERFLOW, TOTAL.

source: Designing for inheritance
ru: Проектирование наследования

source: Always decide whether a class's methods and instance variables (collectively: "attributes") should be public or non-public. If in doubt, choose non-public; it's easier to make it public later than to make a public attribute non-public.
ru: Обязательно решите, каким должен быть метод класса или переменная экземпляра класса (в общем, атрибут) -- доступными (public) или внутренними (non-public). Если вы сомневаетесь, делайте их внутренними. Потом будет проще открыть к ним доступ, чем наоборот.

source: Public attributes are those that you expect unrelated clients of your class to use, with your commitment to avoid backward incompatible changes. Non-public attributes are those that are not intended to be used by third parties; you make no guarantees that non-public attributes won't change or even be removed.
ru: Доступные атрибуты -- это такие атрибуты, которые будут использовать потребители ваших классов, и вы должны быть уверены в обратной совместимости. Внутренние атрибуты, в свою очередь, не предназначены для использования третьими лицами, поэтому вы можете не гарантировать, что не измените или не удалите эти атрибуты.

source: We don't use the term "private" here, since no attribute is really private in Python (without a generally unnecessary amount of work).
ru: Мы не используем термин "закрытый" (private), потому что на самом деле в Python таких атрибутов не бывает (без ненужных дополнительных усилий).

source: Another category of attributes are those that are part of the "subclass API" (often called "protected" in other languages). Some classes are designed to be inherited from, either to extend or modify aspects of the class's behavior. When designing such a class, take care to make explicit decisions about which attributes are public, which are part of the subclass API, and which are truly only to be used by your base class.
ru: Другой тип атрибутов классов принадлежит так называемому API подклассов (в других языках они часто называются защищенными -- "protected"). Некоторые классы предназначены для наследования другими классами, которые расширяют или изменяют поведение базового класса. Когда вы проектируете такой класс, решите и явным образом укажите, какие атрибуты являются доступными (public), какие относятся к API подклассов (subclass API), а какие используются только базовым классом.

source: With this in mind, here are the Pythonic guidelines:
ru: С учетом вышесказанного, сформулируем рекомендации:

source: Public attributes should have no leading underscores.
ru: В начале имени доступных атрибутов не должно быть символов подчеркивания.

source: If your public attribute name collides with a reserved keyword, append a single trailing underscore to your attribute name. This is preferable to an abbreviation or corrupted spelling. (However, not withstanding this rule, 'cls' is the preferred spelling for any variable or argument which is known to be a class, especially the first argument to a class method.)
ru: Если имя доступного атрибута конфликтует с ключевым словом языка, добавьте в конец имени один символ подчеркивания. Это более предпочтительно, чем сокращать слово или искажать его (однако, у этого правила есть исключение: 'cls' -- это предпочтительное написание любой переменной или аргумента, который означает класс, а особенно первого аргумента метода класса).

source: Note 1:
ru: Примечание 1:

source: See the argument name recommendation above for class methods.
ru: См. рекомендации по именам аргументов выше для методов класса.
