Repository: tarantool/doc
Catalog: locale/*/LC_MESSAGES/doc.po
Languages: ru

source: local http = require('curl').http() local json = require('json') local URI = os.getenv('SERVER_URI') local fiber = require('fiber') local player1 = { name="Player1", id=1, location = { x=1.0001, y=2.0003 } } local player2 = { name="Player2", id=2, location = { x=30.123, y=40.456 } } local pokemon = { name="Pikachu", chance=99.1, id=1, status="active", location = { x=1, y=2 } } function request(method, body, id) local resp = http:request( method, URI, body ) if id ~= nil then print(string.format('Player %d result: %s', id, resp.body)) else print(resp.body) end end local players = {} function catch(player) fiber.sleep(math.random(5)) print('Catch pokemon by player ' .. tostring(player.id)) request( 'POST', '{"method": "catch", "params": [1, '..json.encode(player)..']}', tostring(player.id) ) table.insert(players, player.id) end print('Create pokemon') request('POST', '{"method": "add", "params": ['..json.encode(pokemon)..']}') request('GET', '') fiber.create(catch, player1) fiber.create(catch, player2) -- wait for players while #players ~= 2 do fiber.sleep(0.001) end request('GET', '') os.exit()
ru: local http = require('curl').http() local json = require('json') local URI = os.getenv('SERVER_URI') local fiber = require('fiber') local player1 = { name="Player1", id=1, location = { x=1.0001, y=2.0003 } } local player2 = { name="Player2", id=2, location = { x=30.123, y=40.456 } } local pokemon = { name="Pikachu", chance=99.1, id=1, status="active", location = { x=1, y=2 } } function request(method, body, id) local resp = http:request( method, URI, body ) if id ~= nil then print(string.format('Player %d result: %s', id, resp.body)) else print(resp.body) end end local players = {} function catch(player) fiber.sleep(math.random(5)) print('Catch pokemon by player ' .. tostring(player.id)) request( 'POST', '{"method": "catch", "params": [1, '..json.encode(player)..']}', tostring(player.id) ) table.insert(players, player.id) end print('Create pokemon') request('POST', '{"method": "add", "params": ['..json.encode(pokemon)..']}') request('GET', '') fiber.create(catch, player1) fiber.create(catch, player2) -- подождать игроков while #players ~= 2 do fiber.sleep(0.001) end request('GET', '') os.exit()

source: When you run this script, you’ll notice that both players have equal chances to make the first attempt at catching the pokémon. In a classical Lua script, a networked call blocks the script until it’s finished, so the first catch attempt can only be done by the player who entered the game first. In Tarantool, both players play concurrently, since all modules are integrated with Tarantool :ref:`cooperative multitasking <atomic-cooperative_multitasking>` and use non-blocking I/O.
ru: При запуска этого скрипта вы заметите, что у обоих игроков одинаковые шансы сделать первую попытку поимки покемона. В классическом Lua-скрипте сетевой вызов блокирует скрипт, пока он не будет выполнен, поэтому первым попытаться поймать может тот игрок, который раньше зашел в игру. В Tarantool'е оба игрока играют одновременно, поскольку все модули объединены в :ref:`кооперативной многозадачности <atomic-cooperative_multitasking>` и используют неблокирующий ввод-вывод.

source: Indeed, when Player1 makes its first REST call, the script doesn’t block. The fiber running ``catch()`` function on behalf of Player1 issues a non-blocking call to the operating system and yields control to the next fiber, which happens to be the fiber of Player2. Player2’s fiber does the same. When the network response is received, Player1's fiber is activated by Tarantool cooperative scheduler, and resumes its work. All Tarantool :ref:`modules <built_in_modules>` use non-blocking I/O and are integrated with Tarantool cooperative scheduler. For module developers, Tarantool provides an :ref:`API <index-c_api_reference>`.
ru: Действительно, когда Player1 посылает первый REST-вызов, скрипт не блокируется. Файбер, выполняющий функцию ``catch()`` от Player1, посылает неблокирующий вызов в операционную систему и передает управление на следующий файбер, которым оказывается файбер от Player2. Файбер от Player2 делает то же самое. Когда получен сетевой ответ, файбер от Player1 активируется с помощью кооперативного планировщика Tarantool'а и возобновляет работу. Все :ref:`модули <built_in_modules>` Tarantool'а используют неблокирующий ввод-вывод и интегрированы с кооперативным планировщиком Tarantool'а. Разработчикам модулей Tarantool предоставляет :ref:`API <index-c_api_reference>`.

source: To run this test locally, download our `pokemon <https://github.com/tarantool/pokemon>`_ project from GitHub and say:
ru: Чтобы запустить тест локально, скачайте наш проект `покемон <https://github.com/tarantool/pokemon>`_ из GitHub и вызовите:

source: Docker Compose builds and runs all the three containers: ``pserver`` (Tarantool backend), ``phttp`` (nginx) and ``pclient`` (demo client). You can see log messages from all these containers in the console, pclient saying that it made an HTTP request to create a pokémon, made two catch requests, requested the map (empty since the pokémon is caught and temporarily inactive) and exited:
ru: Docker Compose собирает и запускает все три контейнера: ``pserver`` (бэкенд Tarantool'а), ``phttp`` (nginx) и``pclient`` (демо-клиент). ВЫ можете увидеть все сообщения журнала из всех этих контейнеров в консоли. pclient выведет, что сделал HTTP-запрос на создание покемона, два запроса на поимку покемона, запросил карту (пустая, поскольку покемон пойман и временно неактивен) и завершил работу:

source: Congratulations! Here's the end point of our walk-through. As further reading, see more about :ref:`installing <app_server-installing_module>` and :ref:`contributing <app_server-contributing_module>` a module.
ru: Поздравляем! Вот мы и закончили наш пошаговый пример. Для дальнейшего изучения рекомендуем :ref:`установку <app_server-installing_module>` и :ref:`добавление <app_server-contributing_module>` модуля.

source: See also reference on :ref:`Tarantool modules <built_in_modules>` and :ref:`C API <index-c_api_reference>`, and don't miss our :ref:`Lua cookbook recipes <cookbook>`.
ru: См. также справочник по :ref:`модулям Tarantool'а <built_in_modules>` и :ref:`C API <index-c_api_reference>` и не пропустите наши :ref:`рекомендации по разработке на Lua <cookbook>`.

source: Application server
ru: Сервер приложений

source: In this chapter, we introduce the basics of working with Tarantool as a Lua application server.
ru: В данной главе мы рассмотрим основы работы с Tarantool'ом в качестве сервера приложений на языке Lua.

source: This chapter contains the following sections:
ru: Эта глава состоит из следующих разделов:

source: Installing a module
ru: Установка модуля

source: Modules in Lua and C that come from Tarantool developers and community contributors are available in the following locations:
ru: Модули на Lua и C от разработчиков Tarantool'а и сторонних разработчиков доступны здесь:

source: Tarantool modules repository, and
ru: Репозиторий модулей Tarantool'а и

source: Tarantool deb/rpm repositories.
ru: Репозитории deb/rpm Tarantool'а.

source: Installing a module from a repository
ru: Установка модуля из репозитория

source: See `README in tarantool/rocks repository <https://github.com/tarantool/rocks#managing-modules-with-tarantool-174>`_ for detailed instructions.
ru: Для получения подробной информации см. `README в репозитории tarantool/rocks <https://github.com/tarantool/rocks#managing-modules-with-tarantool-174>`_.

source: Installing a module from deb/rpm
ru: Установка модуля из deb/rpm

source: Follow these steps:
ru: Выполните следующие действия:

source: Install Tarantool as recommended on the `download page <http://tarantool.org/download.html>`_.
ru: Установите Tarantool в соответствии с рекомендациями на `странице загрузки <http://tarantool.org/download.html>`_.

source: Install the module you need. Look up the module's name on `Tarantool rocks page <http://tarantool.org/rocks.html>`_ and put the prefix "tarantool-" before the module name to avoid ambiguity:
ru: Установите необходимый модуль. Найдите имя модуля на `странице со сторонними библиотеками Tarantool'а <http://tarantool.org/rocks.html>`_ и введите префикс "tarantool-" перед названием модуля во избежание неоднозначности:

source: $ # for Ubuntu/Debian: $ sudo apt-get install tarantool-<module-name> $ # for RHEL/CentOS/Amazon: $ sudo yum install tarantool-<module-name>
ru: $ # для Ubuntu/Debian: $ sudo apt-get install tarantool-<module-name> $ # для RHEL/CentOS/Amazon: $ sudo yum install tarantool-<module-name>

source: For example, to install the module `shard <http://github.com/tarantool/shard>`_ on Ubuntu, say:
ru: Например, чтобы установить модуль `shard <http://github.com/tarantool/shard>`_ на Ubuntu, введите:

source: Once these steps are complete, you can:
ru: Теперь можно:

source: load any module with
ru: загружать любой модуль с помощью

source: for example:
ru: например:

source: search locally for installed modules using ``package.path`` (Lua) or ``package.cpath`` (C):
ru: локально находить установленные модули с помощью ``package.path`` (Lua) или ``package.cpath`` (C):

source: Question-marks stand for the module name that was specified earlier when saying ``require('module-name')``.
ru: Знаки вопроса стоят вместо имени модуля, которое было указано ранее при вызове ``require('module-name')``.

source: Launching an application
ru: Запуск приложения

source: Using Tarantool as an application server, you can write your own applications. Tarantool’s native language for writing applications is `Lua <http://www.lua.org/about.html>`_, so a typical application would be a file that contains your Lua script. But you can also write applications in C or C++.
ru: Используя Tarantool в качестве сервера приложений, вы можете написать собственные приложения. Собственный язык Tarantool’а для приложений -- `Lua <http://www.lua.org/about.html>`_, поэтому типовое приложение представляет собой файл, который содержит Lua-скрипт. Однако вы также можете писать приложения на C или C++.

source: If you're new to Lua, we recommend going over the interactive Tarantool tutorial before proceeding with this chapter. To launch the tutorial, say ``tutorial()`` in Tarantool console:
ru: Если вы только осваиваете Lua, рекомендуем выполнить практическое задание по Tarantool'у до работы с данной главой. Для запуска практического задания, выполните команду ``tutorial()`` в консоли Tarantool'а:

source: Let's create and launch our first Lua application for Tarantool. Here's a simplest Lua application, the good old "Hello, world!":
ru: Создадим и запустим первое приложение на языке Lua для Tarantool'а -- самое простое приложение, старую добрую программу "Hello, world!":

source: We save it in a file. Let it be ``myapp.lua`` in the current directory.
ru: Сохраним приложение в файле. Пусть это будет ``myapp.lua`` в текущей директории.

source: Now let's discuss how we can launch our application with Tarantool.
ru: Теперь рассмотрим, как можно запустить наше приложение с Tarantool'ом.

source: Launching in Docker
ru: Запуск в Docker

source: To run Tarantool with our application, we can say:
ru: Чтобы запустить Tarantool с нашим приложением, можно выполнить команду:

source: Here two resources on the host get mounted in the container:
ru: Здесь два ресурса подключаются к серверу в контейнере:

source: our application file (``\`pwd\`/myapp.lua``) and
ru: наш файл с приложением (``\`pwd\`/myapp.lua``) и

source: Tarantool data directory (``/data/dir/on/host``).
ru: каталог данных Tarantool'а (``/data/dir/on/host``).

source: By convention, the directory for Tarantool application code inside a container is ``/opt/tarantool``, and the directory for data is ``/var/lib/tarantool``.
ru: Традиционно в контейнере директория ``/opt/tarantool`` используется для кода приложения Tarantool'а, а директория ``/var/lib/tarantool`` используется для данных.

source: Launching a binary program
ru: Запуск бинарной программы

source: If we run Tarantool from a :ref:`binary package <getting_started-using_binary>` or from a :ref:`source build <building_from_source>`, we can launch our application:
ru: При запуске Tarantool'а из :ref:`бинарного пакета <getting_started-using_binary>` или :ref:`сборке из исходников <building_from_source>`, можно запустить наше приложение:

source: in the script mode,
ru: в режиме скрипта,

source: as a server application, or
ru: как серверное приложение или

source: as a daemon service.
ru: как демон службы.

source: The simplest way is to pass the filename to Tarantool at start:
ru: Самый простой способ -- передать имя файла в Tarantool при запуске:

source: Tarantool starts, executes our script in the **script mode** and exits.
ru: Tarantool запускается, выполняет наш скрипт в **режиме скрипта** и завершает работу.

source: Now let’s turn this script into a **server application**. We use :ref:`box.cfg <box_introspection-box_cfg>` from Tarantool’s built-in Lua module to:
ru: Теперь превратим этот скрипт в **серверное приложение**. Используем :ref:`box.cfg <box_introspection-box_cfg>` из встроенного в Tarantool Lua-модуля, чтобы:

source: launch the database (a database has a persistent on-disk state, which needs to be restored after we start an application) and
ru: запустить базу данных (данные в базе находятся в персистентном состоянии на диске, которое следует восстановить после запуска приложения) и

source: configure Tarantool as a server that accepts requests over a TCP port.
ru: настроить Tarantool как сервер, который принимает запросы по TCP-порту.

source: We also add some simple database logic, using :ref:`space.create() <box_schema-space_create>` and :ref:`create_index() <box_space-create_index>` to create a space with a primary index. We use the function :ref:`box.once() <box-once>` to make sure that our logic will be executed only once when the database is initialized for the first time, so we don't try to create an existing space or index on each invocation of the script:
ru: Также добавим простую логику для базы данных, используя :ref:`space.create() <box_schema-space_create>` и :ref:`create_index() <box_space-create_index>` для создания спейса с первичным индексом. Используем функцию :ref:`box.once() <box-once>`, чтобы обеспечить единовременное выполнение логики после первоначальной инициализации базы данных, поскольку мы не хотим создавать уже существующий спейс или индекс при каждом обращении к скрипту:

source: #!/usr/bin/env tarantool -- Configure database box.cfg { listen = 3301 } box.once("bootstrap", function() box.schema.space.create('tweedledum') box.space.tweedledum:create_index('primary', { type = 'TREE', parts = {1, 'unsigned'}}) end)
ru: #!/usr/bin/env tarantool -- настроить базу данных box.cfg { listen = 3301 } box.once("bootstrap", function() box.schema.space.create('tweedledum') box.space.tweedledum:create_index('primary', { type = 'TREE', parts = {1, 'unsigned'}}) end)

source: Now we launch our application in the same manner as before:
ru: Далее запустим наше приложение, как делали ранее:

source: This time, Tarantool executes our script and keeps working as a server, accepting TCP requests on port 3301. We can see Tarantool in the current session’s process list:
ru: На этот раз Tarantool выполняет скрипт и продолжает работать в качестве сервера, принимая TCP-запросы на порт 3301. Можно увидеть Tarantool в списке процессов текущей сессии:

source: But the Tarantool instance will stop if we close the current terminal window. To detach Tarantool and our application from the terminal window, we can launch it in the **daemon mode**. To do so, we add some parameters to ``box.cfg{}``:
ru: Однако экземпляр Tarantool'а завершит работу, если мы закроем окно командной строки. Чтобы отделить Tarantool и приложение от окна командной строки, можно запустить **режим демона**. Для этого добавим некоторые параметры в ``box.cfg{}``:

source: :ref:`background <cfg_basic-background>` = ``true`` that actually tells Tarantool to work as a daemon service,
ru: :ref:`background <cfg_basic-background>` = ``true``, который собственно заставит Tarantool работать в качестве демона,

source: :ref:`log <cfg_logging-log>` = ``'dir-name'`` that tells the Tarantool daemon where to store its log file (other log settings are available in Tarantool :ref:`log <log-module>` module), and
ru: :ref:`log <cfg_logging-log>` = ``'dir-name'``, который укажет, где демон Tarantool'а будет сохранять файл журнала (другие настройки журнала находятся в модуле Tarantool'а :ref:`log <log-module>` module), а также

source: :ref:`pid_file <cfg_basic-pid_file>` = ``'file-name'`` that tells the Tarantool daemon where to store its pid file.
ru: :ref:`pid_file <cfg_basic-pid_file>` = ``'file-name'``, который укажет, где демон Tarantool'а будет сохранять файл журнала pid-файл.

source: For example:
ru: Например:

source: We launch our application in the same manner as before:
ru: Запустим наше приложение, как делали ранее:

source: Tarantool executes our script, gets detached from the current shell session (you won't see it with ``ps | grep "tarantool"``) and continues working in the background as a daemon attached to the global session (with SID = 0):
ru: Tarantool выполняет наш скрипт, отделяется от текущей сессии (он не отображается при вводе ``ps | grep "tarantool"``) и продолжает работать в фоновом режиме в качестве демона, прикрепленного к общей сессии (с SID = 0):

source: Now that we have discussed how to create and launch a Lua application for Tarantool, let's dive deeper into programming practices.
ru: Рассмотрев создание и запуск Lua-приложения для Tarantool'а, перейдем к углубленному изложению методик программирования.

source: Reloading a module
ru: Перезагрузка модуля

source: You can reload any Tarantool application or module with zero downtime.
ru: Любое приложение или модуль Tarantool'а можно перезагрузить с нулевым временем простоя.

source: Reloading a module in Lua
ru: Перезагрузка модуля на Lua

source: Here's an example that illustrates the most typical case -- "update and reload".
ru: Ниже представлен пример, который иллюстрирует наиболее типичный случай -- "обновление и перезагрузка".

source: In this example, we use recommended :ref:`administration practices <admin>` based on :ref:`instance files <admin-instance_file>` and :ref:`tarantoolctl <tarantoolctl>` utility.
ru: В этом примере используются рекомендованные :ref:`методики администрирования <admin>` на основании :ref:`файлов экземпляров <admin-instance_file>` и утилиты :ref:`tarantoolctl <tarantoolctl>`.

source: Update the application file.
ru: Обновите файлы приложения.

source: For example, a module in ``/usr/share/tarantool/app.lua``:
ru: Например, модуль в ``/usr/share/tarantool/app.lua``:

source: local function start() -- initial version box.once("myapp:v1.0", function() box.schema.space.create("somedata") box.space.somedata:create_index("primary") ... end) -- migration code from 1.0 to 1.1 box.once("myapp:v1.1", function() box.space.somedata.index.primary:alter(...) ... end) -- migration code from 1.1 to 1.2 box.once("myapp:v1.2", function() box.space.somedata.index.primary:alter(...) box.space.somedata:insert(...) ... end) end -- start some background fibers if you need local function stop() -- stop all background fibers and clean up resources end local function api_for_call(xxx) -- do some business end return { start = start, stop = stop, api_for_call = api_for_call }
ru: local function start() -- начальная версия box.once("myapp:v1.0", function() box.schema.space.create("somedata") box.space.somedata:create_index("primary") ... end) -- код миграции с 1.0 на 1.1 box.once("myapp:v1.1", function() box.space.somedata.index.primary:alter(...) ... end) -- код миграции с 1.1 на 1.2 box.once("myapp:v1.2", function() box.space.somedata.index.primary:alter(...) box.space.somedata:insert(...) ... end) end -- запустить файберы в фоновом режиме, если необходимо local function stop() -- остановить все файберы, работающие в фоновом режиме, и очистить ресурсы end local function api_for_call(xxx) -- do some business end return { start = start, stop = stop, api_for_call = api_for_call }

source: Update the :ref:`instance file <admin-instance_file>`.
ru: Обновить :ref:`файл экземпляра <admin-instance_file>`.

source: For example, ``/etc/tarantool/instances.enabled/my_app.lua``:
ru: Например, ``/etc/tarantool/instances.enabled/my_app.lua``:

source: #!/usr/bin/env tarantool -- -- hot code reload example -- box.cfg({listen = 3302}) -- ATTENTION: unload it all properly! local app = package.loaded['app'] if app ~= nil then -- stop the old application version app.stop() -- unload the application package.loaded['app'] = nil -- unload all dependencies package.loaded['somedep'] = nil end -- load the application log.info('require app') app = require('app') -- start the application app.start({some app options controlled by sysadmins})
ru: #!/usr/bin/env tarantool -- -- hot code reload example -- box.cfg{listen = 3302}}) -- ATTENTION: unload it all properly! local app = package.loaded['app'] if app ~= nil then -- stop the old application version app.stop() -- unload the application package.loaded['app'] = nil -- unload all dependencies package.loaded['somedep'] = nil end -- load the application log.info('require app') app = require('app') -- start the application app.s{some app options controlled by sysadmins}mins})

source: The important thing here is to properly unload the application and its dependencies.
ru: Самое главное -- правильно разгрузить приложение и его зависимости.

source: Manually reload the application file.
ru: Вручную перезагрузите файл приложения.

source: For example, using ``tarantoolctl``:
ru: Например, используя ``tarantoolctl``:

source: Reloading a module in C
ru: Перезагрузка модуля на С

source: After you compiled a new version of a C module (``*.so`` shared library), call :ref:`box.schema.func.reload('module-name') <box_schema-func_reload>` from your Lua script to reload the module.
ru: После компиляции новой версии модуля на C (библиотека общего пользования ``*.so``), вызовите функцию :ref:`box.schema.func.reload('module-name') <box_schema-func_reload>` из Lua-скрипта для перезагрузки модуля.

source: Developing with an IDE
ru: Разработка с IDE

source: You can use IntelliJ IDEA as an IDE to develop and debug Lua applications for Tarantool.
ru: Для разработки и отладки Lua-приложений для Tarantool'а можно использовать IntelliJ IDEA в качестве интегрированной среды разработки (IDE).

source: Download and install the IDE from the `official web-site <https://www.jetbrains.com/idea/>`_.
ru: Загрузите и установите IDE с `официального сайта <https://www.jetbrains.com/idea/>`_.

source: JetBrains provides specialized editions for particular languages: IntelliJ IDEA (Java), PHPStorm (PHP), PyCharm (Python), RubyMine (Ruby), CLion (C/C++), WebStorm (Web) and others. So, download a version that suits your primary programming language.
ru: JetBrains предоставляет специализированные версии для разных языков программирования: IntelliJ IDEA (Java), PHPStorm (PHP), PyCharm (Python), RubyMine (Ruby), CLion (C/C++), WebStorm (Web) и другие. Поэтому загрузите версию, которая подходит предпочитаемому языку.

source: Tarantool integration is supported for all editions.
ru: Для всех версий поддерживается интеграция с Tarantool'ом.

source: Configure the IDE:
ru: Настройте IDE:

source: Start IntelliJ IDEA.
ru: Запустите IntelliJ IDEA.

source: Click ``Configure`` button and select ``Plugins``.
ru: Нажмите кнопку ``Configure`` и выберите ``Plugins``.

source: Click ``Browse repositories``.
ru: Нажмите ``Browse repositories``.

source: Install ``EmmyLua`` plugin.
ru: Установите плагин ``EmmyLua``.
