Repository: tarantool/doc
Catalog: locale/*/LC_MESSAGES/doc.po
Languages: ru

source: Primarily, the .snap file's records are ordered by space id. Therefore the records of system spaces -- such as ``_schema``, ``_space``, ``_index``, ``_func``, ``_priv`` and ``_cluster`` -- will be at the start of the .snap file, before the records of any spaces that were created by users.
ru: В первую очередь записи в .snap-файле упорядочены по идентификатору спейса. Таким образом, записи в системные спейсы -- такие как ``_schema``, ``_space``, ``_index``, ``_func``, ``_priv`` и ``_cluster`` -- будут находиться в начале .snap-файла до записей в другие спейсы, созданные пользователями.

source: Secondarily, the .snap file's records are ordered by primary key within space id.
ru: Во вторую очередь записи в .snap-файле упорядочены по первичному ключу.

source: The recovery process
ru: Процесс восстановления

source: The recovery process begins when box.cfg{} happens for the first time after the Tarantool server instance starts.
ru: Процесс восстановления начинается, когда box.cfg{} впервые используется после запуска экземпляра Tarantool-сервера.

source: The recovery process must recover the databases as of the moment when the instance was last shut down. For this it may use the latest snapshot file and any WAL files that were written after the snapshot. One complicating factor is that Tarantool has two engines -- the memtx data must be reconstructed entirely from the snapshot and the WAL files, while the vinyl data will be on disk but might require updating around the time of a checkpoint. (When a snapshot happens, Tarantool tells the vinyl engine to make a checkpoint, and the snapshot operation is rolled back if anything goes wrong, so vinyl's checkpoint is at least as fresh as the snapshot file.)
ru: Процесс восстановления должен восстановить базы данных на момент последнего отключения экземпляра. Для этого можно использовать последний файл снимка и любые WAL-файлы, которые были записаны после создания снимка. Ситуацию осложняет фактор того, что в Tarantool'е используются два движка -- данные memtx'а должны быть реконструированы полностью из снимка и WAL-файлов, тогда как данные vinyl'а будут находиться на диске, но может потребоваться их обновление на время создания контрольной точки. (При создании снимка Tarantool передает движку vinyl команду создания контрольной точки, а операция создания снимка откатывается в случае какой-либо ошибки, поэтому контрольная точка vinyl'а будет настолько же актуальной, как и файл снимка.)

source: Step 1
ru: Шаг 1

source: Read the configuration parameters in the ``box.cfg{}`` request. Parameters which affect recovery may include :ref:`work_dir <cfg_basic-work_dir>`, :ref:`wal_dir <cfg_basic-wal_dir>`, :ref:`memtx_dir <cfg_basic-memtx_dir>`, :ref:`vinyl_dir <cfg_basic-vinyl_dir>` and :ref:`force_recovery <cfg_binary_logging_snapshots-force_recovery>`.
ru: Выполнить чтение конфигурационных параметров из запроса ``box.cfg{}``. Параметры, которые могут повлиять на восстановление: :ref:`work_dir <cfg_basic-work_dir>`, :ref:`wal_dir <cfg_basic-wal_dir>`, :ref:`memtx_dir <cfg_basic-memtx_dir>`, :ref:`vinyl_dir <cfg_basic-vinyl_dir>` и :ref:`force_recovery <cfg_binary_logging_snapshots-force_recovery>`.

source: Step 2
ru: Шаг 2

source: Find the latest snapshot file. Use its data to reconstruct the in-memory databases. Instruct the vinyl engine to recover to the latest checkpoint.
ru: Найти последний файл снимка. Использовать данные для реконструкции in-memory баз данных. Передать команду vinyl'у о восстановлении до последней контрольной точки.

source: There are actually two variations of the reconstruction procedure for memtx databases, depending on whether the recovery process is "default".
ru: На самом деле, есть два варианта реконструкции баз данных memtx'а в зависимости от того, выполняется ли стандартная процедура.

source: If the recovery process is default (``force_recovery`` is ``false``), memtx can read data in the snapshot with all indexes disabled. First, all tuples are read into memory. Then, primary keys are built in bulk, taking advantage of the fact that the data is already sorted by primary key within each space.
ru: Если выполняется стандартная процедура (``force_recovery`` = ``false``), memtx может выполнить чтение данных из снимка с отключенными индексами. Сначала все кортежи считываются в память. Затем происходит массовая загрузка первичных ключей с учетом того, что данные уже отсортированы по первичному ключу в каждом спейсе.

source: If the recovery process is non-default (``force_recovery`` is ``true``), Tarantool performs additional checking. Indexes are enabled at the start, and tuples are added one by one. This means that any unique-key constraint violations will be caught, and any duplicates will be skipped. Normally there will be no constraint violations or duplicates, so these checks are only made if an error has occurred.
ru: Если выполняется нестандартная процедура принудительного восстановления (``force_recovery`` = ``true``), Tarantool проводит дополнительную проверку. Сначала индексы активны, и кортежи добавляются по одному. Это означает, что будут выявлены любые нарушения ограничений уникальности ключей, и все повторяющиеся значения пропускаются. Как правило, не будет нарушений ограничений или повторяющихся значений, поэтому такие проверки проводятся только в случае ошибки.

source: Step 3
ru: Шаг 3

source: Find the WAL file that was made at the time of, or after, the snapshot file. Read its log entries until the log-entry LSN is greater than the LSN of the snapshot, or greater than the LSN of the vinyl checkpoint. This is the recovery process's "start position"; it matches the current state of the engines.
ru: Найти WAL-файл, который был создан во время создания файла снимка или позже. Выполнить чтение записей журнала до тех пор, пока LSN записи в журнале не будет больше LSN снимка или больше LSN контрольной точки в vinyl'е. Это и будет начальной точкой для процесса восстановления, которая соответствует текущему состоянию движков.

source: Step 4
ru: Шаг 4

source: Redo the log entries, from the start position to the end of the WAL. The engine skips a redo instruction if it is older than the engine's checkpoint.
ru: Повторить записи журнала с начальной точки до конца WAL. Движок пропускает команду повторения, если данные старше контрольной точки движка.

source: Step 5
ru: Шаг 5

source: For the memtx engine, re-create all secondary indexes.
ru: Повторно создать все вторичные индексы для движка memtx.

source: Lua Style Guide
ru: Руководство по написанию кода на Lua

source: Inspiration:
ru: Для вдохновения:

source: Programming style is an art. There is some arbitrariness to the rules, but there are sound rationales for them. It is useful not only to provide sound advice on style but to understand the underlying rationale and human aspect of why the style recommendations are formed:
ru: Придерживаться стиля в программировании -- это искусство. Даже учитывая некоторую произвольность правил, для них есть надежное обоснование. Полезно не только давать значимые советы по стилю, но также понимать основополагающие причины и человеческий аспект того, почему формируются рекомендации по стилю:

source: Zen of Python is good; understand it and use wisely:
ru: Дзен языка программирования Python подходит и здесь; используйте его с умом:

source: Beautiful is better than ugly.
ru: Красивое лучше, чем уродливое.

source: Explicit is better than implicit.
ru: Явное лучше, чем неявное.

source: Simple is better than complex.
ru: Простое лучше, чем сложное.

source: Complex is better than complicated.
ru: Сложное лучше, чем запутанное.

source: Flat is better than nested.
ru: Плоское лучше, чем вложенное.

source: Sparse is better than dense.
ru: Разреженное лучше, чем плотное.

source: Readability counts.
ru: Читаемость имеет значение.

source: Special cases aren't special enough to break the rules.
ru: Особые случаи не настолько особые, чтобы нарушать правила.

source: Although practicality beats purity.
ru: При этом практичность важнее безупречности.

source: Errors should never pass silently.
ru: Ошибки никогда не должны замалчиваться.

source: Unless explicitly silenced.
ru: Если не замалчиваются явно.

source: In the face of ambiguity, refuse the temptation to guess.
ru: Встретив двусмысленность, отбрось искушение угадать.

source: There should be one -- and preferably only one -- obvious way to do it.
ru: Должен существовать один -- и, желательно, только один -- очевидный способ сделать это.

source: Although that way may not be obvious at first unless you're Dutch.
ru: Хотя он поначалу может быть и не очевиден.

source: Now is better than never.
ru: Сейчас лучше, чем никогда.

source: Although never is often better than *right* now.
ru: Хотя никогда зачастую лучше, чем прямо сейчас.

source: If the implementation is hard to explain, it's a bad idea.
ru: Если реализацию сложно объяснить -- идея плоха.

source: If the implementation is easy to explain, it may be a good idea.
ru: Если реализацию легко объяснить -- идея, возможно, хороша.

source: Namespaces are one honking great idea -- let's do more of those!
ru: Пространства имен -- отличная штука! Сделаем побольше!

source: Indentation and Formatting
ru: Отступы и форматирование

source: 4 spaces instead tabs. PIL suggests using of two spaces, but programmer looks at code 4 up to 8 hours a day, so it's simplier to distinguish indentation with 4 spaces. Why spaces? Similar representation everywhere.
ru: 4 пробела, а не табуляция. Библиотека PIL предлагает использовать два пробела, но разработчик читает код от 4 до 8 часов в день, а различать отступы с 4 пробелами легче. Почему именно пробелы? Соблюдение однородности.

source: You can use vim modelines:
ru: Можно использовать строки режима (modelines) vim:

source: A file should ends w/ one newline symbol, but shouldn't ends w/ blank line (two newline symbols).
ru: Файл должен заканчиваться на один символ переноса строки, но не должен заканчиваться на пустой строке (два символа переноса строки).

source: Every do/while/for/if/function should indent 4 spaces.
ru: Отступы всех do/while/for/if/function должны составлять 4 пробела.

source: related ``or``/``and`` in ``if`` must be enclosed in the round brackets (). Example:
ru: ``or``/``and`` в ``if`` должны быть обрамлены круглыми скобками (). Пример:

source: if (a == true and b == false) or (a == false and b == true) then <...> end -- good if a == true and b == false or a == false and b == true then <...> end -- bad if a ^ b == true then end -- good, but not explicit
ru: if (a == true and b == false) or (a == false and b == true) then <...> end -- хорошо if a == true and b == false or a == false and b == true then <...> end -- плохо if a ^ b == true then end -- хорошо, но не явно

source: Type conversion
ru: Преобразование типов

source: Do not use concatenation to convert to string or addition to convert to number (use ``tostring``/``tonumber`` instead):
ru: Не используйте конкатенацию для конвертации в строку или в число (вместо этого воспользуйтесь ``tostring``/``tonumber``):

source: local a = 123 a = a .. '' -- bad local a = 123 a = tostring(a) -- good local a = '123' a = a + 5 -- 128 -- bad local a = '123' a = tonumber(a) + 5 -- 128 -- good
ru: local a = 123 a = a .. '' -- плохо local a = 123 a = tostring(a) -- хорошо local a = '123' a = a + 5 -- 128 -- плохо local a = '123' a = tonumber(a) + 5 -- 128 -- хорошо

source: Try to avoid multiple nested ``if``'s with common body:
ru: Постарайтесь избегать несколько вложенных ``if`` с общим телом оператора:

source: if (a == true and b == false) or (a == false and b == true) then do_something() end -- good if a == true then if b == false then do_something() end if b == true then if a == false then do_something() end end -- bad
ru: if (a == true and b == false) or (a == false and b == true) then do_something() end -- хорошо if a == true then if b == false then do_something() end if b == true then if a == false then do_something() end end -- плохо

source: Avoid multiple concatenations in one statement, use ``string.format`` instead:
ru: Избегайте множества конкатенаций в одном операторе, лучше использовать ``string.format``:

source: function say_greeting(period, name) local a = "good " .. period .. ", " .. name end -- bad function say_greeting(period, name) local a = string.format("good %s, %s", period, name) end -- good local say_greeting_fmt = "good %s, %s" function say_greeting(period, name) local a = say_greeting_fmt:format(period, name) end -- best
ru: function say_greeting(period, name) local a = "good " .. period .. ", " .. name end -- плохо function say_greeting(period, name) local a = string.format("good %s, %s", period, name) end -- хорошо local say_greeting_fmt = "good %s, %s" function say_greeting(period, name) local a = say_greeting_fmt:format(period, name) end -- лучше всего

source: Use ``and``/``or`` for default variable values
ru: Используйте ``and``/``or`` для указания значений переменных, используемых по умолчанию,

source: function(input) input = input or 'default_value' end -- good function(input) if input == nil then input = 'default_value' end end -- ok, but excessive
ru: function(input) input = input or 'default_value' end -- хорошо function(input) if input == nil then input = 'default_value' end end -- нормально, но избыточно

source: ``if``'s and return statements:
ru: операторов ``if`` и возврата:

source: if a == true then return do_something() end do_other_thing() -- good if a == true then return do_something() else do_other_thing() end -- bad
ru: if a == true then return do_something() end do_other_thing() -- хорошо if a == true then return do_something() else do_other_thing() end -- плохо

source: Using spaces:
ru: Использование пробелов:

source: one shouldn't use spaces between function name and opening round bracket, but arguments must be splitted with one whitespace charachter
ru: не следует вставлять пробелы между именем функции и открывающей круглой скобкой, но аргумент необходимо разделять одним символом пробела

source: function name (arg1,arg2,...) end -- bad function name(arg1, arg2, ...) end -- good
ru: function name (arg1,arg2,...) end -- плохо function name(arg1, arg2, ...) end -- хорошо

source: use space after comment marker
ru: добавляйте пробел после маркера комментария

source: while true do -- inline comment -- comment do_something() end --[[ multiline comment ]]--
ru: while true do -- встроенный комментарий -- комментарий do_something() end --[[ многострочный комментарий ]]--

source: surrounding operators
ru: примыкающие конструкции

source: local thing=1 thing = thing-1 thing = thing*1 thing = 'string'..'s' -- bad local thing = 1 thing = thing - 1 thing = thing * 1 thing = 'string' .. 's' -- good
ru: local thing=1 thing = thing-1 thing = thing*1 thing = 'string'..'s' -- плохо local thing = 1 thing = thing - 1 thing = thing * 1 thing = 'string' .. 's' -- хорошо

source: use space after commas in tables
ru: добавляйте пробел после запятых в таблицах

source: local thing = {1,2,3} thing = {1 , 2 , 3} thing = {1 ,2 ,3} -- bad local thing = {1, 2, 3} -- good
ru: local thing = {1,2,3} thing = {1 , 2 , 3} thing = {1 ,2 ,3} -- плохо local thing = {1, 2, 3} -- хорошо

source: use space in map definitions around equality sign and commas
ru: используйте пробелы в определениях ассоциативного массива по сторонам от знаков равенства и запятых

source: return {1,2,3,4} -- bad return { key1 = val1,key2=val2 } -- bad return { 1, 2, 3, 4 key1 = val1, key2 = val2, key3 = vallll } -- good
ru: return {1,2,3,4} -- плохо return { key1 = val1,key2=val2 } -- плохо return { 1, 2, 3, 4 key1 = val1, key2 = val2, key3 = vallll } -- хорошо

source: also, you may use alignment:
ru: также можно применить выравнивание:

source: extra blank lines may be used (sparingly) to separate groups of related functions. Blank lines may be omitted between a bunch of related one-liners (e.g. a set of dummy implementations)
ru: также можно добавлять пустые строки (не слишком часто) для выделения групп связанных функций. Пустые строки не стоит добавлять между несколькими связанными программами в одну строку (например, в формальной реализации)

source: use blank lines in function, sparingly, to indicate logical sections
ru: не слишком часто можно добавлять пустые строки в коде функций, чтобы отделить друг от друга логические части

source: if thing then -- ...stuff... end function derp() -- ...stuff... end local wat = 7 -- bad if thing then -- ...stuff... end function derp() -- ...stuff... end local wat = 7 -- good
ru: if thing then -- ...что-то... end function derp() -- ...что-то... end local wat = 7 -- плохо if thing then -- ...что-то... end function derp() -- ...что-то... end local wat = 7 -- хорошо

source: Delete whitespace at EOL (strongly forbidden. Use ``:s/\s\+$//gc`` in vim to delete them)
ru: Удаляйте символы пробела в конце файла (они категорически запрещаются). Для их удаления в vim используйте ``:s/\s\+$//gc``.

source: Avoid global variable
ru: Недопущение глобальных переменных

source: You must avoid global variables. If you have an exceptional case, use ``_G`` variable to set it, add prefix or add table instead of prefix:
ru: Следует избегать глобальных переменных. В исключительных случаях используйте переменную ``_G`` для объявления, добавьте префикс или таблицу вместо префикса:

source: function bad_global_example() end -- very, very bad function good_local_example() end _G.modulename_good_local_example = good_local_example -- good _G.modulename = {} _G.modulename.good_local_example = good_local_example -- better
ru: function bad_global_example() end -- глобальная, очень-очень плохо function good_local_example() end _G.modulename_good_local_example = good_local_example -- локальная, хорошо _G.modulename = {} _G.modulename.good_local_example = good_local_example -- локальная, лучше

source: Always use prefix to avoid name clash
ru: Всегда добавляйте префиксы во избежание конфликта имен

source: Naming
ru: Именование

source: names of variables/"objects" and "methods"/functions: snake_case
ru: имена переменных/"объектов" и "методов"/функций: snake_case

source: names of "classes": CamelCase
ru: имена "классов": CamelCase

source: private variables/methods (properties in the future) of object starts with underscores ``<object>._<name>``. Avoid using of ``local function private_methods(self) end``
ru: частные переменные/методы (в будущем параметры) объекта начинаются с символа подчеркивания ``<object>._<name>``. Избегайте ``local function private_methods(self) end``

source: boolean - naming ``is_<...>``, ``isnt_<...>``, ``has_``, ``hasnt_`` is a good style.
ru: логическое именование приветствуется ``is_<...>``, ``isnt_<...>``, ``has_``, ``hasnt_``.

source: for "very local" variables: - ``t`` is for tables - ``i``, ``j`` are for indexing - ``n`` is for counting - ``k``, ``v`` is what you get out of ``pairs()`` (are acceptable, ``_`` if unused) - ``i``, ``v`` is what you get out of ``ipairs()`` (are acceptable, ``_`` if unused) - ``k``/``key`` is for table keys - ``v``/``val``/``value`` is for values that are passed around - ``x``/``y``/``z`` is for generic math quantities - ``s``/``str``/``string`` is for strings - ``c`` is for 1-char strings - ``f``/``func``/``cb`` are for functions - ``status, <rv>..`` or ``ok, <rv>..`` is what you get out of pcall/xpcall - ``buf, sz`` is a (buffer, size) pair - ``<name>_p`` is for pointers - ``t0``.. is for timestamps - ``err`` is for errors
ru: для "самых локальных" переменных: - ``t`` для таблиц - ``i``, ``j`` для индексации - ``n`` для подсчета - ``k``, ``v`` для получения из ``pairs()`` (допускаются, ``_`` если не используются) - ``i``, ``v`` is what you get out of ``ipairs()`` (допускаются, ``_`` если не используются) - ``k``/``key`` для ключей таблицы - ``v``/``val``/``value`` для передаваемых значений - ``x``/``y``/``z`` для общих математических величин - ``s``/``str``/``string`` для строк - ``c`` для односимвольных строк - ``f``/``func``/``cb`` для функций - ``status, <rv>..`` или ``ok, <rv>..`` для получения из pcall/xpcall - ``buf, sz`` -- это пара (буфер, размер) - ``<name>_p`` для указателей - ``t0``.. для временных отметок - ``err`` для ошибок

source: abbrevations are acceptable if they're unambigous and if you'll document (or they're too common) them.
ru: допускается использование сокращений, если они недвусмысленны, и если вы документируете их.

source: global variables are written with ALL_CAPS. If it's some system variable, then they're using underscore to define it (``_G``/``_VERSION``/..)
ru: глобальные переменные пишутся ЗАГЛАВНЫМИ_БУКВАМИ. Если это системная переменная, для определения используется символ подчеркивания (``_G``/``_VERSION``/..)

source: module naming snake_case (avoid underscores and dashes) - 'luasql', instead of 'Lua-SQL'
ru: именование модулей -- с помощью snake_case (избегайте подчеркивания и дефисов) - 'luasql', а не 'Lua-SQL'

source: ``*_mt`` and ``*_methods`` defines metatable and methods table
ru: ``*_mt`` и ``*_methods`` определяют метатаблицу и таблицу методов

source: Idioms and patterns
ru: Идиомы и шаблоны

source: Always use round brackets in call of functions except multiple cases (common lua style idioms):
ru: Всегда пользуйтесь круглыми скобками при вызове функций, за исключением множественных случаев (распространенные идиомы в Lua):

source: ``*.cfg{ }`` functions (``box.cfg``/``memcached.cfg``/..)
ru: функции ``*.cfg{ }`` (``box.cfg``/``memcached.cfg``/..)

source: ``ffi.cdef[[ ]]`` function
ru: функция ``ffi.cdef[[ ]]``

source: Avoid these kind of constructions:
ru: Избегайте конструкций такого типа:

source: <func>'<name>' (strongly avoid require'..')
ru: <func>'<name>' (особенно избегайте require'..')

source: ``function object:method() end`` (use ``functon object.method(self) end`` instead)
ru: ``function object:method() end`` (используйте ``functon object.method(self) end``)

source: do not use semicolon as table separator (only comma)
ru: не вставляйте точку с запятой в качестве символа-разделителя в таблице (только запятые)

source: semicolons at the end of line (only to split multiple statements on one line)
ru: точки с запятой в конце строки (только для разделения нескольких операторов в одной строке)

source: try to avoid unnecessary function creation (closures/..)
ru: старайтесь избегать создания ненужных функций (closures/..)

source: Modules
ru: Модули

source: Don't start modules with license/authors/descriptions, you can write it in LICENSE/AUTHORS/README files. For writing modules use one of the two patterns (dont use ``modules()``):
ru: Не начинайте создание модуля с указания лицензии/авторов/описания, это можно сделать в файлах LICENSE/AUTHORS/README соответственно. Для написания модулей используйте один из двух шаблонов (не используйте ``modules()``):

source: or
ru: или

source: Commenting
ru: Комментирование

source: You should write code the way it shouldn't be described, but don't forget about commenting it. You shouldn't comment Lua syntax (assume that reader already knows Lua language). Try to tell about functions/variable names/etc.
ru: Пишите код так, чтобы его не нужно было описывать, но не забывайте о комментировании. Не следует комментировать Lua-синтаксис (примите, что читатель знаком с языком Lua). Постарайтесь рассказать о функциях, именах переменных и так далее.

source: Multiline comments: use matching (``--[[ ]]--``) instead of simple (``--[[ ]]``).
ru: Многострочные комментарии: используйте соответствующие скобки (``--[[ ]]--``) вместо простых (``--[[ ]]``).

source: Public function comments (??):
ru: Комментарии к доступным функциям (??):
