Repository: tarantool/doc
Catalog: locale/*/LC_MESSAGES/doc.po
Languages: ru

source: Once a sequence exists, it can be altered, dropped, reset, forced to generate the next value, or associated with an index.
ru: Существующую последовательность можно изменять, опускать, сбрасывать, заставить сгенерировать новое значение или ассоциировать с индексом.

source: For an initial example, we generate a sequence named 'S'.
ru: Для первоначального примера сгенерируем последовательность под названием 'S'.

source: The result shows that the new sequence has all default values, except for the two that were specified, ``min`` and ``start``.
ru: В результате видим, что в новой последовательность есть все значения по умолчанию, за исключением указанных ``min`` и ``start``.

source: Then we get the next value, with the ``next()`` function.
ru: Затем получаем следующее значение с помощью функции ``next()``.

source: The result is the same as the start value. If we called ``next()`` again, we would get 6 (because the previous value plus the step value is 6), and so on.
ru: Результат точно такой же, как и начальное значение. Если мы снова вызовем ``next()``, то получим 6 (потому что предыдущее значение плюс значение шага составит 6) и так далее.

source: Then we create a new table, and say that its primary key may be generated from the sequence.
ru: Затем создадим новую таблицу и скажем, что ее первичный ключ можно получить из последовательности.

source: Then we insert a tuple, without specifying a value for the primary key.
ru: Затем вставим кортеж, не указывая значение первичного ключа.

source: The result is a new tuple where the first field has a value of 6. This arrangement, where the system automatically generates the values for a primary key, is sometimes called "auto-incrementing" or "identity".
ru: В результате имеем новый кортеж со значением 6 в первом поле. Такой способ организации данных, когда система автоматически генерирует значения для первичного ключа, иногда называется "автоинкрементным" (т.е. с автоматическим увеличением) или "по идентификатору".

source: For syntax and implementation details, see the reference for :ref:`box.schema.sequence <box_schema-sequence>`.
ru: Для получения подробной информации о синтаксисе и методах реализации см. справочник по :ref:`box.schema.sequence <box_schema-sequence>`.

source: Persistence
ru: Персистентность

source: In Tarantool, updates to the database are recorded in the so-called :ref:`write ahead log (WAL) <internals-wal>` files. This ensures data persistence. When a power outage occurs or the Tarantool instance is killed incidentally, the in-memory database is lost. In this situation, WAL files are used to restore the data. Namely, Tarantool reads the WAL files and redoes the requests (this is called the "recovery process"). You can change the timing of the WAL writer, or turn it off, by setting :ref:`wal_mode <cfg_binary_logging_snapshots-wal_mode>`.
ru: В Tarantool'е обновления базы данных записываются в так называемые :ref:`файлы журнала упреждающей записи (WAL-файлы) <internals-wal>`. Это обеспечивает персистентность данных. При отключении электроэнергии или случайном завершении работы экземпляра Tarantool'а данные в оперативной памяти теряются. В такой ситуации WAL-файлы используются для восстановления данных так: Tarantool прочитывает WAL-файлы и повторно выполняет запросы (это называется "процессом восстановления"). Можно изменить временные настройки метода записи WAL-файлов или отключить его с помощью :ref:`wal_mode <cfg_binary_logging_snapshots-wal_mode>`.

source: Tarantool also maintains a set of :ref:`snapshot files <internals-snapshot>`. These files contain an on-disk copy of the entire data set for a given moment. Instead of reading every WAL file since the databases were created, the recovery process can load the latest snapshot file and then read only those WAL files that were produced after the snapshot file was made. After checkpointing, old WAL files can be removed to free up space.
ru: Tarantool также сохраняет ряд файлов со статическими снимками данных (:ref:`snapshots <internals-snapshot>`). Файл со снимком -- это дисковая копия всех данных в базе на какой-то момент. Вместо того, чтобы зачитывать все WAL-файлы, появившиеся с момента создания базы, Tarantool в процессе восстановления может загрузить самый свежий снимок и затем зачитать только те WAL-файлы, которые были сделаны с момента сохранения снимка. После создания новых файлов, старые WAL-файлы могут быть удалены в целях экономии места на диске.

source: To force immediate creation of a snapshot file, you can use Tarantool's :ref:`box.snapshot() <box-snapshot>` request. To enable automatic creation of snapshot files, you can use Tarantool's :ref:`checkpoint daemon <book_cfg_checkpoint_daemon>`. The checkpoint daemon sets intervals for forced checkpoints. It makes sure that the states of both memtx and vinyl storage engines are synchronized and saved to disk, and automatically removes old WAL files.
ru: Чтобы принудительно создать файл со снимком, можно использовать запрос :ref:`box.snapshot() <box-snapshot>` в Tarantool'е. Чтобы включить автоматическое создание файлов со снимком, можно использовать :ref:`демон создания контрольных точек <book_cfg_checkpoint_daemon>` Tarantool'а. Демон создания контрольных точек определяет интервалы для принудительного создания контрольных точек. Он обеспечивает синхронизацию и сохранение на диск образов движков базы данных (как memtx, так и vinyl), а также автоматически удаляет старые WAL-файлы.

source: Snapshot files can be created even if there is no WAL file.
ru: Файлы со снимками можно создавать, даже если WAL-файлы отсутствуют.

source: The memtx engine makes only regular checkpoints with the interval set in :ref:`checkpoint daemon <book_cfg_checkpoint_daemon>` configuration.
ru: Движок memtx регулярно создает контрольные точки с интервалом, указанным в настройках :ref:`демона создания контрольных точек <book_cfg_checkpoint_daemon>`.

source: The vinyl engine runs checkpointing in the background at all times.
ru: Движок vinyl постоянно сохраняет состояние в контрольной точке в фоновом режиме.

source: See the :ref:`Internals <internals-data_persistence>` section for more details about the WAL writer and the recovery process.
ru: Для получения более подробной информации о методе записи WAL-файлов и процессе восстановления см. раздел :ref:`Внутренняя реализация <internals-data_persistence>`.

source: Operations
ru: Операции

source: Data operations
ru: Операции с данными

source: The basic data operations supported in Tarantool are:
ru: Tarantool поддерживает следующие основные операции с данными:

source: five data-manipulation operations (INSERT, UPDATE, UPSERT, DELETE, REPLACE), and
ru: пять операций по изменению данных (INSERT, UPDATE, UPSERT, DELETE, REPLACE) и

source: one data-retrieval operation (SELECT).
ru: одну операция по выборке данных (SELECT).

source: All of them are implemented as functions in :ref:`box.space <box_space>` submodule.
ru: Все они реализованы в виде функций во вложенном модуле :ref:`box.space <box_space>`.

source: :ref:`INSERT <box_space-insert>`: Add a new tuple to space 'tester'.
ru: :ref:`INSERT <box_space-insert>`: добавить новый кортеж к спейсу 'tester'.

source: The first field, field[1], will be 999 (MsgPack type is `integer`).
ru: Первое поле, field[1], будет 999 (тип MsgPack -- `integer`, целое число).

source: The second field, field[2], will be 'Taranto' (MsgPack type is `string`).
ru: Второе поле, field[2], будет 'Taranto' (тип MsgPack -- `string`, строка).

source: :ref:`UPDATE <box_space-update>`: Update the tuple, changing field field[2].
ru: :ref:`UPDATE <box_space-update>`: обновить кортеж, изменяя поле field[2].

source: The clause "{999}", which has the value to look up in the index of the tuple's primary-key field, is mandatory, because ``update()`` requests must always have a clause that specifies a unique key, which in this case is field[1].
ru: Оператор "{999}" со значением, которое используется для поиска поля, соответствующего ключу в первичном индексе, является обязательным, поскольку в запросе ``update()`` должен быть оператор, который указывает уникальный ключ, в данном случае -- field[1].

source: The clause "{{'=', 2, 'Tarantino'}}" specifies that assignment will happen to field[2] with the new value.
ru: Оператор "{{'=', 2, 'Tarantino'}}" указывает, что назначение нового значения относится к field[2].

source: :ref:`UPSERT <box_space-upsert>`: Upsert the tuple, changing field field[2] again.
ru: :ref:`UPSERT <box_space-upsert>`: обновить или вставить кортеж, снова изменяя поле field[2].

source: The syntax of ``upsert()`` is similar to the syntax of ``update()``. However, the execution logic of these two requests is different. UPSERT is either UPDATE or INSERT, depending on the database's state. Also, UPSERT execution is postponed until after transaction commit, so, unlike ``update()``, ``upsert()`` doesn't return data back.
ru: Синтаксис ``upsert()`` похож на синтаксис ``update()``. Однако логика выполнения двух запросов отличается. UPSERT означает UPDATE или INSERT, в зависимости от состояния базы данных. Кроме того, выполнение UPSERT откладывается до коммита транзакции, поэтому в отличие от``update()``, ``upsert()`` не возвращает данные.

source: :ref:`REPLACE <box_space-replace>`: Replace the tuple, adding a new field.
ru: :ref:`REPLACE <box_space-replace>`: заменить кортеж, добавляя новое поле.

source: This is also possible with the ``update()`` request, but the ``update()`` request is usually more complicated.
ru: Это действие также можно выполнить с помощью запроса ``update()``, но обычно запрос ``update()`` более сложен.

source: :ref:`SELECT <box_space-select>`: Retrieve the tuple.
ru: :ref:`SELECT <box_space-select>`: провести выборку кортежа.

source: The clause "{999}" is still mandatory, although it does not have to mention the primary key.
ru: Оператор "{999}" все еще обязателен, хотя в нем не должен упоминаться первичный ключ.

source: :ref:`DELETE <box_space-delete>`: Delete the tuple.
ru: :ref:`DELETE <box_space-delete>`: удалить кортеж.

source: In this example, we identify the primary-key field.
ru: В этом примере мы определяем поле, соответствующее ключу в первичном индексе.

source: Summarizing the examples:
ru: Подводя итоги по примерам:

source: Functions ``insert`` and ``replace`` accept a tuple (where a primary key comes as part of the tuple).
ru: Функции ``insert`` и ``replace`` принимают кортеж (где первичный ключ -- это часть кортежа).

source: Function ``upsert`` accepts a tuple (where a primary key comes as part of the tuple), and also the update operations to execute.
ru: Функция ``upsert`` принимает кортеж (где первичный ключ -- это часть кортежа), а также операции по обновлению.

source: Function ``delete`` accepts a full key of any unique index (primary or secondary).
ru: Функция ``delete`` принимает полный ключ любого уникального индекса (первичный или вторичный).

source: Function ``update`` accepts a full key of any unique index (primary or secondary), and also the operations to execute.
ru: Функция ``update`` принимает полный ключ любого уникального индекса (первичный или вторичный), а также операции к выполнению.

source: Function ``select`` accepts any key: primary/secondary, unique/non-unique, full/partial.
ru: Функция ``select`` принимает любой ключ: первичный/вторичный, уникальный/неуникальный, полный/часть.

source: See reference on ``box.space`` for more :ref:`details on using data operations <box_space-operations-detailed-examples>`.
ru: Для получения более :ref:`подробной информации по использованию операций с данными <box_space-operations-detailed-examples>` см. справочник по ``box.space``.

source: Besides Lua, you can use :ref:`Perl, PHP, Python or other programming language connectors <index-box_connectors>`. The client server protocol is open and documented. See this :ref:`annotated BNF <box_protocol-iproto_protocol>`.
ru: Помимо Lua можно использовать :ref:`коннекторы к Perl, PHP, Python или другому языку программирования <index-box_connectors>`. Клиент-серверный протокол открыт и задокументирован. См. :ref:`БНФ с комментариями <box_protocol-iproto_protocol>`.

source: Index operations
ru: Операции с индексами

source: Index operations are automatic: if a data-manipulation request changes a tuple, then it also changes the index keys defined for the tuple.
ru: Операции с индексами производятся автоматически. Если запрос по манипулированию данными меняет данные в кортеже, то меняются и ключи в индексе для данного кортежа.

source: The simple index-creation operation that we've illustrated before is:
ru: Простая операция по созданию индекса, которую мы рассматривали ранее, выглядит следующим образом:

source: :samp:`box.space.{space-name}:create_index('{index-name}')`
ru: :samp:`box.space.{имя-спейса}:create_index('{имя-индекса}')`

source: This creates a unique TREE index on the first field of all tuples (often called "Field#1"), which is assumed to be numeric.
ru: По умолчанию, при этом создается TREE-индекс по первому полю для всех кортежей (обычно его называют "Field#1"). Предполагается, что индексируемое поле является числовым.

source: The simple SELECT request that we've illustrated before is:
ru: Вот простой SELECT-запрос, который мы рассматривали ранее:

source: This looks for a single tuple via the first index. Since the first index is always unique, the maximum number of returned tuples will be: one.
ru: Такой запрос ищет отдельный кортеж по первичному индексу. Поскольку первичный индекс всегда уникален, то данный запрос вернет не более одного кортежа.

source: The following SELECT variations exist:
ru: Возможны следующие варианты SELECT:

source: The search can use comparisons other than equality.
ru: Помимо условия равенства, при поиске могут использоваться и другие условия сравнения.

source: The :ref:`comparison operators <box_index-iterator-types>` are LT, LE, EQ, REQ, GE, GT (for "less than", "less than or equal", "equal", "reversed equal", "greater than or equal", "greater than" respectively). Comparisons make sense if and only if the index type is ‘TREE'.
ru: Можно использовать следующие :ref:`операторы сравнения <box_index-iterator-types>`: LT (меньше), LE (меньше или равно), EQ (равно), REQ (неравно), GE (больше или равно), GT (больше). Сравнения имеют смысл только для индексов типа 'TREE'.

source: This type of search may return more than one tuple; if so, the tuples will be in descending order by key when the comparison operator is LT or LE or REQ, otherwise in ascending order.
ru: Этот вариант поиска может вернуть более одного кортежа. В таком случае кортежи будут отсортированы в порядке убывания по ключу (если использовался оператор LT, LE или REQ), либо в порядке возрастания (во всех остальных случаях).

source: The search can use a secondary index.
ru: Поиск может производиться по вторичному индексу.

source: For a primary-key search, it is optional to specify an index name. For a secondary-key search, it is mandatory.
ru: При поиске по первичному индексу имя индекса можно не указывать. При поиске же по вторичному индексу имя индекса указывать необходимо.

source: The search may be for some or all key parts.
ru: Поиск может производиться как по всему ключу, так и по его частям.

source: The search may be for all fields, using a table for the value:
ru: Поиск может производиться по всем полям с использованием таблицы значений:

source: or the search can be for one field, using a table or a scalar:
ru: либо же по одному полю (в этом случае используется таблица или скалярное значение):

source: In the second case, the result will be two tuples: ``{1, 'A'}`` and ``{1, 'B'}``.
ru: Во втором случае Tarantool вернет два кортежа: ``{1, 'A'}`` и ``{1, 'B'}``.

source: You can specify even zero fields, causing all three tuples to be returned. (Notice that partial key searches are available only in TREE indexes.)
ru: При необходимости можно задать даже нулевые поля, в результате чего Tarantool вернет все три кортежа (обратите внимание, что поиск по компонентам ключа доступен только для TREE-индексов).

source: **Examples**
ru: **Примеры**

source: BITSET example:
ru: Пример работы с BITSET-индексом:

source: The result will be:
ru: Мы получим следующий результат:

source: because (7 AND 2) is not equal to 0, and (3 AND 2) is not equal to 0.
ru: поскольку (7 AND 2) не равно 0 и (3 AND 2) не равно 0.

source: RTREE example:
ru: Пример работы с RTREE-индексом:

source: because a rectangle whose corners are at coordinates ``4,7,5,9`` is entirely within a rectangle whose corners are at coordinates ``3,5,9,10``.
ru: поскольку прямоугольник с углами в координатах ``4,7,5,9`` лежит целиком внутри прямоугольника с углами в координатах ``3,5,9,10``.

source: Additionally, there exist :ref:`index iterator operations <box_index-index_pairs>`. They can only be used with code in Lua and C/C++. Index iterators are for traversing indexes one key at a time, taking advantage of features that are specific to an index type, for example evaluating Boolean expressions when traversing BITSET indexes, or going in descending order when traversing TREE indexes.
ru: Кроме того, есть :ref:`операции с итераторами с индексом <box_index-index_pairs>`. Их можно использовать только с кодом на языках Lua и C/C++. Итераторы с индексом предназначены для обхода индексов по одному ключу за раз, поскольку используют особенности каждого типа индекса, например оценка логических выражений при обходе BITSET-индексов или обход TREE-индексов в порядке по убыванию.

source: See also other index operations like :ref:`alter() <box_index-alter>` and :ref:`drop() <box_index-drop>` in reference for :ref:`box.index <box_index>` submodule.
ru: См. также информацию о других операциях с итераторами с индексом, таких как :ref:`alter() <box_index-alter>` и :ref:`drop() <box_index-drop>` во вложенном модуле :ref:`box.index <box_index>`.

source: Complexity factors
ru: Факторы сложности

source: In reference for :ref:`box.space <box_space>` and :ref:`box.index <box_index>` submodules, there are notes about which complexity factors might affect the resource usage of each function.
ru: Что касается вложенных модулей :ref:`box.space <box_space>` и :ref:`box.index <box_index>`, есть информация о том, как факторы сложности могут повлиять на использование каждой функции.

source: Complexity factor
ru: Фактор сложности

source: Index size
ru: Размер индекса

source: The number of index keys is the same as the number of tuples in the data set. For a TREE index, if there are more keys, then the lookup time will be greater, although of course the effect is not linear. For a HASH index, if there are more keys, then there is more RAM used, but the number of low-level steps tends to remain constant.
ru: Количество ключей в индексе равно количеству кортежей в наборе данных. В случае с TREE-индексом: с ростом количества ключей увеличивается время поиска, хотя зависимость здесь, конечно же, не линейная. В случае с HASH-индексом: с ростом количества ключей увеличивается объем оперативной памяти, но количество низкоуровневых шагов остается примерно тем же.

source: Typically, a HASH index is faster than a TREE index if the number of tuples in the space is greater than one.
ru: Как правило, поиск по HASH-индексу работает быстрее, чем по TREE-индексу, если в спейсе более одного кортежа.

source: Number of indexes accessed
ru: Количество обращений к индексам

source: Ordinarily, only one index is accessed to retrieve one tuple. But to update the tuple, there must be N accesses if the space has N different indexes.
ru: Обычно для выборки значений одного кортежа используется только один индекс. Но при обновлении значений в кортеже требуется N обращений, если в спейсе N индексов.

source: Note re storage engine: Vinyl optimizes away such accesses if secondary index fields are unchanged by the update. So, this complexity factor applies only to memtx, since it always makes a full-tuple copy on every update.
ru: Примечание по движку базы данных: Vinyl отклоняет такой доступ, если обновление не затрагивает поля вторичного индекса. Таким образом, этот фактор сложности влияет только на memtx, поскольку он всегда создает копию всего кортежа при каждом обновлении.

source: Number of tuples accessed
ru: Количество обращений к кортежам

source: A few requests, for example SELECT, can retrieve multiple tuples. This factor is usually less important than the others.
ru: Некоторые запросы, например SELECT, могут возвращать несколько кортежей. Как правило, это наименее важный фактор из всех.

source: WAL settings
ru: Настройки WAL

source: The important setting for the write-ahead log is :ref:`wal_mode <cfg_binary_logging_snapshots-wal_mode>`. If the setting causes no writing or delayed writing, this factor is unimportant. If the setting causes every data-change request to wait for writing to finish on a slow device, this factor is more important than all the others.
ru: Важным параметром для записи в WAL является :ref:`wal_mode <cfg_binary_logging_snapshots-wal_mode>`. Если запись в WAL отключена или задана запись с задержкой, но этот фактор не так важен. Если же запись в WAL производится при каждом запросе на изменение данных, то при каждом таком запросе приходится ждать, пока отработает обращение к более медленному диску, и данный фактор становится важнее всех остальных.

source: Database
ru: Функциональность СУБД

source: In this chapter, we introduce the basic concepts of working with Tarantool as a database manager.
ru: В данной главе мы рассмотрим основные понятия при работе с Tarantool'ом в качестве системы управления базой данных.

source: Limitations
ru: Ограничения

source: **Number of parts in an index**
ru: **Количество частей в индексе**

source: For TREE or HASH indexes, the maximum is 255 (``box.schema.INDEX_PART_MAX``). For :ref:`RTREE <box_index-rtree>` indexes, the maximum is 1 but the field is an ARRAY of up to 20 dimensions. For BITSET indexes, the maximum is 1.
ru: Для TREE-индексов или HASH-индексов максимальное количество -- 255 частей (``box.schema.INDEX_PART_MAX``). Для :ref:`RTREE-индексов <box_index-rtree>` максимальное количество -- 1, но это поля типа ARRAY (массив) с размерностью до 20. Для BITSET-индексов максимальное количество -- 1.

source: **Number of indexes in a space**
ru: **Количество индексов в спейсе**

source: **Number of fields in a tuple**
ru: **Количество полей в кортеже**

source: The theoretical maximum is 2,147,483,647 (``box.schema.FIELD_MAX``). The practical maximum is whatever is specified by the space's :ref:`field_count <box_space-field_count>` member, or the maximal tuple length.
ru: Теоретически максимальное количество составляет 2 147 483 647 полей (``box.schema.FIELD_MAX``). Практически максимальное количество указано в поле :ref:`field_count <box_space-field_count>` спейса или соответствует максимальной длине кортежа.

source: **Number of bytes in a tuple**
ru: **Количество байтов в кортеже**
