Repository: tarantool/doc
Catalog: locale/*/LC_MESSAGES/doc.po
Languages: ru

source: Same as box.index.GE.
ru: Как для box.index.GE.

source: box.index.LT or 'LT'
ru: box.index.LT или 'LT'

source: The comparison operator is '<' (less than). If an index key is less than a search value, it matches. Tuples are returned in descending order by index key.
ru: Оператором сравнения будет '<' (меньше чем). Если ключ индекса меньше искомого значения, получим совпадение. Найденные кортежи упорядочены по убыванию по ключу индекса.

source: box.index.LE or 'LE'
ru: box.index.LE или 'LE'

source: The comparison operator is '<=' (less than or equal to). If an index key is less than or equal to a search value, it matches. Tuples are returned in descending order by index key.
ru: Оператором сравнения будет '<=' (меньше или равен). Если ключ индекса меньше искомого значения или равен ему, получим совпадение. Найденные кортежи упорядочены по убыванию по ключу индекса.

source: Informally, we can state that searches with TREE indexes are generally what users will find is intuitive, provided that there are no nils and no missing parts. Formally, the logic is as follows. A search key has zero or more parts, for example {}, {1,2,3},{1,nil,3}. An index key has one or more parts, for example {1}, {1,2,3},{1,2,3}. A search key may contain nil (but not msgpack.NULL, which is the wrong type). An index key may not contain nil or msgpack.NULL, although a later version of Tarantool will have different rules -- the behavior of searches with nil is subject to change. Possible iterators are LT, LE, EQ, REQ, GE, GT. A search key is said to "match" an index key if the following statements, which are pseudocode for the comparison operation, return TRUE.
ru: Неофициально можно сказать, что поиск с помощью TREE-индексов пользователи обычно считают интуитивно понятным при условии, что нет нулевых значений и отсутствующих частей. Формально же логика заключается в следующем. Ключ поиска состоит из нуля или более частей, например, {}, {1,2,3},{1,nil,3}. Ключ индекса состоит из одной или более частей, например, {1}, {1,2,3},{1,2,3}. Ключ поиска может содержать нулевое значение nil (но не msgpack.NULL, этот тип не будет правильным). Ключ индекса не может содержать nil или msgpack.NULL, хотя в последующих версиях правила работы Tarantool'а будут другие -- поведение поиска с nil может измениться. Возможные итераторы: LT, LE, EQ, REQ, GE, GT. Считается, что ключ поиска соответствует ключу индекса, если следующие операторы, которые представляют собой псевдокод для операции сопоставления, возвращают TRUE.

source: **Iterator types for HASH indexes**
ru: **Типы итераторов для HASH-индексов**

source: none
ru: нет

source: All index keys match. Tuples are returned in ascending order by hash of index key, which will appear to be random.
ru: Все ключи индекса являются совпадениями. Найденные кортежи упорядочены по возрастанию по хешу ключа индекса, который будет выглядеть случайным.

source: The comparison operator is '==' (equal to). If an index key is equal to a search value, it matches. The number of returned tuples will be 0 or 1. This is the default.
ru: Оператором сравнения будет '==' (равный). Если ключ индекса равен искомому значению, получим совпадение. Количество найденных кортежей будет 0 или 1. Этот тип используется по умолчанию.

source: The comparison operator is '>' (greater than). If a hash of an index key is greater than a hash of a search value, it matches. Tuples are returned in ascending order by hash of index key, which will appear to be random. Provided that the space is not being updated, one can retrieve all the tuples in a space, N tuples at a time, by using {iterator='GT', limit=N} in each search, and using the last returned value from the previous result as the start search value for the next search.
ru: Оператором сравнения будет '>' (больше чем). Если хеш ключа индекса больше, чем хеш искомого значения, получим совпадение. Найденные кортежи упорядочены по возрастанию по хешу ключа индекса, который будет выглядеть случайным. При условии, что спейс не обновляется, можно получить все кортежи в спейсе, N кортежей за раз, используя {iterator='GT', limit=N} в каждом поиске и последнее найденное значение из предыдущего результата поиска в качестве начального значения для следующего поиска.

source: **Iterator types for BITSET indexes**
ru: **Типы итераторов для BITSET-индексов**

source: All index keys match. Tuples are returned in their order within the space.
ru: Все ключи индекса являются совпадениями. Найденные кортежи упорядочены по положению в спейсе.

source: bitset value
ru: значение bitset (битовое множество)

source: If an index key is equal to a bitset value, it matches. Tuples are returned in their order within the space. This is the default.
ru: Если ключ индекса равен искомому значению, получим совпадение. Найденные кортежи упорядочены по положению в спейсе. Этот тип используется по умолчанию.

source: If all of the bits which are 1 in the bitset value are 1 in the index key, it matches. Tuples are returned in their order within the space.
ru: Если все биты, которые равны 1 в битовом множестве, также равны 1 в ключе индекса, получим совпадение. Найденные кортежи упорядочены по положению в спейсе.

source: If any of the bits which are 1 in the bitset value are 1 in the index key, it matches. Tuples are returned in their order within the space.
ru: Если один из битов, которые равны 1 в битовом множестве, также равен 1 в ключе индекса, получим совпадение. Найденные кортежи упорядочены по положению в спейсе.

source: If all of the bits which are 1 in the bitset value are 0 in the index key, it matches. Tuples are returned in their order within the space.
ru: Если все биты, которые равны 1 в битовом множестве, равны 0 в ключе индекса, получим совпадение. Найденные кортежи упорядочены по положению в спейсе.

source: **Iterator types for RTREE indexes**
ru: **Типы итераторов для RTREE-индексов**

source: All keys match. Tuples are returned in their order within the space.
ru: Все ключи являются совпадениями. Найденные кортежи упорядочены по положению в спейсе.

source: If all points of the rectangle-or-box defined by the search value are the same as the rectangle-or-box defined by the index key, it matches. Tuples are returned in their order within the space. "Rectangle-or-box" means "rectangle-or-box as explained in section about :ref:`RTREE <box_index-rtree>`". This is the default.
ru: Если все точки прямоугольника-или-параллелепипеда, определенные искомым значением, совпадают с точками прямоугольника-или-параллелепипеда, определенного ключом индекса, получим совпадение. Найденные кортежи упорядочены по положению в спейсе. "Прямоугольник-или-параллелепипед" означает "прямоугольник-или-параллелепипед, как описано в разделе о :ref:`RTREE <box_index-rtree>`". Этот тип используется по умолчанию.

source: If all points of the rectangle-or-box defined by the search value are within the rectangle-or-box defined by the index key, it matches. Tuples are returned in their order within the space.
ru: Если все точки прямоугольника-или-параллелепипеда, определенные искомым значением, находятся в пределах прямоугольника-или-параллелепипеда, определенного ключом индекса, получим совпадение. Найденные кортежи упорядочены по положению в спейсе.

source: If all points of the rectangle-or-box defined by the search value are within, or at the side of, the rectangle-or-box defined by the index key, it matches. Tuples are returned in their order within the space.
ru: Если все точки прямоугольника-или-параллелепипеда, определенные искомым значением, находятся в пределах прямоугольника-или-параллелепипеда, определенного ключом индекса, или рядом с ним, получим совпадение. Найденные кортежи упорядочены по положению в спейсе.

source: If all points of the rectangle-or-box defined by the index key are within the rectangle-or-box defined by the search key, it matches. Tuples are returned in their order within the space.
ru: Если все точки прямоугольника-или-параллелепипеда, определенные ключом индекса, находятся в пределах прямоугольника-или-параллелепипеда, определенного искомым значением, получим совпадение. Найденные кортежи упорядочены по положению в спейсе.

source: If all points of the rectangle-or-box defined by the index key are within, or at the side of, the rectangle-or-box defined by the search key, it matches. Tuples are returned in their order within the space.
ru: Если все точки прямоугольника-или-параллелепипеда, определенные ключом индекса, находятся в пределах прямоугольника-или-параллелепипеда, определенного искомым значением, или рядом с ним, получим совпадение. Найденные кортежи упорядочены по положению в спейсе.

source: box.index.OVERLAPS or 'OVERLAPS'
ru: box.index.OVERLAPS или 'OVERLAPS'

source: search values
ru: искомые значения

source: If some points of the rectangle-or-box defined by the search value are within the rectangle-or-box defined by the index key, it matches. Tuples are returned in their order within the space.
ru: Если некоторые точки прямоугольника-или-параллелепипеда, определенные искомым значением, находятся в пределах прямоугольника-или-параллелепипеда, определенного ключом индекса, получим совпадение. Найденные кортежи упорядочены по положению в спейсе.

source: box.index.NEIGHBOR or 'NEIGHBOR'
ru: box.index.NEIGHBOR или 'NEIGHBOR'

source: If some points of the rectangle-or-box defined by the defined by the key are within, or at the side of, defined by the index key, it matches. Tuples are returned in order: nearest neighbor first.
ru: Если некоторые точки прямоугольника-или-параллелепипеда, определенные ключом, находятся в пределах, определенных ключом индекса, или рядом с ним, получим совпадение. Найденные кортежи упорядочены следующим образом: сначала ближайший сосед.

source: **First example of index pairs():**
ru: **Первый пример pairs():**

source: Default 'TREE' Index and ``pairs()`` function:
ru: 'TREE'-индекс, используемый по умолчанию, и функция ``pairs()``:

source: **Second example of index pairs():**
ru: **Второй пример pairs():**

source: This Lua code finds all the tuples whose primary key values begin with 'XY'. The assumptions include that there is a one-part primary-key TREE index on the first field, which must be a string. The iterator loop ensures that the search will return tuples where the first value is greater than or equal to 'XY'. The conditional statement within the loop ensures that the looping will stop when the first two letters are not 'XY'.
ru: Данный код на Lua найдет все кортежи, значения первичного ключа в которых начинаются с 'XY'. Рабочие предположения заключаются в следующем: есть однокомпонентный первичный TREE-индекс по первому полю, которое должно представлять собой строку. Цикл с итератором обеспечивает поиск кортежей, в которых первое значение больше или равно 'XY'. Условный оператор в цикле служит для того, чтобы цикл останавливался, если первые две буквы не 'XY'.

source: **Third example of index pairs():**
ru: **Третий пример pairs():**

source: This Lua code finds all the tuples whose primary key values are greater than or equal to 1000, and less than or equal to 1999 (this type of request is sometimes called a "range search" or a "between search"). The assumptions include that there is a one-part primary-key TREE index on the first field, which must be a :ref:`number <index-box_number>`. The iterator loop ensures that the search will return tuples where the first value is greater than or equal to 1000. The conditional statement within the loop ensures that the looping will stop when the first value is greater than 1999.
ru: Данный код на Lua найдет все кортежи, значения первичного ключа которых равны или больше 1000 и меньше или равны 1999 (такой тип запроса иногда называют поиском по диапазону или поиском в заданных пределах). Рабочие предположения заключаются в следующем: есть однокомпонентный первичный TREE-индекс по первому полю, которое должно представлять собой :ref:`число <index-box_number>`. Цикл с итератором обеспечивает поиск кортежей, в которых первое значение больше или равно 1000. Условный оператор в цикле служит для того, чтобы цикл останавливался, если первое значение больше 1999.

source: This is an alternative to :ref:`box.space...select() <box_space-select>` which goes via a particular index and can make use of additional parameters that specify the iterator type, and the limit (that is, the maximum number of tuples to return) and the offset (that is, which tuple to start with in the list).
ru: Это может быть альтернативой для функции :ref:`box.space...select() <box_space-select>`, которая проходит по определенному индексу и может использовать дополнительные параметры, которые определяют тип итератора и пределы (то есть максимальное количество возвращаемых кортежей) и смещение (то есть с какого кортежа в списке начинать).

source: values to be matched against the index key
ru: значения для сопоставления с ключом индекса

source: none, any or all of next parameters
ru: ни один, любой или все следующие параметры

source: type of iterator
ru: тип итератора

source: maximum number of tuples
ru: максимальное количество кортежей

source: start tuple number
ru: номер начального кортежа

source: the tuple or tuples that match the field values.
ru: кортеж или кортежи, которые совпадают со значениями поля.

source: array of tuples
ru: массив кортежей

source: -- Create a space named tester. tarantool> sp = box.schema.space.create('tester') -- Create a unique index 'primary' -- which won't be needed for this example. tarantool> sp:create_index('primary', {parts = {1, 'unsigned' }}) -- Create a non-unique index 'secondary' -- with an index on the second field. tarantool> sp:create_index('secondary', { > type = 'tree', > unique = false, > parts = {2, 'string'} > }) -- Insert three tuples, values in field[2] -- equal to 'X', 'Y', and 'Z'. tarantool> sp:insert{1, 'X', 'Row with field[2]=X'} tarantool> sp:insert{2, 'Y', 'Row with field[2]=Y'} tarantool> sp:insert{3, 'Z', 'Row with field[2]=Z'} -- Select all tuples where the secondary index -- keys are greater than 'X'.` tarantool> sp.index.secondary:select({'X'}, { > iterator = 'GT', > limit = 1000 > })
ru: -- Создать спейс под названием tester. tarantool> sp = box.schema.space.create('tester') -- Создать уникальный индекс 'primary' -- который не будет нужен для данного примера.. tarantool> sp:create_index('primary', {parts = {1, 'unsigned' }}) -- Создать неуникальный индекс 'secondary' -- по второму полю. tarantool> sp:create_index('secondary', { > type = 'tree', > unique = false, > parts = {2, 'string'} > }) -- Вставить три кортежа, значения в поле2 field[2] -- равны 'X', 'Y' и 'Z'. tarantool> sp:insert{1, 'X', 'Row with field[2]=X'} tarantool> sp:insert{2, 'Y', 'Row with field[2]=Y'} tarantool> sp:insert{3, 'Z', 'Row with field[2]=Z'} -- Выбрать все кортежи, где вторичные ключи -- больше, чем 'X'.` tarantool> sp.index.secondary:select({'X'}, { > iterator = 'GT', > limit = 1000 > })

source: The result will be a table of tuple and will look like this:
ru: Результатом будет следующая таблица кортежа:

source: :samp:`index.{index-name}` is optional. If it is omitted, then the assumed index is the first (primary-key) index. Therefore, for the example above, ``box.space.tester:select({1}, {iterator = 'GT'})`` would have returned the same two rows, via the 'primary' index.
ru: Параметр :samp:`index.{имя-индекса}` необязателен. Если он пропущен, то подразумевается первый индекс (первичный ключ). Таким образом, для примера выше, ``box.space.tester:select({1}, {iterator = 'GT'})`` вернет две одинаковых строки по первичному индексу 'primary'.

source: :samp:`iterator = {iterator-type}` is optional. If it is omitted, then ``iterator = 'EQ'`` is assumed.
ru: Параметр типа итератора :samp:`iterator = {тип-итератора}` необязателен. Если он пропущен, то подразумевается, что ``iterator = 'EQ'``.

source: :samp:`{field-value} [, {field-value ...}]` is optional. If it is omitted, then every key in the index is considered to be a match, regardless of iterator type. Therefore, for the example above, ``box.space.tester:select{}`` will select every tuple in the tester space via the first (primary-key) index.
ru: Параметр :samp:`{field-value} [, {значение поля ...}]` необязателен. Если он пропущен, то каждый ключ в индексе будет считаться совпадением независимо от типа итератора. Таким образом, для примера выше, ``box.space.tester:select{}`` выберет каждый кортеж в спейсе tester по первому индексу (первичный ключ).

source: :samp:`box.space.{space-name}.index.{index-name}:select(...)[1]``. can be replaced by :samp:`box.space.{space-name}.index.{index-name}:get(...)`. That is, ``get`` can be used as a convenient shorthand to get the first tuple in the tuple set that would be returned by ``select``. However, if there is more than one tuple in the tuple set, then ``get`` returns an error.
ru: :samp:`box.space.{имя-спейса}.index.{имя-индекса}:select(...)[1]`` можно заменить :samp:`box.space.{имя-спейса}.index.{имя-индекса}:get(...)`. А именно, ``get`` можно использовать в качестве удобного сокращения для получения первого кортежа в наборе кортежей, который был бы выведен по запросу ``select``. Однако, если в наборе кортежей больше одного кортежа, ``get`` вернет ошибку.

source: **Example with BITSET index:**
ru: **Пример с индексом BITSET:**

source: The following script shows creation and search with a BITSET index. Notice: BITSET cannot be unique, so first a primary-key index is created. Notice: bit values are entered as hexadecimal literals for easier reading.
ru: Следующий скрипт показывает создание BITSET-индекса и поиск по нему. Обратите внимание, что битовое множество BITSET не может быть уникальным, поэтому сначала создается первичный индекс. Обратите внимание, что битовые значения вводятся как шестнадцатеричные литералы для удобства чтения.

source: Search for a tuple via the given index, as described :ref:`earlier <box_index-note>`.
ru: Поиск кортежа по заданному индексу, как описано :ref:`выше <box_index-note>`.

source: the tuple whose index-key fields are equal to the passed key values.
ru: кортеж, в котором поля ключа в индексе равны переданным значениям ключа.

source: tuple
ru: кортеж

source: no such index;
ru: отсутствие такого индекса;

source: wrong type;
ru: неправильный тип;

source: more than one tuple matches.
ru: больше одного кортежа подходят.

source: **Complexity factors:** Index size, Index type. See also :ref:`space_object:get() <box_space-get>`.
ru: **Факторы сложности:** Размер индекса, тип индекса. См. также :ref:`space_object:get() <box_space-get>`.

source: Find the minimum value in the specified index.
ru: Поиск минимального значения в указанном индексе.

source: **Possible errors:** index is not of type 'TREE'.
ru: **Возможные ошибки:** тип индекса не 'TREE'.

source: **Complexity factors:** Index size, Index type.
ru: **Факторы сложности:** Размер индекса, тип индекса.

source: Find the maximum value in the specified index.
ru: Поиск максимального значения в указанном индексе.

source: Find a random value in the specified index. This method is useful when it's important to get insight into data distribution in an index without having to iterate over the entire data set.
ru: Поиск случайного значения в заданном индексе. Данный метод используется, когда важно получить представление о распределении данных в индексе без необходимости проходить по всему набору данных.

source: an arbitrary non-negative integer
ru: произвольное неотрицательное целое число

source: the tuple for the random key in the index.
ru: кортеж для случайного ключа в индексе.

source: **Note re storage engine:** vinyl does not support ``random()``.
ru: **Примечание про движок базы данных:** vinyl не поддерживает ``random()``.

source: Iterate over an index, counting the number of tuples which match the key-value.
ru: Итерация по индексу с подсчетом количества кортежей, которые соответствуют паре ключ-значение.

source: comparison method
ru: метод сопоставления

source: the number of matching index keys.
ru: количество совпадающих ключей индекса.

source: number
ru: число

source: Update a tuple.
ru: Обновление кортежа.

source: Same as :ref:`box.space...update() <box_space-update>`, but key is searched in this index instead of primary key. This index ought to be unique.
ru: То же, что и :ref:`box.space...update() <box_space-update>`, но поиск ключа происходит в этом индексе, вместо первичного. Данный индекс должен быть уникальным.

source: operation type represented in string
ru: тип операции, представленный строкой

source: what field the operation will apply to. The field number can be negative, meaning the position from the end of tuple. (#tuple + negative field number + 1)
ru: к какому полю применяется операция. Номер поля может быть отрицательным, что означает, что позиция рассчитывается с конца кортежа. (#кортеж + отрицательный номер поля + 1)

source: what value will be applied
ru: какое значение применяется

source: the updated tuple.
ru: обновленный кортеж.

source: Delete a tuple identified by a key.
ru: Удаление кортежа по ключу.

source: Same as :ref:`box.space...delete() <box_space-delete>`, but key is searched in this index instead of in the primary-key index. This index ought to be unique.
ru: То же, что и :ref:`box.space...delete() <box_space-delete>`, но поиск ключа происходит в этом индексе, вместо первичного. Данный индекс должен быть уникальным.

source: the deleted tuple.
ru: удаленный кортеж.

source: **Note re storage engine:** vinyl will return `nil`, rather than the deleted tuple.
ru: **Примечание про движок базы данных:** vinyl вернет `nil`, а не удаленный кортеж.

source: options list, same as the options list for ``create_index``, see the chart named :ref:`Options for space_object:create_index() <box_space-create_index>`.
ru: список параметров, аналогичный списку параметров для ``create_index``, см. таблицу под названием :ref:`Параметры для space_object:create_index() <box_space-create_index>`.

source: index does not exist,
ru: индекс не существует,

source: Drop an index. Dropping a primary-key index has a side effect: all tuples are deleted.
ru: Удаление индекса. Побочный эффект удаления первичного индекса -- все кортежи удалятся.

source: a primary-key index cannot be dropped while a secondary-key index exists.
ru: первичный индекс невозможно удалить, если существует вторичный индекс.

source: Rename an index.
ru: Переименование индекса.

source: new name for index
ru: новое имя индекса

source: **Possible errors:** index_object does not exist.
ru: **Возможные ошибки:** index_object не существует.

source: **Complexity factors:** Index size, Index type, Number of tuples accessed.
ru: **Факторы сложности:** Размер индекса, тип индекса, количество кортежей, к которым получен доступ.

source: Return the total number of bytes taken by the index.
ru: Возврат общего количества байтов, занятых индексом.

source: number of bytes
ru: количество байтов

source: Example showing use of the box functions
ru: Пример использования функций box

source: This example will work with the sandbox configuration described in the preface. That is, there is a space named tester with a numeric primary key. The example function will:
ru: Данный пример сработает на конфигурации из песочницы, описанной в предисловии, то есть создан спейс под названием tester с первичным числовым ключом. Функция в примере выполнит следующие действия:

source: select a tuple whose key value is 1000;
ru: выбрать кортеж, значение ключа в котором равно 1000;

source: return an error if the tuple already exists and already has 3 fields;
ru: вернуть ошибку, если такой кортеж уже существует и содержит 3 поля;

source: Insert or replace the tuple with:
ru: вставить или заменить кортеж следующими данными:

source: field[1] = 1000
ru: поле [1] = 1000
