Repository: tarantool/doc
Catalog: locale/*/LC_MESSAGES/doc.po
Languages: ru

source: table of connection options, with any of these components:
ru: таблица с параметрами подключения, которые могут содержать любые из следующих компонентов:

source: ``timeout`` - number of seconds to wait for a curl API read request before timing out
ru: ``timeout`` -- количество секунд ожидания API-запроса curl на чтение до превышения времени ожидания

source: ``ca_path`` - path to a directory holding one or more certificates to verify the peer with
ru: ``ca_path`` -- путь к директории, где хранятся один или более сертификатов для проверки подключенного узла

source: ``ca_file`` - path to an SSL certificate file to verify the peer with
ru: ``ca_file`` -- путь к SSL-сертификату для проверки подключенного узла

source: ``verify_host`` - set on/off verification of the certificate's name (CN) against host. See also `CURLOPT_SSL_VERIFYHOST <https://curl.haxx.se/libcurl/c/CURLOPT_SSL_VERIFYHOST.html>`_
ru: ``verify_host`` -- включение/отключение проверки имени сертификата (CN) для хоста. См. также `CURLOPT_SSL_VERIFYHOST <https://curl.haxx.se/libcurl/c/CURLOPT_SSL_VERIFYHOST.html>`_

source: ``verify_peer`` - set on/off verification of the peer's SSL certificate. See also `CURLOPT_SSL_VERIFYPEER <https://curl.haxx.se/libcurl/c/CURLOPT_SSL_VERIFYPEER.html>`_
ru: ``verify_peer`` -- включение/отключение проверки SSL-сертификата подключенного узла. См. также `CURLOPT_SSL_VERIFYPEER <https://curl.haxx.se/libcurl/c/CURLOPT_SSL_VERIFYPEER.html>`_

source: ``ssl_key`` - path to a private key file for a TLS and SSL client certificate. See also `CURLOPT_SSLKEY <https://curl.haxx.se/libcurl/c/CURLOPT_SSLKEY.html>`_
ru: ``ssl_key`` -- путь к файлу закрытого ключа для клиентского TSL-сертификата и SSL-сертификата. См. также `CURLOPT_SSLKEY <https://curl.haxx.se/libcurl/c/CURLOPT_SSLKEY.html>`_

source: ``ssl_cert`` - path to a SSL client certificate file. See also `CURLOPT_SSLCERT <https://curl.haxx.se/libcurl/c/CURLOPT_SSLCERT.html>`_
ru: ``ssl_cert`` -- путь к файлу клиентского SSL-сертификата. См. также `CURLOPT_SSLCERT <https://curl.haxx.se/libcurl/c/CURLOPT_SSLCERT.html>`_

source: ``headers`` - table of HTTP headers
ru: ``headers`` -- таблица HTTP-заголовков

source: ``keepalive_idle`` - delay, in seconds, that the operating system will wait while the connection is idle before sending keepalive probes. See also `CURLOPT_TCP_KEEPALIVE <https://curl.haxx.se/libcurl/c/CURLOPT_TCP_KEEPALIVE.html>`_
ru: ``keepalive_idle`` -- время задержки в секундах, в течение которого операционная система находится в режиме ожидания подключения до отправки сообщений для поддержания в активном состоянии keepalive. См. также `CURLOPT_TCP_KEEPALIVE <https://curl.haxx.se/libcurl/c/CURLOPT_TCP_KEEPALIVE.html>`_

source: ``keepalive_interval`` - the interval, in seconds, that the operating system will wait between sending keepalive probes. See also `CURLOPT_TCP_KEEPALIVE <https://curl.haxx.se/libcurl/c/CURLOPT_TCP_KEEPALIVE.html>`_
ru: ``keepalive_interval`` -- время интервала в секундах, в течение которого операционная система находится в режиме ожидания между отправкой сообщений keepalive. См. также `CURLOPT_TCP_KEEPALIVE <https://curl.haxx.se/libcurl/c/CURLOPT_TCP_KEEPALIVE.html>`_

source: ``low_speed_time`` - set the "low speed time" -- the time that the transfer speed should be below the "low speed limit" for the library to consider it too slow and abort. See also `CURLOPT_LOW_SPEED_TIME <https://curl.haxx.se/libcurl/c/CURLOPT_LOW_SPEED_TIME.html>`_
ru: ``low_speed_time`` -- установка "времени работы с низкой скоростью" -- времени, в течение которого скорость передачи должна быть ниже "предела низкой скорости", чтобы библиотека посчитала работу слишком медленной и завершила ее. См. также `CURLOPT_LOW_SPEED_TIME <https://curl.haxx.se/libcurl/c/CURLOPT_LOW_SPEED_TIME.html>`_

source: ``low_speed_limit`` - set the "low speed limit" -- the average transfer speed in bytes per second that the transfer should be below during "low speed time" seconds for the library to consider it to be too slow and abort. See also `CURLOPT_LOW_SPEED_LIMIT <https://curl.haxx.se/libcurl/c/CURLOPT_LOW_SPEED_LIMIT.html>`_
ru: ``low_speed_limit`` -- установка "предела низкой скорости" -- средней скорости передачи в байтах в секунду, ниже которой должна быть скорость передачи, чтобы библиотека посчитала работу слишком медленной и завершила ее. См. также `CURLOPT_LOW_SPEED_LIMIT <https://curl.haxx.se/libcurl/c/CURLOPT_LOW_SPEED_LIMIT.html>`_

source: ``verbose`` - set on/off verbose mode
ru: ``verbose`` -- включение/отключение режима отображения подробной информации

source: connection information, with all of these components:
ru: информация о подключении со всеми следующими компонентами:

source: ``status`` - HTTP response status
ru: ``status`` -- статус HTTP-ответа

source: ``reason`` - HTTP response status text
ru: ``reason`` -- текст статуса HTTP-ответа

source: ``headers`` - a Lua table with normalized HTTP headers
ru: ``headers`` -- Lua-таблица с нормализованными HTTP-заголовками

source: ``body`` - response body
ru: ``body`` -- тело сообщения-ответа

source: ``proto`` - protocol version
ru: ``proto`` -- версия протокола

source: The following "shortcuts" exist for requests:
ru: Для запросов существуют следующие ускоренные методы:

source: ``http_client:get(url, options)`` - shortcut for ``http_client:request("GET", url, nil, opts)``
ru: ``http_client:get(url, options)`` -- ускоренный метод для ``http_client:request("GET", url, nil, opts)``

source: ``http_client:post (url, body, options)`` - shortcut for ``http_client:request("POST", url, body, opts)``
ru: ``http_client:post (url, body, options)`` -- ускоренный метод для ``http_client:request("POST", url, body, opts)``

source: ``http_client:put(url, body, options)`` - shortcut for ``http_client:request("POST", url, body, opts)``
ru: ``http_client:put(url, body, options)`` -- ускоренный метод для ``http_client:request("POST", url, body, opts)``

source: ``http_client:patch(url, body, options)`` - shortcut for ``http_client:request("PATCH", url, body, opts)``
ru: ``http_client:patch(url, body, options)`` -- ускоренный метод для ``http_client:request("PATCH", url, body, opts)``

source: ``http_client:options(url, options)`` - shortcut for ``http_client:request("OPTIONS", url, nil, opts)``
ru: ``http_client:options(url, options)`` -- ускоренный метод для ``http_client:request("OPTIONS", url, nil, opts)``

source: ``http_client:head(url, options)`` - shortcut for ``http_client:request("HEAD", url, nil, opts)``
ru: ``http_client:head(url, options)`` -- ускоренный метод для ``http_client:request("HEAD", url, nil, opts)``

source: ``http_client:delete(url, options)`` - shortcut for ``http_client:request("DELETE", url, nil, opts)``
ru: ``http_client:delete(url, options)`` -- ускоренный метод для ``http_client:request("DELETE", url, nil, opts)``

source: ``http_client:trace(url, options)`` - shortcut for ``http_client:request("TRACE", url, nil, opts)``
ru: ``http_client:trace(url, options)`` -- ускоренный метод для ``http_client:request("TRACE", url, nil, opts)``

source: ``http_client:connect:(url, options)`` - shortcut for ``http_client:request("CONNECT", url, nil, opts)``
ru: ``http_client:connect:(url, options)`` -- ускоренный метод для ``http_client:request("CONNECT", url, nil, opts)``

source: The ``http_client:stat()`` function returns a table with statistics:
ru: Функция ``http_client:stat()`` возвращает таблицу со статистическими данными:

source: ``active_requests`` - number of currently executing requests
ru: ``active_requests`` -- количество активно выполняемых запросов

source: ``sockets_added`` - total number of sockets added into an event loop
ru: ``sockets_added`` -- общее количество сокетов, добавленных в событийный цикл

source: ``sockets_deleted`` - total number of sockets sockets from an event loop
ru: ``sockets_deleted`` -- общее количество сокетов, удаленных из событийного цикла

source: ``total_requests`` - total number of requests
ru: ``total_requests`` -- общее количество запросов

source: ``http_200_responses`` - total number of requests which have returned code HTTP 200
ru: ``http_200_responses`` -- общее количество запросов, которые вернули код состояния HTTP 200

source: ``http_other_responses`` - total number of requests which have not returned code HTTP 200
ru: ``http_other_responses`` -- общее количество запросов, которые не вернули код состояния HTTP 200

source: ``failed_requests`` - total number of requests which have failed including system errors, curl errors, and HTTP errors
ru: ``failed_requests`` -- общее количество невыполненных запросов, включая системные ошибки, ошибки curl и HTTP-ошибки

source: Connect to an HTTP server, look at the size of the response for a 'GET' request, and look at the statistics for the session.
ru: Подключение к HTTP-серверу, просмотр размера ответа на 'GET'-запрос и просмотр статистики по сессии.

source: Module `iconv`
ru: Модуль `iconv`

source: The ``iconv`` module provides a way to convert a string with one encoding to a string with another encoding, for example from ASCII to UTF-8. It is based on the POSIX iconv routines.
ru: Модуль ``iconv`` предоставляет метод конвертации строки с одним типом кодировки в строку с другим типом кодировки, например из ASCII в UTF-8. Он основывается на процедурах с iconv в POSIX.

source: An exact list of the available encodings may depend on environment. Typically the list includes ASCII, BIG5, KOI8R, LATIN8, MS-GREEK, SJIS, and about 100 others. For a complete list, type ``iconv --list`` on a terminal.
ru: Точный список доступных кодировок зависит от окружения. Как правило, в список входят ASCII, BIG5, KOI8R, LATIN8, MS-GREEK, SJIS и около 100 других. Чтобы увидеть общий список, введите команду ``iconv --list`` в терминале.

source: Below is a list of all ``iconv`` functions.
ru: Ниже приведен перечень всех функций модуля ``iconv``.

source: Create an iconv instance
ru: Создание экземпляра iconv

source: Perform conversion on a string
ru: Преобразование строки

source: Construct a new iconv instance.
ru: Создание нового iconv-экземпляра.

source: the name of the encoding that we will convert to.
ru: название будущей кодировки.

source: the name of the encoding that we will convert from.
ru: название используемой кодировки.

source: a new iconv instance -- in effect, a callable function
ru: новый экземпляр iconv -- на самом деле, вызываемая функция

source: If either parameter is not a valid name, there will be an error message.
ru: Если значение одного из параметров представляет собой недопустимое имя, появится сообщение об ошибке.

source: Convert.
ru: Преобразование.

source: the string to be converted (the "from" string)
ru: строка для преобразования ("из")

source: the string that results from the conversion (the "to" string)
ru: строка, получаемая в результате преобразования ("в")

source: If anything in input-string cannot be converted, there will be an error message and the result string will be unchanged.
ru: Если что-либо в строке input-string нельзя преобразовать, появится сообщение об ошибке, строка останется неизменной.

source: We know that the Unicode code point for "Д" (CYRILLIC CAPITAL LETTER DE) is hexadecimal 0414 according to the character database of Unicode_. Therefore that is what it will look like in UTF-16. We know that Tarantool typically uses the UTF-8 character set. So make a from-UTF-8-to-UTF-16 converter, use string.hex('Д') to show what Д's encoding looks like in the UTF-8 source, and use string.hex('Д'-after-conversion) to show what it looks like in the UTF-16 target. Since the result is 0414, we see that iconv conversion works.
ru: Мы знаем, что кодовая точка для заглавной буквы "Д" в Unicode представляет собой шестнадцатеричное число 0414 в соответствии с таблицей символов Unicode_. Таким образом, так она будет выглядеть в UTF-16. Мы знаем, что как правило, Tarantool использует набор символов UTF-8. Поэтому для создания конвертора из UTF-8 в UTF-16 используем string.hex('Д'), чтобы показать, как выглядит кодировка Д в исходном наборе символов UTF-8, а затем используем string.hex('Д'-after-conversion), чтобы показать, как она будет выглядеть в целевом наборе символов UTF-16. Поскольку результатом будет 0414, видим, что преобразование с помощью iconv сработало.

source: Built-in modules reference
ru: Справочник по встроенным модулям

source: This reference covers Tarantool's built-in Lua modules.
ru: В данном справочнике рассматриваются встроенные Lua-модули Tarantool'а.

source: Some functions in these modules are analogs to functions from `standard Lua libraries <http://www.lua.org/manual/>`_. For better results, we recommend using functions from Tarantool's built-in modules.
ru: Некоторые функции в данных модулях представляют собой аналоги функций из `стандартных Lua-библиотек <http://www.lua.org/manual/>`_. Для достижения наилучшего результата мы рекомендуем использовать функции из встроенных модулей Tarantool'а.

source: List of Lua modules
ru: Перечень Lua-модулей

source: Module `json`
ru: Модуль `json`

source: The ``json`` module provides JSON manipulation routines. It is based on the `Lua-CJSON module by Mark Pulford`_. For a complete manual on Lua-CJSON please read `the official documentation`_.
ru: Модуль ``json`` обеспечивает процедуры работы с форматом JSON. Он основан на `модуле Lua-CJSON от Mark Pulford`_. Полное руководство по Lua-CJSON включено в официальную документацию (`the official documentation`_).

source: Below is a list of all ``json`` functions and members.
ru: Ниже приведен перечень всех функций и элементов модуля ``json``.

source: Convert a Lua object to a JSON string
ru: Конвертация Lua-объекта в JSON-строку

source: Convert a JSON string to a Lua object
ru: Конвертация JSON-строки в Lua-объект

source: Analog of Lua's "nil"
ru: Аналог "nil" в языке Lua

source: Convert a Lua object to a JSON string.
ru: Конвертация Lua-объекта в JSON-строку.

source: either a scalar value or a Lua table value.
ru: скалярное значение или значение из Lua-таблицы.

source: the original value reformatted as a JSON string.
ru: оригинальное значение, преобразованное в JSON-строку.

source: Convert a JSON string to a Lua object.
ru: Конвертация JSON-строки в Lua-объект.

source: a string formatted as JSON.
ru: строка в формате JSON.

source: the original contents formatted as a Lua table.
ru: оригинальное содержание в формате Lua-таблицы.

source: See the tutorial :ref:`Sum a JSON field for all tuples <c_lua_tutorial-sum_a_json_field>` to see how ``json.decode()`` can fit in an application.
ru: Чтобы увидеть применение ``json.decode()`` в приложении, см. практическое задание :ref:`Подсчет суммы по JSON-полям во всех кортежах <c_lua_tutorial-sum_a_json_field>`.

source: A value comparable to Lua "nil" which may be useful as a placeholder in a tuple.
ru: Значение, сопоставимое с нулевым значением "nil" в языке Lua, которое можно использовать в качестве объекта-заполнителя в кортеже.

source: -- When nil is assigned to a Lua-table field, the field is null tarantool> {nil, 'a', 'b'} --- - - null - a - b ... -- When json.NULL is assigned to a Lua-table field, the field is json.NULL tarantool> {json.NULL, 'a', 'b'} --- - - null - a - b ... -- When json.NULL is assigned to a JSON field, the field is null tarantool> json.encode({field2 = json.NULL, field1 = 'a', field3 = 'c'}) --- - '{"field2":null,"field1":"a","field3":"c"}' ...
ru: -- Когда полю Lua-таблицы присваивается nil, это поле -- null tarantool> {nil, 'a', 'b'} --- - - null - a - b ... -- Когда полю Lua-таблицы присваивается json.NULL, это поле -- json.NULL tarantool> {json.NULL, 'a', 'b'} --- - - null - a - b ... -- Когда JSON-полю присваивается json.NULL, это поле -- null tarantool> json.encode({field2 = json.NULL, field1 = 'a', field3 = 'c'}) --- - '{"field2":null,"field1":"a","field3":"c"}' ...

source: The JSON output structure can be specified with ``__serialize``:
ru: Структуру JSON-вывода можно указать с помощью ``__serialize``:

source: ``__serialize="seq"`` for an array
ru: ``__serialize="seq"`` для массива

source: ``__serialize="map"`` for a map
ru: ``__serialize="map"`` для ассоциативного массива

source: Serializing 'A' and 'B' with different ``__serialize`` values causes different results:
ru: Сериализация 'A' и' B' различными значениями ``__serialize`` приводит к различным результатам:

source: Configuration settings
ru: Параметры конфигурации

source: There are configuration settings which affect the way that Tarantool encodes invalid numbers or types. They are all boolean ``true``/``false`` values
ru: Следующие параметры конфигурации определяют, как Tarantool кодирует недопустимые числа или типы. Значения параметров -- логические ``true``/``false`` (правда/ложь).

source: ``cfg.encode_invalid_numbers`` (default is true) -- allow nan and inf
ru: ``cfg.encode_invalid_numbers`` (по умолчанию, true) -- разрешить nan и inf

source: ``cfg.encode_use_tostring`` (default is false) -- use tostring for unrecognizable types
ru: ``cfg.encode_use_tostring`` (по умолчанию, false) -- использовать tostring для нераспознаваемых типов

source: ``cfg.encode_invalid_as_nil`` (default is false) -- use null for all unrecognizable types
ru: ``cfg.encode_invalid_as_nil`` (по умолчанию, false) -- использовать null для всех нераспознаваемых типов

source: ``cfg.encode_load_metatables`` (default is false) -- load metatables
ru: ``cfg.encode_load_metatables`` (по умолчанию, false) -- загрузить метатаблицы

source: For example, the following code will interpret 0/0 (which is "not a number") and 1/0 (which is "infinity") as special values rather than nulls or errors:
ru: Например, следующий код интерпретирует 0/0 (что не является числом) и 1/0 (что представляет собой бесконечность) в качестве специальных значений, а не как null или ошибку:

source: The result of the ``json.encode()`` request will look like this:
ru: Результат запроса ``json.encode()`` будет следующим:

source: The same configuration settings exist for json, for :ref:`MsgPack <msgpack-module>`, and for :ref:`YAML <yaml-module>`.
ru: Такие параметры конфигурации применяются для формата JSON, для :ref:`MsgPack <msgpack-module>` и для :ref:`YAML <yaml-module>`.

source: Module `log`
ru: Модуль `log`

source: The Tarantool server puts all diagnostic messages in a log file specified by the :ref:`log <cfg_logging-log>` configuration parameter. Diagnostic messages may be either system-generated by the server's internal code, or user-generated with the :samp:`log.{log_level_function_name}` function.
ru: Сервер Tarantool'а сохраняет все сообщения об ошибке в файл журнала, указанный в конфигурационном параметре :ref:`log <cfg_logging-log>`. Сообщения об ошибке могут быть созданы либо системой с помощью внутреннего кода сервера, либо пользователем с помощью функции :samp:`log.{log_level_function_name}`.

source: As explained in the description of :ref:`log_format <cfg_logging-log_format>` configuration setting, there are two possible formats for log entries:
ru: Как сказано в описании параметра :ref:`log_format <cfg_logging-log_format>`, записи в журнале могут сохраняться в одном из двух форматов:

source: Below is a list of all ``log`` functions.
ru: Ниже приведен перечень всех функций и элементов модуля ``log``.

source: Write a user-generated message to a log file
ru: Запись сгенерированного пользователем сообщения в файл журнала

source: Get the PID of a logger
ru: Получение PID регистратора записи в журнале

source: Rotate a log file
ru: Ротация файла журнала

source: Output a user-generated message to the :ref:`log file <cfg_logging-log>`, given log_level_function_name = ``error`` or ``warn`` or ``info`` or ``verbose`` or ``debug``.
ru: Запись созданного пользователем сообщения в :ref:`файл журнала <cfg_logging-log>` при условии, что log_level_function_name = ``error`` или ``warn``, или ``info``, или ``verbose``, или ``debug``.

source: As explained in the description of the configuration setting for :ref:`log_level <cfg_logging-log_level>`, there are seven levels of detail:
ru: Как поясняется в описании настроек конфигурации :ref:`log_level <cfg_logging-log_level>`, есть семь уровней детализации:

source: 2 – ``ERROR`` -- this corresponds to ``log.error(...)``
ru: 2 – ``ERROR`` -- соответствует ``log.error(...)``

source: 4 – ``WARNING`` -- this corresponds to ``log.warn(...)``
ru: 4 – ``WARNING`` -- соответствует ``log.warn(...)``

source: 5 – ``INFO`` -- this corresponds to ``log.info(...)``
ru: 5 – ``INFO`` -- соответствует ``log.info(...)``

source: 6 – ``VERBOSE`` -- this corresponds to ``log.verbose(...)``
ru: 6 – ``VERBOSE`` -- соответствует ``log.verbose(...)``

source: 7 – ``DEBUG`` -- this corresponds to ``log.debug(...)``
ru: 7 – ``DEBUG`` -- соответствует ``log.debug(...)``

source: For example, if ``box.cfg.log_level`` is currently 5 (the default value), then ``log.error(...)``, ``log.warn(...)`` and ``log.info(...)`` messages will go to the log file. However, ``log.verbose(...)`` and ``log.debug(...)`` messages will not go to the log file, because they correspond to higher levels of detail.
ru: Например, если уровень ``box.cfg.log_level`` в данный момент -- 5 (по умолчанию), то сообщения ``log.error(...)``, ``log.warn(...)`` и ``log.info(...)`` будут записываться в файл журнала. Однако, сообщения ``log.verbose(...)`` и ``log.debug(...)`` не будут записываться в файл журнала, поскольку они соответствуют более высоким уровням детализации.

source: The actual output will be a line containing: * the current timestamp, * a module name, * 'E', 'W', 'I', 'V' or 'D' depending on ``log_level_function_name``, and * ``message``. Output will not occur if ``log_level_function_name`` is for a type greater than :ref:`log_level <cfg_logging-log_level>`. Messages may contain C-style format specifiers %d or %s, so :samp:`log.error('...%d...%s', {x}, {y})` will work if ``x`` is a number and ``y`` is a string.
ru: Выходное значение будет представлять собой строку, которая содержит следующее: * текущая временная отметка, * название модуля, * 'E', 'W', 'I', 'V' или 'D' в зависимости от ``log_level_function_name`` и * ``сообщение``. Вывода не будет, если ``log_level_function_name`` соответствует типу больше, чем :ref:`log_level <cfg_logging-log_level>`. Сообщения могут содержать спецификаторы формата в стиле C: %d или %s, то есть :samp:`log.error('...%d...%s', {x}, {y})` сработает, если ``x`` -- это число, а ``y`` -- это строка.

source: The actual output will be a line containing:
ru: Выходное значение будет представлять собой строку, которая содержит следующее:

source: the current timestamp,
ru: текущая временная отметка,

source: a module name,
ru: название модуля,

source: 'E', 'W', 'I', 'V' or 'D' depending on ``log_level_function_name``, and
ru: , 'W', 'I', 'V' или 'D' в зависимости от ``log_level_function_name`` и

source: ``message``.
ru: ``сообщение``.

source: Output will not occur if ``log_level_function_name`` is for a type greater than :ref:`log_level <cfg_logging-log_level>`.
ru: Вывода не будет, если ``log_level_function_name`` соответствует типу больше, чем :ref:`log_level <cfg_logging-log_level>`.

source: Messages may contain C-style format specifiers %d or %s, so :samp:`log.error('...%d...%s', {x}, {y})` will work if ``x`` is a number and ``y`` is a string.
ru: Сообщения могут содержать спецификаторы формата в стиле C: %d или %s, то есть :samp:`log.error('...%d...%s', {x}, {y})` сработает, если ``x`` -- это число, а ``y`` -- это строка.

source: PID of a logger
ru: PID регистратора записи в журнале

source: Rotate the log.
ru: Ротация журнала.

source: The 'Error' line is visible in ``tarantool.txt`` preceded by the letter E.
ru: Строке 'Error' в файле ``tarantool.txt`` предшествует буква "E".
