Repository: tarantool/doc
Catalog: locale/*/LC_MESSAGES/doc.po
Languages: ru

source: where ``sql-statement`` is a string, and the optional ``parameters`` are extra values that can be plugged in to replace any question marks ("?"s) in the SQL statement.
ru: где ``sql-statement`` -- это строка, а необязательные параметры -- это дополнительные значения, которыми можно заменить любые знаки вопроса ("?") в SQL-операторе.

source: Closing connection
ru: Закрытие соединения

source: To end a session that began with ``mysql.connect``, the request is:
ru: Чтобы закрыть сессию, которую открыли с помощью ``mysql.connect``, используется следующий запрос:

source: *connection-name*:close()
ru: *имя-соединения*:close()

source: For further information, including examples of rarely-used requests, see the README.md file at `github.com/tarantool/mysql`_.
ru: Для получения дополнительной информации, включая примеры редко используемых запросов, см. файл README.md по ссылке `github.com/tarantool/mysql`_.

source: The example was run on an Ubuntu 12.04 ("precise") machine where tarantool had been installed in a /usr subdirectory, and a copy of MySQL had been installed on ~/mysql-5.5. The mysqld server instance is already running on the local host 127.0.0.1.
ru: Пример выполняется на машине с ОС Ubuntu 12.04 (Precise Pangolin), где Tarantool установлен в поддиректорию /usr, а копия MySQL установлена в ~/mysql-5.5. Экземпляр сервера mysqld уже запущен на localhost 127.0.0.1.

source: $ export TMDIR=~/mysql-5.5 $ # Check that the include subdirectory exists by looking $ # for .../include/mysql.h. (If this fails, there's a chance $ # that it's in .../include/mysql/mysql.h instead.) $ [ -f $TMDIR/include/mysql.h ] && echo "OK" || echo "Error" OK $ # Check that the library subdirectory exists and has the $ # necessary .so file. $ [ -f $TMDIR/lib/libmysqlclient.so ] && echo "OK" || echo "Error" OK $ # Check that the mysql client can connect using some factory $ # defaults: port = 3306, user = 'root', user password = '', $ # database = 'test'. These can be changed, provided one uses $ # the changed values in all places. $ $TMDIR/bin/mysql --port=3306 -h 127.0.0.1 --user=root \ --password= --database=test Welcome to the MySQL monitor. Commands end with ; or \g. Your MySQL connection id is 25 Server version: 5.5.35 MySQL Community Server (GPL) ... Type 'help;' or '\h' for help. Type '\c' to clear ... $ # Insert a row in database test, and quit. mysql> CREATE TABLE IF NOT EXISTS test (s1 INT, s2 VARCHAR(50)); Query OK, 0 rows affected (0.13 sec) mysql> INSERT INTO test.test VALUES (1,'MySQL row'); Query OK, 1 row affected (0.02 sec) mysql> QUIT Bye $ # Install luarocks $ sudo apt-get -y install luarocks | grep -E "Setting up|already" Setting up luarocks (2.0.8-2) ... $ # Set up the Tarantool rock list in ~/.luarocks, $ # following instructions at rocks.tarantool.org $ mkdir ~/.luarocks $ echo "rocks_servers = {[[http://rocks.tarantool.org/]]}" >> \ ~/.luarocks/config.lua $ # Ensure that the next "install" will get files from Tarantool $ # master repository. The resultant display is normal for Ubuntu $ # 12.04 precise $ cat /etc/apt/sources.list.d/tarantool.list deb http://tarantool.org/dist/1.7/ubuntu/ precise main deb-src http://tarantool.org/dist/1.7/ubuntu/ precise main $ # Install tarantool-dev. The displayed line should show version = 1.6 $ sudo apt-get -y install tarantool-dev | grep -E "Setting up|already" Setting up tarantool-dev (1.6.6.222.g48b98bb~precise-1) ... $ $ # Use luarocks to install locally, that is, relative to $HOME $ luarocks install mysql MYSQL_LIBDIR=/usr/local/mysql/lib --local Installing http://rocks.tarantool.org/mysql-scm-1.rockspec... ... (more info about building the Tarantool/MySQL driver appears here) mysql scm-1 is now built and installed in ~/.luarocks/ $ # Ensure driver.so now has been created in a place $ # tarantool will look at $ find ~/.luarocks -name "driver.so" ~/.luarocks/lib/lua/5.1/mysql/driver.so $ # Change directory to a directory which can be used for $ # temporary tests. For this example we assume that the name $ # of this directory is /home/pgulutzan/tarantool_sandbox. $ # (Change "/home/pgulutzan" to whatever is the user's actual $ # home directory for the machine that's used for this test.) $ cd /home/pgulutzan/tarantool_sandbox $ # Start the Tarantool server instance. Do not use a Lua initialization file. $ tarantool tarantool: version 1.7.0-222-g48b98bb type 'help' for interactive help tarantool>
ru: $ export TMDIR=~/mysql-5.5 $ # Проверьте, что создана поддиректория include, путем поиска $ # .../include/mysql.h. (Если нет, то можно проверить $ # .../include/mysql/mysql.h.) $ [ -f $TMDIR/include/mysql.h ] && echo "OK" || echo "Error" OK $ # Проверьте, что создана поддиректория library, а в ней $ # необходимый файл .so. $ [ -f $TMDIR/lib/libmysqlclient.so ] && echo "OK" || echo "Error" OK $ # Проверьте, что mysql-клиент может подключиться, с помощью настроек $ # по умолчанию: порт = 3306, пользователь = 'root', пароль пользователя = '', $ # база данных = 'test'. Эти настройки можно изменить, используя $ # измененные значения. $ $TMDIR/bin/mysql --port=3306 -h 127.0.0.1 --user=root \ --password= --database=test Welcome to the MySQL monitor. Commands end with ; or \g. Your MySQL connection id is 25 Server version: 5.5.35 MySQL Community Server (GPL) ... Type 'help;' or '\h' for help. Type '\c' to clear ... $ # Вставьте строку в базу данных test и завершите работу. mysql> CREATE TABLE IF NOT EXISTS test (s1 INT, s2 VARCHAR(50)); Query OK, 0 rows affected (0.13 sec) mysql> INSERT INTO test.test VALUES (1,'MySQL row'); Query OK, 1 row affected (0.02 sec) mysql> QUIT Bye $ # Установите luarocks $ sudo apt-get -y install luarocks | grep -E "Setting up|already" Setting up luarocks (2.0.8-2) ... $ # Настройте список сторонних модулей Tarantool'а в ~/.luarocks, $ # следуя инструкциям по ссылке rocks.tarantool.org $ mkdir ~/.luarocks $ echo "rocks_servers = {[[http://rocks.tarantool.org/]]}" >> \ ~/.luarocks/config.lua $ # Убедитесь, что при следующей установке будут использованы файлы из главного $ # хранилища Tarantool'а. Получаем результат, нормальный для Ubuntu $ # 12.04 Precise Pangolin $ cat /etc/apt/sources.list.d/tarantool.list deb http://tarantool.org/dist/1.7/ubuntu/ precise main deb-src http://tarantool.org/dist/1.7/ubuntu/ precise main $ # Установите tarantool-dev. Строка на экране должна показать версию 1.6 $ sudo apt-get -y install tarantool-dev | grep -E "Setting up|already" Setting up tarantool-dev (1.6.6.222.g48b98bb~precise-1) ... $ $ # Используйте luarocks для локальной установки, то есть в $HOME $ luarocks install mysql MYSQL_LIBDIR=/usr/local/mysql/lib --local Installing http://rocks.tarantool.org/mysql-scm-1.rockspec... ... (здесь будет еще информация о сборке драйвера Tarantool/MySQL) mysql scm-1 is now built and installed in ~/.luarocks/ $ # Убедитесь, что driver.so создан в месте, $ # где Tarantool будет искать его $ find ~/.luarocks -name "driver.so" ~/.luarocks/lib/lua/5.1/mysql/driver.so $ # Измените директорию на директорию, которую можно использовать для $ # временного тестирования. В данном примере предполагаем, что имя $ # этой директории будет /home/pgulutzan/tarantool_sandbox. $ # (Измените "/home/pgulutzan" на фактическую корневую директорию $ # пользователя машины, используемой для тестирования.) $ cd /home/pgulutzan/tarantool_sandbox $ # Запустите экземпляр Tarantool-сервера. Не используйте файл инициализации Lua. $ tarantool tarantool: version 1.7.0-222-g48b98bb type 'help' for interactive help tarantool>

source: Configure tarantool and load mysql module. Make sure that tarantool doesn't reply "error" for the call to "require()".
ru: Настройте Tarantool и загрузите модуль mysql. Убедитесь, что Tarantool не выбрасывает ошибку в ответ на вызов "require()".

source: Create a Lua function that will connect to the MySQL server instance, (using some factory default values for the port and user and password), retrieve one row, and display the row. For explanations of the statement types used here, read the Lua tutorial earlier in the Tarantool user manual.
ru: Создайте Lua-функцию, которая подключится к экземпляру MySQL-сервера (используя значения по умолчанию для параметров порта, пользователя и пароля), выберите одну строку и выведите ее на экран. Описание используемых здесь типов операторов вы можете найти в практикуме по Lua в руководстве пользователя Tarantool'а.

source: Observe the result. It contains "MySQL row". So this is the row that was inserted into the MySQL database. And now it's been selected with the Tarantool client.
ru: Просмотрите результат. В нем есть строка "MySQL row". Это и есть строка, которая была вставлена в базу данных MySQL. А сейчас она выделена с помощью Tarantool-клиента.

source: PostgreSQL Example
ru: Пример для PostgreSQL

source: This example assumes that PostgreSQL 8 or PostgreSQL 9 has been installed. More recent versions should also work. The package that matters most is the PostgreSQL developer package, typically named something like libpq-dev. On Ubuntu this can be installed with:
ru: В данном примере предполагается, что установлены PostgreSQL 8 или PostgreSQL 9. Более поздние версии также должны сработать. Самым важным пакетом будет пакет для разработчиков клиента PostgreSQL, который обычно называется libpq-dev. На Ubuntu его можно установить следующим образом:

source: However, because not all platforms are alike, for this example the assumption is that the user must check that the appropriate PostgreSQL files are present and must explicitly state where they are when building the Tarantool/PostgreSQL driver. One can use ``find`` or ``whereis`` to see what directories PostgreSQL files are installed in.
ru: Однако, не все платформы одинаковы, поэтому в данном примере предполагается, что пользователь должен проверить наличие нужных PostgreSQL-файлов, а также явным образом прописать, где они находятся, для сборки драйвера Tarantool/PostgreSQL. Для поиска директорий, где установлены PostgreSQL-файлы, можно воспользоваться командами ``find`` или ``whereis``.

source: It will be necessary to install Tarantool's PostgreSQL driver shared library, load it, and use it to connect to a PostgreSQL server instance. After that, one can pass any PostgreSQL statement to the server instance and receive results.
ru: Также нужно будет установить библиотеку общего пользования Tarantool'а с драйвером для PostgreSQL, загрузить ее и использовать для подключения к экземпляру PostgreSQL-сервера. После этого можно передавать любой оператор PostgreSQL на экземпляр сервера и получать результаты.

source: Now, for the PostgreSQL driver shared library, there are two ways to install:
ru: Что касается библиотеки общего пользования с драйвером для PostgreSQL, ее можно установить двумя способами:

source: Go the site `github.com/tarantool/pg`_. Follow the instructions there, saying:
ru: Перейдите по ссылке `github.com/tarantool/pg`_. Следуя инструкциям, введите команду:

source: Begin by making a ``require`` request for the pg driver. We will assume that the name is ``pg`` in further examples.
ru: Начните с выполнения запроса ``require`` для драйвера pg. В дальнейших примерах у него будет имя ``pg``.

source: *connection_name* = pg.connect(*connection options*)
ru: *имя_подключения* = pg.connect(*параметры подключения*)

source: :samp:`port = {port-number}` - number, default value = 5432
ru: :samp:`port = {номер-порта}` -- число, значение по умолчанию = 5432

source: :samp:`pass = {password}` or :samp:`password = {password}` - string, default value is blank
ru: :samp:`pass = {пароль}` или :samp:`password = {пароль}` -- строка, по умолчанию пустая

source: The names are similar to the names that PostgreSQL itself uses.
ru: Имена параметров похожи на имена, которые используются в PostgreSQL.

source: For all PostgreSQL statements, the request is:
ru: Для всех операторов PostgreSQL запрос будет:

source: To end a session that began with ``pg.connect``, the request is:
ru: Чтобы закрыть сессию, которую открыли с помощью ``pg.connect``, используется следующий запрос:

source: For further information, including examples of rarely-used requests, see the README.md file at `github.com/tarantool/pg`_.
ru: Для получения дополнительной информации, включая примеры редко используемых запросов, см. файл README.md по ссылке `github.com/tarantool/pg`_.

source: The example was run on an Ubuntu 12.04 ("precise") machine where tarantool had been installed in a /usr subdirectory, and a copy of PostgreSQL had been installed on /usr. The PostgreSQL server instance is already running on the local host 127.0.0.1.
ru: Пример выполняется на машине с ОС Ubuntu 12.04 (Precise Pangolin), где Tarantool установлен в поддиректорию /usr, а копия PostgreSQL установлена в /usr. Экземпляр сервера PostgreSQL уже запущен на localhost 127.0.0.1.

source: $ # Check that the include subdirectory exists $ # by looking for /usr/include/postgresql/libpq-fe-h. $ [ -f /usr/include/postgresql/libpq-fe.h ] && echo "OK" || echo "Error" OK $ # Check that the library subdirectory exists and has the necessary .so file. $ [ -f /usr/lib/x86_64-linux-gnu/libpq.so ] && echo "OK" || echo "Error" OK $ # Check that the psql client can connect using some factory defaults: $ # port = 5432, user = 'postgres', user password = 'postgres', $ # database = 'postgres'. These can be changed, provided one changes $ # them in all places. Insert a row in database postgres, and quit. $ psql -h 127.0.0.1 -p 5432 -U postgres -d postgres Password for user postgres: psql (9.3.10) SSL connection (cipher: DHE-RSA-AES256-SHA, bits: 256) Type "help" for help. postgres=# CREATE TABLE test (s1 INT, s2 VARCHAR(50)); CREATE TABLE postgres=# INSERT INTO test VALUES (1,'PostgreSQL row'); INSERT 0 1 postgres=# \q $ $ # Install luarocks $ sudo apt-get -y install luarocks | grep -E "Setting up|already" Setting up luarocks (2.0.8-2) ... $ # Set up the Tarantool rock list in ~/.luarocks, $ # following instructions at rocks.tarantool.org $ mkdir ~/.luarocks $ echo "rocks_servers = {[[http://rocks.tarantool.org/]]}" >> \ ~/.luarocks/config.lua $ # Ensure that the next "install" will get files from Tarantool master $ # repository. The resultant display is normal for Ubuntu 12.04 precise $ cat /etc/apt/sources.list.d/tarantool.list deb http://tarantool.org/dist/1.7/ubuntu/ precise main deb-src http://tarantool.org/dist/1.7/ubuntu/ precise main $ # Install tarantool-dev. The displayed line should show version = 1.7 $ sudo apt-get -y install tarantool-dev | grep -E "Setting up|already" Setting up tarantool-dev (1.7.0.222.g48b98bb~precise-1) ... $ $ # Use luarocks to install locally, that is, relative to $HOME $ luarocks install pg POSTGRESQL_LIBDIR=/usr/lib/x86_64-linux-gnu --local Installing http://rocks.tarantool.org/pg-scm-1.rockspec... ... (more info about building the Tarantool/PostgreSQL driver appears here) pg scm-1 is now built and installed in ~/.luarocks/ $ # Ensure driver.so now has been created in a place $ # tarantool will look at $ find ~/.luarocks -name "driver.so" ~/.luarocks/lib/lua/5.1/pg/driver.so $ # Change directory to a directory which can be used for $ # temporary tests. For this example we assume that the $ # name of this directory is $HOME/tarantool_sandbox. $ # (Change "$HOME" to whatever is the user's actual $ # home directory for the machine that's used for this test.) cd $HOME/tarantool_sandbox $ # Start the Tarantool server instance. Do not use a Lua initialization file. $ tarantool tarantool: version 1.7.0-412-g803b15c type 'help' for interactive help tarantool>
ru: $ # Проверьте, что создана поддиректория include, путем поиска $ # /usr/include/postgresql/libpq-fe-h. $ [ -f /usr/include/postgresql/libpq-fe.h ] && echo "OK" || echo "Error" OK $ # Проверьте, что создана поддиректория library, а в ней необходимый файл .so. $ [ -f /usr/lib/x86_64-linux-gnu/libpq.so ] && echo "OK" || echo "Error" OK $ # Проверьте, что psql-клиент может подключиться, с помощью настроек по умолчанию: $ # порт = 5432, пользователь = 'postgres', пароль пользователя = 'postgres', $ # база данных = 'postgres'. Эти настройки можно изменить, используя $ # измененные значения. Вставьте строку в базу данных postgres и завершите работу. $ psql -h 127.0.0.1 -p 5432 -U postgres -d postgres Password for user postgres: psql (9.3.10) SSL connection (cipher: DHE-RSA-AES256-SHA, bits: 256) Type "help" for help. postgres=# CREATE TABLE test (s1 INT, s2 VARCHAR(50)); CREATE TABLE postgres=# INSERT INTO test VALUES (1,'PostgreSQL row'); INSERT 0 1 postgres=# \q $ $ # Установите luarocks $ sudo apt-get -y install luarocks | grep -E "Setting up|already" Setting up luarocks (2.0.8-2) ... $ # Настройте список сторонних модулей Tarantool'а в ~/.luarocks, $ # следуя инструкциям по ссылке rocks.tarantool.org $ mkdir ~/.luarocks $ echo "rocks_servers = {[[http://rocks.tarantool.org/]]}" >> \ ~/.luarocks/config.lua $ # Убедитесь, что при следующей установке будут использованы файлы из главного $ # хранилища Tarantool'а. Получаем результат, нормальный для Ubuntu 12.04 Precise Pangolin $ cat /etc/apt/sources.list.d/tarantool.list deb http://tarantool.org/dist/1.7/ubuntu/ precise main deb-src http://tarantool.org/dist/1.7/ubuntu/ precise main $ # Установите tarantool-dev. Строка на экране должна показать версию 1.7 $ sudo apt-get -y install tarantool-dev | grep -E "Setting up|already" Setting up tarantool-dev (1.7.0.222.g48b98bb~precise-1) ... $ $ # Используйте luarocks для локальной установки, то есть в $HOME $ luarocks install pg POSTGRESQL_LIBDIR=/usr/lib/x86_64-linux-gnu --local Installing http://rocks.tarantool.org/pg-scm-1.rockspec... ... (здесь будет еще информация о сборке драйвера Tarantool/PostgreSQL) pg scm-1 is now built and installed in ~/.luarocks/ $ # Убедитесь, что driver.so создан в месте, $ # где Tarantool будет искать его $ find ~/.luarocks -name "driver.so" ~/.luarocks/lib/lua/5.1/pg/driver.so $ # Измените директорию на директорию, которую можно использовать для $ # временного тестирования. В данном примере предполагаем, что имя $ # name этой директории будет $HOME/tarantool_sandbox. $ # (Измените "$HOME" на фактическую корневую директорию $ # машины, используемой для тестирования.) cd $HOME/tarantool_sandbox $ # Запустите экземпляр Tarantool-сервера. Не используйте файл инициализации Lua. $ tarantool tarantool: version 1.7.0-412-g803b15c type 'help' for interactive help tarantool>

source: Configure tarantool and load pg module. Make sure that tarantool doesn't reply "error" for the call to "require()".
ru: Настройте Tarantool и загрузите модуль pg. Убедитесь, что Tarantool не выбрасывает ошибку в ответ на вызов "require()".

source: Create a Lua function that will connect to a PostgreSQL server, (using some factory default values for the port and user and password), retrieve one row, and display the row. For explanations of the statement types used here, read the Lua tutorial earlier in the Tarantool user manual.
ru: Создайте Lua-функцию, которая подключится к PostgreSQL-серверу (используя значения по умолчанию для параметров порта, пользователя и пароля), выберите одну строку и выведите ее на экран. Описание используемых здесь типов операторов вы можете найти в практикуме по Lua в руководстве пользователя Tarantool'а.

source: Observe the result. It contains "PostgreSQL row". So this is the row that was inserted into the PostgreSQL database. And now it's been selected with the Tarantool client.
ru: Просмотрите результат. В нем есть строка "PostgreSQL row". Это и есть строка, которая была вставлена в базу данных PostgreSQL. А сейчас она выделена с помощью Tarantool-клиента.

source: Module `expirationd`
ru: Модуль `expirationd`

source: For a commercial-grade example of a Lua rock that works with Tarantool, let us look at expirationd, which Tarantool supplies on GitHub_ with an Artistic license. The expirationd.lua program is lengthy (about 500 lines), so here we will only highlight the matters that will be enhanced by studying the full source later.
ru: Рассмотрим expirationd -- пример Lua-модуля для промышленной эксплуатации, который работает с Tarantool'ом -- Tarantool предоставляет его с лицензией Artistic на GitHub_. Программа expirationd.lua довольно объемная (около 500 строк), поэтому здесь мы остановимся на пунктах, знания о которых можно расширить, позднее изучив программу полностью.

source: Whenever one hears "daemon" in Tarantool, one should suspect it's being done with a :doc:`fiber<../reference_lua/fiber>`. The program is making a fiber and turning control over to it so it runs occasionally, goes to sleep, then comes back for more.
ru: Если в Tarantool'е упоминается "демон", то речь идет об использовании :doc:`файбера <../reference_lua/fiber>`. Программа создает файбер и передает управление так, что он периодически запускается, уходит в режим ожидания, а затем повторяет эти действия.

source: The "for" instruction can be translated as "iterate through the index of the space that is being scanned", and within it, if the tuple is "expired" (for example, if the tuple has a timestamp field which is less than the current time), process the tuple as an expired tuple.
ru: Команду "for" можно перевести как "выполнить итерацию по индексу сканируемого спейса", а внутри -- если кортеж "неактуален" (например, если в кортеже есть поле метки времени, которое меньше текущего времени), то обработать кортеж как неактуальный кортеж.

source: -- default process_expired_tuple function local function default_tuple_drop(space_id, args, tuple) local key = fun.map( function(x) return tuple[x.fieldno] end, box.space[space_id].index[0].parts ):totable() box.space[space_id]:delete(key) end
ru: -- функция обработки неактуального кортежа local function default_tuple_drop(space_id, args, tuple) local key = fun.map( function(x) return tuple[x.fieldno] end, box.space[space_id].index[0].parts ):totable() box.space[space_id]:delete(key) end

source: Ultimately the tuple-expiry process leads to ``default_tuple_drop()`` which does a "delete" of a tuple from its original space. First the fun :ref:`fun <fun-module>` module is used, specifically fun.map_. Remembering that :codenormal:`index[0]` is always the space's primary key, and :codenormal:`index[0].parts[`:codeitalic:`N`:codenormal:`].fieldno` is always the field number for key part :codeitalic:`N`, fun.map() is creating a table from the primary-key values of the tuple. The result of fun.map() is passed to :ref:`space_object:delete() <box_space-delete>`.
ru: В конечном итоге, обработка неактуального кортежа приводит к ``default_tuple_drop()``, что приводит к удалению кортежа из первоначального спейса. Сначала используется модуль :ref:`fun <fun-module>`, в частности fun.map_. Учитывая, что :codenormal:`index[0]` всегда является первичным ключом спейса, а :codenormal:`index[0].parts[`:codeitalic:`N`:codenormal:`].fieldno` всегда является номером поля для компонента ключа :codeitalic:`N`, функция fun.map() создает таблицу из первичных значений кортежа. Результат fun.map() передается в :ref:`space_object:delete() <box_space-delete>`.
