Repository: tarantool/doc
Catalog: locale/*/LC_MESSAGES/doc.po
Languages: ru

source: Suppose that a digest is done for a string 'A', then a new part 'B' is appended to the string, then a new digest is required. The new digest could be recomputed for the whole string 'AB', but it is faster to take what was computed before for 'A' and apply changes based on the new part 'B'. This is called multi-step or "incremental" digesting, which Tarantool supports with crc32 and with murmur...
ru: Предположим, что вычислен дайджест для строки 'A', затем часть 'B' добавляется в строку, необходим новый дайджест. Новый дайджест можно пересчитать для всей строки 'AB', но быстрее будет взять вычисленный дайджест для 'A' и внести изменения на основании добавленной части 'B'. Это называется многошаговым процессом или "инкрементным" хеш-суммированием, которое поддерживает Tarantool поддерживает для crc32 и murmur...

source: digest = require('digest') -- print crc32 of 'AB', with one step, then incrementally print(digest.crc32('AB')) c = digest.crc32.new() c:update('A') c:update('B') print(c:result()) -- print murmur hash of 'AB', with one step, then incrementally print(digest.murmur('AB')) m = digest.murmur.new() m:update('A') m:update('B') print(m:result())
ru: digest = require('digest') -- вывести дайджест 'AB' по crc32 пошагово, затем с инкрементом print(digest.crc32('AB')) c = digest.crc32.new() c:update('A') c:update('B') print(c:result()) -- вывести дайджест 'AB' по murmur hash пошагово, затем с инкрементом print(digest.murmur('AB')) m = digest.murmur.new() m:update('A') m:update('B') print(m:result())

source: In the following example, the user creates two functions, ``password_insert()`` which inserts a SHA-1_ digest of the word "**^S^e^c^ret Wordpass**" into a tuple set, and ``password_check()`` which requires input of a password.
ru: В следующем примере пользователь создает две функции: функцию ``password_insert()``, которая вставляет дайджест слова "**^S^e^c^ret Wordpass**" по SHA-1_ в набор кортежей, и функцию ``password_check()``, которая требует ввод пароля.

source: If a later user calls the ``password_check()`` function and enters the wrong password, the result is an error.
ru: Если затем пользователь вызовет функцию ``password_check()`` и вводит неверный пароль, результатом будет ошибка.

source: Database error codes
ru: Коды ошибок базы данных

source: In the current version of the binary protocol, error messages, which are normally more descriptive than error codes, are not present in server responses. The actual message may contain a file name, a detailed reason or operating system error code. All such messages, however, are logged in the error log. Below are general descriptions of some popular codes. A complete list of errors can be found in file `errcode.h`_ in the source tree.
ru: В текущей версии бинарного протокола в ответы сервера не включены сообщения об ошибках, которые как правило, содержат больше информации, чем коды ошибок. Само сообщение может содержать имя файла, подробное описание причины или код ошибки операционной системы. Однако все такие сообщения регистрируются в журнале ошибок. Ниже приведены общие описания некоторых распространенных кодов. Полный список ошибок можно найти в файле `errcode.h`_ в исходном дереве.

source: **List of error codes**
ru: **Список кодов ошибок**

source: (In replication) A server instance cannot modify data unless it is a master.
ru: (Репликация) Экземпляр сервера не может вносить изменения в данные, если он не является мастером.

source: Illegal parameters. Malformed protocol message.
ru: Недопустимые параметры. Некорректное протокольное сообщение.

source: Out of memory: :ref:`memtx_memory <cfg_storage-memtx_memory>` limit has been reached.
ru: Нехватка оперативной памяти: достижение предела памяти :ref:`memtx_memory <cfg_storage-memtx_memory>`.

source: Failed to write to disk. May mean: failed to record a change in the write-ahead log. Some sort of disk error.
ru: Запись на диск не удалась. Может означать, что не удалось записать изменение в журнале упреждающей записи. Некоторая ошибка на диске.

source: Key part count is not the same as index part count
ru: Количество частей ключа не совпадает с количеством частей индекса

source: The specified space does not exist.
ru: Указанный спейс отсутствует.

source: The specified index in the specified space does not exist.
ru: Указанного индекса нет в указанном спейсе.

source: An error occurred inside a Lua procedure.
ru: Возникла ошибке в Lua-процедуре.

source: The recursion limit was reached when creating a new fiber. This usually indicates that a stored procedure is recursively invoking itself too often.
ru: При создании нового файбера был достигнут предел рекурсии. Обычно это указывает на то, что хранимая процедура слишком часто рекурсивно вызывает себя.

source: An error occurred during update of a field.
ru: Возникла ошибка во время обновления поля.

source: A duplicate key exists in a unique index.
ru: В уникальном индексе есть повторяющийся ключ.

source: Handling errors
ru: Обработка ошибок

source: Here are some procedures that can make Lua functions more robust when there are errors, particularly database errors.
ru: Ниже представлены несколько процедур для более надежного вызова Lua-функций в случае ошибок, в частности, ошибок базы данных.

source: Invoke with pcall.
ru: Вызов с помощью pcall.

source: Take advantage of Lua's mechanisms for `"Error handling and exceptions" <http://www.lua.org/pil/8.4.html>`_, particularly ``pcall``. That is, instead of simply invoking with
ru: Используйте механизмы Lua для `"Обработки ошибок и исключений" <http://www.lua.org/pil/8.4.html>`_, в частности ``pcall``. То есть вместо простого вызова функции с помощью

source: :samp:`box.space.{space-name}:{function-name}()`
ru: :samp:`box.space.{имя-спейса}:{имя-функции}()`

source: say
ru: выполните

source: :samp:`if pcall(box.space.{space-name}.{function-name}, box.space.{space-name}) ...`
ru: :samp:`if pcall(box.space.{имя-спейса}.{имя-функции}, box.space.{имя-спейса}) ...`

source: For some Tarantool box functions, pcall also returns error details including a file-name and line-number within Tarantool's source code. This can be seen by unpacking. For example:
ru: Для некоторых функций модуля box в Tarantool'е pcall также вернет описание ошибки, включая имя файла и номер строки в исходном коде Tarantool'а. Например:

source: See the tutorial :ref:`Sum a JSON field for all tuples <c_lua_tutorial-sum_a_json_field>` to see how pcall can fit in an application.
ru: Чтобы увидеть применение pcall в приложении, см. практическое задание :ref:`Подсчет суммы по JSON-полям во всех кортежах <c_lua_tutorial-sum_a_json_field>`.

source: Examine and raise with box.error.
ru: Проверка и вызов ошибки с помощью box.error.

source: To make a new error and pass it on, the box.error module provides :ref:`box.error(code, errtext [, errtext ...]) <box_error-error>`.
ru: В модуле box.error предусмотрена функция :ref:`box.error(code, errtext [, errtext ...]) <box_error-error>`, чтобы создать ошибку и передать ее.

source: To find the last error, the box.error module provides :ref:`box.error.last() <box_error-last>`. (There is also a way to find the text of the last operating-system error for certain functions -- :ref:`errno.strerror([code]) <errno-strerror>`.)
ru: Чтобы найти последнюю ошибку, в модуле box.error предусмотрена функция :ref:`box.error.last() <box_error-last>`. (Также можно найти текст последней ошибки операционной системы для определенной функции -- :ref:`errno.strerror([code]) <errno-strerror>`.)

source: Log.
ru: Запись в журнал.

source: Put messages in a log using the :ref:`log module <log-module>`.
ru: Записывайте сообщения в журнал с помощью :ref:`модуля log <log-module>`.

source: And filter messages that are automatically generated, with the :ref:`log <cfg_logging-log>` configuration parameter.
ru: И отфильтровывайте автоматически созданные сообщения с помощью конфигурационного параметра :ref:`log <cfg_logging-log>`.

source: Generally, for Tarantool built-in functions which are designed to return objects: the result will be an object, or nil, or `a Lua error <https://www.lua.org/pil/8.3.html>`_. For example consider the :ref:`fio_read.lua <cookbook-fio_read>` program in our cookbook:
ru: Как правило, встроенные функции Tarantool'а, которые предназначены для возврата объектов, вернут либо объект, либо нулевое значение nil, либо `Lua-ошибку <https://www.lua.org/pil/8.3.html>`_. Например, рассмотрим программу :ref:`fio_read.lua <cookbook-fio_read>` из рекомендаций по разработке:

source: After a function call that might fail, like fio.open() above, it is common to see syntax like ``if not f then ...`` or ``if f == nil then ...``, which check for common failures. But if there had been a syntax error, for example fio.opex instead of fio.open, then there would have been a Lua error and f would not have been changed. If checking for such an obvious error had been a concern, the programmer would probably have used pcall().
ru: После вызова функции, который может не сработать, как fio.open() выше, обычно можно увидеть такой синтаксис, как ``if not f then ...`` или ``if f == nil then ...``, который проверяет на типичные отказы. Но если есть ошибка синтаксиса, например, fio.opex вместо fio.open, то появится Lua-ошибка, и f не изменится. Если речь идет о проверке таких очевидных ошибок, программист вероятно будет использовать pcall().

source: All functions in Tarantool modules should work this way, unless the manual explicitly says otherwise.
ru: Все функции в модулях Tarantool'а должны работать таким образом, если в руководстве явно не говорится об обратном.

source: Module `errno`
ru: Модуль `errno`

source: The ``errno`` module is typically used within a function or within a Lua program, in association with a module whose functions can return operating-system errors, such as :ref:`fio <fio-module>`.
ru: Модуль ``errno``, как правило, используется внутри функции или в рамках Lua-программы совместно с модулем, функции которого могут возвращать ошибки ОС, например :ref:`fio <fio-module>`.

source: Below is a list of all ``errno`` functions.
ru: Ниже приведен перечень всех функций модуля ``errno``.

source: Get an error number for the last OS-related function
ru: Получение номера ошибки для последней функции, связанной с ОС

source: Get an error message for the corresponding error number
ru: Получение сообщения об ошибке для соответствующего номера ошибки

source: Return an error number for the last operating-system-related function, or 0. To invoke it, simply say ``errno()``, without the module name.
ru: Возврат номера ошибки для последней функции, связанной с операционной системой, или 0. Чтобы вызвать функцию, просто введите команду ``errno()`` без названия модуля.

source: Return a string, given an error number. The string will contain the text of the conventional error message for the current operating system. If ``code`` is not supplied, the error message will be for the last operating-system-related function, or 0.
ru: Возврат строки в ответ на номер ошибки. Строка будет содержать текст традиционного сообщения об ошибке для текущей операционной системы. Если не указан код ``code``, то будет выведено сообщение об ошибке для последней функции, связанной с операционной системой, или 0.

source: number of an operating-system error
ru: номер ошибки в операционной системе

source: This function displays the result of a call to :ref:`fio.open() <fio-open>` which causes error 2 (``errno.ENOENT``). The display includes the error number, the associated error string, and the error name.
ru: Данная функция отображает результат вызова :ref:`fio.open() <fio-open>`, который вызывает ошибку 2 (``errno.ENOENT``). В результат включен номер ошибки, связанная с ним строка сообщения об ошибке и название ошибки.

source: To see all possible error names stored in the ``errno`` metatable, say ``getmetatable(errno)`` (output abridged):
ru: Чтобы увидеть все возможные названия ошибок, которые хранятся в метатаблице ``errno``, введите команду ``getmetatable(errno)`` (выводятся сокращенно):

source: With the ``fiber`` module, you can:
ru: С помощью модуля ``fiber`` можно:

source: create, run and manage :ref:`fibers <fiber-fibers>`,
ru: создавать, запускать и управлять :ref:`файберами <fiber-fibers>`,

source: send and receive messages between different processes (i.e. different connections, sessions, or fibers) via :ref:`channels <fiber_ipc-channel>`, and
ru: отправлять и получать сообщения для различных процессов (например, разные соединения, сессии или файберы) по :ref:`каналам <fiber_ipc-channel>`, а также

source: use a :ref:`synchronization mechanism <fiber_ipc-cond_var>` for fibers, similar to "condition variables" and similar to operating-system functions such as ``pthread_cond_wait()`` plus ``pthread_cond_signal()``.
ru: использовать :ref:`механизм синхронизации <fiber_ipc-cond_var>` для файберов, аналогично работе "условных переменных" и функций операционных систем, таких как ``pthread_cond_wait()`` плюс ``pthread_cond_signal()``.

source: Below is a list of all ``fiber`` functions and members.
ru: Ниже приведен перечень всех функций и элементов модуля ``fiber``.

source: Create and start a fiber
ru: Создание и запуск файбера

source: Get a fiber object
ru: Получение объекта файбера

source: Get a fiber object by ID
ru: Получение объекта файбера по ID

source: Make a fiber go to sleep
ru: Перевод файбера в режим ожидания

source: Yield control
ru: Передача управления

source: Get the current fiber's status
ru: Получение статуса активного файбера

source: Get information about all fibers
ru: Получение информации о всех файберах

source: Cancel a fiber
ru: Отмена файбера

source: Check if the current fiber has been cancelled
ru: Проверка отмены действующего файбера

source: Get a fiber's ID
ru: Получение ID файбера

source: Get a fiber's name
ru: Получение имени файбера

source: Set a fiber's name
ru: Назначение имени файбера

source: Get a fiber's status
ru: Получение статуса файбера

source: Local storage within the fiber
ru: Локальное хранилище в пределах файбера

source: Get the system time in seconds
ru: Получение системного времени в секундах

source: Get the system time in microseconds
ru: Получение системного времени в микросекундах

source: Create a communication channel
ru: Создание канала связи

source: Send a message via a channel
ru: Отправка сообщения по каналу связи

source: Close a channel
ru: Закрытие канала

source: Fetch a message from a channel
ru: Перехват сообщения из канала

source: Check if a channel is empty
ru: Проверка пустоты канала

source: Count messages in a channel
ru: Подсчет сообщений в канале

source: Check if a channel is full
ru: Проверка заполненности канала

source: Check if an empty channel has any readers waiting
ru: Проверка пустого канала на наличие читателей в состоянии ожидания

source: Check if a full channel has any writers waiting
ru: Проверка полного канала на наличие писателей в состоянии ожидания

source: Check if a channel is closed
ru: Проверка закрытия канала

source: Create a condition variable
ru: Создание условной переменной

source: Make a fiber go to sleep until woken by another fiber
ru: Перевод файбера в режим ожидания до пробуждения другим файбером

source: Wake up a single fiber
ru: Пробуждение отдельного файбера

source: Wake up all fibers
ru: Пробуждение всех файберов

source: A **fiber** is a set of instructions which are executed with cooperative multitasking. Fibers managed by the fiber module are associated with a user-supplied function called the *fiber function*.
ru: **Файбер** -- это набор инструкций, которые выполняются по принципу кооперативной многозадачности. Файберы, управление которых происходит с помощью модуля fiber, связаны с функцией под названием *функция для файбера*, которую задает пользователь.

source: All fibers are part of the fiber registry. This registry can be searched with :ref:`fiber.find() <fiber-find>` - via fiber id (fid), which is a numeric identifier.
ru: Все файберы составляют часть реестра файберов. Можно производить поиск по реестру с помощью :ref:`fiber.find() <fiber-find>` по ID файбера (fid), который представляет собой числовой идентификатор.

source: A runaway fiber can be stopped with :ref:`fiber_object.cancel <fiber_object-cancel>`. However, :ref:`fiber_object.cancel <fiber_object-cancel>` is advisory — it works only if the runaway fiber calls :ref:`fiber.testcancel() <fiber-testcancel>` occasionally. Most ``box.*`` functions, such as :ref:`box.space...delete() <box_space-delete>` or :ref:`box.space...update() <box_space-update>`, do call :ref:`fiber.testcancel() <fiber-testcancel>` but :ref:`box.space...select{} <box_space-select>` does not. In practice, a runaway fiber can only become unresponsive if it does many computations and does not check whether it has been cancelled.
ru: Неконтролируемый файбер можно остановить с помощью :ref:`fiber_object.cancel <fiber_object-cancel>`. Однако, функция :ref:`fiber_object.cancel <fiber_object-cancel>` консультативна, то есть сработает только в том случае, если неконтролируемый файбер случайно вызовет :ref:`fiber.testcancel() <fiber-testcancel>`. Большинство функций типа ``box.*``, например :ref:`box.space...delete() <box_space-delete>` или :ref:`box.space...update() <box_space-update>`, действительно вызывают :ref:`fiber.testcancel() <fiber-testcancel>`, а :ref:`box.space...select{} <box_space-select>` не вызовет. В действительности неконтролируемый файбер может перестать отвечать, если он производит большое количество вычислений и не проверяет вероятность отмены.

source: The other potential problem comes from fibers which never get scheduled, because they are not subscribed to any events, or because no relevant events occur. Such morphing fibers can be killed with :ref:`fiber.kill() <fiber-kill>` at any time, since :ref:`fiber.kill() <fiber-kill>` sends an asynchronous wakeup event to the fiber, and :ref:`fiber.testcancel() <fiber-testcancel>` is checked whenever such a wakeup event occurs.
ru: Другой потенциальной проблемой могут стать файберы, которые не включаются в расписание, поскольку они не подписаны ни на какие события, или потому что соответствующие события не происходят. Такие файберы можно в любое принудительно остановить с помощью :ref:`fiber.kill() <fiber-kill>`, потому что функция :ref:`fiber.kill() <fiber-kill>` отправляет асинхронное событие пробуждения на файбер, а :ref:`fiber.testcancel() <fiber-testcancel>` проверяет наступление такого события пробуждения.

source: A fiber has all the features of a Lua coroutine_ and all the programming concepts that apply for Lua coroutines will apply for fibers as well. However, Tarantool has made some enhancements for fibers and has used fibers internally. So, although use of coroutines is possible and supported, use of fibers is recommended.
ru: У файбера есть все возможности сопрограммы (coroutine_) на языке Lua, и все принципы программирования, которые применяются к сопрограммам на Lua, применимы и к файберам. Однако Tarantool расширил возможности файберов для внутреннего использования. Поэтому, несмотря на возможность и поддержку использования сопрограмм, рекомендуется использовать файберы.

source: Create and start a fiber. The fiber is created and begins to run immediately.
ru: Создание и запуск файбера. Происходит создание файбера, который незамедлительно начинает работу.

source: the function to be associated with the fiber
ru: функция, которая будет связана с файбером

source: Return
ru: Возвращается

source: created fiber object
ru: созданный объект файбера

source: Rtype
ru: Тип возвращаемого значения

source: fiber object for the currently scheduled fiber.
ru: объект файбера для запланированного на данный момент файбера.

source: numeric identifier of the fiber.
ru: числовой идентификатор файбера.

source: fiber object for the specified fiber.
ru: объект файбера для указанного файбера.

source: Yield control to the scheduler and sleep for the specified number of seconds. Only the current fiber can be made to sleep.
ru: Передача управления планировщику и переход в режим ожидания на указанное количество секунд. Только текущий файбер можно перевести в режим ожидания.

source: number of seconds to sleep.
ru: количество секунд в режиме ожидания.

source: Yield control to the scheduler. Equivalent to :ref:`fiber.sleep(0) <fiber-sleep>`, except that `fiber.sleep(0)` depends on a timer, `fiber.yield()` does not.
ru: Передача управления планировщику. Работает аналогично :ref:`fiber.sleep(0) <fiber-sleep>`, только `fiber.sleep(0)` зависит от таймера, `fiber.yield()` -- нет.

source: the status of ``fiber``. One of: “dead”, “suspended”, or “running”.
ru: статус файбера: “dead” (недоступен), “suspended” (приостановлен) или “running” (активен).

source: Return information about all fibers.
ru: Возврат информации о всех файберах.

source: number of context switches, backtrace, id, total memory, used memory, name for each fiber.
ru: количество переключений контекста, обратная трассировка, ID, общий объем памяти, объем используемой памяти, имя каждого файбера.

source: Locate a fiber by its numeric id and cancel it. In other words, :ref:`fiber.kill() <fiber-kill>` combines :ref:`fiber.find() <fiber-find>` and :ref:`fiber_object:cancel() <fiber_object-cancel>`.
ru: Поиск файбера по числовому идентификатору и его отмена. Другими словами, :ref:`fiber.kill() <fiber-kill>` объединяет в себе :ref:`fiber.find() <fiber-find>` и :ref:`fiber_object:cancel() <fiber_object-cancel>`.

source: the id of the fiber to be cancelled.
ru: ID файбера для отмены.

source: Exception
ru: Исключение

source: the specified fiber does not exist or cancel is not permitted.
ru: указанный файбер отсутствует, или отмена невозможна.

source: tarantool> fiber.kill(fiber.id()) -- kill self, may make program end --- - error: fiber is cancelled ...
ru: tarantool> fiber.kill(fiber.id()) -- функция с self может вызвать окончание программы --- - error: fiber is cancelled ...

source: Check if the current fiber has been cancelled and throw an exception if this is the case.
ru: Проверка отмены действующего файбера и выдача исключения, если файбер отменен.

source: id of the fiber.
ru: ID файбера.

source: name of the fiber.
ru: имя файбера.

source: Change the fiber name. By default a Tarantool server's interactive-mode fiber is named 'interactive' and new fibers created due to :ref:`fiber.create <fiber-create>` are named 'lua'. Giving fibers distinct names makes it easier to distinguish them when using :ref:`fiber.info <fiber-info>`.
ru: Изменение имени файбера. По умолчанию, файбер в интерактивном режиме экземпляра Tarantool'а называется 'interactive', а новые файберы, созданные с помощью :ref:`fiber.create <fiber-create>`, называются 'lua'. Переименование файберов позволяет легче различать их при использовании :ref:`fiber.info <fiber-info>`.

source: the new name of the fiber.
ru: новое имя файбера.

source: Return the status of the specified fiber.
ru: Возврат статуса указанного файбера.

source: the status of fiber. One of: “dead”, “suspended”, or “running”.
ru: статус файбера: “dead” (недоступен), “suspended” (приостановлен) или “running” (активен).

source: Cancel a fiber. Running and suspended fibers can be cancelled. After a fiber has been cancelled, attempts to operate on it will cause errors, for example :ref:`fiber_object:id() <fiber_object-id>` will cause ``error: the fiber is dead``.
ru: Отмена файбера. Активные и приостановленные файберы можно отменить. После отмены файбера попытки работать с ним вызовут ошибку, например, вызов :ref:`fiber_object:id() <fiber_object-id>` вызовет ошибку с указанием недоступности файбера ``error: the fiber is dead``.

source: Possible errors: cancel is not permitted for the specified fiber object.
ru: Возможные ошибки: нельзя отменить указанный объект файбера.
