Repository: tarantool/doc
Catalog: locale/*/LC_MESSAGES/doc.po
Languages: ru

source: Tarantool displays a prompt (e.g. "tarantool>") and you can enter requests. When used this way, Tarantool can be a client for a remote server. See basic examples in :ref:`Getting started <getting_started>`.
ru: Tarantool выводит приглашение командной строки (например, "tarantool>") -- и вы можете посылать запросы. Если использовать Tarantool таким образом, он может выступать клиентом для удаленного сервера, см. простые примеры в :ref:`Руководстве для начинающих <getting_started>`.

source: The interactive mode is used by ``tarantoolctl`` to implement "enter" and "connect" commands.
ru: Скрипт ``tarantoolctl`` использует интерактивный режим для реализации команд "enter" и "connect".

source: Executing code on an instance
ru: Выполнение кода на экземпляре Tarantool'а

source: You can attach to an instance's :ref:`admin console <admin-security>` and execute some Lua code using ``tarantoolctl``:
ru: Можно подключиться к :ref:`административной консоли <admin-security>` экземпляра и выполнить некий Lua-код с помощью утилиты ``tarantoolctl``:

source: $ # for local instances: $ tarantoolctl enter my_app /bin/tarantoolctl: Found my_app.lua in /etc/tarantool/instances.available /bin/tarantoolctl: Connecting to /var/run/tarantool/my_app.control /bin/tarantoolctl: connected to unix/:/var/run/tarantool/my_app.control unix/:/var/run/tarantool/my_app.control> 1 + 1 --- - 2 ... unix/:/var/run/tarantool/my_app.control> $ # for local and remote instances: $ tarantoolctl connect username:password@127.0.0.1:3306
ru: $ # для локальных экземпляров: $ tarantoolctl enter my_app /bin/tarantoolctl: Found my_app.lua in /etc/tarantool/instances.available /bin/tarantoolctl: Connecting to /var/run/tarantool/my_app.control /bin/tarantoolctl: connected to unix/:/var/run/tarantool/my_app.control unix/:/var/run/tarantool/my_app.control> 1 + 1 --- - 2 ... unix/:/var/run/tarantool/my_app.control> $ # для локальных и удаленных экземпляров: $ tarantoolctl connect username:password@127.0.0.1:3306

source: You can also use ``tarantoolctl`` to execute Lua code on an instance without attaching to its admin console. For example:
ru: Можно также использовать ``tarantoolctl`` для выполнения Lua-кода на запущенном экземпляре Tarantool-сервера, не подключаясь к его административной консоли. Например:

source: $ # executing commands directly from the command line $ <command> | tarantoolctl eval my_app <...> $ # - OR - $ # executing commands from a script file $ tarantoolctl eval my_app script.lua <...>
ru: $ # выполнение команд напрямую из командной строки $ <command> | tarantoolctl eval my_app <...> $ # - ИЛИ - $ # выполнение команд из скрипта $ tarantoolctl eval my_app script.lua <...>

source: Alternatively, you can use the :ref:`console <console-module>` module or the :ref:`net.box <net_box-module>` module from a Tarantool server. Also, you can write your client programs with any of the :ref:`connectors <index-box_connectors>`. However, most of the examples in this manual illustrate usage with either ``tarantoolctl connect`` or :ref:`using the Tarantool server as a client <admin-using_tarantool_as_a_client>`.
ru: Еще можно использовать модули :ref:`console <console-module>` и :ref:`net.box <net_box-module>` из Tarantool-сервера. Также вы можете писать свои клиентские программы с использованием любого из доступных :ref:`коннекторов <index-box_connectors>`. Однако большинство примеров в данном документе использует или ``tarantoolctl connect``, или :ref:`Tarantool-сервер как клиент <admin-using_tarantool_as_a_client>`.

source: Health checks
ru: Проверка состояния экземпляра

source: To check the instance status, say:
ru: Чтобы проверить статус экземпляра Tarantool-сервера, выполните команду:

source: $ tarantoolctl status my_app my_app is running (pid: /var/run/tarantool/my_app.pid) $ # - OR - $ systemctl status tarantool@my_app tarantool@my_app.service - Tarantool Database Server Loaded: loaded (/etc/systemd/system/tarantool@.service; disabled; vendor preset: disabled) Active: active (running) Docs: man:tarantool(1) Process: 5346 ExecStart=/usr/bin/tarantoolctl start %I (code=exited, status=0/SUCCESS) Main PID: 5350 (tarantool) Tasks: 11 (limit: 512) CGroup: /system.slice/system-tarantool.slice/tarantool@my_app.service + 5350 tarantool my_app.lua <running>
ru: $ tarantoolctl status my_app my_app is running (pid: /var/run/tarantool/my_app.pid) $ # - ИЛИ - $ systemctl status tarantool@my_app tarantool@my_app.service - Tarantool Database Server Loaded: loaded (/etc/systemd/system/tarantool@.service; disabled; vendor preset: disabled) Active: active (running) Docs: man:tarantool(1) Process: 5346 ExecStart=/usr/bin/tarantoolctl start %I (code=exited, status=0/SUCCESS) Main PID: 5350 (tarantool) Tasks: 11 (limit: 512) CGroup: /system.slice/system-tarantool.slice/tarantool@my_app.service + 5350 tarantool my_app.lua <running>

source: To check the boot log, on systems with ``systemd``, say:
ru: Если вы используете систему, на которой доступна утилита ``systemd``, выполните следующую команду для проверки содержимого журнала загрузки:

source: For more details, use the reports provided by functions in the following submodules:
ru: Более подробная информация содержится в отчетах, которые можно получить с помощью функций из следующих подмодулей:

source: :ref:`box.cfg <box_introspection-box_cfg>` submodule (check and specify all configuration parameters for the Tarantool server)
ru: :ref:`box.cfg <box_introspection-box_cfg>` -- проверка и указание всех конфигурационных параметров Tarantool-сервера,

source: :ref:`box.slab <box_introspection-box_slab>` submodule (monitor the total use and fragmentation of memory allocated for storing data in Tarantool)
ru: :ref:`box.slab <box_introspection-box_slab>` -- мониторинг использования и фрагментированности памяти, выделенной для хранения данных в Tarantool'е,

source: :ref:`box.info <box_introspection-box_info>` submodule (introspect Tarantool server variables, primarily those related to replication)
ru: :ref:`box.info <box_introspection-box_info>` -- просмотр переменных Tarantool-сервера -- в первую очередь тех, что относятся к репликации,

source: :ref:`box.stat <box_introspection-box_stat>` submodule (introspect Tarantool request and network statistics)
ru: :ref:`box.stat <box_introspection-box_stat>` -- просмотр статистики Tarantool'а по запросам и использованию сети,

source: You can also try `tarantool/prometheus <https://github.com/tarantool/prometheus>`_, a Lua module that makes it easy to collect metrics (e.g. memory usage or number of requests) from Tarantool applications and databases and expose them via the Prometheus protocol.
ru: Можно также попробовать воспользоваться Lua-модулем `tarantool/prometheus <https://github.com/tarantool/prometheus>`_, который облегчает сбор метрик (например, использование памяти или количество запросов) с Tarantool-приложений и баз данных и их публикацию через протокол Prometheus.

source: **Example**
ru: **Пример**

source: A very popular administrator request is :ref:`box.slab.info() <box_slab_info>`, which displays detailed memory usage statistics for a Tarantool instance.
ru: Очень часто администраторам приходится вызывать функцию :ref:`box.slab.info() <box_slab_info>`, которая показывает подробную статистику по использованию памяти для конкретного экземпляра Tarantool'а.

source: Tarantool takes memory from the operating system, for example when a user does many insertions. You can see how much it has taken by saying (on Linux):
ru: Tarantool занимает память операционной системы, например, когда пользователь вставляет много данных. Можно проверить, сколько памяти занято, выполнив команду (в Linux):

source: Ordinarily this does not affect performance. But, to force Tarantool to release memory, you can call :ref:`box.snapshot <box-snapshot>`, stop the server instance, and restart it.
ru: Как правило, это не влияет на производительность. Однако, чтобы заставить Tarantool высвободить память, можно вызвать :ref:`box.snapshot <box-snapshot>`, остановить экземпляр и перезапустить его.

source: Profiling performance issues
ru: Профилирование производительности

source: Tarantool can at times work slower than usual. There can be multiple reasons, such as disk issues, CPU-intensive Lua scripts or misconfiguration. Tarantool’s log may lack details in such cases, so the only indications that something goes wrong are log entries like this: ``W> too long DELETE: 8.546 sec``. Here are tools and techniques that can help you collect Tarantool’s performance profile, which is helpful in troubleshooting slowdowns.
ru: Иногда Tarantool может работать медленнее, чем обычно. Причин такого поведения может быть несколько: проблемы с диском, Lua-скрипты, активно использующие процессор, или неправильная настройка. В таких случаях в журнале Tarantool’а могут отсутствовать необходимые подробности, поэтому единственным признаком неправильного поведения является наличие в журнале записей вида ``W> too long DELETE: 8.546 sec``. Ниже приведены инструменты и приемы, которые облегчают снятие профиля производительности Tarantool’а. Эта процедура может помочь при решении проблем с замедлением.

source: Most of these tools -- except ``fiber.info()`` -- are intended for generic GNU/Linux distributions, but not FreeBSD or Mac OS.
ru: Большинство инструментов, за исключением ``fiber.info()``, предназначено для дистрибутивов GNU/Linux, но не для FreeBSD или Mac OS.

source: The simplest profiling method is to take advantage of Tarantool’s built-in functionality. :ref:`fiber.info() <fiber-info>` returns information about all running fibers with their corresponding C stack traces. You can use this data to see how many fibers are running and which C functions are executed more often than others.
ru: Самый простой способ профилирования -- это использование встроенных функций Tarantool’а. :ref:`fiber.info() <fiber-info>` возвращает информацию обо всех работающих файберах с соответствующей трассировкой стека для языка C. Эти данные показывают, сколько файберов запущенно на данный момент и какие функции, написанные на C, вызываются чаще остальных.

source: First, enter your instance’s interactive administrator console:
ru: Сначала войдите в интерактивную административную консоль вашего экземпляра Tarantool’а:

source: Once there, load the ``fiber`` module:
ru: После этого загрузите модуль ``fiber``:

source: After that you can get the required information with ``fiber.info()``.
ru: Теперь можно получить необходимую информацию с помощью `fiber.info()`.

source: At this point, you console output should look something like this:
ru: На этом шаге в вашей консоли должно выводиться следующее:

source: We highly recommend to assign meaningful names to fibers you create so that you can find them in the ``fiber.info()`` list. In the example below, we create a fiber named ``myworker``:
ru: Мы рекомендуем присваивать создаваемым файберам понятные имена, чтобы их можно было легко найти в списке, выводимом ``fiber.info()``. В примере ниже создается файбер с именем ``myworker``:

source: tarantool> fiber = require('fiber') --- ... tarantool> f = fiber.create(function() while true do fiber.sleep(0.5) end end) --- ... tarantool> f:name('myworker') <!-- assigning the name to a fiber --- ... tarantool> fiber.info() --- - 102: csw: 14 backtrace: - '#0 0x501a1a in fiber_yield_timeout+90' - '#1 0x4f2008 in lbox_fiber_sleep+72' - '#2 0x5112a7 in lj_BC_FUNCC+52' fid: 102 memory: total: 57656 used: 0 name: myworker <!-- newly created background fiber 101: csw: 284 backtrace: [] fid: 101 memory: total: 57656 used: 0 name: interactive ...
ru: tarantool> fiber = require('fiber') --- ... tarantool> f = fiber.create(function() while true do fiber.sleep(0.5) end end) --- ... tarantool> f:name('myworker') <!-- присваивание имени файберу --- ... tarantool> fiber.info() --- - 102: csw: 14 backtrace: - '#0 0x501a1a in fiber_yield_timeout+90' - '#1 0x4f2008 in lbox_fiber_sleep+72' - '#2 0x5112a7 in lj_BC_FUNCC+52' fid: 102 memory: total: 57656 used: 0 name: myworker <!-- новый созданный фоновый файбер 101: csw: 284 backtrace: [] fid: 101 memory: total: 57656 used: 0 name: interactive ...

source: You can kill any fiber with :ref:`fiber.kill(fid) <fiber-kill>`:
ru: Для принудительного завершения файбера используется команда :ref:`fiber.kill(fid) <fiber-kill>`:

source: If you want to dynamically obtain information with ``fiber.info()``, the shell script below may come in handy. It connects to a Tarantool instance specified by ``NAME`` every 0.5 seconds, grabs the ``fiber.info()`` output and writes it to the ``fiber-info.txt`` file:
ru: Если вам необходимо динамически получать информацию с помощью ``fiber.info()``, вам может пригодиться приведенный ниже скрипт. Он каждые полсекунды подключается к экземпляру Tarantool’а, указанному в переменной ``NAME``, выполняет команду ``fiber.info()`` и записывает ее выход в файл ``fiber-info.txt``:

source: If you can't understand which fiber causes performance issues, collect the metrics of the ``fiber.info()`` output for 10-15 seconds using the script above and contact the Tarantool team at support@tarantool.org.
ru: Если вы не можете самостоятельно разобраться, какой именно файбер вызывает проблемы с производительностью, запустите данный скрипт на 10-15 секунд и пришлите получившийся файл команде Tarantool’а на адрес support@tarantool.org.

source: Poor man’s profilers
ru: Простейшие профилировщики

source: To use this tool, first install it with a package manager that comes with your Linux distribution. This command prints an execution stack trace of a running process specified by the PID. You might want to run this command several times in a row to pinpoint the bottleneck that causes the slowdown.
ru: Чтобы использовать этот инструмент, его необходимо установить с помощью пакетного менеджера, поставляемого с вашим дистрибутивом Linux. Данная команда выводит трассировку стека выполнения для работающего процесса с соответствующим PID. При необходимости команду можно запустить несколько раз, чтобы выявить узкое место, которое вызывает падение производительности.

source: Once installed, say:
ru: После установки воспользуйтесь следующей командой:

source: Next, say:
ru: Затем выполните:

source: to show the PID of the Tarantool instance that runs the ``INSTANCENAME.lua`` file.
ru: чтобы вывести на экран PID экземпляра Tarantool’а, использующего файл ``INSTANCENAME.lua``.

source: You should get similar output:
ru: В вашей консоли должно отображаться приблизительно следующее:

source: As with ``pstack``, the GNU debugger (also known as ``gdb``) needs to be installed before you can start using it. Your Linux package manager can help you with that.
ru: Как и в случае с ``pstack``, перед использованием GNU-отладчик (также известный как ``gdb``) необходимо сначала установить через пакетный менеджер, встроенный в ваш дистрибутив Linux.

source: Once the debugger is installed, say:
ru: После установки воспользуйтесь следующей командой:

source: After using the debugger, your console output should look like this:
ru: После использования отладчика в консоль должна выводиться следующая информация:

source: Run the debugger in a loop a few times to collect enough samples for making conclusions about why Tarantool demonstrates suboptimal performance. Use the following script:
ru: Запустите отладчик в цикле, чтобы собрать достаточно информации, которая поможет установить причину спада производительности Tarantool’а. Можно воспользоваться следующим скриптом:

source: Structurally and functionally, this script is very similar to the one used with ``fiber.info()`` above.
ru: С точки зрения структуры и функциональности, этот скрипт идентичен тому, что используется выше с ``fiber.info()``.

source: If you have any difficulties troubleshooting, let the script run for 10-15 seconds and then send the resulting ``stack-trace.txt`` file to the Tarantool team at support@tarantool.org.
ru: Если вам не удается отыскать причину пониженной производительности, запустите данный скрипт на 10-15 секунд и пришлите получившийся файл ``stack-trace.txt`` команде Tarantool’а на адрес support@tarantool.org.

source: Use the poor man’s profilers with caution: each time they attach to a running process, this stops the process execution for about a second, which may leave a serious footprint in high-load services.
ru: Следует использовать ``pstack`` и ``gdb`` с осторожностью: каждый раз, подключаясь с работающему процессу, они приостанавливают выполнение этого процесса приблизительно на одну секунду, что может иметь серьезные последствия для высоконагруженных сервисов.

source: To use the CPU profiler from the Google Performance Tools suite with Tarantool, first take care of the prerequisites:
ru: Чтобы использовать профилировщик процессора из набора Google Performance Tools с Tarantool’ом, необходимо сначала установить зависимости:

source: For Debian/Ubuntu, run:
ru: Если вы используете Debian/Ubuntu, запустите эту команду:

source: For RHEL/CentOS/Fedora, run:
ru: Если вы используете RHEL/CentOS/Fedora, запустите эту команду:

source: Once you do this, install Lua bindings:
ru: После этого установите привязки для Lua:

source: Now you're ready to go. Enter your instance’s interactive administrator console:
ru: После окончания установки войдите в интерактивную административную консоль вашего экземпляра Tarantool’а:

source: To start profiling, say:
ru: Для запуска профилировщика выполните следующий код:

source: tarantool> cpuprof = require('gperftools.cpu') tarantool> cpuprof.start('/home/<username>/tarantool-on-production.prof')
ru: tarantool> cpuprof = require('gperftools.cpu') tarantool> cpuprof.start('/home/<имя_пользователя>/tarantool-on-production.prof')

source: It takes at least a couple of minutes for the profiler to gather performance metrics. After that, save the results to disk (you can do that as many times as you need):
ru: На сбор метрик производительности у профилировщика уходит по крайней мере пара минут. По истечении этого времени можно сохранять информацию на диск (неограниченное количество раз):

source: To stop profiling, say:
ru: Для остановки профилировщика выполните следующую команду:

source: You can now analyze the output with the ``pprof`` utility that comes with the ``gperftools`` package:
ru: Теперь можно проанализировать собранные данные с помощью утилиты ``pprof``, которая входит в пакет ``gperftools``:

source: $ pprof --text /usr/bin/tarantool /home/<username>/tarantool-on-production.prof
ru: $ pprof --text /usr/bin/tarantool /home/<имя_пользователя>/tarantool-on-production.prof

source: On Debian/Ubuntu, the ``pprof`` utility is called ``google-pprof``.
ru: В дистрибутивах Debian/Ubuntu утилита ``pprof`` называется ``google-pprof``.

source: Your output should look similar to this:
ru: В консоль должно выводиться приблизительно следующее:

source: This tool for performance monitoring and analysis is installed separately via your package manager. Try running the ``perf`` command in the terminal and follow the prompts to install the necessary package(s).
ru: Этот инструмент для мониторинга и анализа производительности устанавливается отдельно с помощью пакетного менеджера. Попробуйте ввести в окне консоли команду ``perf`` и следуйте подсказкам, чтобы установить необходимые пакеты.

source: By default, some ``perf`` commands are restricted to **root**, so, to be on the safe side, either run all commands as **root** or prepend them with ``sudo``.
ru: По умолчанию некоторые команды из пакета ``perf`` можно выполнять только с **root**-правами, поэтому необходимо либо зайти в систему из-под пользователя **root**, либо добавлять перед каждой командой ``sudo``.

source: To start gathering performance statistics, say:
ru: Чтобы начать сбор показателей производительности, выполните следующую команду:

source: This command saves the gathered data to a file named ``perf.data`` inside the current working directory. To stop this process (usually, after 10-15 seconds), press **ctrl+C**. In your console, you’ll see:
ru: Эта команда сохраняет собранные данные в файл ``perf.data``, который находится в текущей рабочей папке. Для остановки процесса (обычно через 10-15 секунд) нажмите **ctrl+C**. В консоли должно появиться следующее:

source: Now run the following command:
ru: Затем выполните эту команду:

source: It formats the statistical data in the ``perf.data`` file into a performance report and writes it to the ``perf-report.txt`` file.
ru: Она превращает содержащиеся в ``perf.data`` статистические данные в отчет о производительности, который сохраняется в файл ``perf-report.txt``.

source: The resulting output should look similar to this:
ru: Получившийся отчет выглядит следующим образом:

source: Unlike the poor man’s profilers, ``gperftools`` and ``perf`` have low overhead (almost negligible as compared with ``pstack`` and ``gdb``): they don’t result in long delays when attaching to a process and therefore can be used without serious consequences.
ru: Инструменты ``gperftools`` и ``perf`` отличаются от ``pstack`` и ``gdb`` низкой затратой ресурсов (пренебрежимо малой по сравнению с ``pstack`` и ``gdb``): они подключаются к работающим процессам без больших задержек, а потому могут использоваться без серьезных последствий.

source: Starting/stopping an instance
ru: Запуск/остановка экземпляра

source: While a Lua application is executed by Tarantool, an instance file is executed by ``tarantoolctl`` which is a Tarantool script.
ru: Lua-приложение выполняется Tarantool'ом, тогда как файл экземпляра выполняется Tarantool-скриптом ``tarantoolctl``.

source: Here is what ``tarantoolctl`` does when you issue the command:
ru: Вот что делает ``tarantoolctl`` при вводе следующей команды:

source: $ tarantoolctl start <instance_name>
ru: $ tarantoolctl start <имя_экземпляра>

source: Read and parse the command line arguments. The last argument, in our case, contains an instance name.
ru: Считывает и разбирает аргументы командной строки. В нашем случае последний аргумент содержит имя экземпляра.

source: Read and parse its own configuration file. This file contains ``tarantoolctl`` defaults, like the path to the directory where instances should be searched for.
ru: Считывает и разбирает собственный конфигурационный файл. Этот файл содержит параметры ``tarantoolctl`` по умолчанию -- такие как путь до директории, в которой располагаются экземпляры.

source: Override :ref:`box.cfg{} <box_introspection-box_cfg>` function to pre-process its parameters and ensure that instance paths are pointing to the paths defined in the ``tarantoolctl`` configuration file. For example, if the configuration file specifies that instance work directory must be in ``/var/tarantool``, then the new implementation of ``box.cfg{}`` ensures that :ref:`work_dir <cfg_basic-work_dir>` parameter in ``box.cfg{}`` is set to ``/var/tarantool/<instance_name>``, regardless of what the path is set to in the instance file itself.
ru: Переопределяет функцию :ref:`box.cfg{} <box_introspection-box_cfg>`, чтобы предобработать ее параметры и сделать так, чтобы пути к экземплярам указывали на пути, прописанные в конфигурационном файле ``tarantoolctl``. Например, если в конфигурационном файле указано, что рабочей директорией экземпляра является ``/var/tarantool``, то новая реализация ``box.cfg{}`` сделает так, чтобы параметр :ref:`work_dir <cfg_basic-work_dir>` в ``box.cfg{}`` имел значение ``/var/tarantool/<имя_экземпляра>``, независимо от того, какой путь указан в самом файле экземпляра.
