Repository: tarantool/doc
Catalog: locale/*/LC_MESSAGES/doc.po
Languages: ru

source: This is the first alpha in the 1.7 series. The main feature of this release is a new storage engine, called "vinyl". Vinyl is a write optimized storage engine, allowing the amount of data stored exceed the amount of available RAM 10-100x times. Vinyl is a continuation of the Sophia engine from 1.6, and effectively a fork and a distant relative of Dmitry Simonenko's Sophia. Sophia is superseded and replaced by Vinyl. Internally it is organized as a log structured merge tree. However, it takes a serious effort to improve on the traditional deficiencies of log structured storage, such as poor read performance and unpredictable write latency. A single index is range partitioned among many LSM data structures, each having its own in-memory buffers of adjustable size. Range partitioning allows merges of LSM levels to be more granular, as well as to prioritize hot ranges over cold ones in access to resources, such as RAM and I/O. The merge scheduler is designed to minimize write latency while ensuring read performance stays within acceptable limits. Vinyl today only supports a primary key index. The index can consist of up to 256 parts, like in MemTX, up from 8 in Sophia. Partial key reads are supported. Support of non-sequential multi part keys, as well as secondary keys is on the short term todo. Our intent is to remove all limitations currently present in Vinyl, making it a first class citizen in Tarantool.
ru: Данная сборка представляет собой первую альфа-версию в серии 1.7. Основной функцией данной версии является новый движок базы данных под названием "vinyl". Vinyl представляет собой оптимизированный для записи движок базы данных, который позволяет сохранять объем сохраняемых данных, превышающий объем доступной памяти в 10-100 раз. Vinyl является продолжением движка Sophia из версии 1.6, а именно ответвлением и дальним родственником Sophia Дмитрия Симоненко. Новый Vinyl заменяет Sophia. Он реализован в виде журнально-структурированного дерева со слиянием (log-structured merge tree -- LSM-tree). Однако усовершенствование таких традиционных недостатков журнально-структурированных хранилищ, как низкая производительность при чтении и непредсказуемая задержка во времени при записи, стоит больших усилий. Отдельный индекс секционирован по диапазонам между многими структурами данных LSM, в каждой из который находятся собственные буферы оперативной памяти регулируемого размера. Секционирование по диапазонам позволяет осуществить слияние LSM-уровней, чтобы добиться большей детализации, а также отдать приоритет горячим диапазонам по отношению к холодным в том, что касается доступа к ресурсам, таким как оперативная память и ввод-вывод. Планировщик слияний предназначен для сведения времени задержки записи к минимуму, а также для поддержания производительности при чтении в приемлемых пределах. На сегодняшний день Vinyl поддерживает только первичные индексы. Индекс может состоять из 256 частей, как в MemTX'е, по сравнению с 8 в Sophia. Поддерживает чтение по компонентам ключа. Вскоре ожидается поддержка непоследовательных составных ключей, а также вторичных ключей. Наше намерение заключается в том, чтобы убрать любые ограничения, которые есть сейчас в Vinyl'е, чтобы сделать его полноценным компонентом Tarantool'а.

source: The disk-based storage engine, which was called ``sophia`` or ``phia`` in earlier versions, is superseded by the ``vinyl`` storage engine.
ru: Дисковый движок, который в более ранних версиях Tarantool'а назывался ``sophia`` или ``phia``, заменен новым движком под названием ``vinyl``.

source: There are new types for indexed fields.
ru: Добавлены новые типы индексируемых полей.

source: The LuaJIT version is updated.
ru: Обновлена версия LuaJIT.

source: Automatic replica set bootstrap (for easier configuration of a new replica set) is supported.
ru: Поддерживается автоматическая настройка набора реплик, что существенно упрощает настройку нового набора реплик.

source: The ``space_object:inc()`` function is removed.
ru: Функция ``space_object:inc()`` объявлена устаревшей.

source: The ``space_object:dec()`` function is removed.
ru: Функция ``space_object:dec()`` объявлена устаревшей.

source: The ``space_object:bsize()`` function is added.
ru: Добавлена функция ``space_object:bsize()``.

source: The ``box.coredump()`` function is removed, for an alternative see :ref:`Core dumps <admin-core_dumps>`.
ru: Удалена функция ``box.coredump()``, аналог см. в главе :ref:`Создание дампов памяти <admin-core_dumps>`.

source: The ``hot_standby`` configuration option is added.
ru: Добавлена опция настройки ``hot_standby`` (горячий резерв).

source: Configuration parameters revised or renamed:
ru: Исправленные или переименованные конфигурационные параметры:

source: ``slab_alloc_arena`` (in gigabytes) to ``memtx_memory`` (in bytes),
ru: ``slab_alloc_arena`` (в гигабайтах) в ``memtx_memory`` (в байтах),

source: ``slab_alloc_minimal`` to ``memtx_min_tuple_size``,
ru: ``slab_alloc_minimal`` в ``memtx_min_tuple_size``,

source: ``slab_alloc_maximal`` to ``memtx_max_tuple_size``,
ru: ``slab_alloc_maximal`` в ``memtx_max_tuple_size``,

source: ``replication_source`` to ``replication``,
ru: ``replication_source`` в ``replication``,

source: ``snap_dir`` to ``memtx_dir``,
ru: ``snap_dir`` в ``memtx_dir``,

source: ``logger`` to ``log``,
ru: ``logger`` в ``log``,

source: ``logger_nonblock`` to ``log_nonblock``,
ru: ``logger_nonblock`` в ``log_nonblock``,

source: ``snapshot_count`` to ``checkpoint_count``,
ru: ``snapshot_count`` в ``checkpoint_count``,

source: ``snapshot_period`` to ``checkpoint_interval``,
ru: ``snapshot_period`` в ``checkpoint_interval``,

source: ``panic_on_wal_error`` and ``panic_on_snap_error`` united under ``force_recovery``.
ru: ``panic_on_wal_error`` и ``panic_on_snap_error`` объединены в ``force_recovery``.

source: Until Tarantool 1.8, you can use :ref:`deprecated parameters <cfg_deprecated>` for both initial and runtime configuration, but Tarantool will display a warning. Also, you can specify both deprecated and up-to-date parameters, provided that their values are harmonized. If not, Tarantool will display an error.
ru: В версиях Tarantool'а до 1.8 можно использовать :ref:`устаревшие параметры <cfg_deprecated>` как для начальной, так и для рабочей конфигурации, но в таком случае Tarantool выдаст предупреждение. Также можно указывать как устаревшие, так и новые параметры при условии, что их значения согласованы. В противном случае, Tarantool выдаст ошибку.

source: Automatic replication cluster bootstrap; it's now much easier to configure a new replication cluster.
ru: У кластера репликации появилась возможность автоматической настройки, что существенно упрощает настройку нового кластера.

source: New indexable data types: INTEGER and SCALAR.
ru: Новые индексируемые типы данных: INTEGER (целое число) и SCALAR (скаляр).

source: Code refactoring and performance improvements.
ru: Рефакторинг кода и улучшение производительности.

source: Updated LuaJIT to 2.1-beta116.
ru: LuaJIT обновлен до версии 2.1-beta116.

source: Version 1.6
ru: Версия 1.6

source: **Release 1.6.9**
ru: **Версия 1.6.9**

source: Release type: maintenance. Release date: 2016-09-27. Release tag: 1.6.9-4-gcc9ddd7.
ru: Тип версии: обновленная. Дата выхода: 2016-09-27. Тег версии: 1.6.9-4-gcc9ddd7.

source: Since February 15, 2017, due to Tarantool issue#2040 `Remove sophia engine from 1.6 <https://github.com/tarantool/tarantool/issues/2040>`_ there no longer is a storage engine named `sophia`. It will be superseded in version 1.7 by the `vinyl` storage engine.
ru: С 15 февраля 2017 года вследствие проблемы № 2040 `Удалить движок sophia из версии 1.6 <https://github.com/tarantool/tarantool/issues/2040>`_, движок базы данных под названием `sophia` отсутствует. В версии 1.7 его заменит движок базы данных `vinyl`.

source: Tarantool binary now dynamically links with libssl.so during compile time instead of loading it at the run time.
ru: Бинарный файл Tarantool'а будет динамически связываться с libssl.so во время компиляции вместо загрузки во время выполнения.

source: Tab-based autocompletion in the interactive console. Issue `86 <https://github.com/tarantool/tarantool/issues/86>`_
ru: Автодополнение по Tab в интерактивной консоли. Проблема `86 <https://github.com/tarantool/tarantool/issues/86>`_

source: LUA_PATH and LUA_CPATH environment variables taken into account, like in PUC-RIO Lua. Issue `1428 <https://github.com/tarantool/tarantool/issues/1428>`_
ru: Принимаются во внимание переменные окружения LUA_PATH и LUA_CPATH, как в PUC-RIO Lua. Проблема `1428 <https://github.com/tarantool/tarantool/issues/1428>`_

source: Search for ``.dylib`` as well as for ``.so`` libraries in OS X. Issue `810 <https://github.com/tarantool/tarantool/issues/810>`_.
ru: Поиск по библиотекам ``.dylib``, а также ``.so`` в OS X. Проблема `810 <https://github.com/tarantool/tarantool/issues/810>`_.

source: A new ``box.cfg { read_only = true }`` option to emulate master-slave behavior. Issue `246 <https://github.com/tarantool/tarantool/issues/246>`_
ru: Новая опция ``box.cfg { read_only = true }`` для моделирования поведения главный-ведомый. Проблема `246 <https://github.com/tarantool/tarantool/issues/246>`_

source: ``if_not_exists = true`` option added to box.schema.user.grant. Issue `1683 <https://github.com/tarantool/tarantool/issues/1683>`_
ru: Опция ``if_not_exists = true`` добавлена в box.schema.user.grant. Проблема `1683 <https://github.com/tarantool/tarantool/issues/1683>`_

source: ``clock_realtime()``/``monotonic()`` functions added to the public C API. Issue `1455 <https://github.com/tarantool/tarantool/issues/1455>`_
ru: Функции ``clock_realtime()``/``monotonic()`` добавлены в общедоступный API для языка C. Проблема `1455 <https://github.com/tarantool/tarantool/issues/1455>`_

source: ``space:count(key, opts)`` introduced as an alias for ``space.index.primary:count(key, opts)``. Issue `1391 <https://github.com/tarantool/tarantool/issues/13918>`_
ru: Появляется ``space:count(key, opts)`` в качестве псевдонима для ``space.index.primary:count(key, opts)``. Проблема `1391 <https://github.com/tarantool/tarantool/issues/13918>`_

source: Upgrade script for 1.6.4 -> 1.6.8 -> 1.6.9. Issue `1281 <https://github.com/tarantool/tarantool/issues/1281>`_
ru: Обновление скрипта для 1.6.4 -> 1.6.8 -> 1.6.9. Проблема `1281 <https://github.com/tarantool/tarantool/issues/1281>`_

source: Support for OpenSSL 1.1. Issue `1722 <https://github.com/tarantool/tarantool/issues/1722>`_
ru: Поддержка OpenSSL 1.1. Проблема `1722 <https://github.com/tarantool/tarantool/issues/1722>`_

source: `gis <https://github.com/tarantool/gis>`_ - full-featured geospatial extension for Tarantool.
ru: `gis <https://github.com/tarantool/gis>`_ -- полнофункциональное геопространственное расширение для Tarantool'а.

source: `mqtt <https://github.com/tarantool/mqtt>`_ - MQTT protocol client for Tarantool
ru: `mqtt <https://github.com/tarantool/mqtt>`_ -- клиент MQTT-протокола для Tarantool'а

source: **Release 1.6.8**
ru: **Версия 1.6.8**

source: Release type: maintenance. Release date: 2016-02-25. Release tag: 1.6.8-525-ga571ac0.
ru: Тип версии: обновленная. Дата выхода: 2016-02-25. Тег версии: 1.6.8-525-ga571ac0.

source: RPM packages for CentOS 7 / RHEL 7 and Fedora 22+ now use native systemd configuration without legacy sysvinit shell scripts. Systemd provides its own facilities for multi-instance management. To upgrade, perform the following steps:
ru: RPM-пакеты для CentOS 7 / RHEL 7 Fedora 22+ будут использовать встроенную конфигурацию systemd без устаревших скриптов sysvinit. В systemd появляется возможность управления несколькими экземплярами. Чтобы обновить, выполните следующие действия:

source: Ensure that ``INSTANCENAME.lua`` file is present in ``/etc/tarantool/instace.available``.
ru: Убедитесь в наличии файла ``ИМЯ_ЭКЗЕМПЛЯРА.lua`` в директории ``/etc/tarantool/instace.available``.

source: ``/etc/tarantool/instance.enabled`` directory is now deprecated for systemd-enabled platforms.
ru: Директория ``/etc/tarantool/instance.enabled`` больше не используется для платформ, запускаемых по systemd.

source: See :ref:`the administration chapter <admin>` for additional information.
ru: Для получения дополнительной информации см. главу :ref:`по администрированию серверной части `.

source: Sophia was upgraded to v2.1 to fix upsert, memory corruption and other bugs. Sophia v2.1 doesn't support old v1.1 data format. Please use Tarantool replication to upgrade. Issue `1222 <https://github.com/tarantool/tarantool/issues/1222>`_
ru: Движок Sophia был обновлен до версии 2.1 для исправления ошибок upsert, нарушения целостности данных в памяти и других ошибок. Sophia версии 2.1 не поддерживает старый формат данных версии 1.1. Используйте репликацию в Tarantool'е для обновления. Проблема `1222 <https://github.com/tarantool/tarantool/issues/1222>`_

source: Ubuntu Vivid, Fedora 20, Fedora 21 were deprecated due to EOL.
ru: Ubuntu Vivid, Fedora 20, Fedora 21 объявлены устаревшими по причине прекращения поддержки.

source: i686 packages were deprecated. Please use our RPM and DEB specs to build these on your own infrastructure.
ru: i686-пакеты объявлены устаревшими. Используйте наши спецификации по RPM и DEB для сборки на своей инфраструктуре.

source: Please update your ``yum.repos.d`` and/or apt ``sources.list.d`` according to instructions at http://tarantool.org/download.html
ru: Обновите ``yum.repos.d`` и/или apt ``sources.list.d`` в соответствии с инструкциями по ссылке http://tarantool.org/download.html

source: Tarantool 1.6.8 fully supports ARMv7 and ARMv8 (aarch64) processors. Now it is possible to use Tarantool on a wide range of consumer devices, starting from popular Raspberry PI 2 to coin-size embedded boards and no-name mini-micro-nano-PCs. Issue `1153 <https://github.com/tarantool/tarantool/issues/1153>`_. (Also qemu works well, but we don't have real hardware to check.)
ru: Tarantool в версии 1.6.8 полностью поддерживает процессоры ARMv7 и ARMv8 (aarch64). Теперь можно будет использовать Tarantool на самых разных пользовательских устройствах от популярного Raspberry PI 2 и до плат размером с монету и безымянных мини-микро-нано-компьютеров. Проблема `1153 <https://github.com/tarantool/tarantool/issues/1153>`_. (На qemu также работает хорошо, но у нас нет оборудования, чтобы проверить.)

source: Tuple comparator functions were optimized, providing up to 30% performance boost when an index key consists of 2, 3 or more parts. Issue `969 <https://github.com/tarantool/tarantool/issues/969>`_.
ru: Функции компаратора кортежей были оптимизированы, чтобы обеспечить повышение производительности на 30%, когда индексный ключ состоит из 2, 3 и более частей. Проблема `969 <https://github.com/tarantool/tarantool/issues/969>`_.

source: Tuple allocator changes give another 15% performance improvement. Issue `1298 <https://github.com/tarantool/tarantool/issues/1298>`_
ru: Изменения распределителя кортежей дают улучшение производительности еще на 15%. Проблема `1298 <https://github.com/tarantool/tarantool/issues/1298>`_

source: Replication relay performance was improved by reducing the amount of data directory re-scans. Issue `11150 <https://github.com/tarantool/tarantool/issues/1150>`_
ru: Производительность передачи данных репликации была улучшена путем уменьшения объема данных в повторном сканировании. Проблема `11150 <https://github.com/tarantool/tarantool/issues/1150>`_

source: A random delay was introduced into snapshot daemon, reducing the chance that multiple instances take a snapshot at the same time. Issue `732 <https://github.com/tarantool/tarantool/issues/732>`_.
ru: В демоне создания снимков появилась произвольная задержка, что снижает возможность того, что несколько экземпляров будут делать снимки одновременно. Проблема `732 <https://github.com/tarantool/tarantool/issues/732>`_.

source: Sophia storage engine was upgraded to v2.1:
ru: Движок базы данных Sophia был обновлен до версии 2.1:

source: serializable Snapshot Isolation (SSI),
ru: изоляция сериализуемых снимков (SSI -- Serializable Snapshot Isolation),

source: RAM storage mode,
ru: режим хранения в оперативной памяти,

source: anti-cache storage mode,
ru: режим хранения без кэша,

source: persistent caching storage mode,
ru: режим хранения в кэше с подключением к базе данных,

source: implemented AMQ Filter,
ru: внедренный AMQ-фильтр,

source: LRU mode,
ru: режим LRU (удаление страниц, которые дольше всего не использовались),

source: separate compression for hot and cold data,
ru: отдельная компрессия горячих и холодных данных,

source: snapshot implementation for Faster Recovery,
ru: внедрение снимков для быстрого восстановления,

source: upsert reorganizations and fixes,
ru: реорганизация и исправление ошибок в upsert,

source: new performance metrics.
ru: новые метрики производительности.

source: Please note "Incompatible changes" above.
ru: Обратите внимание на "Несовместимые изменения" выше.

source: Allow to remove servers with non-zero LSN from ``_cluster`` space. Issue `1219 <https://github.com/tarantool/tarantool/issues/1219>`_.
ru: Возможно удаление серверов с ненулевым LSN из спейса ``_cluster``. Проблема `1219 <https://github.com/tarantool/tarantool/issues/1219>`_.

source: ``net.box`` now automatically reloads space and index definitions. Issue `1183 <https://github.com/tarantool/tarantool/issues/1183>`_.
ru: ``net.box`` теперь автоматически перезагружает схемы спейса и индексов. Проблема `1183 <https://github.com/tarantool/tarantool/issues/1183>`_.

source: The maximal number of indexes in space was increased to 128. Issue `1311 <https://github.com/tarantool/tarantool/issues/1311>`_.
ru: Максимальное количество индексов в спейсе было увеличено до 128. Проблема `1311 <https://github.com/tarantool/tarantool/issues/1311>`_.

source: New native ``systemd`` configuration with support of instance management and daemon supervision (CentOS 7 and Fedora 22+ only). Please note "Incompatible changes" above. Issue `1264 <https://github.com/tarantool/tarantool/issues/1264>`_.
ru: Новая встроенная конфигурацию ``systemd`` с поддержкой управления экземплярами и контролем демонов (только CentOS 7 и Fedora 22+). См. "Несовместимые изменения" выше. Проблема `1264 <https://github.com/tarantool/tarantool/issues/1264>`_.

source: Tarantool package was accepted to the official Fedora repositories (https://apps.fedoraproject.org/packages/tarantool).
ru: Пакет Tarantool'а принят в официальный репозиторий Fedora (https://apps.fedoraproject.org/packages/tarantool).

source: Tarantool brew formula (OS X) was accepted to the official Homebrew repository (http://brewformulas.org/tarantool).
ru: Пакет Tarantool'а (OS X) принят в официальный репозиторий Homebrew (http://brewformulas.org/tarantool).

source: Clang compiler support was added on FreeBSD. Issue `786 <https://github.com/tarantool/tarantool/issues/786>`_.
ru: Поддержка компилятора Clang добавлена в FreeBSD. Проблема `786 <https://github.com/tarantool/tarantool/issues/786>`_.

source: Support for musl libc, used by Alpine Linux and Docker images, was added. Issue `1249 <https://github.com/tarantool/tarantool/issues/1249>`_.
ru: Добавлена поддержка библиотеки musl libc, используемой образами Alpine Linux и Docker. Проблема `1249 <https://github.com/tarantool/tarantool/issues/1249>`_.

source: Added support for GCC 6.0.
ru: Добавлена поддержка GCC 6.0.

source: Ubuntu Wily, Xenial and Fedora 22, 23 and 24 are now supported distributions for which we build official packages.
ru: Получили поддержку Ubuntu Wily, Xenial и Fedora 22, 23 и 24, для которых мы создаем официальные пакеты.

source: box.info.cluster.uuid can be used to retrieve cluster UUID. Issue `1117 <https://github.com/tarantool/tarantool/issues/1117>`_.
ru: box.info.cluster.uuid можно использовать для получения UUID кластера. Проблема `1117 <https://github.com/tarantool/tarantool/issues/1117>`_.

source: Numerous improvements in the documentation, added documentation for ``syslog``, ``clock``, ``fiber.storage`` packages, updated the built-in tutorial.
ru: Многочисленные исправления в документации, добавлена документация по пакетам ``syslog``, ``clock``, ``fiber.storage``, встроенное практическое задание получило обновление.

source: Tarantool switched to a new Docker-based cloud build infrastructure The new buildbot significantly decreases commit-to-package time. The official repositories at http://tarantool.org now contain the latest version of the server, rocks and connectors. See http://github.com/tarantool/build
ru: Tarantool перешел на новую облачную инфраструктуру на основе Docker. Новый инструмент интеграции разработки buildbot значительно уменьшает время передачи коммитов в пакеты. Официальные репозитории по ссылке http://tarantool.org теперь содержат последнюю версию сервера, модулей и коннекторов. См. http://github.com/tarantool/build

source: The repositories at http://tarantool.org/download.html were moved to http://packagecloud.io cloud hosting (backed by Amazon AWS). Thanks to packagecloud.io for their support of open source!
ru: Репозитории по ссылке http://tarantool.org/download.html were был перенесены в облачное хранилище http://packagecloud.io (при поддержке Amazon AWS). Благодарим packagecloud.io за поддержку свободного ПО!

source: ``memcached`` - memcached text and binary protocol implementation for Tarantool. Turns Tarantool into a persistent memcached with master-master replication. See https://github.com/tarantool/memcached
ru: ``memcached`` -- внедрение текстового и бинарного протокола memcached для Tarantool'а. Превращает Tarantool в memcached с доступом к базе данных с репликацией по схеме мастер-мастер. См. https://github.com/tarantool/memcached

source: ``migrate`` - a Tarantool rock for migration from Tarantool 1.5 to 1.6. See https://github.com/bigbes/migrate
ru: ``migrate`` -- модуль Tarantool'а для миграции с версии 1.5 на версию 1.6. См. https://github.com/bigbes/migrate

source: ``cqueues`` - a Lua asynchronous networking, threading, and notification framework (contributed by @daurnimator). PR `1204 <https://github.com/tarantool/tarantool/pull/1204>`_.
ru: ``cqueues`` -- асинхронный Lua-каркас для работы по сети с потоками и уведомлениями (разработал @daurnimator). Проблема `1204 <https://github.com/tarantool/tarantool/pull/1204>`_.

source: **Release 1.6.7**
ru: **Версия 1.6.7**

source: Release type: maintenance. Release date: 2015-11-17.
ru: Тип версии: обновленная. Дата выхода: 2015-11-17.

source: The syntax of ``upsert`` command has been changed and an extra ``key`` argument was removed from it. The primary key for look up is now always taken from the tuple, which is the second argument of upsert. ``upsert()`` was added fairly late at a release cycle and the design had an obvious bug which we had to fix. Sorry for this.
ru: Изменился синтаксис команды ``upsert``, и из нее был удален дополнительный аргумент ``key``. Первичный ключ для поиска всегда берется из кортежа, который является вторым аргументом в upsert. ``upsert()`` добавили довольно поздно в рабочем цикле, и в проекте была очевидная ошибка, которую нам пришлось исправлять. Извините.

source: ``fiber.channel.broadcast()`` was removed since it wasn't used by anyone and didn't work properly.
ru: Функцию ``fiber.channel.broadcast()`` удалили, потому что ее никто не использовал, и она работала некорректно.

source: tarantoolctl ``reload`` command renamed to ``eval``.
ru: Команда ``reload`` утилиты tarantoolctl переименована в``eval``.

source: ``logger`` option now accepts a syntax for syslog output. Use uri-style syntax for file, pipe or syslog log destination.
ru: Опция ``logger`` допускает синтаксис для вывода в системный журнал syslog. Используйте синтаксис URI, чтобы определить место назначения журнала: в файл, в конвейер или syslog.
