Repository: tarantool/doc
Catalog: locale/*/LC_MESSAGES/doc.po
Languages: ru

source: **Deprecated** in favor of :ref:`checkpoint_interval <cfg_checkpoint_daemon-checkpoint_interval>`. The parameter was only renamed, while the type, values and semantics remained intact.
ru: **Устаревший**, заменен параметром :ref:`checkpoint_interval <cfg_checkpoint_daemon-checkpoint_interval>`. Параметр был лишь переименован, его тип, значения и семантика остались прежними.

source: **Deprecated** in favor of :ref:`checkpoint_count <cfg_checkpoint_daemon-checkpoint_count>`. The parameter was only renamed, while the type, values and semantics remained intact.
ru: **Устаревший**, заменен параметром :ref:`checkpoint_count <cfg_checkpoint_daemon-checkpoint_count>`. Параметр был лишь переименован, его тип, значения и семантика остались прежними.

source: Reference
ru: Справочники

source: Tips on Lua syntax
ru: Рекомендации по Lua-синтаксису

source: The Lua syntax for :ref:`data-manipulation functions <index-box_data-operations>` can vary. Here are examples of the variations with ``select()`` requests. The same rules exist for the other data-manipulation functions.
ru: В :ref:`функциях управления данными <index-box_data-operations>` Lua-синтаксис может различаться. Далее приводятся варианты таких различий на примере запросов ``select()``. Аналогичные правила существуют и для остальных функций.

source: Every one of the examples does the same thing: select a tuple set from a space named 'tester' where the primary-key field value equals 1. For these examples, we assume that the numeric id of 'tester' is 512, which happens to be the case in our sandbox example only.
ru: В каждом из приведенных примеров выполняются следующие действия: производится выборка по набору кортежей из спейса с именем 'tester', где значение поля, которое соответствует ключу в первичном индексе, равно 1. Также во всех примерах мы принимаем, что числовой идентификатор спейса 'tester' равен 512, но это верно только для нашей тестовой базы.

source: Object reference variations
ru: Способы ссылки на объект

source: First, there are three **object reference variations**:
ru: Во-первых, есть пять *способов ссылки на объект*:

source: -- #1 module . submodule . name tarantool> box.space.tester:select{1} -- #2 replace name with a literal in square brackets tarantool> box.space['tester']:select{1} -- #3 use a variable for the entire object reference tarantool> s = box.space.tester tarantool> s:select{1}
ru: -- #1 модуль.подмодуль.имя tarantool> box.space.tester:select{1} -- #2 заменить имя буквенной константой в квадратных скобках tarantool> box.space['tester']:select{1} -- #3 использовать переменную для всей ссылки на объект tarantool> s = box.space.tester tarantool> s:select{1}

source: Examples in this manual usually have the ":samp:`box.space.{tester}:`" form (#1). However, this is a matter of user preference and all the variations exist in the wild.
ru: Для примеров в документации, как правило, используется вариант синтаксиса №1, например ":samp:`box.space.{tester}:`". Но вы можете с тем же успехом пользоваться любым из пяти описанных выше вариантов.

source: Also, descriptions in this manual use the syntax "``space_object:``" for references to objects which are spaces, and "``index_object:``" for references to objects which are indexes (for example :samp:`box.space.{tester}.index.{primary}:`).
ru: Также описания в руководстве используют синтаксис типа "``space_object:``" для ссылки на спейсы и "``index_object:``" для ссылки на индексы (например, :samp:`box.space.{tester}.index.{primary}:`).

source: Parameter variations
ru: Способы задания параметров

source: Then, there are seven **parameter variations**:
ru: Затем есть семь *способов задания параметров*:

source: Lua allows to omit parentheses ``()`` when invoking a function if its only argument is a Lua table, and we use it sometimes in our examples. This is why ``select{1}`` is equivalent to ``select({1})``. Literal values such as ``1`` (a scalar value) or ``{1}`` (a Lua table value) may be replaced by variable names, as in examples #6 and #7.
ru: В Lua допускается пропуск круглых скобок ``()`` при вызове функции, если единственным аргументом является Lua-таблица, и иногда мы этим пользуемся в примерах. Вот почему ``select{1}`` аналогично ``select({1})``. Литеральные значения, такие как ``1`` (скалярное значение) или ``{1}`` (значение Lua-таблицы), можно заменить именами переменных, ка в примерах 6 и 7.

source: Although there are special cases where braces can be omitted, they are preferable because they signal "Lua table". Examples and descriptions in this manual have the ``{1}`` form. However, this too is a matter of user preference and all the variations exist in the wild.
ru: Хотя есть особые случаи, когда фигурные скобки можно опустить, рекомендуется использовать их, потому что они означают Lua-таблицу. В примерах и описаниях данного руководства применяется форма ``{1}``. Однако это тоже вопрос предпочтений пользователя, и на практике применимы все варианты.

source: As well as executing Lua chunks or defining their own functions, you can exploit Tarantool's storage functionality with the ``box`` module and its submodules.
ru: Помимо выполнения фрагментов кода на Lua или определения собственных функций, с помощью модуля ``box`` и вложенных модулей можно использовать функции хранилища Tarantool'а.

source: The contents of the ``box`` module can be inspected at runtime with ``box``, with no arguments. The ``box`` module contains:
ru: Содержимое модуля ``box`` можно просмотреть во время исполнения кода с помощью команды ``box`` без аргументов. Модуль ``box`` включает в себя следующее:

source: Every submodule contains one or more Lua functions. A few submodules contain members as well as functions. The functions allow data definition (create alter drop), data manipulation (insert delete update upsert select replace), and introspection (inspecting contents of spaces, accessing server configuration).
ru: Каждый вложенный модуль включает в себя одну или более Lua-функций. Несколько вложенных модулей включают в себя элементы класса, а также функции. Функции обеспечивают определение данных (create alter drop), управление данными (insert delete update upsert select replace) и просмотр состояния (просмотр содержимого спейсов, получение доступа к конфигурации сервера).

source: Submodule `box.error`
ru: Вложенный модуль `box.error`

source: The ``box.error`` function is for raising an error. The difference between this function and Lua's built-in `error <https://www.lua.org/pil/8.3.html>`_ function is that when the error reaches the client, its error code is preserved. In contrast, a Lua error would always be presented to the client as :errcode:`ER_PROC_LUA`.
ru: Функция ``box.error`` предназначена для вызова ошибки. Разница между этой функцией и встроенной Lua-функцией `error <https://www.lua.org/pil/8.3.html>`_ в том, что когда клиент получает ошибку, код ошибки сохраняется. В отличие от этого, ошибки в Lua всегда передаются на клиент в виде :errcode:`ER_PROC_LUA`.

source: Below is a list of all ``box.error`` functions.
ru: Ниже приведен перечень всех функций модуля ``box.error``.

source: Throw an error
ru: Вызов ошибки

source: Get a description of the last error
ru: Получение описания последней ошибки

source: Clear the record of errors
ru: Очистка записи об ошибках

source: When called with a Lua-table argument, the code and reason have any user-desired values. The result will be those values.
ru: При вызове с аргументом из Lua-таблицы значения параметров code и reason будут любыми по желанию пользователя. Результатом будут эти значения.

source: When called without arguments, ``box.error()`` re-throws whatever the last error was.
ru: При вызове без аргументов ``box.error()`` повторно вызывает последнюю ошибку.

source: number of a pre-defined error
ru: номер предварительно заданной ошибки

source: part of the message which will accompany the error
ru: часть сообщения, которое сопровождает ошибку

source: the ``NO_SUCH_USER`` message is "``User '%s' is not found``" -- it includes one "``%s``" component which will be replaced with errtext. Thus a call to ``box.error(box.error.NO_SUCH_USER, 'joe')`` or ``box.error(45, 'joe')`` will result in an error with the accompanying message "``User 'joe' is not found``".
ru: сообщение ``NO_SUCH_USER`` = "``User '%s' is not found``" (пользователь не найден) -- оно включает в себя компонент "``%s``", который будет заменен значением параметра errtext. Таким образом, вызов ``box.error(box.error.NO_SUCH_USER, 'joe')`` или ``box.error(45, 'joe')`` приведет к ошибке с сообщением "``User 'joe' is not found``" (пользователь 'joe' не найден).

source: except
ru: Исключение:

source: whatever is specified in errcode-number.
ru: то, что указано в номере errcode.

source: Returns a description of the last error, as a Lua table with five members: "line" (number) Tarantool source file line number, "code" (number) error's number, "type", (string) error's C++ class, "message" (string) error's message, "file" (string) Tarantool source file. Additionally, if the error is a system error (for example due to a failure in socket or file io), there may be a sixth member: "errno" (number) C standard error number.
ru: Возвращает описание последней ошибки в виде Lua-таблицы с 5 элементами: "line" (число) -- номер строки в исходном файле Tarantool'а, "code" (число) -- номер ошибки, "type" (строка) -- C++ класс ошибки, "message" (строка) -- сообщение об ошибке, "file" (строка) -- исходный файл Tarantool'а. Кроме того, если ошибка является системной (например, по причине ошибки в сокете или файловом вводы-выводе), может быть дополнительный шестой элемент: "errno" (число) стандартный номер ошибки на языке C.

source: rtype: table
ru: Тип возвращаемого значения: таблица

source: Clears the record of errors, so functions like `box.error()` or `box.error.last()` will have no effect.
ru: Очистка записи об ошибках, то есть функции `box.error()` или `box.error.last()` не сработают.

source: Function `box.once`
ru: Функция `box.once`

source: Execute a function, provided it has not been executed before. A passed value is checked to see whether the function has already been executed. If it has been executed before, nothing happens. If it has not been executed before, the function is invoked.
ru: Выполнение функции при условии, что она раньше не выполнялась. Передаваемое значение проверяется на предмет того, выполнялась ли функция. Если она выполнялась, ничего не происходит. В противном случае вызывается функция.

source: See an example of using ``box.once()`` while :ref:`bootstrapping a replica set <replication-bootstrap>`.
ru: См. пример использования ``box.once()`` во время :ref:`настройки набора реплик <replication-bootstrap>`.

source: If an error occurs inside ``box.once()`` when initializing a database, you can re-execute the failed ``box.once()`` block without stopping the database. The solution is to delete the ``once`` object from the system space :ref:`_schema <box_space-schema>`. Say ``box.space._schema:select{}``, find your ``once`` object there and delete it. For example, re-executing a block with ``key='hello'`` :
ru: Если в ``box.once()`` возникает ошибка во время инициализации базы данных, можно повторно запустить невыполненный блок ``box.once()``, не останавливая базу данных. Для этого удалите объект ``once`` из системного спейса :ref:`_schema <box_space-schema>`. Введите команду ``box.space._schema:select{}``, найдите объект ``once`` и удалите его. Например, повторное выполнение блока ``key='hello'`` :

source: When ``box.once()`` is used for initialization, it may be useful to wait until the database is in an appropriate state (read-only or read-write). In that case, see the functions in the :ref:`box.ctl submodule <box_ctl>`.
ru: Когда ``box.once()`` используется для инициализации, следует подождать, пока база данных не будет в нужном состоянии (только для чтения или для чтения и записи). Для этого см. функции во :ref:`вложенном модуле box.ctl <box_ctl>`.

source: a value that will be checked
ru: значение для проверки

source: a function
ru: функция

source: arguments that must be passed to function
ru: аргументы, которые следует передать в функцию

source: Function `box.snapshot`
ru: Функция `box.snapshot`

source: Since a snapshot is written sequentially, one can expect a very high write performance (averaging to 80MB/second on modern disks), which means an average database instance gets saved in a matter of minutes.
ru: Поскольку снимок создается последовательно, можно ожидать высокую скорость записи (в среднем до 80 МБ/секунду на современных дисках), что означает сохранение данных усредненного экземпляра базы данных за несколько минут.

source: As long as there are any changes to the parent index memory through concurrent updates, there are going to be page splits, and therefore you need to have some extra free memory to run this command. 10% of :ref:`memtx_memory <cfg_storage-memtx_memory>` is, on average, sufficient. This statement waits until a snapshot is taken and returns operation result.
ru: При условии, что происходят изменения в родительском индексе в ходе многопоточного обновления данных, будет происходить и расщепление страниц, поэтому возникнет необходимость в наличии дополнительной свободной памяти для выполнения этой команды. В среднем, будет достаточно 10% от :ref:`memtx_memory <cfg_storage-memtx_memory>`. Оператор подождет окончания создания снимка и вернет результат операции.

source: **Change notice:** Prior to Tarantool version 1.6.6, the snapshot process caused a fork, which could cause occasional latency spikes. Starting with Tarantool version 1.6.6, the snapshot process creates a consistent read view and this view is written to the snapshot file by a separate thread (the "Write Ahead Log" thread).
ru: **Обновление:** До версии 1.6.6 Tarantool'а процесс создания снимка вызывал создание ответвления, что могло привести к скачкам задержки отклика. Начиная с версии 1.6.6 Tarantool'а, процесс создания снимка создает вид постоянного просмотра, который и записывается в файл снимка с помощью отдельного потока (поток упреждающей записи в журнал).

source: Although ``box.snapshot()`` does not cause a fork, there is a separate fiber which may produce snapshots at regular intervals -- see the discussion of the :ref:`checkpoint daemon <book_cfg_checkpoint_daemon>`.
ru: Хотя ``box.snapshot()`` не создает ответвление, есть отдельный файбер, который может создавать снимки на регулярной основе -- см. обсуждение :ref:`демона создания контрольных точек <book_cfg_checkpoint_daemon>`.

source: Taking a snapshot does not cause the server to start a new write-ahead log. Once a snapshot is taken, old WALs can be deleted as long as all replicated data is up to date. But the WAL which was current at the time ``box.snapshot()`` started must be kept for recovery, since it still contains log records written after the start of ``box.snapshot()``.
ru: Создание снимка не приводит к записи нового журнала упреждающей записи на сервере. После создания снимка старые WAL-файлы можно удалить, если все реплицируемые данные актуальны. Но WAL-файл на момент начала работы ``box.snapshot()`` следует сохранить на случай восстановления, поскольку он содержит записи журнала после начала работы ``box.snapshot()``.

source: An alternative way to save a snapshot is to send a SIGUSR1 signal to the instance. While this approach could be handy, it is not recommended for use in automation: a signal provides no way to find out whether the snapshot was taken successfully or not.
ru: Другим способом сохранения снимка будет отправка сигнала SIGUSR1 на экземпляр. Хотя это может быть удобно, не рекомендуется использовать такой метод в автоматическом процессе: сигнал не дает возможность проверить, был ли корректно сделан снимок.

source: Module `buffer`
ru: Модуль `buffer`

source: The ``buffer`` module returns a dynamically resizable buffer which is solely for use as an option for methods of the :ref:`net.box module <net_box-module>`.
ru: Модуль ``buffer`` возвращает буфер, допускающий динамическое изменение размера, который используется только в качестве опции для методов :ref:`модуля net.box <net_box-module>`.

source: Ordinarily the ``net.box`` methods return a Lua table. If a ``buffer`` option is used, then the ``net.box`` methods return a raw MsgPack_ string. This saves time on the server, if the client application has its own routine for decoding MsgPack strings.
ru: Как правило, модуль ``net.box`` возвращает Lua-таблицу. Если используется опция ``buffer``, то методы модуля ``net.box`` возвращают неформатированную строку MsgPack_. Это экономит время работы на сервере, если в клиентском приложении есть собственная процедура декодирования MsgPack-строк.

source: a descriptor of a buffer.
ru: дескриптор буфера.

source: Assume a Tarantool server is listening on farhost:3301. Assume it has a space ``T`` with one tuple: ``'ABCDE', 12345``. In this example we start up a server on localhost:3302 and then use ``net.box`` routines to connect to farhost. Then we create a buffer, and use it as an option for a ``conn.space...select()`` call. The result will be in MsgPack_ format. To show this, we will use :ref:`msgpack.decode_unchecked() <msgpack-decode_unchecked>` on ``ibuf.rpos`` (the "read position" of the buffer). Thus we do not decode on the remote server, but we do decode on the local server.
ru: Предположим, что Tarantool-сервер настроен на прослушивание на farhost:3301. Предположим, что на нем есть спейс ``T`` с одним кортежем: ``'ABCDE', 12345``. В данном примере запустим сервер на localhost:3302, а затем используем процедуры ``net.box`` для подключения к farhost. Затем создадим буфер и используем его как опцию для вызова ``conn.space...select()``. Результат получим в формате MsgPack_. Чтобы показать это, используем :ref:`msgpack.decode_unchecked() <msgpack-decode_unchecked>` на ``ibuf.rpos`` ("позиция для чтения" в буфере). Таким образом, мы проведем декодирование не на удаленном сервере, а на локальном.

source: The result of the final request looks like this:
ru: Результат последнего запроса выглядит следующим образом:

source: Before Tarantool version 1.7.7, the function to use for this case is ``msgpack.ibuf_decode(ibuf.rpos)``. Starting with Tarantool version 1.7.7, ``ibuf_decode`` is deprecated.
ru: До версии 1.7.7 Tarantool'а в данном случае следует использовать функцию ``msgpack.ibuf_decode(ibuf.rpos)``. Начиная с версии 1.7.7 Tarantool'а , ``ibuf_decode`` объявлена устаревшей.

source: The ``clock`` module returns time values derived from the Posix / C CLOCK_GETTIME_ function or equivalent. Most functions in the module return a number of seconds; functions whose names end in "64" return a 64-bit number of nanoseconds.
ru: Модуль ``clock`` возвращает значения времени, полученных из функции Posix / C CLOCK_GETTIME_ или аналогичной. Большинство функций модуля возвращают число секунд; функции, названия которых заканчиваются на "64", возвращают 64-разрадяное число наносекунд.

source: Below is a list of all ``clock`` functions.
ru: Ниже приведен перечень всех функций модуля ``clock``.

source: Get the wall clock time in seconds
ru: Получение физического времени в секундах

source: Get the wall clock time in nanoseconds
ru: Получение физического времени в наносекундах

source: Get the monotonic time in seconds
ru: Получение монотонного времени в секундах

source: Get the monotonic time in nanoseconds
ru: Получение монотонного времени в наносекундах

source: Get the processor time in seconds
ru: Получение времени процессора в секундах

source: Get the processor time in nanoseconds
ru: Получение времени процессора в наносекундах

source: Get the thread time in seconds
ru: Получение рабочего времени потока в секундах

source: Get the thread time in nanoseconds
ru: Получение рабочего времени потока в наносекундах

source: Measure the time a function takes within a processor
ru: Измерение времени, которое функция проводит в процессоре

source: The wall clock time. Derived from C function clock_gettime(CLOCK_REALTIME). This is the best function for knowing what the official time is, as determined by the system administrator.
ru: Физическое время в секундах. Получено из C-функции clock_gettime(CLOCK_REALTIME). Использование этой функции лучше всего подходит для выяснения официального времени, как установлено системным администратором.

source: seconds or nanoseconds since epoch (1970-01-01 00:00:00), adjusted.
ru: секунды или наносекунды с начала отсчета (1970-01-01 00:00:00), значение корректируется.

source: number or number64
ru: число или 64-разрядное число

source: -- This will print an approximate number of years since 1970. clock = require('clock') print(clock.time() / (365*24*60*60))
ru: -- Результатом будет примерное число лет с 1970. clock = require('clock') print(clock.time() / (365*24*60*60))

source: See also :ref:`fiber.time64 <fiber-time64>` and the standard Lua function `os.clock <http://www.lua.org/manual/5.1/manual.html#pdf-os.clock>`_.
ru: См. также :ref:`fiber.time64 <fiber-time64>` и стандартную Lua-функцию `os.clock <http://www.lua.org/manual/5.1/manual.html#pdf-os.clock>`_.

source: The monotonic time. Derived from C function clock_gettime(CLOCK_MONOTONIC). Monotonic time is similar to wall clock time but is not affected by changes to or from daylight saving time, or by changes done by a user. This is the best function to use with benchmarks that need to calculate elapsed time.
ru: Монотонное время. Получено из C-функции clock_gettime(CLOCK_MONOTONIC). Монотонное время похоже на физическое время, но на него не влияют изменения для перехода на летнее время или изменения, сделанные пользователем. Такую функцию лучше всего использовать для эталонного тестирования, где необходимо рассчитать затраченное время.

source: seconds or nanoseconds since the last time that the computer was booted.
ru: секунды или наносекунды с момента последней загрузки компьютера.

source: -- This will print nanoseconds since the start. clock = require('clock') print(clock.monotonic64())
ru: -- Результатом будет число наносекунд с запуска. clock = require('clock') print(clock.monotonic64())

source: The processor time. Derived from C function ``clock_gettime(CLOCK_PROCESS_CPUTIME_ID)``. This is the best function to use with benchmarks that need to calculate how much time has been spent within a CPU.
ru: Время процессора. Получено из C-функции ``clock_gettime(CLOCK_PROCESS_CPUTIME_ID)``. Такую функцию лучше всего использовать для эталонного тестирования, где необходимо рассчитать время, затраченное на процессоре.

source: seconds or nanoseconds since processor start.
ru: секунды или наносекунды с момента начала работы процессора.

source: -- This will print nanoseconds in the CPU since the start. clock = require('clock') print(clock.proc64())
ru: -- Результатом будет число наносекунд с запуска процессора. clock = require('clock') print(clock.proc64())

source: The thread time. Derived from C function ``clock_gettime(CLOCK_THREAD_CPUTIME_ID)``. This is the best function to use with benchmarks that need to calculate how much time has been spent within a thread within a CPU.
ru: Рабочее время потока. Получено из C-функции ``clock_gettime(CLOCK_THREAD_CPUTIME_ID)``. Такую функцию лучше всего использовать для эталонного тестирования, где необходимо рассчитать время, затраченное потоком на процессоре.

source: seconds or nanoseconds since the transaction processor thread started.
ru: секунды или наносекунды с момента начала работы потока процессора транзакций.

source: -- This will print seconds in the thread since the start. clock = require('clock') print(clock.thread64())
ru: -- Результатом будет число секунд с момента начала работы потока. clock = require('clock') print(clock.thread64())
