Repository: tarantool/doc
Catalog: locale/*/LC_MESSAGES/doc.po
Languages: ru

source: Integration with IntelliJ IDEA with debugging support. Now you can use IntelliJ IDEA as an IDE to develop and debug Lua applications for Tarantool. See :ref:`Using IDE <app_server-using_ide>`.
ru: Интеграция с IntelliJ IDEA с поддержкой отладки. Появилась возможность использовать IntelliJ IDEA в качестве IDE для разработки и отладки Lua-приложений для Tarantool'а. См. :ref:`Использование IDE <app_server-using_ide>`.

source: Integration with `MobDebug <https://github.com/pkulchenko/MobDebug>`_ remote Lua debugger. Issue `2728 <https://github.com/tarantool/tarantool/issues/2728>`_.
ru: Интеграция с удаленным Lua-отладчиком `MobDebug <https://github.com/pkulchenko/MobDebug>`_. Проблема `2728 <https://github.com/tarantool/tarantool/issues/2728>`_.

source: Configured ``/usr/bin/tarantool`` as an alternative Lua interpreter on Debian/Ubuntu. Issue `2730 <https://github.com/tarantool/tarantool/issues/2730>`_.
ru: Настройка ``/usr/bin/tarantool`` в качестве альтернативного Lua-интерпретатора для Debian/Ubuntu. Проблема `2730 <https://github.com/tarantool/tarantool/issues/2730>`_.

source: New rocks:
ru: Новые сторонние библиотеки:

source: `smtp.client <https://github.com/tarantool/smtp>`_ - support SMTP via ``libcurl``.
ru: `smtp.client <https://github.com/tarantool/smtp>`_ -- поддержка SMTP по ``libcurl``.

source: **Release 1.7.5**
ru: **Версия 1.7.5**

source: Release type: stable. Release date: 2017-08-22. Tag: 1.7.5.
ru: Тип версии: стабильная. Дата выхода: 2017-08-22. Тег: 1.7.5.

source: Announcement: https://github.com/tarantool/doc/issues/289.
ru: Объявление о выходе: https://github.com/tarantool/doc/issues/289.

source: This is a stable release in the 1.7 series. This release resolves more than 160 issues since 1.7.4.
ru: Данная сборка представляет собой стабильную версию в серии 1.7. Это обновление содержит более 160 исправлений по сравнению с версией 1.7.4.

source: Keep track of remote replicas during WAL maintenance. Replication master now automatically preserves xlogs needed for remote replicas. Issue `748 <https://github.com/tarantool/tarantool/issues/748>`_.
ru: Отслеживание удаленных реплик во время обслуживания WAL. Мастер репликации будет автоматически сохранять xlog-файлы, необходимые для удаленных реплик. Проблема `748 <https://github.com/tarantool/tarantool/issues/748>`_.

source: Package manager based on LuaRocks. Use ``tarantoolctl rocks install MODULENAME`` to install MODULENAME Lua module from https://rocks.tarantool.org/. Issue `2067 <https://github.com/tarantool/tarantool/issues/2067>`_.
ru: Менеджер пакетов на основе LuaRocks. Используйте ``tarantoolctl rocks install MODULENAME`` для установки Lua-модуля MODULENAME (имя модуля) из https://rocks.tarantool.org/. Проблема `2067 <https://github.com/tarantool/tarantool/issues/2067>`_.

source: Lua 5.1 command line options. Tarantool binary now supports '-i', '-e', '-m' and '-l' command line options. Issue `1265 <https://github.com/tarantool/tarantool/issues/1265>`_.
ru: Опции командной строки в Lua 5.1. Бинарный протокол Tarantool'а поддерживает опции командной строки: '-i', '-e', '-m' и '-l'. Проблема `1265 <https://github.com/tarantool/tarantool/issues/1265>`_.

source: Experimental GC64 mode for LuaJIT. GC64 mode allow to operate the full address space on 64-bit hosts. Enable via ``-DLUAJIT_ENABLE_GC64=ON compile-time`` configuration option. Issue `2643 <https://github.com/tarantool/tarantool/issues/2643>`_.
ru: Экспериментальный режим GC64 для LuaJIT. Режим GC64 позволяет работать со спейсами с полным адресом на 64-битных хостах. Включить настройку можно с помощью ``-DLUAJIT_ENABLE_GC64=ON compile-time``. Проблема `2643 <https://github.com/tarantool/tarantool/issues/2643>`_.

source: Allowed to create fiber with custom stack size from C API. Issue `2438 <https://github.com/tarantool/tarantool/issues/2438>`_.
ru: Появилась возможность создания файбера с заданным размером стека из API для языка C. Проблема `2438 <https://github.com/tarantool/tarantool/issues/2438>`_.

source: Added ``ipc_cond`` to public C API. Issue `1451 <https://github.com/tarantool/tarantool/issues/1451>`_.
ru: В API для языка C добавлена функция ``ipc_cond``. Проблема `1451 <https://github.com/tarantool/tarantool/issues/1451>`_.

source: `authman <https://github.com/mailru/tarantool-authman>`_ - API for user registration and login in your site using email and social networks.
ru: `authman <https://github.com/mailru/tarantool-authman>`_ - API для регистрации пользователя и входа в систему с использованием email и социальных сетей.

source: `synchronized <https://github.com/tarantool/synchronized>`_ - critical sections for Lua.
ru: `synchronized <https://github.com/tarantool/synchronized>`_ - критические секции для Lua.

source: **Release 1.7.4**
ru: **Версия 1.7.4**

source: Release type: release candidate. Release date: 2017-05-12. Release tag: Tag: 1.7.4.
ru: Тип версии: предварительная версия. Дата выхода: 2017-05-12. Тег версии: 1.7.4.

source: Announcement: https://github.com/tarantool/tarantool/releases/tag/1.7.4 or https://groups.google.com/forum/#!topic/tarantool/3x88ATX9YbY
ru: Объявление о выходе: https://github.com/tarantool/tarantool/releases/tag/1.7.4 или https://groups.google.com/forum/#!topic/tarantool/3x88ATX9YbY

source: This is a release candidate in the 1.7 series. Vinyl Engine, the flagship feature of 1.7.x, is now feature complete.
ru: Данная сборка представляет собой предварительную версию перед выпуском нового релиза в серии 1.7. Движок vinyl, ключевой компонент 1.7.x, обладает полностью реализованной заявленной функциональностью.

source: Incompatible changes
ru: Несовместимые изменения

source: ``box.cfg()`` options were changed to add Vinyl support:
ru: Для поддержки vinyl были внесены следующие изменения в параметры ``box.cfg()``:

source: ``snap_dir`` renamed to ``memtx_dir``
ru: переименование ``snap_dir`` в ``memtx_dir``

source: ``slab_alloc_arena`` (gigabytes) renamed to ``memtx_memory`` (bytes), default value changed from 1Gb to 256MB
ru: переименование ``slab_alloc_arena`` (гигабайты) в ``memtx_memory`` (байты), значение, используемое по умолчанию, изменилось с 1 Гб на 256 МБ

source: ``slab_alloc_minimal`` renamed to ``memtx_min_tuple_size``
ru: переименование ``slab_alloc_minimal`` в ``memtx_min_tuple_size``

source: ``slab_alloc_maximal`` renamed to ``memtx_max_tuple_size``
ru: переименование ``slab_alloc_maximal`` в ``memtx_max_tuple_size``

source: ``slab_alloc_factor`` is deprecated, not relevant in 1.7.x
ru: ``slab_alloc_factor`` больше не используется, не применимо в 1.7.x

source: ``snapshot_count`` renamed to ``checkpoint_count``
ru: переименование ``snapshot_count`` в ``checkpoint_count``

source: ``snapshot_period`` renamed to ``checkpoint_interval``
ru: переименование ``snapshot_period`` в ``checkpoint_interval``

source: ``logger`` renamed to ``log``
ru: переименование ``logger`` в ``log``

source: ``logger_nonblock`` renamed to ``log_nonblock``
ru: переименование ``logger_nonblock`` в ``log_nonblock``

source: ``logger_level`` renamed to ``log_level``
ru: переименование ``logger_level`` в ``log_level``

source: ``replication_source`` renamed to ``replication``
ru: переименование ``replication_source`` в ``replication``

source: ``panic_on_snap_error = true`` and ``panic_on_wal_error = true`` superseded by ``force_recovery = false``
ru: ``panic_on_snap_error = true`` и ``panic_on_wal_error = true`` заменены ``force_recovery = false``

source: Until Tarantool 1.8, you can use deprecated parameters for both initial and runtime configuration, but such usage will print a warning in the server log. Issues `1927 <https://github.com/tarantool/tarantool/issues/1927>`_ and `2042 <https://github.com/tarantool/tarantool/issues/2042>`_.
ru: В версиях Tarantool'а до 1.8 можно использовать устаревшие параметры как для начальной, так и для рабочей конфигурации, но в таком случае система запишет сообщение предупреждения в журнал сервера. Проблемы `1927 <https://github.com/tarantool/tarantool/issues/1927>`_ и `2042 <https://github.com/tarantool/tarantool/issues/2042>`_.

source: Hot standy mode is now off by default. Tarantool automatically detects another running instance in the same ``wal_dir`` and refuses to start. Use ``box.cfg {hot_standby = true}`` to enable the hot standby mode. Issue `775 <https://github.com/tarantool/tarantool/issues/775>`_.
ru: Режим hot standby (горячее резервирование) по умолчанию будет отключен. Tarantool автоматически находит еще один запущенный экземпляр в той же директории ``wal_dir`` и откажется запускаться. Используйте ``box.cfg {hot_standby = true}`` для включения режима hot standby. Проблема `775 <https://github.com/tarantool/tarantool/issues/775>`_.

source: UPSERT via a secondary key was banned to avoid unclear semantics. Issue `2226 <https://github.com/tarantool/tarantool/issues/2226>`_.
ru: Операция UPSERT по вторичному ключу запрещена во избежание неопределенности семантики. Проблема `2226 <https://github.com/tarantool/tarantool/issues/2226>`_.

source: Added ``box.info.replication[instance_id].downstream.vclock`` to display the last sent row to remote replica.
ru: Добавление ``box.info.replication[instance_id].downstream.vclock`` для отображения последней строки, отправленной на удаленную реплику.

source: Added ``box.info.replication[instance_id].id``.
ru: Добавление ``box.info.replication[instance_id].id``.

source: Added ``box.info.replication[instance_id].lsn``.
ru: Добавление ``box.info.replication[instance_id].lsn``.

source: Moved ``box.info.replication[instance_id].{vclock,status,error}`` to ``box.info.replication[instance_id].upstream.{vclock,status,error}``.
ru: Перемещение ``box.info.replication[instance_id].{vclock,status,error}`` в ``box.info.replication[instance_id].upstream.{vclock,status,error}``.

source: All registered replicas from ``box.space._cluster`` are included to ``box.info.replication`` output.
ru: Включение всех зарегистрированных реплик из ``box.space._cluster`` в вывод ``box.info.replication``.

source: ``box.info.server.id`` renamed ``box.info.id``
ru: Переименование ``box.info.server.id`` в ``box.info.id``

source: ``box.info.server.lsn`` renamed ``box.info.lsn``
ru: Переименование ``box.info.server.lsn`` в ``box.info.lsn``

source: ``box.info.server.uuid`` renamed ``box.info.uuid``
ru: Переименование ``box.info.server.uuid`` в ``box.info.uuid``

source: ``box.info.cluster.signature`` renamed to ``box.info.signature``
ru: Переименование ``box.info.cluster.signature`` в ``box.info.signature``

source: ``box.info.id`` and ``box.info.lsn`` now return `nil` instead of `-1` during initial cluster bootstrap.
ru: Возврат значения `nil` вместо `-1` функциями ``box.info.id`` и ``box.info.lsn`` во время начальной настройки кластера.

source: ``net.box``: added per-request options to all requests:
ru: ``net.box``: добавление запрошенные параметров во все запросы:

source: ``conn.call(func_name, arg1, arg2,...)`` changed to ``conn.call(func_name, {arg1, arg2, ...}, opts)``
ru: изменение ``conn.call(func_name, arg1, arg2,...)`` на ``conn.call(func_name, {arg1, arg2, ...}, opts)``

source: ``conn.eval(func_name, arg1, arg2,...)`` changed to ``conn.eval(func_name, {arg1, arg2, ...}, opts)``
ru: изменение ``conn.eval(func_name, arg1, arg2,...)`` на ``conn.eval(func_name, {arg1, arg2, ...}, opts)``

source: All requests now support ``timeout = <seconds>``, ``buffer = <ibuf>`` options.
ru: Все запросы поддерживают параметры ``timeout = <seconds>``(время задержки в секундах), ``buffer = <ibuf>`` (буфер).

source: Added ``connect_timeout`` option to ``netbox.connect()``.
ru: Добавление опции ``connect_timeout`` в ``netbox.connect()``.

source: ``netbox:timeout()`` and ``conn:timeout()`` are now deprecated. Use ``netbox.connect(host, port, { call_16 = true })`` for 1.6.x-compatible behavior. Issue `2195 <https://github.com/tarantool/tarantool/issues/2195>`_.
ru: ``netbox:timeout()`` и ``conn:timeout()`` объявлены устаревшими. Используйте ``netbox.connect(host, port, { call_16 = true })``, чтобы получить поведение как в 1.6.x. Проблема `2195 <https://github.com/tarantool/tarantool/issues/2195>`_.

source: systemd configuration changed to support ``Type=Notify`` / ``sd_notify()``. Now ``systemctl start tarantool@INSTANCE`` will wait until Tarantool has started and recovered from xlogs. The recovery status is reported to ``systemctl status tarantool@INSTANCE``. Issue `1923 <https://github.com/tarantool/tarantool/issues/1923>`_.
ru: Конфигурация systemd будет поддерживать ``Type=Notify`` / ``sd_notify()``. ``systemctl start tarantool@ЭКЗЕМПЛЯР`` будет ожидать, пока Tarantool не запустится и не восстановится из xlog-файлов. Статус восстановления передается в ``systemctl status tarantool@ЭКЗЕМПЛЯР``. Проблема `1923 <https://github.com/tarantool/tarantool/issues/1923>`_.

source: ``log`` module now doesn't prefix all messages with the full path to tarantool binary when used without ``box.cfg()``. Issue `1876 <https://github.com/tarantool/tarantool/issues/1876>`_.
ru: Модуль ``log`` не будет присоединять ко всем сообщениям полный путь к бинарному файлу при использовании без ``box.cfg()``. Проблема `1876 <https://github.com/tarantool/tarantool/issues/1876>`_.

source: ``require('log').logger_pid()`` was renamed to ``require('log').pid()``. Issue `2917 <https://github.com/tarantool/tarantool/issues/2917>`_.
ru: Переименование ``require('log').logger_pid()`` в ``require('log').pid()``. Проблема `2917 <https://github.com/tarantool/tarantool/issues/2917>`_.

source: ``luaL_reg`` removed in favor of ``luaL_Reg``
ru: ``luaL_Reg`` заменяет удаленный ``luaL_reg``

source: ``luaL_getn(L, i)`` removed in favor of ``lua_objlen(L, i)``
ru: ``lua_objlen(L, i)`` заменяет удаленный ``luaL_getn(L, i)``

source: ``luaL_setn(L, i, j)`` removed (was no-op)
ru: Удаление ``luaL_setn(L, i, j)`` (пустая операция)

source: ``lua_ref(L, lock)`` removed in favor of ``luaL_ref(L, lock)``
ru: ``luaL_ref(L, lock)`` заменяет удаленный ``lua_ref(L, lock)``

source: ``lua_getref(L,ref)`` removed in favor of ``lua_rawgeti(L, LUA_REGISTRYINDEX, (ref))``
ru: ``lua_rawgeti(L, LUA_REGISTRYINDEX, (ref))`` заменяет удаленный ``lua_getref(L,ref)``

source: ``lua_unref(L, ref)`` removed in favor of ``luaL_unref(L, ref)``
ru: ``luaL_unref(L, ref)`` заменяет удаленный ``lua_unref(L, ref)``.

source: ``math.mod()`` removed in favor of ``math.fmod()``
ru: ``math.fmod()`` заменяет удаленный ``math.mod()``

source: ``string.gfind()`` removed in favor of ``string.gmatch()``
ru: ``string.gmatch()`` заменяет удаленный ``string.gfind()``

source: (Vinyl) multi-level compaction. The compaction scheduler now groups runs of the same range into levels to reduce the write amplification during compaction. This design allows Vinyl to support 1:100+ ram:disk use-cases. Issue `1821 <https://github.com/tarantool/tarantool/issues/1821>`_.
ru: (Vinyl) многоуровневое слияние. Планировщик слияния будет группировать забеги одного диапазона в уровни, чтобы снизить "паразитную" запись во время слияния. Новая функция позволит Vinyl'у поддерживать сценарии 1:100+ оперативная память:диск. Проблема `1821 <https://github.com/tarantool/tarantool/issues/1821>`_.

source: (Vinyl) bloom filters for sorted runs. Bloom filter is a probabilistic data structure which can be used to test whether a requested key is present in a run file without reading the actual file from the disk. Bloom filter may have false-positive matches but false-negative matches are impossible. This feature reduces the number of seeks needed for random lookups and speeds up REPLACE/DELETE with enabled secondary keys. Issue `1919 <https://github.com/tarantool/tarantool/issues/1919>`_.
ru: (Vinyl) Фильтры Блума для отсортированных забегов. Фильтр Блума -- это вероятностная структура данных, которую можно использовать для проверки наличия необходимого ключа в файле забега без считывания самого файла с диска. Фильтр Блума может выдавать ложноположительное срабатывание (элемента в множестве нет, но структура данных сообщает, что он есть), но не ложноотрицательное. Данная функция уменьшает объем поиска, необходимый для случайного просмотра, и ускоряет операции REPLACE/DELETE with enabled secondary keys. Проблема `1919 <https://github.com/tarantool/tarantool/issues/1919>`_.

source: (Vinyl) key-level cache for point lookups and range queries. Vinyl storage engine caches selected keys and key ranges instead of entire disk pages like in traditional databases. This approach is more efficient because the cache is not polluted with raw disk data. Issue `1692 <https://github.com/tarantool/tarantool/issues/1692>`_.
ru: (Vinyl) кэш на уровне ключей для поиска точек и запросов по диапазону. Движок базы данных Vinyl кэширует выбранные ключи и диапазоны ключей вместо страниц диска полностью, как в традиционных базах данных. Такой подход более эффективен, поскольку кэш не заполнен сырыми данными. Проблема `1692 <https://github.com/tarantool/tarantool/issues/1692>`_.

source: (Vinyl) implemented the common memory level for in-memory indexes. Now all in-memory indexes of a space store pointers to the same tuples instead of cached secondary key index data. This feature significantly reduces the memory footprint in case of secondary keys. Issue `1908 <https://github.com/tarantool/tarantool/issues/1908>`_.
ru: (Vinyl) внедрение уровня общей памяти для in-memory индексов. Все in-memory индексы спейса будут хранить указатели на одни и те же кортежи, вместо закэшированных данных вторичного индекса. Данная функция значительно уменьшает объем необходимой памяти в случае вторичных ключей. Проблема `1908 <https://github.com/tarantool/tarantool/issues/1908>`_.

source: (Vinyl) new implementation of initial state transfer of JOIN command in replication protocol. New replication protocol fixes problems with consistency and secondary keys. We implemented a special kind of low-cost database-wide read-view to avoid dirty reads in JOIN procedure. This trick wasn't not possible in traditional B-Tree based databases. Issue `2001 <https://github.com/tarantool/tarantool/issues/2001>`_.
ru: (Vinyl) новая реализация передачи начального состояния JOIN-команды в протоколе репликации. Новый протокол репликации исправляет проблемы с согласованностью и вторичными ключами. Мы внедрили специальный вид просмотра по всей базе данных с небольшой нагрузкой, чтобы избежать неподтвержденного чтения в JOIN-процедуре. В традиционных базах данных на основе B-Tree такое не представляется возможным. Проблема `2001 <https://github.com/tarantool/tarantool/issues/2001>`_.

source: (Vinyl) index-wide mems/runs. Removed ranges from in-memory and and the stop layer of LSM tree on disk. Issue `2209 <https://github.com/tarantool/tarantool/issues/2209>`_.
ru: (Vinyl) забеги по всему индексу. Удалены диапазоны из оперативной памяти и уровень LSM-дерева на диске. Проблема `2209 <https://github.com/tarantool/tarantool/issues/2209>`_.

source: (Vinyl) coalesce small ranges. Before dumping or compacting a range, consider coalescing it with its neighbors. Issue `1735 <https://github.com/tarantool/tarantool/issues/1735>`_.
ru: (Vinyl) объединение небольших диапазонов. Перед созданием дампа или слиянием диапазона рассмотрите возможность объединения его с соседними диапазонами. Проблема `1735 <https://github.com/tarantool/tarantool/issues/1735>`_.

source: (Vinyl) implemented transnational journal for metadata. Now information about all Vinyl files is logged in a special ``.vylog`` file. Issue `1967 <https://github.com/tarantool/tarantool/issues/1967>`_.
ru: (Vinyl) внедрен многосторонний журнал для метаданных. Информация о всех Vinyl-файлах будет записываться в специальный ``.vylog``-файл. Проблема `1967 <https://github.com/tarantool/tarantool/issues/1967>`_.

source: (Vinyl) implemented consistent secondary keys. Issue `2410 <https://github.com/tarantool/tarantool/issues/2410>`_.
ru: (Vinyl) появились постоянные вторичные ключи. Проблема `2410 <https://github.com/tarantool/tarantool/issues/2410>`_.

source: (Vinyl) added statistics for background workers to ``box.info.vinyl()``. Issue `2005 <https://github.com/tarantool/tarantool/issues/2005>`_.
ru: (Vinyl) добавлена статистика для фоновых рабочих процессов в ``box.info.vinyl()``. Проблема `2005 <https://github.com/tarantool/tarantool/issues/2005>`_.

source: (Memtx+Vinyl) reduced the memory footprint for indexes which keys are sequential and start from the first field. This optimization was necessary for secondary keys in Vinyl, but we optimized Memtx as well. Issue `2046 <https://github.com/tarantool/tarantool/issues/2046>`_.
ru: (Memtx+Vinyl) уменьшен объем необходимой памяти для индексов с последовательными ключами, которые начинаются с первого поля. Такая оптимизация была необходима для вторичных ключей в Vinyl'е, но мы также оптимизировали Memtx. Проблема `2046 <https://github.com/tarantool/tarantool/issues/2046>`_.

source: Added JIT compiler backend for ARM64
ru: Добавлен бэкенд для JIT-компилятора для архитектуры ARM64

source: Added JIT compiler backend and interpreter for MIPS64
ru: Добавлен бэкенд и интерпретатор для JIT-компилятора для архитектуры MIPS64

source: Added some more Lua 5.2 and Lua 5.3 extensions
ru: Добавлены некоторые расширения для Lua 5.2 и Lua 5.3

source: Fixed several bugs
ru: Исправление нескольких ошибок

source: Removed Lua 5.0 legacy (see incompatible changes above).
ru: Удалены устаревшие функции Lua 5.0 (см. несовместимые изменения выше).

source: Enabled a new smart string hashing algorithm in LuaJIT to avoid significant slowdown when a lot of collisions are generated. Contributed by Yury Sokolov (@funny-falcon) and Nick Zavaritsky (@mejedi). See https://github.com/tarantool/luajit/pull/2.
ru: Запущен новый умный алгоритм хеширования строк в LuaJIT, чтобы избежать замедления работы в случае множества столкновений. Разработали Юрий Соколов (@funny-falcon) и Ник Заварицкий (@mejedi). См. https://github.com/tarantool/luajit/pull/2.

source: ``box.snapshot()`` now updates mtime of a snapshot file if there were no changes to the database since the last snapshot. Issue `2045 <https://github.com/tarantool/tarantl/issues/2045>`_.
ru: ``box.snapshot()`` теперь обновляет время mtime в файле снимка, если не было изменений в базе данных с момента последнего снимка. Проблема `2045 <https://github.com/tarantool/tarantl/issues/2045>`_.

source: Implemented ``space:bsize()`` to return the memory size utilized by all tuples of the space. Contributed by Roman Tokarev (@rtokarev). Issue `2043 <https://github.com/tarantool/tarantool/issues/2043>`_.
ru: Внедрена функция ``space:bsize()`` для возврата объема памяти, занятого всеми кортежами спейса. Разработал Роман Токарев (@rtokarev). Проблема `2043 <https://github.com/tarantool/tarantool/issues/2043>`_.

source: Exported new Lua/C functions to public API:
ru: Новые функции Lua/C вынесены в общедоступный API:

source: ``luaT_pushtuple``, ``luaT_istuple`` (issue `1878 <https://github.com/tarantool/tarantool/issues/1878>`_)
ru: ``luaT_pushtuple``, ``luaT_istuple`` (проблема `1878 <https://github.com/tarantool/tarantool/issues/1878>`_)

source: ``luaT_error``, ``luaT_call``, ``luaT_cpcall`` (issue `2291 <https://github.com/tarantool/tarantool/issues/2291>`_)
ru: ``luaT_error``, ``luaT_call``, ``luaT_cpcall`` (проблема `2291 <https://github.com/tarantool/tarantool/issues/2291>`_)

source: ``luaT_state`` (issue `2416 <https://github.com/tarantool/tarantool/issues/2416>`_)
ru: ``luaT_state`` (проблема `2416 <https://github.com/tarantool/tarantool/issues/2416>`_)
