Repository: tarantool/doc
Catalog: locale/*/LC_MESSAGES/doc.po
Languages: ru

source: Please don’t be confused with ``Lua`` plugin, which is less powerful than ``EmmyLua``.
ru: Не путайте с плагином ``Lua``, у которого меньше возможностей, чем у ``EmmyLua``.

source: Restart IntelliJ IDEA.
ru: Перезапустите IntelliJ IDEA.

source: Click ``Configure``, select ``Project Defaults`` and then ``Run Configurations``.
ru: Нажмите ``Configure``, выберите ``Project Defaults``, а затем ``Run Configurations``.

source: Find ``Lua Application`` in the sidebar at the left.
ru: Найдите ``Lua Application`` в боковой панели слева.

source: In ``Program``, type a path to an installed ``tarantool`` binary.
ru: В ``Program`` введите путь к установленному бинарному файлу ``tarantool``.

source: By default, this is ``tarantool`` or ``/usr/bin/tarantool`` on most platforms.
ru: По умолчанию, это ``tarantool`` или ``/usr/bin/tarantool`` на большинстве платформ.

source: If you installed ``tarantool`` from sources to a custom directory, please specify the proper path here.
ru: Если вы установили ``tarantool`` из источников в другую директорию, укажите здесь правильный путь.

source: Now IntelliJ IDEA is ready to use with Tarantool.
ru: Теперь IntelliJ IDEA можно использовать с Tarantool'ом.

source: Create a new Lua project.
ru: Создайте новый проект на Lua.

source: Add a new Lua file, for example ``init.lua``.
ru: Добавьте новый Lua-файл, например, ``init.lua``.

source: Write your code, save the file.
ru: Разработайте код, сохраните файл.

source: To run you application, click ``Run -> Run`` in the main menu and select your source file in the list.
ru: Чтобы запустить приложение, нажмите ``Run -> Run`` в основном меню и выберите исходный файл из списка.

source: Or click ``Run -> Debug`` to start debugging.
ru: Или нажмите ``Run -> Debug`` для начала отладки.

source: To use Lua debugger, please upgrade Tarantool to version 1.7.5-29-gbb6170e4b or later.
ru: Чтобы использовать Lua-отладчик, обновите Tarantool до версии 1.7.5-29-gbb6170e4b или более поздней версии.

source: Transaction control
ru: Контроль транзакций

source: Transactions in Tarantool occur in **fibers** on a single **thread**. That is why Tarantool has a guarantee of execution atomicity. That requires emphasis.
ru: Транзакции в Tarantool'е происходят в **файберах** в одном **потоке**. Вот почему Tarantool дает гарантию атомарности выполнения. На этом следует сделать акцент.

source: Threads, fibers and yields
ru: Потоки, файберы и передача управления

source: How does Tarantool process a basic operation? As an example, let's take this query:
ru: Как Tarantool выполняет основные операции? Для примера возьмем такой запрос:

source: This is equivalent to the following SQL statement for a table that stores primary keys in ``field[1]``:
ru: Это эквивалентно следующему SQL-выражению (оно работает с таблицей, где первичные ключи в ``field[1]``):

source: This query will be processed with three operating system **threads**:
ru: Этот запрос будет обработан тремя **потоками** операционной системы:

source: If we issue the query on a remote client, then the **network thread** on the server side receives the query, parses the statement and changes it to a server executable message which has already been checked, and which the server instance can understand without parsing everything again.
ru: Если мы передадим запрос на удаленный клиент, **сетевой поток** на стороне сервера получит запрос, разберет выражение и преобразует его в выполняемое сообщение сервера, которое уже проверено. Такое сообщение экземпляр сервера может понимать без повторного разбора.

source: The network thread ships this message to the instance's **"transaction processor" thread** using a lock-free message bus. Lua programs execute directly in the transaction processor thread, and do not require parsing and preparation.
ru: Сетевой поток отправляет это сообщение в **поток "обработки транзакций"** с помощью шины передачи сообщений без блокировок. Lua-программы выполняются непосредственно в потоке обработки транзакций и не требуют разбора и подготовки.

source: The instance's transaction processor thread uses the primary-key index on field[1] to find the location of the tuple. It determines that the tuple can be updated (not much can go wrong when you're merely changing an unindexed field value to something shorter).
ru: Поток обработки транзакций экземпляра использует индекс на поле первичного ключа field[1], чтобы найти нужный кортеж. Он проверяет, что данный кортеж можно обновить (мы хотим лишь изменить значение не индексированного поля на более короткое, и вряд ли что-то пойдет не так).

source: The transaction processor thread sends a message to the :ref:`write-ahead logging (WAL) thread <internals-wal>` to commit the transaction. When done, the WAL thread replies with a COMMIT or ROLLBACK result, which is returned to the client.
ru: Поток обработки транзакций отправляет сообщение в :ref:`поток упреждающей записи в журнал (WAL) <internals-wal>` для коммита транзакции. По завершении поток WAL отправляет ответ с результатом COMMIT (коммит) или ROLLBACK (откат) на клиент.

source: Notice that there is only one transaction processor thread in Tarantool. Some people are used to the idea that there can be multiple threads operating on the database, with (say) thread #1 reading row #x, while thread #2 writes row #y. With Tarantool, no such thing ever happens. Only the transaction processor thread can access the database, and there is only one transaction processor thread for each Tarantool instance.
ru: Обратите внимание, что в Tarantool'е есть только один поток обработки транзакций. Некоторые уже привыкли к мысли, что потоков для обработки данных в базе данных может быть много (например, поток №1 читает данные из строки №x, в то время как поток №2 записывает данные в столбец №y). В случае с Tarantool'ом такого не происходит. Доступ к базе есть только у потока обработки транзакций, и на каждый экземпляр Tarantool'а есть только один такой поток.

source: Like any other Tarantool thread, the transaction processor thread can handle many :ref:`fibers <fiber-fibers>`. A fiber is a set of computer instructions that may contain "**yield**" signals. The transaction processor thread will execute all computer instructions until a yield, then switch to execute the instructions of a different fiber. Thus (say) the thread reads row #x for the sake of fiber #1, then writes row #y for the sake of fiber #2.
ru: Как и любой другой поток Tarantool'а, поток обработки транзакций может управлять множеством :ref:`файберов <fiber-fibers>`. Файбер -- это набор команд, среди которых могут быть и сигналы "**передачи управления**". Поток обработки транзакций выполняет все команды, пока не увидит такой сигнал, и тогда он переключается на выполнение команд из другого файбера. Например, таким образом поток обработки транзакций сначала выполняет чтение данных из строки №x для файбера №1, а затем выполняет запись в строку №y для файбера №2.

source: Yields must happen, otherwise the transaction processor thread would stick permanently on the same fiber. There are two types of yields:
ru: Передача управления необходима, в противном случае, поток обработки транзакции заклинит на одном файбере. Есть два типа передачи управления:

source: :ref:`implicit yields <atomic-implicit-yields>`: every data-change operation or network-access causes an implicit yield, and every statement that goes through the Tarantool client causes an implicit yield.
ru: :ref:`неявная передача управления <atomic-implicit-yields>`: каждая операция по изменению данных или доступ к сети вызывают неявную передачу управления, а также каждое выражение, которое проходит через клиент Tarantool'а, вызывает неявную передачу управления.

source: explicit yields: in a Lua function, you can (and should) add :ref:`"yield" <fiber-yield>` statements to prevent hogging. This is called **cooperative multitasking**.
ru: явная передача управления: в Lua-функции можно (и нужно) добавить выражения :ref:`"передачи управления" <fiber-yield>` для предотвращения захвата ЦП. Это называется **кооперативной многозадачностью**.

source: Cooperative multitasking
ru: Кооперативная многозадачность

source: Cooperative multitasking means: unless a running fiber deliberately yields control, it is not preempted by some other fiber. But a running fiber will deliberately yield when it encounters a “yield point”: a transaction commit, an operating system call, or an explicit :ref:`"yield" <fiber-yield>` request. Any system call which can block will be performed asynchronously, and any running fiber which must wait for a system call will be preempted, so that another ready-to-run fiber takes its place and becomes the new running fiber.
ru: Кооперативная многозадачность означает, что если запущенный файбер намеренно не передаст управление, он не вытесняется каким-либо другим файбером. Но запущенный файбер намеренно передает управление, когда обнаруживает “точку передачи управления”: коммит транзакции, вызов операционной системы или запрос явной :ref:`"передачи управления" <fiber-yield>`. Любой вызов системы, который может блокировать файбер, будет производиться асинхронно, а запущенный файбер, который должен ожидать системного вызова, будет вытеснен так, что другой готовый к работе файбер занимает его место и становится запущенным файбером.

source: This model makes all programmatic locks unnecessary: cooperative multitasking ensures that there will be no concurrency around a resource, no race conditions, and no memory consistency issues.
ru: Эта модель исключает необходимость любых программных блокировок -- кооперативная многозадачность обеспечивает отсутствие многопоточности вокруг ресурса, состояния гонки и проблем с согласованностью данных.

source: When requests are small, for example simple UPDATE or INSERT or DELETE or SELECT, fiber scheduling is fair: it takes only a little time to process the request, schedule a disk write, and yield to a fiber serving the next client.
ru: При небольших запросах, таких как простые UPDATE, INSERT, DELETE или SELECT, происходит справедливое планирование файберов: немного времени требуется на обработку запроса, планирование записи на диск и передачу управления на файбер, обслуживающий следующего клиента.

source: However, a function might perform complex computations or might be written in such a way that yields do not occur for a long time. This can lead to unfair scheduling, when a single client throttles the rest of the system, or to apparent stalls in request processing. Avoiding this situation is the responsibility of the function’s author.
ru: Однако функция может выполнять сложные расчеты или может быть написана так, что управление не передается в течение длительного времени. Это может привести к несправедливому планированию, когда отдельный клиент перекрывает работу остальной системы, или к явным задержкам в обработке запросов. Автору функции следует не допускать таких ситуаций.

source: Transactions
ru: Транзакции

source: In the absence of transactions, any function that contains yield points may see changes in the database state caused by fibers that preempt. Multi-statement transactions exist to provide **isolation**: each transaction sees a consistent database state and commits all its changes atomically. At :ref:`commit <box-commit>` time, a yield happens and all transaction changes are written to the :ref:`write ahead log <internals-wal>` in a single batch. Or, if needed, transaction changes can be rolled back -- :ref:`completely <box-rollback>` or to a specific :ref:`savepoint <box-rollback_to_savepoint>`.
ru: В отсутствие транзакций любая функция, в которой есть точки передачи управления, может видеть изменения в состоянии базы данных, вызванные вытесняющими файберами. Составные транзакции предназначены для **изоляции**: каждая транзакция видит постоянное состояние базы данных и делает атомарные коммиты изменений. Во время :ref:`коммита <box-commit>` происходит передача управления, а все транзакционные изменения записываются в :ref:`журнал упреждающей записи <internals-wal>` в отдельный пакет. Или, при необходимости, можно откатить изменения -- :ref:`полностью <box-rollback>` или на определенную :ref:`точку сохранения <box-rollback_to_savepoint>`.

source: To implement isolation, Tarantool uses a simple optimistic scheduler: the first transaction to commit wins. If a concurrent active transaction has read a value modified by a committed transaction, it is aborted.
ru: Чтобы осуществить изоляцию, Tarantool использует простой планировщик с оптимистичным управлением: транзакция подтверждена первой -- выигрывает. Если параллельная активная транзакция читает значение, измененное подтвержденной транзакцией, она прерывается.

source: The cooperative scheduler ensures that, in absence of yields, a multi-statement transaction is not preempted and hence is never aborted. Therefore, understanding yields is essential to writing abort-free code.
ru: Кооперативный планировщик обеспечивает, что в отсутствие передачи управления составная транзакция не вытесняется, поэтому никогда не прерывается. Таким образом, понимание передачи управления необходимо для написания кода без прерываний.

source: You can’t mix storage engines in a transaction today.
ru: На сегодняшний день нельзя смешивать движки базы данных в транзакции.

source: Implicit yields
ru: Правила неявной передачи управления

source: The only explicit yield requests in Tarantool are :ref:`fiber.sleep() <fiber-sleep>` and :ref:`fiber.yield() <fiber-yield>`, but many other requests "imply" yields because Tarantool is designed to avoid blocking.
ru: Единственные запросы явной передачи данных в Tarantool'е отправляют :ref:`fiber.sleep() <fiber-sleep>` и :ref:`fiber.yield() <fiber-yield>`, но многие другие запросы "неявно" подразумевают передачу управления, поскольку цель Tarantool'а -- избежать блокировок.

source: Database operations usually do not yield, but it depends on the engine:
ru: Операции по изменению базы данных обычно не передают управление, но это зависит от движка:

source: In memtx, reads or writes do not require I/O and do not yield.
ru: В memtx'е чтение и запись не требуют ввода-вывода и не передают управление.

source: In vinyl, not all data is in memory, and SELECT often incurs a disc I/O, and therefore yields, while a write may stall waiting for memory to free up, thus also causing a yield.
ru: В vinyl'е не все данные находятся в оперативной памяти, и запрос SELECT часто подразумевает дисковый ввод-вывод и, следовательно, передачу управления, пока запись ожидает освобождения памяти, что также вызывает передачу управления.

source: In the "autocommit" mode, all data change operations are followed by an automatic commit, which yields. So does an explicit commit of a multi-statement transaction, :ref:`box.commit() <box-commit>`.
ru: В режиме "автокоммита" все операции по изменению данных сопровождаются автоматическим коммитом, который передает управление. Также передает управление явный коммит составной транзакции :ref:`box.commit() <box-commit>`.

source: Many functions in modules :ref:`fio <fio-section>`, :ref:`net_box <net_box-module>`, :ref:`console <console-module>` and :ref:`socket <socket-module>` (the "os" and "network" requests) yield.
ru: Многие функции в модулях :ref:`fio <fio-section>`, :ref:`net_box <net_box-module>`, :ref:`console <console-module>` и :ref:`socket <socket-module>` (запросы "ОС" и "сети") передают управление.

source: **Example #1**
ru: **Пример №1**

source: *Engine = memtx* |br| ``select() insert()`` has one yield, at the end of insertion, caused by implicit commit; ``select()`` has nothing to write to the WAL and so does not yield.
ru: *Движок = memtx* |br| В ``select() insert()`` управление передается один раз в конце вставки, что вызвано неявным коммитом; ``select()`` ничего не записывает в WAL-файл, поэтому не передает управление.

source: *Engine = vinyl* |br| ``select() insert()`` has between one and three yields, since ``select()`` may yield if the data is not in cache, ``insert()`` may yield waiting for available memory, and there is an implicit yield at commit.
ru: *Движок = vinyl* |br| В ``select() insert()`` управление передается от одного до трех раз, поскольку ``select()`` может передавать управление, если данные не находятся в кэше, ``insert()`` может передавать управление в ожидании свободной памяти, а при коммите управление передается неявно.

source: The sequence ``begin() insert() insert() commit()`` yields only at commit if the engine is memtx, and can yield up to 3 times if the engine is vinyl.
ru: Последовательность ``begin() insert() insert() commit()`` передает управление только при коммите, если движок -- memtx, и может передавать управление до 3 раз, если движок -- vinyl.

source: **Example #2**
ru: **Пример №2**

source: Assume that in space ‘tester’ there are tuples in which the third field represents a positive dollar amount. Let's start a transaction, withdraw from tuple#1, deposit in tuple#2, and end the transaction, making its effects permanent.
ru: Предположим, что в спейсе ‘tester’ существуют кортежи, третье поле которых представляет собой положительную сумму в долларах. Начнем транзакцию, снимем сумму из кортежа №1, внесем ее в кортеж №2 и завершим транзакцию, подтверждая изменения.

source: If :ref:`wal_mode <cfg_binary_logging_snapshots-wal_mode>` = ‘none’, then implicit yielding at commit time does not take place, because there are no writes to the WAL.
ru: Если :ref:`wal_mode <cfg_binary_logging_snapshots-wal_mode>` = ‘none’, то при коммите управление не передается неявно, потому что не идет запись в WAL-файл.

source: If a task is interactive -- sending requests to the server and receiving responses -- then it involves network IO, and therefore there is an implicit yield, even if the request that is sent to the server is not itself an implicit yield request. Therefore, the sequence:
ru: Если задача интерактивная -- отправка запроса на сервер и получение ответа -- то она включает в себя сетевой ввод-вывод, поэтому наблюдается неявная передача управления, даже если отправляемый на сервер запрос не представляет собой запрос с неявной передачей управления. Таким образом, последовательность:

source: causes blocking (in memtx), if it is inside a function or Lua program being executed on the server instance, but causes yielding (in both memtx and vinyl) if it is done as a series of transmissions from a client, including a client which operates via telnet, via one of the connectors, or via the :ref:`MySQL and PostgreSQL rocks <dbms_modules>`, or via the interactive mode when :ref:`using Tarantool as a client <admin-using_tarantool_as_a_client>`.
ru: приводит к блокировке (в memtx'е), если находится внутри функции или Lua-программы, которая выполняется на экземпляре сервера. Однако она вызывает передачу управления (и в memtx'е, и в vinyl'е), если выполняется как серия передач от клиента, включая клиентов, работающих по telnet, по одному из коннекторов или :ref:`модулей MySQL и PostgreSQL <dbms_modules>` или в интерактивном режиме при :ref:`использовании Tarantool'а как клиента <admin-using_tarantool_as_a_client>`.

source: After a fiber has yielded and then has regained control, it immediately issues :ref:`testcancel <fiber-testcancel>`.
ru: После того, как файбер передал управление, а затем вернул его, он незамедлительно вызывает :ref:`testcancel <fiber-testcancel>`.

source: Access control
ru: Управление доступом

source: In a nutshell:
ru: Общая информация:

source: There is a method to guarantee with password checks that users really are who they say they are (“authentication”).
ru: Существует метод, который с помощью паролей проверяет, что пользователи являются теми, за кого себя выдают (“аутентификация”).

source: There is a :ref:`_user <box_space-user>` system space, where usernames and password-hashes are stored.
ru: Существует системный спейс :ref:`_user <box_space-user>`, где хранятся имена пользователей и хеши паролей.

source: There are functions for saying that certain users are allowed to do certain things (“privileges”).
ru: Существуют функции, чтобы дать определенным пользователям право совершать определенные действия (“права”).

source: There is a :ref:`_priv <box_space-priv>` system space, where privileges are stored. Whenever a user tries to do an operation, there is a check whether the user has the privilege to do the operation (“access control”).
ru: Существует системный спейс :ref:`_priv <box_space-priv>`, где хранятся права. Когда пользователь пытается выполнить операцию, проводится проверка на наличие у него прав на выполнение такой операции (“управление доступом”).

source: Further on, we explain all of this in more detail.
ru: Далее рассмотрим эти пункты более подробно.

source: Users
ru: Пользователи

source: There is a **current user** for any program working with Tarantool, local or remote. If a remote connection is using a :ref:`binary port <admin-security>`, the current user, by default, is '**guest**'. If the connection is using an :ref:`admin-console port <admin-security>`, the current user is '**admin**'. When executing a :ref:`Lua initialization script <index-init_label>`, the current user is also ‘admin’.
ru: Для любой локальной или удаленной программы, работающей с Tarantool'ом, есть **текущий пользователь**. Если удаленное соединение использует :ref:`бинарный порт <admin-security>`, то текущим пользователем, по умолчанию, будет '**guest**' (гость). Если соединение использует :ref:`порт для административной консоли <admin-security>`, текущим пользователем будет '**admin**' (администратор). При выполнении :ref:`скрипта инициализации на Lua <index-init_label>`, текущим пользователем также будет ‘admin’.

source: The current user name can be found with :ref:`box.session.user() <box_session-user>`.
ru: Имя текущего пользователя можно узнать с помощью :ref:`box.session.user() <box_session-user>`.

source: The current user can be changed:
ru: Текущего пользователя можно изменить:

source: For an admin-console connection and in a Lua initialization script -- with :ref:`box.session.su <box_session-su>`;
ru: Для соединения по порту для административной консоли и при выполнении скрипта инициализации на Lua -- с помощью :ref:`box.session.su <box_session-su>`;

source: Passwords
ru: Пароли

source: Each user (except 'guest') may have a **password**. The password is any alphanumeric string.
ru: У каждого пользователя (за исключением гостя 'guest') может быть **пароль**. Паролем является любая буквенно-цифровая строка.
