Repository: tarantool/doc
Catalog: locale/*/LC_MESSAGES/doc.po
Languages: ru

source: :ref:`csv.iterate() <csv-iterate>` is the low level of :ref:`csv.load() <csv-load>` and :ref:`csv.dump() <csv-dump>`. To illustrate that, here is a function which is the same as the :ref:`csv.load() <csv-load>` function, as seen in `the Tarantool source code`_.
ru: :ref:`csv.iterate() <csv-iterate>` -- это :ref:`csv.load() <csv-load>` и :ref:`csv.dump() <csv-dump>` низкого уровня. Чтобы это доказать, используем функцию, которая совпадает с функцией :ref:`csv.load() <csv-load>`, как можно увидеть в исходном коде Tarantool'а (`the Tarantool source code`_).

source: Debug facilities
ru: Средства отладки

source: Tarantool users can benefit from built-in debug facilities that are part of:
ru: Пользователи Tarantool'а могут воспользоваться преимуществами встроенных средств отладки, которые составляют часть:

source: Lua (`debug <https://www.lua.org/manual/5.1/manual.html#5.9>`_ library, see details below) and
ru: Lua (библиотека `отладки <https://www.lua.org/manual/5.1/manual.html#5.9>`_, см. подробное описание ниже) и

source: LuaJit (`debug.* <http://luajit.org/extensions.html>`_ functions).
ru: LuaJit (функции отладки `debug.* <http://luajit.org/extensions.html>`_).

source: The ``debug`` library provides an interface for debugging Lua programs. All functions in this library reside in the ``debug`` table. Those functions that operate on a thread have an optional first parameter that specifies the thread to operate on. The default is always the current thread.
ru: Библиотека ``debug`` предоставляет интерфейс для отладки Lua-программ. Все функции этой библиотеки содержатся в таблице ``debug``. В функциях для работы с потоками есть дополнительный первый параметр, в котором указывается необходимый поток. По умолчанию, это всегда текущий поток.

source: This library should be used only for debugging and profiling and not as a regular programming tool, as the functions provided here can take too long to run. Besides, several of these functions can compromise otherwise secure code.
ru: Библиотеку следует использовать только для отладки и профилирования, а не в качестве программного средства, поскольку данные функции выполняются слишком долго. Кроме того, некоторые из этих функций могут привести к нарушению работы безопасного в других отношениях кода.

source: Below is a list of all ``debug`` functions.
ru: Ниже приведен перечень всех функций библиотеки ``debug``.

source: Enter an interactive mode
ru: Вход в интерактивный режим

source: Get an object's environment
ru: Получение среды объекта

source: Get a thread's current hook settings
ru: Получение текущих настроек ловушки потока

source: Get information about a function
ru: Получение информации о функции

source: Get a local variable's name and value
ru: Получение имени и значения локальной переменной

source: Get an object's metatable
ru: Получение метатаблицы объекта

source: Get the registry table
ru: Получение таблицы реестра

source: Get an upvalue's name and value
ru: Получение имени и значения сопоставляющего значения

source: Set an object's environment
ru: Определение среды объекта

source: Set a given function as a hook
ru: Определение данной функции в качестве ловушки

source: Assign a value to a local variable
ru: Присваивание значения локальной переменной

source: Set an object's metatable
ru: Определение метатаблицы объекта

source: Assign a value to an upvalue
ru: Присваивание значения сопоставляющему значению

source: Get a traceback of the call stack
ru: Получение обратной трассировки стека вызовов

source: Enters an interactive mode and runs each string that the user types in. The user can, among other things, inspect global and local variables, change their values and evaluate expressions.
ru: Вход в интерактивный режим и выполнение каждой строки, которую печатает пользователь. Пользователь может, в частности, проверять глобальные и локальные переменные, изменять их значения и вычислять выражения.

source: Enter ``cont`` to exit this function, so that the caller can continue its execution.
ru: Введите ``cont`` для выхода из данной функции, чтобы вызывающий клиент мог продолжить выполнение.

source: Commands for ``debug.debug()`` are not lexically nested within any function and so have no direct access to local variables.
ru: Команды для ``debug.debug()`` не вложены лексически в какую-либо функцию, поэтому у них нет прямого доступа к локальным переменным.

source: object to get the environment of
ru: объект, для которого будет получена среда

source: the environment of the ``object``
ru: среда объекта ``object``

source: the current hook settings of the ``thread`` as three values:
ru: текущие настройки ловушки потока ``thread`` в виде трех значений:

source: the current hook function
ru: текущая функция-ловушка

source: the current hook mask
ru: текущая маска ловушки

source: the current hook count as set by the ``debug.sethook()`` function
ru: текущий счетчик ловушки, как определяет функция ``debug.sethook()``

source: function to get information on
ru: функция, по которой будет получена информация

source: what information on the ``function`` to return
ru: какую информацию о функции ``function`` вернуть

source: a table with information about the ``function``
ru: таблица с информацией о функции ``function``

source: You can pass in a ``function`` directly, or you can give a number that specifies a function running at level ``function`` of the call stack of the given ``thread``: level 0 is the current function (``getinfo()`` itself), level 1 is the function that called ``getinfo()``, and so on. If ``function`` is a number larger than the number of active functions, ``getinfo()`` returns ``nil``.
ru: Можно передать функцию ``function`` напрямую или же передать число, которое указывает на функцию, выполняемую на уровне ``function`` стека вызовов данного потока ``thread``: уровень 0 -- это текущая функция (сама функция ``getinfo()``), уровень 1 -- это функция, которая вызвала ``getinfo()``, и т.д. Если для функции ``function`` указано число больше числа активных функций, ``getinfo()`` вернет ``nil``.

source: The default for ``what`` is to get all information available, except the table of valid lines. If present, the option ``f`` adds a field named ``func`` with the function itself. If present, the option ``L`` adds a field named ``activelines`` with the table of valid lines.
ru: По умолчанию, ``what`` -- это вся доступная информация, кроме таблицы допустимых строк. Если задать опцию ``f``, добавится поле под названием ``func`` с самой функцией. Если задать опцию ``L``, добавится поле под названием ``activelines`` с таблицей доступных строк.

source: level of the stack
ru: уровень стека

source: index of the local variable
ru: индекс локальной переменной

source: the name and the value of the local variable with the index ``local`` of the function at level ``level`` of the stack or ``nil`` if there is no local variable with the given index; raises an error if ``level`` is out of range
ru: имя и значение локальной переменной с индексом ``local`` функции на уровне ``level`` стека или ``nil``, если нет локальной переменной с указанным индексом; появится ошибка, если уровень ``level`` вне диапазона

source: You can call ``debug.getinfo()`` to check whether the level is valid.
ru: Можно вызвать ``debug.getinfo()`` для проверки доступности уровня.

source: object to get the metatable of
ru: объект, для которого будет получена метатаблица

source: a metatable of the ``object`` or ``nil`` if it does not have a metatable
ru: метатаблица объекта ``object`` или ``nil``, если метатаблица отсутствует

source: the registry table
ru: таблица реестра

source: function to get the upvalue of
ru: функция, для которой будет получено сопоставляющее значение

source: index of the function upvalue
ru: индекс сопоставляющего значения функции

source: the name and the value of the upvalue with the index ``up`` of the function ``func`` or ``nil`` if there is no upvalue with the given index
ru: имя и значение сопоставляющего значения с индексом ``up`` функции ``func`` или ``nil``, если нет сопоставляющего значения в пределах заданного индекса

source: Sets the environment of the ``object`` to the ``table``.
ru: Определение среды объекта ``object`` для таблицы ``table``.

source: object to change the environment of
ru: объект, среда которого будет изменена

source: table to set the object environment to
ru: таблица для определения среды объекта

source: the ``object``
ru: объект ``object``

source: Sets the given function as a hook. When called without arguments, turns the hook off.
ru: Определение данной функции в качестве ловушки. При вызове без аргументов ловушка отключается.

source: function to set as a hook
ru: функция, которая будет определена в качестве ловушки

source: describes when the ``hook`` will be called; may have the following values: * ``c`` - the ``hook`` is called every time Lua calls a function * ``r`` - the ``hook`` is called every time Lua returns from a function * ``l`` - the ``hook`` is called every time Lua enters a new line of code
ru: описание того, когда будет вызвана ловушка ``hook``; может принимать следующие значения: * ``c`` -- ловушка``hook`` вызывается каждый раз, когда Lua вызывает функцию * ``r`` -- ловушка ``hook`` вызывается каждый раз, когда Lua возвращается из функции * ``l`` -- ловушка ``hook`` вызывается каждый раз, когда Lua переходит на новую строку кода

source: describes when the ``hook`` will be called; may have the following values:
ru: описание того, когда будет вызвана ловушка ``hook``; может принимать следующие значения:

source: ``c`` - the ``hook`` is called every time Lua calls a function
ru: ``c`` -- ловушка``hook`` вызывается каждый раз, когда Lua вызывает функцию

source: ``r`` - the ``hook`` is called every time Lua returns from a function
ru: ``r`` -- ловушка ``hook`` вызывается каждый раз, когда Lua возвращается из функции

source: ``l`` - the ``hook`` is called every time Lua enters a new line of code
ru: ``l`` -- ловушка ``hook`` вызывается каждый раз, когда Lua переходит на новую строку кода

source: describes when the ``hook`` will be called; when different from zero, the ``hook`` is called after every ``count`` instructions.
ru: описание того, когда будет вызвана ловушка ``hook``; если отличается от нуля, ловушка ``hook`` вызывается после каждой инструкции ``count``.

source: Assigns the value ``value`` to the local variable with the index ``local`` of the function at level ``level`` of the stack.
ru: Присвоение значения ``value`` локальной переменной с индексом ``local`` функции на уровне ``level`` стека

source: value to assign to the local variable
ru: значение, присваиваемое локальной переменной

source: the name of the local variable or ``nil`` if there is no local variable with the given index; raises an error if ``level`` is out of range
ru: имя локальной переменной или ``nil``, если локальная переменная с заданным индексом отсутствует; возникает ошибка, если уровень ``level`` вне диапазона

source: Sets the metatable of the ``object`` to the ``table``.
ru: Определение метатаблицы объекта ``object`` для таблицы ``table``.

source: object to change the metatable of
ru: объект, метатаблица которого будет изменена

source: table to set the object metatable to
ru: таблица для определения метатаблицы объекта

source: Assigns the value ``value`` to the upvalue with the index ``up`` of the function ``func``.
ru: Присвоение значения ``value`` сопоставляющему значению с индексом ``up`` функции ``func``.

source: function to set the upvalue of
ru: функция, для которой будет определено сопоставляющее значение

source: value to assign to the function upvalue
ru: значение, присваиваемое сопоставляющему значению функции

source: the name of the upvalue or ``nil`` if there is no upvalue with the given index
ru: имя сопоставляющего значения или ``nil``, если сопоставляющее значение с данным индексом отсутствует

source: an optional message prepended to the traceback
ru: необязательное сообщение, добавленное к началу обратной трассировки

source: specifies at which level to start the traceback (default is 1)
ru: указывает на каком уровне начинать обратную трассировку (по умолчанию, 1)

source: a string with a traceback of the call stack
ru: строка с обратной трассировкой стека вызовов

source: Module `digest`
ru: Модуль `digest`

source: A "digest" is a value which is returned by a function (usually a `Cryptographic hash function`_), applied against a string. Tarantool's ``digest`` module supports several types of cryptographic hash functions (AES_, MD4_, MD5_, SHA-0_, SHA-1_, SHA-2_, PBKDF2_) as well as a checksum function (CRC32_), two functions for base64_, and two non-cryptographic hash functions (guava_, murmur_). Some of the digest functionality is also present in the :ref:`crypto <crypto>` module.
ru: "Дайджест" -- это значение, которое возвращает функция (как правило, криптографическая хеш-функция -- `Cryptographic hash function`_), примененная к строке. Модуль``digest`` Tarantool'а поддерживает несколько типов криптографических хеш-функций (AES_, MD4_, MD5_, SHA-0_, SHA-1_, SHA-2_, PBKDF2_), а также функцию контрольного суммирования (CRC32_), две функции для base64_ и две некриптографические хеш-функции (guava_, murmur_). Часть функций модуля digest также включена в модуль :ref:`crypto <crypto>`.

source: Below is a list of all ``digest`` functions.
ru: Ниже приведен перечень всех функций модуля ``digest``.

source: Encrypt a string using AES
ru: Шифрование строки с использованием AES

source: Decrypt a string using AES
ru: Расшифрование строки с использованием AES

source: Get a digest made with MD4
ru: Получение дайджеста с помощью MD4

source: Get a hexadecimal digest made with MD4
ru: Получение шестнадцатеричного дайджеста с помощью MD4

source: Get a digest made with MD5
ru: Получение дайджеста с помощью MD5

source: Get a hexadecimal digest made with MD5
ru: Получение шестнадцатеричного дайджеста с помощью MD5

source: Get a digest made with PBKDF2
ru: Получение дайджеста с помощью PBKDF2

source: Get a digest made with SHA-0
ru: Получение дайджеста с помощью SHA-0

source: Get a hexadecimal digest made with SHA-0
ru: Получение шестнадцатеричного дайджеста с помощью SHA-0

source: Get a digest made with SHA-1
ru: Получение дайджеста с помощью SHA-1

source: Get a hexadecimal digest made with SHA-1
ru: Получение шестнадцатеричного дайджеста с помощью SHA-1

source: Get a 224-bit digest made with SHA-2
ru: Получение 224-битного дайджеста с помощью SHA-2

source: Get a 56-byte hexadecimal digest made with SHA-2
ru: Получение 56-байтного шестнадцатеричного дайджеста с помощью SHA-2

source: Get a 256-bit digest made with SHA-2
ru: Получение 256-битного дайджеста с помощью SHA-2

source: Get a 64-byte hexadecimal digest made with SHA-2
ru: Получение 64-байтного шестнадцатеричного дайджеста с помощью SHA-2

source: Get a 384-bit digest made with SHA-2
ru: Получение 384-битного дайджеста с помощью SHA-2

source: Get a 96-byte hexadecimal digest made with SHA-2
ru: Получение 96-байтного шестнадцатеричного дайджеста с помощью SHA-2

source: Get a 512-bit digest made with SHA-2
ru: Получение 512-битного дайджеста с помощью SHA-2

source: Get a 128-byte hexadecimal digest made with SHA-2
ru: Получение 128-байтного шестнадцатеричного дайджеста с помощью SHA-2

source: Encode a string to Base64
ru: Кодирование строки по стандарту Base64

source: Decode a Base64-encoded string
ru: Декодирование строки по стандарту Base64

source: Get an array of random bytes
ru: Получение массива случайных байтов

source: Get a 32-bit checksum made with CRC32
ru: Получение 32-битной контрольной суммы с помощью CRC32

source: Initiate incremental CRC32
ru: Запуск инкрементного вычисления CRC32

source: Get a number made with a consistent hash
ru: Получение числа с помощью консистентного хеширования

source: Get a digest made with MurmurHash
ru: Получение дайджеста с помощью MurmurHash

source: Initiate incremental MurmurHash
ru: Запуск инкрементного вычисления с помощью MurmurHash

source: Returns 256-bit binary string = digest made with AES.
ru: Возврат 256-битной двоичной строки = дайджест, полученный с помощью AES.

source: Returns 128-bit binary string = digest made with MD4.
ru: Возврат 128-битной двоичной строки = дайджест, полученный с помощью MD4.

source: Returns 32-byte string = hexadecimal of a digest calculated with md4.
ru: Возврат 32-байтной строки = шестнадцатеричное значение дайджеста, вычисленного с помощью MD4.

source: Returns 128-bit binary string = digest made with MD5.
ru: Возврат 128-битной двоичной строки = дайджест, полученный с помощью MD5.

source: Returns 32-byte string = hexadecimal of a digest calculated with md5.
ru: Возврат 32-байтной строки = шестнадцатеричное значение дайджеста, вычисленного с помощью MD5.

source: Returns binary string = digest made with PBKDF2. |br| For effective encryption the ``iterations`` value should be at least several thousand. The ``digest-length`` value determines the length of the resulting binary string.
ru: Возврат двоичной строки = дайджест, полученный с помощью PBKDF2. |br| Для эффективности шифрования значение параметра количества итераций ``iterations`` должно быть как минимум несколько тысяч. Значение параметра ``digest-length`` определяет длину полученной двоичной строки.

source: Returns 160-bit binary string = digest made with SHA-0. |br| Not recommended.
ru: Возврат 160-битной двоичной строки = дайджест, полученный с помощью SHA-0. |br| Не рекомендуется.

source: Returns 40-byte string = hexadecimal of a digest calculated with sha.
ru: Возврат 40-байтной строки = шестнадцатеричное значение дайджеста, вычисленного с помощью SHA.

source: Returns 160-bit binary string = digest made with SHA-1.
ru: Возврат 160-битной двоичной строки = дайджест, полученный с помощью SHA-1.

source: Returns 40-byte string = hexadecimal of a digest calculated with sha1.
ru: Возврат 40-байтной строки = шестнадцатеричное значение дайджеста, вычисленного с помощью SHA-1.

source: Returns 224-bit binary string = digest made with SHA-2.
ru: Возврат 224-битной двоичной строки = дайджест, полученный с помощью SHA-2.

source: Returns 56-byte string = hexadecimal of a digest calculated with sha224.
ru: Возврат 56-байтной строки = шестнадцатеричное значение дайджеста, вычисленного с помощью SHA-224.

source: Returns 256-bit binary string = digest made with SHA-2.
ru: Возврат 256-битной двоичной строки = дайджест, полученный с помощью SHA-2.

source: Returns 64-byte string = hexadecimal of a digest calculated with sha256.
ru: Возврат 64-байтной строки = шестнадцатеричное значение дайджеста, вычисленного с помощью SHA-256.

source: Returns 384-bit binary string = digest made with SHA-2.
ru: Возврат 384-битной двоичной строки = дайджест, полученный с помощью SHA-2.

source: Returns 96-byte string = hexadecimal of a digest calculated with sha384.
ru: Возврат 96-байтной строки = шестнадцатеричное значение дайджеста, вычисленного с помощью SHA-384.

source: Returns 512-bit binary tring = digest made with SHA-2.
ru: Возврат 512-битной двоичной строки = дайджест, полученный с помощью SHA-2.

source: Returns 128-byte string = hexadecimal of a digest calculated with sha512.
ru: Возврат 128-байтной строки = шестнадцатеричное значение дайджеста, вычисленного с помощью SHA-512.

source: Returns base64 encoding from a regular string.
ru: Возврат кодированного по base64 значения обычной строки.

source: ``nopad`` -- result must not include '=' for padding at the end,
ru: ``nopad`` -- результат не должен включать в себя '=' для заполнения символами в конце,

source: ``nowrap`` -- result must not include line feed for splitting lines after 72 characters,
ru: ``nowrap`` -- результат не должен включать в себя символ переноса строки для разделения строк после 72 символов,

source: ``urlsafe`` -- result must not include '=' or line feed, and may contain '-' or '_' instead of '+' or '/' for positions 62 and 63 in the index table.
ru: ``urlsafe`` -- результат не должен включать в себя '=' или символ переноса строки и может содержать '-' или '_' взамен '+' или '/' в качестве 62 и 63 символа в схеме.

source: Options may be ``true`` or ``false``, the default value is ``false``.
ru: Значения параметров могут быть ``true`` (правда) или ``false`` (ложь), по умолчанию используется ``false``.

source: Returns a regular string from a base64 encoding.
ru: Возврат обычной строки из кодированного по base64 значения.

source: Returns array of random bytes with length = integer.
ru: Возврат массива случайных байтов с длиной = целому числу.

source: Returns 32-bit checksum made with CRC32.
ru: Возврат 32-битной контрольной суммы с помощью CRC32.

source: The ``crc32`` and ``crc32_update`` functions use the `CRC-32C (Castagnoli)`_ polynomial value: ``0x1EDC6F41`` / ``4812730177``. If it is necessary to be compatible with other checksum functions in other programming languages, ensure that the other functions use the same polynomial value.
ru: Функции ``crc32`` и ``crc32_update`` используют значение многочлена `CRC-32C (Castagnoli)`_: ``0x1EDC6F41`` / ``4812730177``. Если необходима совместимость с другими функциями контрольной суммы на другом языке программирования, убедитесь, что другие функции используют то же значение многочлена.

source: For example, in Python, install the ``crcmod`` package and say:
ru: Например, в Python установите пакет ``crcmod`` и введите команду:

source: In Perl, install the ``Digest::CRC`` module and run the following code:
ru: В Perl установите модуль ``Digest::CRC`` и выполните следующий код:

source: (the expected output is 3304160206).
ru: (ожидается выходное значение: 3304160206).

source: Initiates incremental crc32. See :ref:`incremental methods <digest-incremental_digests>` notes.
ru: Запуск инкрементного вычисления CRC32. См. примечания по :ref:`инкрементным методам <digest-incremental_digests>`.

source: Returns a number made with consistent hash.
ru: Возврат числа с помощью консистентного хеширования.

source: The guava function uses the `Consistent Hashing`_ algorithm of the Google guava library. The first parameter should be a hash code; the second parameter should be the number of buckets; the returned value will be an integer between 0 and the number of buckets. For example,
ru: Функция guava использует алгоритм консистентного хеширование (`Consistent Hashing`_) из библиотеки guava от Google. Первым параметром должен быть хеш-код; вторым параметром должно быть число слотов; возвращается значение в виде целого числа в диапазоне от 0 до указанного числа слотов. Например,

source: Returns 32-bit binary string = digest made with MurmurHash.
ru: Возврат 32-битной двоичной строки = дайджест, полученный с помощью MurmurHash.

source: Initiates incremental MurmurHash. See :ref:`incremental methods <digest-incremental_digests>` notes.
ru: Запуск инкрементного вычисления с помощью MurmurHash. См. примечания по :ref:`инкрементным методам <digest-incremental_digests>`.

source: Incremental methods in the ``digest`` module
ru: Инкрементальные методы в модуле ``digest``
