Repository: tarantool/doc
Catalog: locale/*/LC_MESSAGES/doc.po
Languages: ru

source: Exported new Box/C functions to public API: ``box_key_def``, ``box_tuple_format``, ``tuple_compare()``, ``tuple_compare_with_key()``. Issue `2225 <https://github.com/tarantool/tarantool/issues/2225>`_.
ru: Новые функции Box/C вынесены в общедоступный API: ``box_key_def``, ``box_tuple_format``, ``tuple_compare()``, ``tuple_compare_with_key()``. Проблема `2225 <https://github.com/tarantool/tarantool/issues/2225>`_.

source: Added ``string.split()``, ``string.startswith()``, ``string.endswith()``, ``string.ljust()``, ``string.rjust()``, ``string.center()`` API. Issues `2211 <https://github.com/tarantool/tarantool/issues/2211>`_, `2214 <https://github.com/tarantool/tarantool/issues/2214>`_, `2415 <https://github.com/tarantool/tarantool/issues/2415>`_.
ru: Добавлены следующие API: ``string.split()``, ``string.startswith()``, ``string.endswith()``, ``string.ljust()``, ``string.rjust()``, ``string.center()``. Проблемы `2211 <https://github.com/tarantool/tarantool/issues/2211>`_, `2214 <https://github.com/tarantool/tarantool/issues/2214>`_, `2415 <https://github.com/tarantool/tarantool/issues/2415>`_.

source: Added ``table.copy()`` and ``table.deepcopy()`` functions. Issue `2212 <https://github.com/tarantool/tarantool/issues/2412>`_.
ru: Добавлены функции ``table.copy()`` и ``table.deepcopy()``. Проблема `2212 <https://github.com/tarantool/tarantool/issues/2412>`_.

source: Added ``pwd`` module to work with UNIX users and groups. Issue `2213 <https://github.com/tarantool/tarantool/issues/2213>`_.
ru: Добавлен модуль ``pwd`` для работы с пользователями и группами в UNIX. Проблема `2213 <https://github.com/tarantool/tarantool/issues/2213>`_.

source: ``box.session.on_connect()``/``on_disconnect()``/``on_auth()`` triggers now also fired for admin console connections.
ru: Триггеры ``box.session.on_connect()``/``on_disconnect()``/``on_auth()`` также срабатывают для подключений административной консоли.

source: tarantoolctl: ``eval``, ``enter``, ``connect`` commands now support UNIX pipes. Issue `672 <https://github.com/tarantool/tarantool/issues/672>`_.
ru: tarantoolctl: следующие команды: ``eval``, ``enter``, ``connect`` -- теперь поддерживают конвейеры UNIX. Проблема `672 <https://github.com/tarantool/tarantool/issues/672>`_.

source: tarantoolctl: improved error messages and added a new man page. Issue `1488 <https://github.com/tarantool/tarantool/issues/1488>`_.
ru: tarantoolctl: более точные сообщения об ошибке; добавлена новая страница справочника. Проблема `1488 <https://github.com/tarantool/tarantool/issues/1488>`_.

source: tarantoolctl: added filter by ``replica_id`` to ``cat`` and ``play`` commands. Issue `2301 <https://github.com/tarantool/tarantool/issues/2301>`_.
ru: tarantoolctl: добавлен фильтр по ``replica_id`` для команд ``cat`` и ``play``. Проблема `2301 <https://github.com/tarantool/tarantool/issues/2301>`_.

source: tarantoolctl: ``start``, ``stop`` and ``restart`` commands now redirect to ``systemctl start/stop/restart`` when systemd is enabled. Issue `2254 <https://github.com/tarantool/tarantool/issues/2254>`_.
ru: tarantoolctl: Команды ``start``, ``stop`` и ``restart`` перенаправляют на ``systemctl start/stop/restart``, когда запущен systemd. Проблема `2254 <https://github.com/tarantool/tarantool/issues/2254>`_.

source: net.box: added ``buffer = <buffer>`` per-request option to store raw MessagePack responses into a C buffer. Issue `2195 <https://github.com/tarantool/tarantool/issues/2195>`_.
ru: net.box: по запросу добавлена опция ``buffer = <buffer>`` для хранения исходных ответов MessagePack в буфер C. Проблема `2195 <https://github.com/tarantool/tarantool/issues/2195>`_.

source: net.box: added ``connect_timeout`` option. Issue `2054 <https://github.com/tarantool/tarantool/issues/2054>`_.
ru: net.box: добавлена опция ``connect_timeout``. Проблема `2054 <https://github.com/tarantool/tarantool/issues/2054>`_.

source: net.box: added ``on_schema_reload()`` hook. Issue `2021 <https://github.com/tarantool/tarantool/issues/2021>`_.
ru: net.box: добавлена ловушка ``on_schema_reload()``. Проблема `2021 <https://github.com/tarantool/tarantool/issues/2021>`_.

source: net.box: exposed ``conn.schema_version`` and ``space.connection`` to API. Issue `2412 <https://github.com/tarantool/tarantool/issues/2412>`_.
ru: net.box: ``conn.schema_version`` и ``space.connection`` дополнены API. Проблема `2412 <https://github.com/tarantool/tarantool/issues/2412>`_.

source: log: ``debug()``/``info()``/``warn()``/``error()`` now doesn't fail on formatting errors. Issue `889 <https://github.com/tarantool/tarantool/issues/889>`_.
ru: log: ``debug()``/``info()``/``warn()``/``error()`` не выдают сбой при ошибках форматирования. Проблема `889 <https://github.com/tarantool/tarantool/issues/889>`_.

source: crypto: added HMAC support. Contributed by Andrey Kulikov (@amdei). Issue `725 <https://github.com/tarantool/tarantool/issues/725>`_.
ru: crypto: добавлена поддержка HMAC. Разработал Андрей Куликов (@amdei). Проблема `725 <https://github.com/tarantool/tarantool/issues/725>`_.

source: **Release 1.7.3**
ru: **Версия 1.7.3**

source: Release type: beta. Release date: 2016-12-24. Release tag: Tag: 1.7.3-0-gf0c92aa.
ru: Тип версии: бета. Дата выхода: 2016-12-24. Тег версии: 1.7.3-0-gf0c92aa.

source: Announcement: https://github.com/tarantool/tarantool/releases/tag/1.7.3
ru: Объявление о выходе: https://github.com/tarantool/tarantool/releases/tag/1.7.3

source: This is the second beta release in the 1.7 series.
ru: Данная сборка представляет собой вторую бета-версию в серии 1.7.

source: Broken ``coredump()`` Lua function was removed. Use ``gdb -batch -ex "generate-core-file" -p $PID`` instead. Issue `1886 <https://github.com/tarantool/tarantool/issues/1886>`_.
ru: Удалена поврежденная Lua-функция ``coredump()``. Используйте вместо нее ``gdb -batch -ex "generate-core-file" -p $PID``. Проблема `1886 <https://github.com/tarantool/tarantool/issues/1886>`_.

source: Vinyl disk layout was changed since 1.7.2 to add ZStandard compression and improve the performance of secondary keys. Use the replication mechanism to upgrade from 1.7.2 beta. Issue `1656 <https://github.com/tarantool/tarantool/issues/1656>`_.
ru: Структура диска Vinyl изменилась с версии 1.7.2: добавлен механизм компрессии ZStandard и улучшена производительность вторичных ключей. Используйте механизм репликации для обновления с бета-версии 1.7.2. Проблема `1656 <https://github.com/tarantool/tarantool/issues/1656>`_.

source: Substantial progress on stabilizing the Vinyl storage engine:
ru: Значительный прогресс в стабилизации движка базы данных Vinyl:

source: Fix most known crashes and bugs with bad results.
ru: Исправлены большинство известных отказов системы и ошибок, выдающих плохие результаты.

source: Switch to use XLOG/SNAP format for all data files.
ru: Замена формата всех файлов с данными на XLOG/SNAP.

source: Enable ZStandard compression for all data files.
ru: Использование механизма компрессии ZStandard для всех файлов с данными.

source: Squash UPSERT operations on the fly and merge hot keys using a background fiber.
ru: Сжатие операций UPSERT на лету и объединение горячих клавиш с помощью фонового файбера.

source: Significantly improve the performance of index:pairs() and index:count().
ru: Значительное улучшение производительности index:pairs() и index:count().

source: Remove unnecessary conflicts from transactions.
ru: Удаление ненужных конфликтов из транзакций.

source: In-memory level was mostly replaced by memtx data structures.
ru: Уровень In-memory по большей части заменен структурами данных memtx.

source: Specialized allocators are used in most places.
ru: В большинстве случаев используются специализированные распределители ресурсов.

source: We're still actively working on Vinyl and plan to add multi-level compaction and improve the performance of secondary keys in 1.7.4. This implies a data format change.
ru: Мы все еще активно работаем над Vinyl'ом и планируем добавить многоуровневое слияние и улучшить производительность в работе со вторичными ключами в версии 1.7.4. Это подразумевает изменение формата данных.

source: Support for DML requests for space:on_replace() triggers. Issue `587 <https://github.com/tarantool/tarantool/issues/587>`_.
ru: Поддержка DML-запросов для триггеров space:on_replace(). Проблема `587 <https://github.com/tarantool/tarantool/issues/587>`_.

source: UPSERT can be used with the empty list of operations. Issue `1854 <https://github.com/tarantool/tarantool/issues/1854>`_.
ru: UPSERT можно использовать с пустым списком операций. Проблема `1854 <https://github.com/tarantool/tarantool/issues/1854>`_.

source: Lua functions to manipulate environment variables. Issue `1718 <https://github.com/tarantool/tarantool/issues/1718>`_.
ru: Lua-функции будут управлять переменными окружения. Проблема `1718 <https://github.com/tarantool/tarantool/issues/1718>`_.

source: Lua library to read Tarantool snapshots and xlogs. Issue `1782 <https://github.com/tarantool/tarantool/issues/1782>`_.
ru: Lua-библиотека будет считывать снимки Tarantool'а и xlog-файлы. Проблема `1782 <https://github.com/tarantool/tarantool/issues/1782>`_.

source: New ``play`` and ``cat`` commands in ``tarantoolctl``. Issue `1861 <https://github.com/tarantool/tarantool/issues/1861>`_.
ru: Новые команды в ``tarantoolctl``: ``play`` и``cat``. Проблема `1861 <https://github.com/tarantool/tarantool/issues/1861>`_.

source: Improve support for the large number of active network clients. Issue#5#1892.
ru: Улучшена поддержка большого количества активных сетевых клиентов. Проблема #5#1892.

source: Support for ``space:pairs(key, iterator-type)`` syntax. Issue `1875 <https://github.com/tarantool/tarantool/issues/1875>`_.
ru: Поддержка синтаксиса ``space:pairs(key, iterator-type)``. Проблема `1875 <https://github.com/tarantool/tarantool/issues/1875>`_.

source: Automatic cluster bootstrap now also works without authorization. Issue `1589 <https://github.com/tarantool/tarantool/issues/1589>`_.
ru: Автоматическая настройка кластера будет работать и без авторизации. Проблема `1589 <https://github.com/tarantool/tarantool/issues/1589>`_.

source: Replication retries to connect to master indefinitely. Issue `1511 <https://github.com/tarantool/tarantool/issues/1511>`_.
ru: При репликации попытки повторного подключения к мастеру бесконечны. Проблема `1511 <https://github.com/tarantool/tarantool/issues/1511>`_.

source: Temporary spaces now work with ``box.cfg { read_only = true }``. Issue `1378 <https://github.com/tarantool/tarantool/issues/1378>`_.
ru: Временные спейсы будут работать с ``box.cfg { read_only = true }``. Проблема `1378 <https://github.com/tarantool/tarantool/issues/1378>`_.

source: The maximum length of space names increased to 64 bytes (was 32). Issue `2008 <https://github.com/tarantool/tarantool/issues/2008>`_.
ru: Максимальная длина имени спейса увеличена до 64 байтов (ранее 32). Проблема `2008 <https://github.com/tarantool/tarantool/issues/2008>`_.

source: **Release 1.7.2**
ru: **Версия 1.7.2**

source: Release type: beta. Release date: 2016-09-29. Release tag: Tag: `1.7.2-1-g92ed6c4`.
ru: Тип версии: бета. Дата выхода: 2016-09-29. Тег версии: `1.7.2-1-g92ed6c4`.

source: Announcement: https://groups.google.com/forum/#!topic/tarantool-ru/qUYUesEhRQg
ru: Объявление о выходе: https://groups.google.com/forum/#!topic/tarantool-ru/qUYUesEhRQg

source: This is a release in the 1.7 series.
ru: Данная сборка представляет собой версию в серии 1.7.

source: A new binary protocol command for CALL, which no more restricts a function to returning an array of tuples and allows returning an arbitrary MsgPack/JSON result, including scalars, nil and void (nothing). The old CALL is left intact for backward compatibility. It will be removed in the next major release. All programming language drivers will be gradually changed to use the new CALL. Issue `1296 <https://github.com/tarantool/tarantool/issues/1296>`_.
ru: Команда нового бинарного протокола для вызова CALL больше не ограничивает функцию в возврате массива кортежей и позволяет возвращать произвольный результат в формате MsgPack/JSON, включая scalar (скалярные значения), nil (нулевые значения) и void (пусто). Старый метод CALL оставлен нетронутым для обратной совместимости. В следующей основной версии он будет удален. Все драйверы для языков программирования будут постепенно переведены на использование нового метода CALL. Проблема `1296 <https://github.com/tarantool/tarantool/issues/1296>`_.

source: Vinyl storage engine finally reached the beta stage. This release fixes more than 90 bugs in Vinyl, in particular, removing unpredictable latency spikes, all known crashes and bad/lost result bugs.
ru: Разработка движка базы данных Vinyl, наконец, перешла в бета-стадию. В данной версии исправлены более 90 ошибок в Vinyl'е, в частности, удаление непредсказуемых скачков задержки отклика, все известные отказы системы и ошибки, выдающие плохие результаты или их отсутствие.

source: new cooperative multitasking based architecture to eliminate latency spikes,
ru: новая архитектура на основе кооперативной многозадачности для устранения скачков задержки отклика,

source: support for non-sequential multi-part keys,
ru: поддержка непоследовательных составных ключей,

source: support for secondary keys,
ru: поддержка вторичных ключей,

source: support for ``auto_increment()``,
ru: поддержка ``auto_increment()``,

source: number, integer, scalar field types in indexes,
ru: типы полей в индексах: number (число), integer (целое число), scalar (скаляр),

source: INSERT, REPLACE and UPDATE return new tuple, like in memtx.
ru: операции INSERT, REPLACE и UPDATE возвращают новый кортеж, как в memtx'е.

source: We're still actively working on Vinyl and plan to add ``zstd`` compression and a new memory allocator for Vinyl in-memory index in 1.7.3. This implies a data format change which we plan to implement before 1.7 becomes generally available.
ru: Мы все еще активно работаем над Vinyl'ом и планируем добавить механизм компрессии ``zstd`` и новый распределитель ресурсов для Vinyl'а в версии 1.7.3. Это подразумевает изменение формата данных, который планируется внедрить до того, как версия 1.7 станет общедоступной.

source: Tab-based autocompletion in the interactive console, ``require('console').connect()``, ``tarantoolctl enter`` and ``tarantoolctl connect`` commands. Issues `86 <https://github.com/tarantool/tarantool/issues/86>`_ and `1790 <https://github.com/tarantool/tarantool/issues/1790>`_. Use the TAB key to auto complete the names of Lua variables, functions and meta-methods.
ru: Автодополнение по Tab в интерактивной консоли, команды `require('console').connect()``, ``tarantoolctl enter`` и ``tarantoolctl connect``. Проблемы `86 <https://github.com/tarantool/tarantool/issues/86>`_ и `1790 <https://github.com/tarantool/tarantool/issues/1790>`_. Используйте клавишу TAB для автодополнения имен переменных, функций и метаметодов в Lua.

source: memtx snapshots and xlog files are now compressed on the fly using the fast `ZStandard <https://github.com/facebook/zstd>`_ compression algorithm. Compression options are configured automatically to get an optimal trade-off between CPU utilization and disk throughput.
ru: Появилась компрессия снимков memtx и xlog-файлов на лету с использованием быстрого алгоритма компрессии `ZStandard <https://github.com/facebook/zstd>`_. Компрессия настраивается автоматически для получения оптимального соотношения между использованием ЦП и пропускной способностью диска.

source: ``fiber.cond()`` - a new synchronization mechanism for cooperative multitasking. Issue `1731 <https://github.com/tarantool/tarantool/issues/1731>`_.
ru: ``fiber.cond()`` -- новый механизм синхронизации для кооперативной многозадачности. Проблема `1731 <https://github.com/tarantool/tarantool/issues/1731>`_.

source: Tarantool can now be installed using universal Snappy packages (http://snapcraft.io/) with ``snap install tarantool --channel=beta``.
ru: Tarantool теперь можно устанавливать из универсальных Snappy-пакетов (http://snapcraft.io/) с помощью команды ``snap install tarantool --channel=beta``.

source: New rocks and packages:
ru: Новые модули и пакеты:

source: `curl <https://github.com/tarantool/tarantool-curl>`_ - non-blocking bindings for libcurl
ru: `curl <https://github.com/tarantool/tarantool-curl>`_ - неблокирующие привязки для libcurl

source: `prometheus <https://github.com/tarantool/prometheus>`_ - Prometheus metric collector for Tarantool
ru: `prometheus <https://github.com/tarantool/prometheus>`_ - сборщик метрик Prometheus для Tarantool'а

source: `gis <https://github.com/tarantool/gis>`_ - a full-featured geospatial extension for Tarantool
ru: `gis <https://github.com/tarantool/gis>`_ - полнофункциональное геопространственное расширение для Tarantool'а

source: `mqtt <https://github.com/tarantool/mqtt>`_ - an MQTT protocol client for Tarantool
ru: `mqtt <https://github.com/tarantool/mqtt>`_ - клиент MQTT-протокола для Tarantool'а

source: `luaossl <https://github.com/tarantool/luaossl>`_ - the most comprehensive OpenSSL module in the Lua universe
ru: `luaossl <https://github.com/tarantool/luaossl>`_ - самый полноценный OpenSSL-модуль во вселенной Lua

source: Deprecated, removed features and minor incompatibilities:
ru: Устаревшие, удаленные и несовместимые функции:

source: ``num`` and ``str`` fields type names are deprecated, use ``unsigned`` and ``string`` instead. Issue `1534 <https://github.com/tarantool/tarantool/issues/1534>`_.
ru: Имена типов полей ``num`` и ``str`` объявлены устаревшими, используйте вместо них ``unsigned`` и ``string``. Проблема `1534 <https://github.com/tarantool/tarantool/issues/1534>`_.

source: ``space:inc()`` and ``space:dec()`` were removed (deprecated in 1.6.x) Issue `1289 <https://github.com/tarantool/tarantool/issues/1289>`_.
ru: Удалены ``space:inc()`` и ``space:dec()`` (объявлены устаревшими в версии 1.6.x). Проблема `1289 <https://github.com/tarantool/tarantool/issues/1289>`_.

source: ``fiber:cancel()`` is now asynchronous and doesn't wait for the fiber to end. Issue `1732 <https://github.com/tarantool/tarantool/issues/1732>`_.
ru: Функция ``fiber:cancel()`` теперь является асинхронной и не ждет завершения работы файбера. Проблема `1732 <https://github.com/tarantool/tarantool/issues/1732>`_.

source: Implicit error-prone ``tostring()`` was removed from ``digest`` API. Issue `1591 <https://github.com/tarantool/tarantool/issues/1591>`_.
ru: Склонная к ошибкам функция ``tostring()`` была удалена из API ``digest``. Проблема `1591 <https://github.com/tarantool/tarantool/issues/1591>`_.

source: Support for SHA-0 (``digest.sha()``) was removed due to OpenSSL upgrade.
ru: Поддержка SHA-0 (``digest.sha()``) прекращается по причине обновления OpenSSL.

source: ``net.box`` now uses one-based indexes for ``space.name.index[x].parts``. Issue `1729 <https://github.com/tarantool/tarantool/issues/1729>`_.
ru: ``net.box`` будет использовать индексы, начинающиеся с 1, для ``space.name.index[x].parts``. Проблемы `1729 <https://github.com/tarantool/tarantool/issues/1729>`_.

source: Tarantool binary now dynamically links with ``libssl.so`` during compile time instead of loading it at the run time.
ru: Бинарный файл Tarantool'а будет динамически связываться с ``libssl.so`` во время компиляции вместо загрузки во время выполнения.

source: Debian and Ubuntu packages switched to use native ``systemd`` configuration alongside with old-fashioned ``sysvinit`` scripts.
ru: Пакеты Debian и Ubuntu будут использовать встроенную конфигурацию ``systemd`` вместе с вышедшими из употребления скриптами ``sysvinit``.

source: ``systemd`` provides its own facilities for multi-instance management. To upgrade, perform the following steps:
ru: В ``systemd`` появляется возможность управления несколькими экземплярами. Чтобы обновить, выполните следующие действия:

source: Install new 1.7.2 packages.
ru: Установите новые пакеты версии 1.7.2.

source: Ensure that ``INSTANCENAME.lua`` file is present in ``/etc/tarantool/instace.enabled``.
ru: Убедитесь в наличии файла ``ИМЯ_ЭКЗЕМПЛЯРА.lua`` в директории ``/etc/tarantool/instace.enabled``.

source: Stop INSTANCENAME using ``tarantoolctl stop INSTANCENAME``.
ru: Остановите ЭКЗЕМПЛЯР с помощью ``tarantoolctl stop ИМЯ_ЭКЗЕМПЛЯРА``.

source: Start INSTANCENAME using ``systemctl start tarantool@INSTANCENAME``.
ru: Запустите ЭКЗЕМПЛЯР с помощью ``systemctl start tarantool@ИМЯ_ЭКЗЕМПЛЯРА``.

source: Enable INSTANCENAME during system boot using ``systemctl enable trantool@INTANCENAME``.
ru: Включите ЭКЗЕМПЛЯР во время загрузки системы с помощью ``systemctl enable tarantool@ИМЯ_ЭКЗЕМПЛЯРА``.

source: Say ``systemctl disable tarantool; update-rc.d tarantool remove`` to disable sysvinit-compatible wrappers.
ru: Введите команду ``systemctl disable tarantool; update-rc.d tarantool remove``, чтобы отключить надстройки, совместимые с sysvinit.

source: Refer to issue `1291 <https://github.com/tarantool/tarantool/issues/1291>`_ comment and :ref:`the administration chapter <admin>` for additional information.
ru: Для получения дополнительной информации см. комментарии к проблеме `1291 <https://github.com/tarantool/tarantool/issues/1291>`_ и главу :ref:`по администрированию серверной части <admin>`.

source: Debian and Ubuntu packages start a ready-to-use ``example.lua`` instance on a clean installation of the package. The default instance grants universe permissions for ``guest`` user and listens on "locahost:3313".
ru: Пакеты для Debian и Ubuntu запускают готовый к использованию экземпляр ``example.lua`` при чистой установке пакета. В экземпляре, используемом по умолчанию, предоставлены права на universe для пользователя ``guest`` и настроено прослушивание по "locahost:3313".

source: Fedora 22 packages were deprecated (EOL).
ru: Пакеты для Fedora 22 объявлены устаревшими (прекращение поддержки).

source: **Release 1.7.1**
ru: **Версия 1.7.1**

source: Release type: alpha. Release date: 2016-07-11.
ru: Тип версии: альфа. Дата выхода: 2016-07-11.

source: Announcement: https://groups.google.com/forum/#!topic/tarantool/KGYj3VKJKb8
ru: Объявление о выходе: https://groups.google.com/forum/#!topic/tarantool/KGYj3VKJKb8
