Repository: tarantool/doc
Catalog: locale/*/LC_MESSAGES/doc.po
Languages: ru

source: To prepare, paste the code into a file named :file:`example.py` and install the ``tarantool-python`` connector with either :samp:`pip install tarantool\>0.4` to install in :file:`/usr` (requires **root** privilege) or :samp:`pip install tarantool\>0.4 --user` to install in :file:`~` i.e. user's default directory. Before trying to run, check that the server instance is :ref:`listening <cfg_basic-listen>` at ``localhost:3301`` and that the space ``examples`` exists, as :ref:`described earlier <index-connector_setting>`. To run the program, say :samp:`python example.py`. The program will connect to the Tarantool server, will send the :ref:`INSERT<box_space-insert>` request, and will not throw any exception if all went well. If the tuple already exists, the program will throw ``tarantool.error.DatabaseError: (3, "Duplicate key exists in unique index 'primary' in space 'examples'")``.
ru: Для подготовки сохраните код в файл с именем :file:`example.py` и установите коннектор ``tarantool-python``. Для установки коннектора воспользуйтесь либо командой samp:`pip install tarantool\>0.4` для установки в директорию :file:`/usr` (потребуются права уровня **root**), либо командой :samp:`pip install tarantool\>0.4 --user` для установки в директорию :file:`~`, т.е. в используемую по умолчанию директорию текущего пользователя. Перед запуском проверьте, что у экземпляра задан порт для :ref:`прослушивания <cfg_basic-listen>` на ``localhost:3301``, и в базе создан спейс ``examples``, как :ref:`описано выше <index-connector_setting>`. Чтобы запустить программу, выполните команду :samp:`python example.py`. Программа установит соединение с Tarantool-сервером, пошлет :ref:`INSERT-запрос <box_space-insert>` и не выбросит никакого исключения, если всё прошло хорошо. Если такой кортеж уже существует, то программа выбросит исключение ``tarantool.error.DatabaseError: (3, "Duplicate key exists in unique index 'primary' in space 'examples'")``.

source: The example program only shows one request and does not show all that's necessary for good practice. For that, please see `tarantool-python <http://github.com/tarantool/tarantool-python>`_ project at GitHub. For an example of using Python API with `queue managers for Tarantool <https://github.com/tarantool/queue>`_, see `queue-python <https://github.com/tarantool/queue-python>`_ project at GitHub.
ru: В этой программе мы привели пример использования лишь одного запроса. Для полноценной работы с Tarantool'ом обратитесь к документации из `проекта tarantool-python на GitHub <http://github.com/tarantool/tarantool-python>`_. А на странице `проекта queue-python на GitHub <https://github.com/tarantool/queue-python>`_ вы сможете найти примеры использования Python API для работы с `очередями сообщений в Tarantool'е <https://github.com/tarantool/queue>`_.

source: The most commonly used node.js driver is the `Node Tarantool driver <https://github.com/KlonD90/node-tarantool-driver>`_. It is not supplied as part of the Tarantool repository; it must be installed separately. The most common way to install it is with `npm <https://www.sitepoint.com/beginners-guide-node-package-manager/>`_. For example, on Ubuntu, the installation could look like this after npm has been installed:
ru: Самый используемый драйвер для node.js -- `Node Tarantool driver <https://github.com/KlonD90/node-tarantool-driver>`_. Он не входит в репозиторий Tarantool'а, его необходимо устанавливать отдельно. Проще всего установить его вместе с `npm <https://www.sitepoint.com/beginners-guide-node-package-manager/>`_. Например, на Ubuntu, когда npm уже установлен, установка драйвера будет выглядеть следующим образом:

source: Here is a complete node.js program that inserts ``[99999,'BB']`` into ``space[999]`` via the node.js API. Before trying to run, check that the server instance is :ref:`listening<cfg_basic-listen>` at ``localhost:3301`` and that the space ``examples`` exists, as :ref:`described earlier <index-connector_setting>`. To run, paste the code into a file named :file:`example.rs` and say ``node example.rs``. The program will connect using an application-specific definition of the space. The program will open a socket connection with the Tarantool instance at ``localhost:3301``, then send an :ref:`INSERT<box_space-insert>` request, then — if all is well — end after saying "Insert succeeded". If Tarantool is not running on ``localhost`` with listen port = 3301, the program will print “Connect failed”. If :ref:`user 'guest' user<box_space-user>` does not have authorization to connect, the program will print "Auth failed". If the insert request fails for any reason, for example because the tuple already exists, the program will print "Insert failed".
ru: Далее приводится пример полноценной программы на языке node.js, которая осуществляет вставку кортежа ``[99999,'BB']`` в спейс ``space[999]`` с помощью API для языка node.js. Перед запуском проверьте, что у экземпляра задан порт для :ref:`прослушивания <cfg_basic-listen>` на ``localhost:3301``, и в базе создан спейс ``examples``, как :ref:`описано выше <index-connector_setting>`. Чтобы запустить программу, сохраните код в файл с именем :file:`example.rs` и выполните команду ``node example.rs``. Программа установит соединение, используя определение спейса для этой цели, откроет сокет для соединения с экземпляром по ``localhost:3301``, отправит :ref:`INSERT-запрос <box_space-insert>`, а затем -- если всё хорошо -- выдаст сообщение "Insert succeeded". Если Tarantool не запущен на ``localhost`` на прослушивание по порту = 3301, то программа выдаст сообщение об ошибке “Connect failed”. Если у :ref:`пользователя 'guest' <box_space-user>` нет прав на соединение, программа выдаст сообщение об ошибке "Auth failed". Если запрос вставки по какой-либо причине не сработает, например поскольку такой кортеж уже существует, то программа выдаст сообщение об ошибке "Insert failed".

source: The example program only shows one request and does not show all that's necessary for good practice. For that, please see `The node.js driver repository <https://github.com/KlonD90/node-tarantool-driver>`_.
ru: В этой программе мы привели пример использования лишь одного запроса. Для полноценной работы с Tarantool'ом обратитесь к документации из `репозитория драйвера для node.js <https://github.com/KlonD90/node-tarantool-driver>`_.

source: The most commonly used C# driver is `progaudi.tarantool <https://github.com/progaudi/progaudi.tarantool>`_, previously named ``tarantool-csharp``. It is not supplied as part of the Tarantool repository; it must be installed separately. The makers recommend `cross-platform installation using Nuget <https://www.nuget.org/packages/progaudi.tarantool>`_.
ru: Самый используемый драйвер для C# -- `progaudi.tarantool <https://github.com/progaudi/progaudi.tarantool>`_, который раньше назывался ``tarantool-csharp``. Он не входит в репозиторий Tarantool'а, его необходимо устанавливать отдельно. Создатели драйвера рекомендуют `кроссплатформенную установку с помощью Nuget <https://www.nuget.org/packages/progaudi.tarantool>`_.

source: To be consistent with the other instructions in this chapter, here is a way to install the driver directly on Ubuntu 16.04.
ru: Чтобы придерживаться метода оформления других инструкций в данной главе, дадим описание способа установки драйвера напрямую на 16.04.

source: Install .net core from Microsoft. Follow `.net core installation instructions <https://www.microsoft.com/net/core#ubuntu>`_.
ru: Установите среду .NET Core от Microsoft. Следуйте `инструкциям по установке .NET Core <https://www.microsoft.com/net/core#ubuntu>`_.

source: Mono will not work, nor will .Net from xbuild. Only .net core supported on Linux and Mac.
ru: Mono не сработает, как не сработает и .Net от xbuild. Только .NET Core поддерживается на Linux и Mac.

source: Read the Microsoft End User License Agreement first, because it is not an ordinary open-source agreement and there will be a message during installation saying "This software may collect information about you and your use of the software, and send that to Microsoft." Still you can `set environment variables <https://docs.microsoft.com/en-us/dotnet/core/tools/telemetry#behavior>`_ to opt out from telemetry.
ru: Сначала прочитайте Условия лицензионного соглашения с Microsoft, поскольку оно не похоже на обычные соглашения для ПО с открытым кодом, и во время установки система выдаст сообщение о том, что ПО может собирать информацию ("This software may collect information about you and your use of the software, and send that to Microsoft."). Несмотря на это, можно `определить переменные окружения <https://docs.microsoft.com/en-us/dotnet/core/tools/telemetry#behavior>`_, чтобы отказаться от участия в сборе телеметрических данных.

source: Create a new console project.
ru: Создайте новый консольный проект.

source: Add ``progaudi.tarantool`` reference.
ru: Добавьте ссылку на ``progaudi.tarantool``.

source: Change code in ``Program.cs``.
ru: Измените код в ``Program.cs``.

source: Build and run your application.
ru: Соберите и запустите приложение.

source: Before trying to run, check that the server is listening at ``localhost:3301`` and that the space ``examples`` exists, as :ref:`described earlier <index-connector_setting>`.
ru: Перед запуском проверьте, что у экземпляра задан порт для прослушивания на``localhost:3301``, и в базе создан спейс ``examples``, как :ref:`описано выше <index-connector_setting>`.

source: The program will:
ru: Программа:

source: connect using an application-specific definition of the space,
ru: установит соединение, используя определение спейса для этой цели,

source: open a socket connection with the Tarantool server at `localhost:3301`,
ru: откроет сокет для соединения с экземпляром по ``localhost:3301``,

source: send an INSERT request, and — if all is well — end without saying anything.
ru: отправит INSERT-запрос, а затем -- если всё хорошо -- закончит работу без каких-либо сообщений.

source: If Tarantool is not running on localhost with listen port = 3301, or if user 'guest' does not have authorization to connect, or if the INSERT request fails for any reason, the program will print an error message, among other things (stacktrace, etc).
ru: Если Tarantool не запущен на ``localhost`` на прослушивание по порту 3301, или у пользователя 'guest' нет прав на соединение, или запрос вставки по какой-либо причине не сработает, то программа выдаст сообщение об ошибке и другую информацию (трассировку стека и т.д.).

source: The example program only shows one request and does not show all that’s necessary for good practice. For that, please see the `progaudi.tarantool driver repository <https://github.com/progaudi/progaudi.tarantool>`_.
ru: В этой программе мы привели пример использования лишь одного запроса. Для полноценной работы с Tarantool'ом с помощью PHP API, пожалуйста, обратитесь к документации из `проекта tarantool-php на GitHub <https://github.com/tarantool/tarantool-php>`_.

source: Here follow two examples of using Tarantool's high-level C API.
ru: В этом разделе даны два примера использования высокоуровневого API для Tarantool'а и языка C.

source: Example 1
ru: Пример 1

source: Here is a complete C program that inserts :code:`[99999,'B']` into space :code:`examples` via the high-level C API.
ru: Далее приводится пример полноценной программы на языке C, которая осуществляет вставку кортежа ``[99999,'B']`` в спейс :code:`examples` с помощью высокоуровневого API для языка C.

source: #include <stdio.h> #include <stdlib.h> #include <tarantool/tarantool.h> #include <tarantool/tnt_net.h> #include <tarantool/tnt_opt.h> void main() { struct tnt_stream *tnt = tnt_net(NULL); /* See note = SETUP */ tnt_set(tnt, TNT_OPT_URI, "localhost:3301"); if (tnt_connect(tnt) < 0) { /* See note = CONNECT */ printf("Connection refused\n"); exit(-1); } struct tnt_stream *tuple = tnt_object(NULL); /* See note = MAKE REQUEST */ tnt_object_format(tuple, "[%d%s]", 99999, "B"); tnt_insert(tnt, 999, tuple); /* See note = SEND REQUEST */ tnt_flush(tnt); struct tnt_reply reply; tnt_reply_init(&reply); /* See note = GET REPLY */ tnt->read_reply(tnt, &reply); if (reply.code != 0) { printf("Insert failed %lu.\n", reply.code); } tnt_close(tnt); /* See below = TEARDOWN */ tnt_stream_free(tuple); tnt_stream_free(tnt); }
ru: #include <stdio.h> #include <stdlib.h> #include <tarantool/tarantool.h> #include <tarantool/tnt_net.h> #include <tarantool/tnt_opt.h> void main() { struct tnt_stream *tnt = tnt_net(NULL); /* См. ниже = НАСТРОЙКА */ tnt_set(tnt, TNT_OPT_URI, "localhost:3301"); if (tnt_connect(tnt) < 0) { /* См. ниже = СОЕДИНЕНИЕ */ printf("Connection refused\n"); exit(-1); } struct tnt_stream *tuple = tnt_object(NULL); /* См. ниже = СОЗДАНИЕ ЗАПРОСА */ tnt_object_format(tuple, "[%d%s]", 99999, "B"); tnt_insert(tnt, 999, tuple); /* См. ниже = ОТПРАВКА ЗАПРОСА */ tnt_flush(tnt); struct tnt_reply reply; tnt_reply_init(&reply); /* См. ниже = ПОЛУЧЕНИЕ ОТВЕТА */ tnt->read_reply(tnt, &reply); if (reply.code != 0) { printf("Insert failed %lu.\n", reply.code); } tnt_close(tnt); /* См. ниже = ЗАВЕРШЕНИЕ */ tnt_stream_free(tuple); tnt_stream_free(tnt); }

source: Paste the code into a file named :file:`example.c` and install ``tarantool-c``. One way to install ``tarantool-c`` (using Ubuntu) is:
ru: Скопируйте исходный код программы в файл с именем :file:`example.c` и установите коннектор ``tarantool-c``. Вот один из способов установки ``tarantool-c`` (под Ubuntu):

source: To compile and link the program, say:
ru: Чтобы скомпилировать и слинковать тестовую программу, выполните следующую команду:

source: $ # sometimes this is necessary: $ export LD_LIBRARY_PATH=/usr/local/lib $ gcc -o example example.c -ltarantool
ru: $ # иногда это необходимо: $ export LD_LIBRARY_PATH=/usr/local/lib $ gcc -o example example.c -ltarantool

source: Here are notes corresponding to comments in the example program.
ru: Далее следуют примечания, на которые мы ссылались в комментариях к исходному коду тестовой программы.

source: **SETUP:** The setup begins by creating a stream.
ru: **НАСТРОЙКА:** Настройка начинается с создания потока (``tnt_stream``).

source: In this program, the stream will be named ``tnt``. Before connecting on the ``tnt`` stream, some options may have to be set. The most important option is TNT_OPT_URI. In this program, the :ref:`URI <index-uri>` is ``localhost:3301``, since that is where the Tarantool instance is supposed to be :ref:`listening <cfg_basic-listen>`.
ru: В нашей программе поток назван ``tnt``. Перед установкой соединения с потоком ``tnt`` нужно задать ряд опций. Самая важная из них -- TNT_OPT_URI. Для этой опции указан :ref:`URI <index-uri>` ``localhost:3301``, т.е. адрес, по которому должно быть настроено :ref:`прослушивание <cfg_basic-listen>`на стороне экземпляра Tarantool'а.

source: Function description:
ru: Описание функции:

source: **CONNECT:** Now that the stream named ``tnt`` exists and is associated with a URI, this example program can connect to a server instance.
ru: **СОЕДИНЕНИЕ:** Теперь когда мы создали поток с именем ``tnt`` и связали его с конкретным URI, наша программа может устанавливать соединение с экземпляром.

source: The connection might fail for a variety of reasons, such as: the server is not running, or the URI contains an invalid :ref:`password<authentication-passwords>`. If the connection fails, the return value will be -1.
ru: Попытка соединения может и не удаться по разным причинам, например если Tarantool-сервер не запущен или в URI-строке указан неверный :ref:`пароль <authentication-passwords>`. В случае неудачи функция вернет -1.

source: **MAKE REQUEST:** Most requests require passing a structured value, such as the contents of a tuple.
ru: **СОЗДАНИЕ ЗАПРОСА:** В большинстве запросов требуется передавать структурированные данные, например содержимое кортежа.

source: In this program, the request will be an :ref:`INSERT<box_space-insert>`, and the tuple contents will be an integer and a string. This is a simple serial set of values, that is, there are no sub-structures or arrays. Therefore it is easy in this case to format what will be passed using the same sort of arguments that one would use with a C ``printf()`` function: ``%d`` for the integer, ``%s`` for the string, then the integer value, then a pointer to the string value.
ru: В данной программе мы используем запрос :ref:`INSERT<box_space-insert>`, а кортеж содержит целое число и строку. Это простой набор значений без каких-либо вложенных структур или массивов. И передаваемые значения мы можем указать самым простым образом -- аналогично тому, как это сделано в стандартной C-функции ``printf()``: ``%d`` для обозначения целого числа, ``%s`` для обозначения строки, затем числовое значение, затем указатель на строковое значение.

source: **SEND REQUEST:** The database-manipulation requests are analogous to the requests in the box library.
ru: **ОТПРАВКА ЗАПРОСА:** Отправка запросов на изменение данных в базе делается аналогично тому, как это делается в Tarantool-библиотеке ``box``.

source: In this program, the choice is to do an INSERT request, so the program passes the ``tnt_stream`` that was used for connection (``tnt``) and the ``tnt_stream`` that was set up with :c:func:`tarantoolc:tnt_object_format` (``tuple``).
ru: В данной программе мы делаем INSERT-запрос. В этом запросе мы передаем поток ``tnt``, который ранее использовали для установки соединения, и поток :code:`tuple`, который также ранее настроили с помощью функции :c:func:`tarantoolc:tnt_object_format`.

source: **GET REPLY:** For most requests, the client will receive a reply containing some indication whether the result was successful, and a set of tuples.
ru: **ПОЛУЧЕНИЕ ОТВЕТА:** На большинство запросов клиент получает ответ, который содержит информацию о том, был ли данный запрос успешно выполнен, а также содержит набор кортежей.

source: This program checks for success but does not decode the rest of the reply.
ru: Данная программа проверяет, был ли запрос выполнен успешно, но никак не интерпретирует оставшуюся часть ответа.

source: **TEARDOWN:** When a session ends, the connection that was made with :c:func:`tarantoolc:tnt_connect()` should be closed, and the objects that were made in the setup should be destroyed.
ru: **ЗАВЕРШЕНИЕ:** По окончании сессии нам нужно закрыть соединение, созданное с помощью функции :c:func:`tarantoolc:tnt_connect()`, и удалить объекты, созданные на этапе настройки.

source: Example 2
ru: Пример 2

source: Here is a complete C program that selects, using index key ``[99999]``, from space ``examples`` via the high-level C API. To display the results, the program uses functions in the `MsgPuck <http://rtsisyk.github.io/msgpuck/>`_ library which allow decoding of `MessagePack <https://en.wikipedia.org/wiki/MessagePack>`_ arrays.
ru: Далее приводится еще один пример полноценной программы на языке C, которая осуществляет выборку по индекс-ключу ``[99999]`` из спейса ``examples`` с помощью высокоуровневого Tarantool API для языка C. Для вывода результатов в этой программе используются функции из библиотеки `MsgPuck <http://rtsisyk.github.io/msgpuck/>`_. Эти функции нужны для декодирования массивов значений в формате `MessagePack <https://en.wikipedia.org/wiki/MessagePack>`_.

source: #include <stdio.h> #include <stdlib.h> #include <tarantool/tarantool.h> #include <tarantool/tnt_net.h> #include <tarantool/tnt_opt.h> #define MP_SOURCE 1 #include <msgpuck.h> void main() { struct tnt_stream *tnt = tnt_net(NULL); tnt_set(tnt, TNT_OPT_URI, "localhost:3301"); if (tnt_connect(tnt) < 0) { printf("Connection refused\n"); exit(1); } struct tnt_stream *tuple = tnt_object(NULL); tnt_object_format(tuple, "[%d]", 99999); /* tuple = search key */ tnt_select(tnt, 999, 0, (2^32) - 1, 0, 0, tuple); tnt_flush(tnt); struct tnt_reply reply; tnt_reply_init(&reply); tnt->read_reply(tnt, &reply); if (reply.code != 0) { printf("Select failed.\n"); exit(1); } char field_type; field_type = mp_typeof(*reply.data); if (field_type != MP_ARRAY) { printf("no tuple array\n"); exit(1); } long unsigned int row_count; uint32_t tuple_count = mp_decode_array(&reply.data); printf("tuple count=%u\n", tuple_count); unsigned int i, j; for (i = 0; i < tuple_count; ++i) { field_type = mp_typeof(*reply.data); if (field_type != MP_ARRAY) { printf("no field array\n"); exit(1); } uint32_t field_count = mp_decode_array(&reply.data); printf(" field count=%u\n", field_count); for (j = 0; j < field_count; ++j) { field_type = mp_typeof(*reply.data); if (field_type == MP_UINT) { uint64_t num_value = mp_decode_uint(&reply.data); printf(" value=%lu.\n", num_value); } else if (field_type == MP_STR) { const char *str_value; uint32_t str_value_length; str_value = mp_decode_str(&reply.data, &str_value_length); printf(" value=%.*s.\n", str_value_length, str_value); } else { printf("wrong field type\n"); exit(1); } } } tnt_close(tnt); tnt_stream_free(tuple); tnt_stream_free(tnt); }
ru: #include <stdio.h> #include <stdlib.h> #include <tarantool/tarantool.h> #include <tarantool/tnt_net.h> #include <tarantool/tnt_opt.h> #define MP_SOURCE 1 #include <msgpuck.h> void main() { struct tnt_stream *tnt = tnt_net(NULL); tnt_set(tnt, TNT_OPT_URI, "localhost:3301"); if (tnt_connect(tnt) < 0) { printf("Connection refused\n"); exit(1); } struct tnt_stream *tuple = tnt_object(NULL); tnt_object_format(tuple, "[%d]", 99999); /* кортеж tuple = ключ для поиска */ tnt_select(tnt, 999, 0, (2^32) - 1, 0, 0, tuple); tnt_flush(tnt); struct tnt_reply reply; tnt_reply_init(&reply); tnt->read_reply(tnt, &reply); if (reply.code != 0) { printf("Select failed.\n"); exit(1); } char field_type; field_type = mp_typeof(*reply.data); if (field_type != MP_ARRAY) { printf("no tuple array\n"); exit(1); } long unsigned int row_count; uint32_t tuple_count = mp_decode_array(&reply.data); printf("tuple count=%u\n", tuple_count); unsigned int i, j; for (i = 0; i < tuple_count; ++i) { field_type = mp_typeof(*reply.data); if (field_type != MP_ARRAY) { printf("no field array\n"); exit(1); } uint32_t field_count = mp_decode_array(&reply.data); printf(" field count=%u\n", field_count); for (j = 0; j < field_count; ++j) { field_type = mp_typeof(*reply.data); if (field_type == MP_UINT) { uint64_t num_value = mp_decode_uint(&reply.data); printf(" value=%lu.\n", num_value); } else if (field_type == MP_STR) { const char *str_value; uint32_t str_value_length; str_value = mp_decode_str(&reply.data, &str_value_length); printf(" value=%.*s.\n", str_value_length, str_value); } else { printf("wrong field type\n"); exit(1); } } } tnt_close(tnt); tnt_stream_free(tuple); tnt_stream_free(tnt); }

source: Similarly to the first example, paste the code into a file named :file:`example2.c`.
ru: Аналогично первому примеру, сохраните исходный код программы в файле с именем :file:`example2.c`.

source: To run the program, say :samp:`./example2`.
ru: Для запуска программы выполните команду :samp:`./example2`.

source: The two example programs only show a few requests and do not show all that's necessary for good practice. See more in the `tarantool-c documentation at GitHub <http://github.com/tarantool/tarantool-c>`_.
ru: В этих двух программах мы привели пример использования лишь двух запросов. Для полноценной работы с Tarantool'ом с помощью C API, пожалуйста, обратитесь к документации из `проекта tarantool-c на GitHub <http://github.com/tarantool/tarantool-c>`_.

source: Interpreting function return values
ru: Интерпретация возвращаемых значений
