Repository: tarantool/doc
Catalog: locale/*/LC_MESSAGES/doc.po
Languages: ru

source: Create a so-called "instance control file". This is a Unix socket with Lua console attached to it. This file is used later by ``tarantoolctl`` to query the instance state, send commands to the instance and so on.
ru: Создает так называемый "файл для управления экземпляром". Это Unix-сокет с прикрепленной к нему Lua-консолью. В дальнейшем ``tarantoolctl`` использует этот файл для получения состояния экземпляра, отправки команд и т.д.

source: Finally, use Lua ``dofile`` command to execute the instance file.
ru: Наконец, использует Lua-команду ``dofile`` для выполнения файла экземпляра.

source: If you start an instance using ``systemd`` tools, like this (the instance name is ``my_app``):
ru: При запуске экземпляра с помощью инструментария ``systemd`` указанным ниже способом (имя экземпляра -- ``my_app``):

source: ... this actually calls ``tarantoolctl`` like in case of ``tarantoolctl start my_app``.
ru: ...на самом деле вызывается ``tarantoolctl`` -- так же, как и в случае ``tarantoolctl start my_app``.

source: To check the instance file for syntax errors prior to starting ``my_app`` instance, say:
ru: Для проверки файла экземпляра на наличие синтаксических ошибок перед запуском экземпляра ``my_app`` используйте команду:

source: To enable ``my_app`` instance for auto-load during system startup, say:
ru: Для включения автоматической загрузки экземпляра ``my_app`` при запуске всей системы используйте команду:

source: To stop a running ``my_app`` instance, say:
ru: Для остановки работающего экземпляра ``my_app`` используйте команду:

source: $ tarantoolctl stop my_app $ # - OR - $ systemctl stop tarantool@my_app
ru: $ tarantoolctl stop my_app $ # - ИЛИ - $ systemctl stop tarantool@my_app

source: To restart (i.e. stop and start) a running ``my_app`` instance, say:
ru: Для перезапуска (т.е. остановки и запуска) работающего экземпляра ``my_app`` используйте команду:

source: $ tarantoolctl restart my_app $ # - OR - $ systemctl restart tarantool@my_app
ru: $ tarantoolctl restart my_app $ # - ИЛИ - $ systemctl restart tarantool@my_app

source: Running Tarantool locally
ru: Локальный запуск Tarantool

source: Sometimes you may need to run a Tarantool instance locally, e.g. for test purposes. Let's configure a local instance, then start and monitor it with ``tarantoolctl``.
ru: Иногда бывает необходимо запустить Tarantool локально -- например, для тестирования. Давайте настроим локальный экземпляр, запустим его и будем мониторить с помощью ``tarantoolctl``.

source: First, we create a sandbox directory on the user's path:
ru: Сперва создадим директорию-песочницу по следующему пути:

source: ... and set default ``tarantoolctl`` configuration in ``$HOME/.config/tarantool/tarantool``. Let the file contents be:
ru: ...и поместим конфигурационный файл с параметрами ``tarantoolctl`` по умолчанию в ``$HOME/.config/tarantool/tarantool``. Содержимое файла будет таким:

source: Specify a full path to the user's home directory instead of "~/".
ru: Указывайте полный путь к домашней директории пользователя вместо "~/".

source: Omit ``username`` parameter. ``tarantoolctl`` normally doesn't have permissions to switch current user when invoked by a local user. The instance will be running under 'admin'.
ru: Опустите параметр ``username``. Обычно, когда запуск производит локальный пользователь, у ``tarantoolctl`` нет разрешения на смену текущего пользователя. Экземпляр будет работать с пользователем 'admin'.

source: Next, we create the instance file ``~/tarantool_test/my_app.lua``. Let the file contents be:
ru: Далее создадим файл экземпляра ``~/tarantool_test/my_app.lua``. Содержимое файла будет таким:

source: Let’s verify our instance file by starting it without ``tarantoolctl`` first:
ru: Проверим наш файл экземпляра, сперва запустив его без ``tarantoolctl``:

source: Now we tell ``tarantoolctl`` to start the Tarantool instance:
ru: Запустим экземпляр Tarantool'а с помощью ``tarantoolctl``:

source: Expect to see messages indicating that the instance has started. Then:
ru: В консоли должны появиться сообщения о том, что экземпляр запущен. Затем выполним следующую команду:

source: Expect to see the .snap file and the .xlog file. Then:
ru: В консоли должны появиться .snap-файл и .xlog-файл. Затем выполним следующую команду:

source: Expect to see the contents of ``my_app``‘s log, including error messages, if any. Then:
ru: В консоли должно отобразиться содержимое файла журнала для приложения ``my_app``, в том числе сообщения об ошибках, если они были. Затем выполним серию команд:

source: Expect to see several tuples that ``my_app`` has created.
ru: В консоли должны появиться несколько кортежей, которые создало приложение ``my_app``.

source: Stop now. A polite way to stop ``my_app`` is with ``tarantoolctl``, thus we say:
ru: Теперь остановим приложение ``my_app``. Корректный способ остановки -- это использовать``tarantoolctl``:

source: Finally, we make a cleanup.
ru: Последний шаг -- удаление тестовых данных.

source: Troubleshooting guide
ru: Руководство по разрешению проблем

source: For this guide, you need to install Tarantool `stat <https://github.com/tarantool/stat>`_ module:
ru: В данном руководстве используется сторонний модуль `stat <https://github.com/tarantool/stat>`_. Для его установки выполните команду:

source: $ sudo yum install tarantool-stat $ # -- OR -- $ sudo apt-get install tarantool-stat
ru: $ sudo yum install tarantool-stat $ # -- ИЛИ -- $ sudo apt-get install tarantool-stat

source: Problem: INSERT/UPDATE-requests result in ER_MEMORY_ISSUE error
ru: Проблема: при выполнении INSERT/UPDATE-запросов возникает ошибка ER_MEMORY_ISSUE

source: **Possible reasons**
ru: **Возможные причины**

source: Lack of RAM (parameters ``arena_used_ratio`` and ``quota_used_ratio`` in :ref:`box.slab.info() <box_slab_info>` report are getting close to 100%).
ru: Нехватка памяти (значения параметров ``arena_used_ratio`` и ``quota_used_ratio`` из :ref:`box.slab.info() <box_slab_info>` приближаются к 100%).

source: To check these parameters, say:
ru: Чтобы проверить значения данных параметров, выполните соответствующие команды:

source: $ # attaching to a Tarantool instance $ tarantoolctl enter <instance_name> $ # -- OR -- $ tarantoolctl connect <URI>
ru: $ # подключаемся к админ-консоли нужного экземпляра $ tarantoolctl enter <instance_name> $ # -- ИЛИ -- $ tarantoolctl connect <URI>

source: -- requesting arena_used_ratio value tarantool> require('stat').stat()['slab.arena_used_ratio'] -- requesting quota_used_ratio value tarantool> require('stat').stat()['slab.quota_used_ratio']
ru: -- запрашиваем значение arena_used_ratio tarantool> require('stat').stat()['slab.arena_used_ratio'] -- запрашиваем значение quota_used_ratio tarantool> require('stat').stat()['slab.quota_used_ratio']

source: **Solution**
ru: **Решение**

source: Try either of the following measures:
ru: У вас есть несколько вариантов действий:

source: In Tarantool's :ref:`instance file <admin-instance_config>`, increase the value of :ref:`box.cfg{memtx_memory} <cfg_storage-memtx_memory>` (if memory resources are available).
ru: Зайти в :ref:`конфигурационный файл <admin-instance_config>` Tarantool и увеличить значение параметра :ref:`box.cfg{memtx_memory} <cfg_storage-memtx_memory>` (при наличии свободных ресурсов).

source: Clean up the database.
ru: Провести очистку базы данных.

source: Check the indicators of memory fragmentation:
ru: Проверьте, нет ли проблем с фрагментацией памяти:

source: -- requesting quota_used_ratio value tarantool> require('stat').stat()['slab.quota_used_ratio'] -- requesting items_used_ratio value tarantool> require('stat').stat()['slab.items_used_ratio']
ru: -- запрашиваем значение quota_used_ratio tarantool> require('stat').stat()['slab.quota_used_ratio'] -- запрашиваем значение items_used_ratio tarantool> require('stat').stat()['slab.items_used_ratio']

source: In case of heavy memory fragmentation (``quota_used_ratio`` is getting close to 100%, ``items_used_ratio`` is about 50%), we recommend restarting Tarantool in the :ref:`hot standby <index-hot_standby>` mode.
ru: При высокой степени фрагментации памяти (значение параметра ``quota_used_ratio`` приближается к 100%, ``items_used_ratio`` около 50%) рекомендуется перезапустить Tarantool в режиме горячего резервирования :ref:`hot standby <index-hot_standby>`.

source: Problem: Tarantool generates too heavy CPU load
ru: Проблема: Tarantool создает большую нагрузку на CPU

source: The :ref:`transaction processor thread <atomic-threads_fibers_yields>` consumes over 60% CPU.
ru: :ref:`Поток обработки транзакций <atomic-threads_fibers_yields>` нагружает ЦП более чем на 60%.

source: Attach to the Tarantool instance with :ref:`tarantoolctl <tarantoolctl>` utility, analyze the query statistics with :ref:`box.stat() <box_introspection-box_stat>` and spot the CPU consumption leader. The following commands can help:
ru: Подключиться к Tarantool с помощью утилиты :ref:`tarantoolctl <tarantoolctl>`, внимательно изучить статистику запросов с помощью :ref:`box.stat() <box_introspection-box_stat>` и выявить источник потребления. Для этой цели могут оказаться полезными следующие команды:

source: -- checking the RPS of calling stored procedures tarantool> require('stat').stat()['stat.op.call.rps']
ru: -- запрашиваем RPS для вызовов хранимых процедур tarantool> require('stat').stat()['stat.op.call.rps']

source: The critical RPS value is 75 000, boiling down to 10 000 - 20 000 for a rich Lua application (a Lua module of 200+ lines).
ru: Критическое значение RPS -- 75 000, в случае большого Lua-приложения (модульного приложения, содержащего более 200 строк кода) -- 10 000 - 20 000.

source: -- checking RPS per query type tarantool> require('stat').stat()['stat.op.<query_type>.rps']
ru: -- запрашиваем RPS для запросов указанного типа tarantool> require('stat').stat()['stat.op.<query_type>.rps']

source: The critical RPS value for SELECT/INSERT/UPDATE/DELETE requests is 100 000.
ru: Критическое значение RPS для запросов типа SELECT/INSERT/UPDATE/DELETE -- 100 000.

source: If the load is mostly generated by SELECT requests, we recommend adding a :ref:`slave server <replication-bootstrap>` and let it process part of the queries.
ru: Если основная нагрузка генерируется SELECT-запросами, следует добавить :ref:`slave-сервер <replication-bootstrap>` и часть запросов обрабатывать на нем.

source: If the load is mostly generated by INSERT/UPDATE/DELETE requests, we recommend :ref:`sharding the database <shard-module>`.
ru: Если же нагрузка по большей части приходится на INSERT/UPDATE/DELETE-запросы, рекомендуется провести :ref:`шардинг базы данных <shard-module>`.

source: Problem: Query processing times out
ru: Проблема: обработка запросов прекращается по таймауту

source: All reasons that we discuss here can be identified by messages in Tarantool's log file, all starting with the words ``'Too long...'``.
ru: Все описанные ниже ситуации можно распознать по записям в журнале Tarantool, начинающимся со слов ``'Too long...'``.

source: Both fast and slow queries are processed within a single connection, so the readahead buffer is cluttered with slow queries.
ru: Быстрые и медленные запросы обрабатываются в одном подключении, что приводит к забиванию readahead-буфера медленными запросами.

source: Increase the readahead buffer size (:ref:`box.cfg{readahead} <cfg_networking-readahead>` parameter).
ru: Увеличить размер readahead-буфера (:ref:`box.cfg{readahead} <cfg_networking-readahead>`).

source: This parameter can be changed on the fly, so you don't need to restart Tarantool. Attach to the Tarantool instance with :ref:`tarantoolctl <tarantoolctl>` utility and call ``box.cfg{}`` with a new ``readahead`` value:
ru: Перезапускать Tarantool при этом не требуется. Для обновления конфигурации необходимо подключиться к Tarantool с помощью утилиты :ref:`tarantoolctl <tarantoolctl>` и передать в ``box.cfg{}`` новое значение параметра ``readahead``:

source: -- changing the readahead value tarantool> box.cfg{readahead = 10 * 1024 * 1024}
ru: -- задаем новое значение readahead tarantool> box.cfg{readahead = 10 * 1024 * 1024}

source: **Example:** Given 1000 RPS, 1 Кbyte of query size, and 10 seconds of maximal query processing time, the minimal readahead buffer size must be 10 Mbytes.
ru: **Пример расчета:** при 1000 RPS, размере одного запроса в 1 Кбайт и максимальном времени обработки одного запроса в 10 секунд минимальный размер readahead-буфера должен равняться 10 Мбайт.

source: On the business logic level, split fast and slow queries processing by different connections.
ru: Обрабатывать быстрые и медленные запросы в отдельных подключениях (решается на уровне бизнес-логики).

source: Slow disks.
ru: Медленная работа дисков.

source: Check disk performance (use `iostat <https://linux.die.net/man/1/iostat>`_, `iotop <https://linux.die.net/man/1/iotop>`_ or `strace <https://linux.die.net/man/1/strace>`_ utility to check ``iowait`` parameter) and try to put .xlog files and snapshot files on different physical disks (i.e. use different locations for :ref:`wal_dir <cfg_basic-wal_dir>` and :ref:`memtx_dir <cfg_basic-memtx_dir>`).
ru: Проверить занятость дисков (с помощью утилиты `iostat <https://linux.die.net/man/1/iostat>`_, `iotop <https://linux.die.net/man/1/iotop>`_ или `strace <https://linux.die.net/man/1/strace>`_ посмотреть на параметр ``iowait``) и попробовать разнести .xlog-файлы и снимки состояния базы данных по разным дискам (т.е. указать разные значения для параметров :ref:`wal_dir <cfg_basic-wal_dir>` и :ref:`memtx_dir <cfg_basic-memtx_dir>`).

source: Problem: Replication "lag" and "idle" contain negative values
ru: Проблема: параметры репликации lag и idle принимают отрицательные значения

source: This is about ``box.info.replication.(upstream.)lag`` and ``box.info.replication.(upstream.)idle`` values in :ref:`box.info.replication <box_info_replication>` section.
ru: Речь идет о параметрах ``box.info.replication.(upstream.)lag`` и ``box.info.replication.(upstream.)idle`` из сводной таблицы :ref:`box.info.replication <box_info_replication>`.

source: Operating system clock on the hosts is not synchronized, or the NTP server is faulty.
ru: Не синхронизированы часы на машинах или неправильно работает NTP-сервер.

source: Check NTP server settings.
ru: Проверить настройки NTP-сервера.

source: If you found no problems with the NTP server, just do nothing then. Lag calculation uses operating system clock from two different machines. If they get out of sync, the remote master clock can get consistently behind the local instance’s clock.
ru: Если проблем с NTP-сервером не обнаружено, то не следует ничего предпринимать, потому что при вычислении лага репликации используются показания системных часов на двух разных машинах, и в случае рассинхронизации может случиться так, что часы удаленного мастер-сервера всегда будут отставать от часов локального экземпляра Tarantool.

source: Problem: Replication "idle" keeps growing, but no related log messages appear
ru: Проблема: значение параметра idle растет, но журнал не содержит связанных с этим сообщений

source: This is about ``box.info.replication.(upstream.)idle`` value in :ref:`box.info.replication <box_info_replication>` section.
ru: Речь идет о параметре ``box.info.replication.(upstream.)idle`` из сводной таблицы :ref:`box.info.replication <box_info_replication>`.

source: Some server was assigned different IP addresses, or some server was specified twice in ``box.cfg{}``, so duplicate connections were established.
ru: Одному серверу были назначены различные IP-адреса или один и тот же сервер был указан в ``box.cfg{}`` дважды, что привело к установлению дублирующего подключения.

source: Problem: Replication statistics differ on replicas within a replica set
ru: Проблема: общие параметры репликации не совпадают на репликах в рамках одного кластера

source: This is about a replica set that consists of one master and several replicas. In a replica set of this type, values in :ref:`box.info.replication <box_info_replication>` section, like ``box.info.replication.lsn``, come from the master and must be the same on all replicas within the replica set. The problem is that they get different.
ru: Речь идет о кластере, состоящем из одного мастера и нескольких реплик. В таком случае значения общих параметров из сводной таблицы :ref:`box.info.replication <box_info_replication>`, например ``box.info.replication.lsn``, должны приходить с мастера и должны быть одинаковыми на всех репликах. Если такие параметры не совпадают, это свидетельствует о наличии проблем.

source: Replication is broken.
ru: Сбой репликации.

source: :ref:`Restart replication <replication-recover>`.
ru: :ref:`Перезапустить репликацию <replication-recover>`.

source: Problem: Master-master replication is stopped
ru: Проблема: репликация мастер-мастер остановлена

source: This is about :ref:`box.info.replication(.upstream).status <box_info_replication>` = stopped.
ru: Речь идет о том, что параметр :ref:`box.info.replication(.upstream).status <box_info_replication>` имеет значение stopped.

source: In a master-master replica set of two Tarantool instances, one of the masters has tried to perform an action already performed by the other server, for example re-insert a tuple with the same unique key. This would cause an error message like ``'Duplicate key exists in unique index 'primary' in space <space_name>'``.
ru: В репликационном кластере, состоящем из двух мастер-серверов, один из серверов попытался выполнить действие, уже выполненное другим сервером, -- например, повторно вставить кортеж с таким же уникальным ключом (распознается по ошибке вида ``'Duplicate key exists in unique index 'primary' in space <space_name>'``).

source: Restart replication with the following commands (at each master instance):
ru: Возобновить репликацию с помощью следующих команд (должны быть выполнены на всех мастер-серверах):

source: -- restarting replication tarantool> original_value = box.cfg.replication tarantool> box.cfg{replication={}} tarantool> box.cfg{replication=original_value}
ru: -- перезапускаем репликацию tarantool> original_value = box.cfg.replication tarantool> box.cfg{replication={}} tarantool> box.cfg{replication=original_value}

source: We also recommend using text primary keys or setting up :ref:`master-slave replication <replication-master_replica_bootstrap>`.
ru: Также рекомендуется перейти на текстовые первичные ключи или настроить :ref:`репликацию мастер-реплика <replication-master_replica_bootstrap>`.

source: Problem: Tarantool works much slower than before
ru: Проблема: Tarantool работает заметно медленнее, чем раньше

source: Inefficient memory usage (RAM is cluttered with a huge amount of unused objects).
ru: Неэффективное использование памяти (память занята большим количеством неиспользуемых объектов).

source: Example of calculating memory usage statistics:
ru: Пример кода для подсчета потребляемой памяти:

source: -- loading Tarantool's "clock" module with time-related routines tarantool> local clock = require 'clock' -- starting the timer tarantool> local b = clock.proc() -- launching garbage collection tarantool> local c = collectgarbage('count') -- stopping the timer after garbage collection is completed tarantool> return c, clock.proc() - b
ru: -- загрузка модуля clock для работы со временем tarantool> local clock = require 'clock' -- запускаем таймер tarantool> local b = clock.proc() -- запускаем сборку мусора tarantool> local c = collectgarbage('count') -- останавливаем таймер по завершении сборки мусора tarantool> return c, clock.proc() - b

source: If the returned ``clock.proc()`` value is greater than 0.001, this may be an indicator of inefficient memory usage (no active measures are required, but we recommend to optimize your Tarantool application code).
ru: Если возвращаемое ``clock.proc()`` значение больше 0.001, это может являться признаком неэффективного использования памяти (активного вмешательства не требуется, но рекомендуется оптимизация кода). Если значение превышает 0.01, необходимо провести подробный анализ кода и оптимизировать потребление памяти.

source: If the value is greater than 0.01, your application definitely needs thorough code analysis aimed at optimizing memory usage.
ru: Если значение больше 0,01, код приложения однозначно необходимо проанализировать на предмет оптимизации использования памяти.

source: Upgrades
ru: Обновление

source: Upgrading a Tarantool database
ru: Обновление базы данных Tarantool

source: If you created a database with an older Tarantool version and have now installed a newer version, make the request ``box.schema.upgrade()``. This updates Tarantool system spaces to match the currently installed version of Tarantool.
ru: Если вы создали базу данных в старой версии Tarantool'а, а потом обновили Tarantool до более свежей версии, вызовите команду ``box.schema.upgrade()``. Она обновляет системные спейсы Tarantool'а так, чтобы они совпадали с текущей установленной версией Tarantool'а.

source: For example, here is what happens when you run ``box.schema.upgrade()`` with a database created with Tarantool version 1.6.4 to version 1.7.2 (only a small part of the output is shown):
ru: Например, вот что происходит, если выполнить команду ``box.schema.upgrade()`` для базы данных, созданной в Tarantool версии 1.6.4 (показана лишь малая часть выводимых сообщений):

source: Upgrading a Tarantool instance
ru: Обновление экземпляра Tarantool'а

source: Tarantool is backward compatible between two adjacent versions. For example, you should have no or little trouble when upgrading from Tarantool 1.6 to 1.7, or from Tarantool 1.7 to 1.8. Meanwhile Tarantool 1.8 may have incompatible changes when migrating from Tarantool 1.6. to 1.8 directly.
ru: Tarantool поддерживает обратную совместимость между двумя последовательными версиями. Например, обновление Tarantool 1.6 до 1.7 или Tarantool 1.7 до 1.8 не должно вызвать затруднений, тогда как миграции с Tarantool 1.6 прямиком на 1.8 могут препятствовать несовместимые изменения.

source: Stop the Tarantool server.
ru: Остановите Tarantool-сервер.

source: Make a copy of all data (see an appropriate hot backup procedure in :ref:`Backups <admin-backups>`) and the package from which the current (old) version was installed (for rollback purposes).
ru: Создайте копию всех данных (см. подразделы про горячее резервное копирование в разделе :ref:`Резервное копирование <admin-backups>`) и пакета, из которого была установлена текущая (старая) версия (на случай отката).

source: Update the Tarantool server. See installation instructions at Tarantool `download page <http://tarantool.org/download.html>`_.
ru: Обновите Tarantool-сервер. Инструкции по установке доступны на `странице загрузок Tarantool'а <http://tarantool.org/download.html>`_.

source: Update the Tarantool database. Put the request ``box.schema.upgrade()`` inside a :ref:`box.once() <box-once>` function in your Tarantool :ref:`initialization file <index-init_label>`. On startup, this will create new system spaces, update data type names (e.g. num -> unsigned, str -> string) and options in Tarantool system spaces.
ru: Обновите базу данных Tarantool. Выполните команду ``box.schema.upgrade()``, поместив ее внутрь функции :ref:`box.once() <box-once>` в :ref:`файле инициализации <index-init_label>` Tarantool'а. В результате на этапе запуска Tarantool создаст новые системные спейсы, обновит названия типов данных (например, num -> unsigned, str -> string) и список доступных типов данных в системных спейсах.

source: Update application files, if needed.
ru: При необходимости обновите файлы приложения.

source: Launch the updated Tarantool server using ``tarantoolctl`` or ``systemctl``.
ru: Запустите обновленный Tarantool-сервер с помощью ``tarantoolctl`` или ``systemctl``.
