Repository: tarantool/doc
Catalog: locale/*/LC_MESSAGES/doc.po
Languages: ru

source: Also, note that this brace-placement also minimizes the number of empty (or almost empty) lines, without any loss of readability. Thus, as the supply of new-lines on your screen is not a renewable resource (think 25-line terminal screens here), you have more empty lines to put comments on.
ru: Кроме того, обратите внимание, что такое расположение скобок также сводит к минимуму количество пустых (или почти пустых) строк без потери читаемости. Таким образом, поскольку новые строки на экране -- это не возобновляемый ресурс (вспомним о 25-строчных экранах терминала), у вас будет больше пустых строк для комментариев.

source: Do not unnecessarily use braces where a single statement will do.
ru: Не используйте лишние фигурные скобки, если нужен всего один оператор.

source: This does not apply if one branch of a conditional statement is a single statement. Use braces in both branches.
ru: Это не применимо, если одна ветка условного оператора -- это отдельный оператор. Используйте фигурные скобки в обеих ветках.

source: Chapter 3.1: Spaces
ru: Глава 3.1: Пробелы

source: Linux kernel style for use of spaces depends (mostly) on function-versus-keyword usage. Use a space after (most) keywords. The notable exceptions are sizeof, typeof, alignof, and __attribute__, which look somewhat like functions (and are usually used with parentheses in Linux, although they are not required in the language, as in: "sizeof info" after "struct fileinfo info;" is declared).
ru: Стиль программирования ядра Linux в том, что касается пробелов, зависит (в основном) от использования функции или ключевого слова. Используйте пробел после (большинства) ключевых слов. Значимые исключения: sizeof, typeof, alignof и __attribute__, которые похожи на функции (и обычно используются с круглыми скобками в Linux, хотя они и не требуются, как в объявлении "sizeof info" после "struct fileinfo info;").

source: So use a space after these keywords: if, switch, case, for, do, while but not with sizeof, typeof, alignof, or __attribute__. E.g.,
ru: Поэтому добавляйте пробел после следующих ключевых слов: if, switch, case, for, do, while, но не для sizeof, typeof, alignof или __attribute__. Пример:

source: Do not add spaces around (inside) parenthesized expressions. This example is **bad**:
ru: Не добавляйте пробелы вокруг (внутри) выражений в круглых скобках. Этот пример **неправильный**:

source: When declaring pointer data or a function that returns a pointer type, the preferred use of '*' is adjacent to the data name or function name and not adjacent to the type name. Examples:
ru: Объявляя данных типа указателя или функцию, которая возвращает тип указателя, предпочтительно использовать '*' рядом с именем данных или именем функции, а не рядом с именем типа. Примеры:

source: Use one space around (on each side of) most binary and ternary operators, such as any of these:
ru: Добавляйте по одному пробелу вокруг (с каждой стороны) большинства знаков двухместных и трехместных операций, например, любое из следующих:

source: but no space after unary operators:
ru: но не добавляйте пробелы после знаков одноместных операций:

source: no space before the postfix increment & decrement unary operators:
ru: не нужны пробелы перед знаками одноместных операций увеличения или уменьшения постфикса:

source: no space after the prefix increment & decrement unary operators:
ru: не нужны пробелы после знаков одноместных операций увеличения или уменьшения префикса:

source: and no space around the '.' and "->" structure member operators.
ru: и не нужны пробелы вокруг знаков элементов структуры '.' и "->".

source: Do not leave trailing whitespace at the ends of lines. Some editors with "smart" indentation will insert whitespace at the beginning of new lines as appropriate, so you can start typing the next line of code right away. However, some such editors do not remove the whitespace if you end up not putting a line of code there, such as if you leave a blank line. As a result, you end up with lines containing trailing whitespace.
ru: Не оставляйте пробелы на концах строк. Некоторые редакторы с "умным" отступом вставляют пробелы в начале новых строк, поэтому вы можете сразу ввести следующую строку кода. Однако некоторые такие редакторы не удаляют пробелы, если вы не пишете там код, например, если вы оставите пустую строку. В результате имеем строки с пробелами в конце.

source: Git will warn you about patches that introduce trailing whitespace, and can optionally strip the trailing whitespace for you; however, if applying a series of patches, this may make later patches in the series fail by changing their context lines.
ru: Git предупредит, если патчи содержат пробелы в конце строк, и может по желанию удалить пробелы за вас; однако, в серии патчей, это может привести к тому, что последующие патчи в серии не применятся, поскольку изменены контекстные строки.

source: Chapter 4: Naming
ru: Глава 4: Именование

source: C is a Spartan language, and so should your naming be. Unlike Modula-2 and Pascal programmers, C programmers do not use cute names like ThisVariableIsATemporaryCounter. A C programmer would call that variable "tmp", which is much easier to write, and not the least more difficult to understand.
ru: C -- это спартанский язык, и именование должно быть спартанским. В отличие от разработчиков на Modula-2 и Pascal, разработчики на языке C не используют забавные имена, такие как ThisVariableIsATemporaryCounter. Разработчик на языке C назвал бы такую переменную "tmp", что намного легче написать и не менее сложно понять.

source: HOWEVER, while mixed-case names are frowned upon, descriptive names for global variables are a must. To call a global function "foo" is a shooting offense.
ru: ОДНАКО, хотя на имена со смешанным регистром смотрят неодобрительно, обязательным требованием будут описательные имена глобальных переменных. Назвать глобальную функцию "foo" -- это оскорбление.

source: GLOBAL variables (to be used only if you _really_ need them) need to have descriptive names, as do global functions. If you have a function that counts the number of active users, you should call that "count_active_users()" or similar, you should _not_ call it "cntusr()".
ru: У ГЛОБАЛЬНЫХ переменных (которые надо использовать, только если без них НЕЛЬЗЯ обойтись) должны быть описательные имена, равно как и у глобальных функций. Если у вас есть функция, которая подсчитывает количество активных пользователей, нужно назвать ее "count_active_users()" или как-то похоже, _НЕ_ следует называть ее "cntusr()".

source: Encoding the type of a function into the name (so-called Hungarian notation) is brain damaged - the compiler knows the types anyway and can check those, and it only confuses the programmer. No wonder MicroSoft makes buggy programs.
ru: Кодирование типа функции в названии (так называемая венгерская нотация) -- это признак плохого тона, поскольку компилятор в любом случае знает типы и может их проверять, и это только путает программиста. Неудивительно, что MicroSoft делает глючные программы.

source: LOCAL variable names should be short, and to the point. If you have some random integer loop counter, it should probably be called "i". Calling it "loop_counter" is non-productive, if there is no chance of it being mis-understood. Similarly, "tmp" can be just about any type of variable that is used to hold a temporary value.
ru: Имена ЛОКАЛЬНЫХ переменных должны быть короткими и точными. Если у вас есть счетчик случайных целых чисел, его следует называть "i". Назвать его "loop_counter" будет непродуктивно, если нет никаких шансов, что его перепутают. Аналогично "tmp" может быть практически любым типом переменной, которая используется для хранения временного значения.

source: If you are afraid to mix up your local variable names, you have another problem, which is called the function-growth-hormone-imbalance syndrome. See chapter 6 (Functions).
ru: Если вы боитесь перепутать имена своих локальных переменных, у вас другая проблема, которая называется синдромом дисбаланса гормона роста функций. См. Главу 6 (Функции).

source: Chapter 5: Typedefs
ru: Глава 5: Директива Typedef

source: Please don't use things like "vps_t".
ru: Не используйте что-то вроде "vps_t".

source: It's a _mistake_ to use typedef for structures and pointers. When you see a
ru: Будет _ошибкой_ использовать typedef для определения структур и указателей. Если вы видите

source: in the source, what does it mean?
ru: в исходном коде, что это означает?

source: In contrast, if it says
ru: И наоборот, если говорится

source: you can actually tell what "a" is.
ru: можно действительно понять, что такое "a".

source: Lots of people think that typedefs "help readability". Not so. They are useful only for:
ru: Многие думают, что typedef "способствует читаемости". Это не так. Эту директиву нужно использовать для:

source: totally opaque objects (where the typedef is actively used to _hide_ what the object is).
ru: непрозрачных объектов (где typedef активно используется для _сокрытия_ объекта).

source: Example: "pte_t" etc. opaque objects that you can only access using the proper accessor functions.
ru: Пример: "pte_t" и другие непрозрачные объекты, доступ к которым можно получить с помощью соответствующих функций доступа.

source: NOTE! Opaqueness and "accessor functions" are not good in themselves. The reason we have them for things like pte_t etc. is that there really is absolutely _zero_ portably accessible information there.
ru: ВНИМАНИЕ! Непрозрачность и функции доступа сами по себе не слишком хороши. Причина, по которой мы используем их для pte_t и т.п., состоит в том, что на самом деле там _нет_ никакой информации для скачивания.

source: Clear integer types, where the abstraction _helps_ avoid confusion whether it is "int" or "long".
ru: Чисто целочисленные типы, где абстракция _помогает_ избежать путаницы, "int" это или "long".

source: u8/u16/u32 are perfectly fine typedefs, although they fit into category (d) better than here.
ru: u8/u16/u32 -- вполне нормальные typedef, хотя они больше подходят для категории (d).

source: NOTE! Again - there needs to be a _reason_ for this. If something is "unsigned long", then there's no reason to do
ru: ВНИМАНИЕ! Опять же -- для этого должна быть _причина_. Если что-то представляет собой "unsigned long", должна быть причина для

source: but if there is a clear reason for why it under certain circumstances might be an "unsigned int" and under other configurations might be "unsigned long", then by all means go ahead and use a typedef.
ru: но если есть четкая причина, почему при определенных обстоятельствах может быть "unsigned int", а в других случаях может быть "unsigned long", то на здоровье, используйте typedef.

source: when you use sparse to literally create a _new_ type for type-checking.
ru: когда вы используете разрыв, чтобы буквально создать _новый_ тип для проверки типов.

source: New types which are identical to standard C99 types, in certain exceptional circumstances.
ru: Новые типы, идентичные стандартным типам C99, в определенных исключительных обстоятельствах.

source: Although it would only take a short amount of time for the eyes and brain to become accustomed to the standard types like 'uint32_t', some people object to their use anyway.
ru: Хотя глазам и мозгу требуется лишь короткое время, чтобы привыкнуть к стандартным типам, например, 'uint32_t', некоторые в любом случае возражают против их использования.

source: Therefore, the Linux-specific 'u8/u16/u32/u64' types and their signed equivalents which are identical to standard types are permitted -- although they are not mandatory in new code of your own.
ru: Таким образом, допускаются специфичные для Linux типы 'u8/u16/u32/u64' и их эквиваленты, идентичные стандартным типам, хотя они и не обязательны новом коде.

source: When editing existing code which already uses one or the other set of types, you should conform to the existing choices in that code.
ru: При редактировании существующего кода, в котором уже используется один или другой набор типов, следует придерживаться выбранного типа.

source: Types safe for use in userspace.
ru: Типы, которые можно использовать в пользовательском пространстве.

source: In certain structures which are visible to userspace, we cannot require C99 types and cannot use the 'u32' form above. Thus, we use __u32 and similar types in all structures which are shared with userspace.
ru: В некоторых структурах, видимых в пользовательском пространстве, мы не можем требовать использования типов C99 и не можем применять форму 'u32' выше. Таким образом, мы используем __u32 и подобные типы во всех структурах, которые используются и в пользовательском пространстве.

source: Maybe there are other cases too, but the rule should basically be to NEVER EVER use a typedef unless you can clearly match one of those rules.
ru: Возможно, есть и другие случаи, но основное правило состоит в следующем: НИКОГДА НЕ используйте typedef, если вы не соблюдаете одно из этих правил.

source: In general, a pointer, or a struct that has elements that can reasonably be directly accessed should **never** be a typedef.
ru: В общем, указатель или структура, содержащие элементы, к которым можно получить прямой доступ, **никогда** не должны быть typedef.

source: Chapter 6: Functions
ru: Глава 6: Функции

source: Functions should be short and sweet, and do just one thing. They should fit on one or two screenfuls of text (the ISO/ANSI screen size is 80x24, as we all know), and do one thing and do that well.
ru: Функции должны быть короткими и приятными, и выполнять только одно действие. Они должны помещаться на одном или двух экранах текста (размер экрана ISO/ANSI 80x24, как мы все знаем), и выполнять одно действие, но делать это хорошо.

source: The maximum length of a function is inversely proportional to the complexity and indentation level of that function. So, if you have a conceptually simple function that is just one long (but simple) case-statement, where you have to do lots of small things for a lot of different cases, it's OK to have a longer function.
ru: Максимальная длина функции обратно пропорциональна сложности функции и уровню отступов. Итак, если у вас есть концептуально простая функция, которая представляет собой лишь один длинный (но простой) оператор вариант case, где вам нужно делать много мелочей для множества разных случаев, длинная функция -- это нормально.

source: However, if you have a complex function, and you suspect that a less-than-gifted first-year high-school student might not even understand what the function is all about, you should adhere to the maximum limits all the more closely. Use helper functions with descriptive names (you can ask the compiler to in-line them if you think it's performance-critical, and it will probably do a better job of it than you would have done).
ru: Однако, если у вас есть сложная функция, и вы подозреваете, что не слишком одаренный старшеклассник может даже не понять, о чем эта функция, следует придерживаться ограничений. Используйте вспомогательные функции с описательными именами (можно попросить компилятор встроить их, если считаете, что это критически важно для производительности, и он, вероятно, справится лучше).

source: Another measure of the function is the number of local variables. They shouldn't exceed 5-10, or you're doing something wrong. Re-think the function, and split it into smaller pieces. A human brain can generally easily keep track of about 7 different things, anything more and it gets confu/sed. You know you're brilliant, but maybe you'd like to understand what you did 2 weeks from now.
ru: Другим критерием функции является количество локальных переменных. Их не должно быть больше 5-10, или вы делаете что-то неправильно. Продумайте функцию заново и разбейте ее на более мелкие части. Человеческий мозг обычно легко отслеживает около 7 разных вещей, а больше -- и он уже запутается. Вы знаете, что сейчас вы гений, но, возможно, вам через пару недель захочется понять, что именно вы делали.

source: In source files, separate functions with one blank line. If the function is exported, the EXPORT* macro for it should follow immediately after the closing function brace line. E.g.:
ru: В исходных файлах разделяйте функции пустой строкой. Если функция экспортируется, макрос EXPORT* должен следовать сразу за строкой с закрывающей фигурной скобкой. Например:

source: In function prototypes, include parameter names with their data types. Although this is not required by the C language, it is preferred in Linux because it is a simple way to add valuable information for the reader.
ru: В прототипах функций включайте имена параметров с типами данных. Хотя для языка C это и не требуется, но рекомендуется для Linux, потому что это простой способ добавить ценную информацию для читателя.

source: Chapter 7: Centralized exiting of functions
ru: Глава 7: Централизованный выход из функции

source: Albeit deprecated by some people, the equivalent of the goto statement is used frequently by compilers in form of the unconditional jump instruction.
ru: Хотя некоторые объявили аналог оператора goto устаревшим, его часто используют компиляторы в виде инструкции безусловной передачи управления.

source: The goto statement comes in handy when a function exits from multiple locations and some common work such as cleanup has to be done.
ru: Оператор goto пригодится, когда функция производит выход из нескольких мест, и необходимо выполнить какие-то общие действия, такие как очистка.

source: The rationale is:
ru: Обоснование:

source: unconditional statements are easier to understand and follow
ru: безусловные операторы легче понять и выполнять

source: nesting is reduced
ru: уменьшается глубина вложения

source: errors by not updating individual exit points when making modifications are prevented
ru: предотвращаются ошибки по причине отсутствия обновления отдельных точек выхода при внесении изменений

source: saves the compiler work to optimize redundant code away ;)
ru: уменьшает объем работы компилятора для оптимизации избыточного кода ;)

source: Chapter 8: Commenting
ru: Глава 8: Комментирование

source: Comments are good, but there is also a danger of over-commenting. NEVER try to explain HOW your code works in a comment: it's much better to write the code so that the _working_ is obvious, and it's a waste of time to explain badly written code. с Generally, you want your comments to tell WHAT your code does, not HOW. Also, try to avoid putting comments inside a function body: if the function is so complex that you need to separately comment parts of it, you should probably go back to chapter 6 for a while. You can make small comments to note or warn about something particularly clever (or ugly), but try to avoid excess. Instead, put the comments at the head of the function, telling people what it does, and possibly WHY it does it.
ru: Комментарии полезны, но есть и опасность чрезмерного комментирования. НИКОГДА не пытайтесь объяснить в комментарии, КАК работает ваш код: гораздо лучше написать код так, чтобы принцип _работы_ был очевиден, а объяснять плохо написанный код -- это пустая трата времени. Как правило, желательно, чтобы комментарии поясняли, ЧТО делает ваш код, а не КАК. Кроме того, постарайтесь не размещать комментарии внутри тела функции: если функция настолько сложна, что нужно отдельно комментировать ее части, скорее всего, вам надо вернуться к главе 6. Можно давать небольшие комментарии, чтобы отметить или предупредить о чем-то особенно умном (или уродливом), но старайтесь избегать лишнего. Вместо этого поставьте комментарии во главе функции, сообщите людям, что она делает, и, возможно, ПОЧЕМУ она это делает.

source: When commenting the kernel API functions, please use the kernel-doc format. See the files Documentation/kernel-doc-nano-HOWTO.txt and scripts/kernel-doc for details.
ru: Комментируя функции API ядра, используйте формат kernel-doc. Более подробную информацию см. в файлах Documentation/kernel-doc-nano-HOWTO.txt и scripts/kernel-doc.

source: Linux style for comments is the C89 ``"/\* ... \*/"`` style. Don't use C99-style ``"// ..."`` comments.
ru: Стиль Linux для комментариев -- стиль C89 ``"/\* ... \*/"``. Не используйте стиль C99 ``"// ..."``.

source: The preferred style for long (multi-line) comments is:
ru: Для длинных (многострочных) комментариев рекомендуется:

source: /* * This is the preferred style for multi-line * comments in the Linux kernel source code. * Please use it consistently. * * Description: A column of asterisks on the left side, * with beginning and ending almost-blank lines. */
ru: /* * Рекомендуется использовать этот стиль для многострочных * комментариев в исходном коде ядра Linux. * Просьба использовать его согласованно. * * Описание: Столбец звездочек слева, * в начале и в конце почти пустые строки. */

source: It's also important to comment data, whether they are basic types or derived types. To this end, use just one data declaration per line (no commas for multiple data declarations). This leaves you room for a small comment on each item, explaining its use.
ru: Также важно комментировать данные, являются ли они базовыми или производными типами. Для этого используйте только одно объявление данных в строке (без запятой для объявления массива данных). Это оставляет вам место для небольшого комментария к каждому пункту с объяснением его использования.

source: Chapter 9: You've made a mess of it
ru: Глава 9: Вы устроили беспорядок

source: That's OK, we all do. You've probably been told by your long-time Unix user helper that "GNU emacs" automatically formats the C sources for you, and you've noticed that yes, it does do that, but the defaults it uses are less than desirable (in fact, they are worse than random typing - an infinite number of monkeys typing into GNU emacs would never make a good program).
ru: Всё в порядке, мы все так делаем. Наверное, опытный пользователь Unix, который вам помогает, сказал, что "GNU emacs" автоматически форматирует исходный код C, и вы заметили, что да, действительно, но используемые по умолчанию значения оставляют желать лучшего ( на самом деле, они хуже, чем случайные -- несметное количество обезьян, печатающих в GNU emacs, никогда не создаст хорошую программу).

source: So, you can either get rid of GNU emacs, or change it to use saner values. To do the latter, you can stick the following in your .emacs file:
ru: Итак, вы можете либо избавиться от GNU emacs, либо изменить его для использования более адекватных значений. Чтобы сделать последнее, можно вставить следующее в файл .emacs:
