Repository: tarantool/doc
Catalog: locale/*/LC_MESSAGES/doc.po
Languages: ru

source: For simple public data attributes, it is best to expose just the attribute name, without complicated accessor/mutator methods. Keep in mind that Python provides an easy path to future enhancement, should you find that a simple data attribute needs to grow functional behavior. In that case, use properties to hide functional implementation behind simple data attribute access syntax.
ru: Назовите простые открытые атрибуты понятными именами и не пишите сложные методы доступа и изменения (accessor/mutator). Следует помнить, что в Python очень легко расширить поведение функции, если потребуется. В этом случае используйте свойства (properties), чтобы скрыть функциональную реализацию за синтаксисом доступа к атрибутам.

source: Properties only work on new-style classes.
ru: Свойства работают только в классах нового стиля (new-style classes).

source: Note 2:
ru: Примечание 2:

source: Try to keep the functional behavior side-effect free, although side-effects such as caching are generally fine.
ru: Постарайтесь избавиться от побочных эффектов, связанных с функциональным поведением, хотя такие вещи, как кэширование, вполне допустимы.

source: Note 3:
ru: Примечание 3:

source: Avoid using properties for computationally expensive operations; the attribute notation makes the caller believe that access is (relatively) cheap.
ru: Избегайте использовать вычислительно затратные операции, потому что из-за записи с помощью атрибутов создается впечатление, что доступ происходит (относительно) быстро.

source: If your class is intended to be subclassed, and you have attributes that you do not want subclasses to use, consider naming them with double leading underscores and no trailing underscores. This invokes Python's name mangling algorithm, where the name of the class is mangled into the attribute name. This helps avoid attribute name collisions should subclasses inadvertently contain attributes with the same name.
ru: Если ваш класс предназначен для разделения на подклассы, но некоторые атрибуты не должны наследоваться подклассами, подумайте о добавлении в имена двух символов подчеркивания в начале и ни одного в конце. Механизм изменения имен в Python сработает так, что имя класса добавится к имени такого атрибута. Это позволит избежать конфликта имен, если в подклассах случайно появятся атрибуты с такими же именами.

source: Note that only the simple class name is used in the mangled name, so if a subclass chooses both the same class name and attribute name, you can still get name collisions.
ru: Обратите внимание, что только имена простых классов используются в измененном имени, поэтому если в подклассе будет то же имя класса и имя атрибута, то снова возникнет конфликт имен.

source: Name mangling can make certain uses, such as debugging and ``__getattr__()``, less convenient. However the name mangling algorithm is well documented and easy to perform manually.
ru: Механизм изменения имен может затруднить отладку или работу с ``__getattr__()``. Тем не менее, алгоритм хорошо документирован и легко реализуется вручную.

source: Not everyone likes name mangling. Try to balance the need to avoid accidental name clashes with potential use by advanced callers.
ru: Не всем нравится механизм изменения имен. Постарайтесь достичь компромисса между необходимостью избежать конфликта имен и возможностью доступа к этим атрибутам.

source: References
ru: Использованная литература

source: `PEP 7, Style Guide for C Code, van Rossum <https://www.python.org/dev/peps/pep-0007/>`_
ru: ван Россум Гвидо. `PEP 7, Руководство по программированию на языке C <https://www.python.org/dev/peps/pep-0007/>`_

source: `Barry's GNU Mailman style guide <http://barry.warsaw.us/software/STYLEGUIDE.txt>`_
ru: `Руководство Барри по GNU Mailman <http://barry.warsaw.us/software/STYLEGUIDE.txt>`_

source: `CamelCase Wikipedia page <http://www.wikipedia.com/wiki/CamelCase>`_
ru: `Страница Википедии о CamelCase <http://www.wikipedia.com/wiki/CamelCase>`_

source: Copyright
ru: Защита авторских прав

source: Author:
ru: Автор:

source: Guido van Rossum <guido@python.org>
ru: Гвидо ван Россум <guido@python.org>

source: Barry Warsaw <barry@python.org>
ru: Барри Ворсо <barry@python.org>

source: Module `box`
ru: Модуль `box`

source: Opaque structure passed to a C stored procedure
ru: Непрозрачная структура, передаваемая в хранимую процедуру на языке C.

source: Return a tuple from a C stored procedure.
ru: Возврат кортежа с помощью хранимой процедуры на языке C.

source: The returned tuple is automatically reference-counted by Tarantool. An example program that uses ``box_return_tuple()`` is :ref:`write.c <f_c_tutorial-write>`.
ru: Для возвращаемого кортежа Tarantool проводит автоматический подсчет ссылок. Пример программы, которая использует ``box_return_tuple()``: :ref:`write.c <f_c_tutorial-write>`.

source: an opaque structure passed to the C stored procedure by Tarantool
ru: непрозрачная структура, передаваемая Tarantool'ом в хранимую процедуру на языке C

source: a tuple to return
ru: возвращаемый кортеж

source: Returns
ru: Возвращает

source: -1 on error (perhaps, out of memory; check :ref:`box_error_last()<c_api-error-box_error_last>`)
ru: -1 в случае ошибки (возможная нехватка памяти; проверьте :ref:`box_error_last()<c_api-error-box_error_last>`)

source: 0 otherwise
ru: 0 в остальных случаях

source: Find space id by name.
ru: Поиск идентификатора спейса по имени.

source: This function performs a SELECT request on the ``_vspace`` system space.
ru: Данная функция делает запрос выборки SELECT из системного спейса ``_vspace``.

source: space name
ru: имя спейса

source: length of ``name``
ru: длина имени ``name``

source: :c:macro:`BOX_ID_NIL` on error or if not found (check :ref:`box_error_last()<c_api-error-box_error_last>`)
ru: :c:macro:`BOX_ID_NIL` в случае ошибки или отсутствия (проверьте :ref:`box_error_last()<c_api-error-box_error_last>`)

source: space_id otherwise
ru: space_id в остальных случаях

source: See also: :c:type:`box_index_id_by_name`
ru: См. также :c:type:`box_index_id_by_name`

source: Find index id by name.
ru: Поиск идентификатора индекса по имени.

source: This function performs a SELECT request on the ``_vindex`` system space.
ru: Данная функция делает запрос выборки SELECT из системного спейса ``_vindex``.

source: space identifier
ru: идентификатор спейса

source: index name
ru: имя индекса

source: See also: :c:type:`box_space_id_by_name`
ru: См. также :c:type:`box_space_id_by_name`

source: Execute an INSERT/REPLACE request.
ru: Выполнение запроса вставки или замены (INSERT/REPLACE).

source: encoded tuple in MsgPack Array format ([ field1, field2, ...])
ru: закодированный кортеж в формате MsgPack-массива ([ field1, field2, ...])

source: end of a ``tuple``
ru: конец кортежа ``tuple``

source: output argument. Resulting tuple. Can be set to NULL to discard result
ru: аргумент вывода. Возвращаемый кортеж. Можно задать значение NULL для сброса результата

source: -1 on error (check :ref:`box_error_last()<c_api-error-box_error_last>`)
ru: -1 в случае ошибки (проверьте :ref:`box_error_last()<c_api-error-box_error_last>`)

source: See also :ref:`space_object.insert()<box_space-insert>`
ru: См. также :ref:`space_object.insert()<box_space-insert>`

source: Execute a REPLACE request.
ru: Выполнение запроса замены (REPLACE).

source: See also :ref:`space_object.replace()<box_space-replace>`
ru: См. также :ref:`space_object.replace()<box_space-replace>`

source: Execute a DELETE request.
ru: Выполнение запроса удаления (DELETE).

source: index identifier
ru: идентификатор индекса

source: encoded key in MsgPack Array format ([ field1, field2, ...])
ru: закодированный ключ в формате MsgPack-массива ([ field1, field2, ...])

source: end of a ``key``
ru: конец ключа ``key``

source: output argument. An old tuple. Can be set to NULL to discard result
ru: аргумент вывода. Старый кортеж. Можно задать значение NULL для сброса результата

source: See also :ref:`space_object.delete()<box_space-delete>`
ru: См. также :ref:`space_object.delete()<box_space-delete>`

source: Execute an UPDATE request.
ru: Выполнение запроса обновления (UPDATE).

source: encoded operations in MsgPack Array format, e.g. ``[[ '=', field_id, value ], ['!', 2, 'xxx']]``
ru: закодированные операции в формате MsgPack-массива, например ``[[ '=', field_id, value ], ['!', 2, 'xxx']]``

source: end of an ``ops`` section
ru: конец раздела операций ``ops``

source: 0 if field_ids are zero-based as in C, 1 if field ids are 1-based as in Lua
ru: 0, если идентификаторы полей field_id с основанием 0, как в C, 1, если идентификаторы полей с основанием 1, как в Lua

source: See also :ref:`space_object.update()<box_space-update>`
ru: См. также :ref:`space_object.update()<box_space-update>`

source: Execute an UPSERT request.
ru: Выполнение запроса обновления и вставки (UPSERT).

source: end of a ``ops``
ru: конец операций ``ops``

source: -1 on error (check ::ref:`box_error_last()<c_api-error-box_error_last>`)
ru: -1 в случае ошибки (проверьте :ref:`box_error_last()<c_api-error-box_error_last>`)

source: See also :ref:`space_object.upsert()<box_space-upsert>`
ru: См. также :ref:`space_object.upsert()<box_space-upsert>`

source: Truncate a space.
ru: Очистка спейса.

source: Module `index`
ru: Модуль `index`

source: A space iterator
ru: Итератор спейса

source: Controls how to iterate over tuples in an index. Different index types support different iterator types. For example, one can start iteration from a particular value (request key) and then retrieve all tuples where keys are greater or equal (= GE) to this key.
ru: Управление итерацией кортежей в индексе. Различные типы индексов поддерживают различные типы итераторов. Например, можно начать итерацию с определенного значения (ключ запроса), а затем получить все кортежи, ключи которых больше или равны (= GE) заданному ключу.

source: If iterator type is not supported by the selected index type, iterator constructor must fail with ER_UNSUPPORTED. To be selectable for primary key, an index must support at least ITER_EQ and ITER_GE types.
ru: Если тип итератора не поддерживается выбранным типом индекса, конструктор итератора прекратит работу с ошибкой ER_UNSUPPORTED. Чтобы индекс можно было выбрать для первичного ключа, он должен поддерживать типы ITER_EQ и ITER_GE.

source: NULL value of request key corresponds to the first or last key in the index, depending on iteration direction. (first key for GE and GT types, and last key for LE and LT). Therefore, to iterate over all tuples in an index, one can use ITER_GE or ITER_LE iteration types with start key equal to NULL. For ITER_EQ, the key must not be NULL.
ru: Значение ключа запроса NULL соответствует первому или последнему ключу в индексе, в зависимости от направления итерации (первый ключ для типов GE и GT, последний ключ для типов LE и LT). Таким образом, для итерации по всем кортежам в индексе можно использовать типы итерации ITER_GE или ITER_LE с начальным ключом, который равен NULL. Для ITER_EQ ключ не должен равняться NULL.

source: key == x ASC order
ru: ключ == x в порядке возрастания

source: key == x DESC order
ru: ключ == x в порядке убывания

source: all tuples
ru: все кортежи

source: key < x
ru: ключ < x

source: key <= x
ru: ключ <= x

source: key >= x
ru: ключ >= x

source: key > x
ru: ключ > x

source: all bits from x are set in key
ru: все биты из x заданы в ключе

source: at least one x's bit is set
ru: задан хотя бы один бит из x

source: all bits are not set
ru: ни один бит не задан

source: key overlaps x
ru: ключ пересекается с x

source: tuples in distance ascending order from specified point
ru: кортежи в порядке возрастания расстояния из указанной точки

source: Allocate and initialize iterator for space_id, index_id.
ru: Выделение и инициализация итератора для space_id, index_id.

source: The returned iterator must be destroyed by :ref:`box_iterator_free<c_api-box_index-box_iterator_free>`.
ru: Возвращаемый итератор следует удалить с помощью :ref:`box_iterator_free<c_api-box_index-box_iterator_free>`.

source: encode key in MsgPack Array format ([part1, part2, ...])
ru: кодировка ключа в формате MsgPack-массива ([part1, part2, ...])

source: the end of encoded ``key``
ru: часть закодированного ключа ``key``

source: NULL on error (check :ref:`box_error_last <c_api-error-box_error_last>`)
ru: NULL в случае ошибки (проверьте :ref:`box_error_last()<c_api-error-box_error_last>`)

source: iterator otherwise
ru: итератор в остальных случаях

source: See also :ref:`box_iterator_next<c_api-box_index-box_iterator_next>`, :ref:`box_iterator_free<c_api-box_index-box_iterator_free>`
ru: См. также :ref:`box_iterator_next<c_api-box_index-box_iterator_next>`, :ref:`box_iterator_free<c_api-box_index-box_iterator_free>`

source: Retrieve the next item from the ``iterator``.
ru: Получение следующего пункта из итератора ``iterator``.

source: an iterator returned by :ref:`box_index_iterator <c_api-box_index-box_index_iterator>`
ru: итератор, возвращаемый :ref:`box_index_iterator <c_api-box_index-box_index_iterator>`

source: output argument. result a tuple or NULL if there is no more data.
ru: аргумент вывода. Результатом будет кортеж или NULL, если данных больше нет.

source: -1 on error (check :ref:`box_error_last <c_api-error-box_error_last>`)
ru: -1 в случае ошибки (проверьте :ref:`box_error_last()<c_api-error-box_error_last>`)

source: 0 on success. The end of data is not an error.
ru: 0 в случае выполнения. Отсутствие данных не является ошибкой.

source: Destroy and deallocate iterator.
ru: Удаление и освобождение итератора.

source: Determine a direction of the given iterator type: -1 for REQ, LT, LE, and +1 for all others.
ru: Определение направления заданного типа итератора: -1 для REQ, LT, LE, и +1 для всех остальных.

source: Return the number of element in the index.
ru: Возврат номера элемента в индексе.

source: >= 0 otherwise
ru: >= 0 в остальных случаях

source: Return the number of bytes used in memory by the index.
ru: Возврат количества байтов памяти, используемых индексом.

source: Return a random tuple from the index (useful for statistical analysis).
ru: Возврат случайного кортежа из индекса (используется для статистического анализа).

source: random seed
ru: случайное начальное число

source: output argument. result a tuple or NULL if there is no tuples in space
ru: аргумент вывода. Результатом будет кортеж или NULL, если в спейсе нет кортежей.

source: See also: :ref:`index_object.random<box_index-random>`
ru: См. также :ref:`index_object.random<box_index-random>`

source: Get a tuple from index by the key.
ru: Получение кортежа из индекса по ключу.

source: Please note that this function works much more faster than :ref:`index_object.select<box_index-select>` or :ref:`box_index_iterator<c_api-box_index-box_index_iterator>` + :ref:`box_iterator_next<c_api-box_index-box_iterator_next>`.
ru: Следует отметить, что данная функция работает намного быстрее, чем :ref:`index_object.select<box_index-select>` или :ref:`box_index_iterator<c_api-box_index-box_index_iterator>` + :ref:`box_iterator_next<c_api-box_index-box_iterator_next>`.

source: 0 on success
ru: 0, если выполнено

source: See also: ``index_object.get()``
ru: См. также ``index_object.get()``

source: Return a first (minimal) tuple matched the provided key.
ru: Возврат первого (минимального) кортежа, который соответствует заданному ключу.

source: -1 on error (check :ref:`box_error_last() <c_api-error-box_error_last>`)
ru: -1 в случае ошибки (проверьте :ref:`box_error_last()<c_api-error-box_error_last>`)

source: See also: :ref:`index_object.min()<box_index-min>`
ru: См. также :ref:`index_object.min()<box_index-min>`

source: Return a last (maximal) tuple matched the provided key.
ru: Возврат последнего (максимального) кортежа, который соответствует заданному ключу.

source: See also: :ref:`index_object.max()<box_index-max>`
ru: См. также :ref:`index_object.max()<box_index-max>`

source: Count the number of tuple matched the provided key.
ru: Подсчет количества кортежей, которые соответствуют заданному ключу.

source: See also: :ref:`index_object.count()<box_index-count>`
ru: См. также :ref:`index_object.count()<box_index-count>`

source: Return :ref:`key definition <capi-tuple_key_def>` for an index
ru: Возврат :ref:`определения ключа <capi-tuple_key_def>` для индекса

source: Returned object is valid until the next yield.
ru: Возвращаемый объект действителен до следующей передачи управления.

source: key definition on success
ru: определение ключа, если выполнено

source: NULL on error
ru: NULL в случае ошибки

source: See also: :ref:`box_tuple_compare() <capi-tuple_box_tuple_compare>`,
ru: См. также :ref:`box_tuple_compare() <capi-tuple_box_tuple_compare>`,

source: Module `clock`
ru: Модуль `clock`

source: Module `coio`
ru: Модуль `coio`

source: READ event
ru: событие чтения READ

source: WRITE event
ru: событие записи WRITE

source: Wait until READ or WRITE event on socket (``fd``). Yields.
ru: Ожидание события чтения или записи (READ / WRITE) на сокете (``fd``) с передачей управления.

source: non-blocking socket file description
ru: дескриптор файла сокета без блокировки

source: requested events to wait. Combination of ``COIO_READ | COIO_WRITE`` bit flags.
ru: запрашиваемые события. Комбинация битовых флагов ``COIO_READ | COIO_WRITE``.

source: timeout in seconds.
ru: время ожидания в секундах.

source: 0 - timeout
ru: 0 - время ожидания

source: >0 - returned events. Combination of ``TNT_IO_READ | TNT_IO_WRITE`` bit flags.
ru: >0 - возвращаемые события. Комбинация битовых флагов ``TNT_IO_READ | TNT_IO_WRITE``.

source: Create new eio task with specified function and arguments. Yield and wait until the task is complete or a timeout occurs. This function may use the :ref:`worker_pool_threads <cfg_basic-worker_pool_threads>` configuration parameter.
ru: Создание новой задачи ошибочного ввода-вывода (eio) с указанной функцией и аргументами. Передает управление и ожидает окончания задачи или истечения времени ожидания. Функция может использовать конфигурационный параметр :ref:`worker_pool_threads <cfg_basic-worker_pool_threads>`.

source: To avoid double error checking, this function does not throw exceptions. In most cases it is also necessary to check the return value of the called function and perform necessary actions. If func sets errno, the errno is preserved across the call.
ru: Во избежание двойной проверки ошибок функция не выбрасывает исключения. В большинстве случаев также необходимо проверять возвращаемое значение вызванной функции и выполнить необходимые действия. Если функция определяет номер ошибки errno, этот номер ошибки сохраняется в течение вызова.

source: -1 and ``errno`` = ENOMEM if failed to create a task
ru: -1 и ``errno`` = ENOMEM, если задача не была создана

source: the function return (``errno`` is preserved).
ru: возврат функции (``errno`` сохраняется).

source: static ssize_t openfile_cb(va_list ap) { const char* filename = va_arg(ap); int flags = va_arg(ap); return open(filename, flags); } if (coio_call(openfile_cb, 0.10, "/tmp/file", 0) == -1) // handle errors. ...
ru: static ssize_t openfile_cb(va_list ap) { const char* filename = va_arg(ap); int flags = va_arg(ap); return open(filename, flags); } if (coio_call(openfile_cb, 0.10, "/tmp/file", 0) == -1) // обработка ошибок. ...

source: Fiber-friendly version of :manpage:`getaddrinfo(3)`.
ru: Версия :manpage:`getaddrinfo(3)` для файбера.

source: Close the ``fd`` and wake any fiber blocked in :ref:`coio_wait() <c_api-coio-coio_wait>` call on this ``fd``.
ru: Закрытие ``fd`` и пробуждение любого файбера, заблокированного в вызове :ref:`coio_wait() <c_api-coio-coio_wait>` на данном сокете ``fd``.

source: the result of ``close(fd)``, see :manpage:`close(2)`
ru: результат ``close(fd)``, см. :manpage:`close(2)`

source: Module `error`
ru: Модуль `error`

source: Error - contains information about error.
ru: Ошибка -- содержит информацию об ошибке.

source: Return the error type, e.g. "ClientError", "SocketError", etc.
ru: Возврат типа ошибки, например, "ClientError", "SocketError" и т.д.

source: error
ru: ошибка

source: not-null string
ru: ненулевая строка

source: Return IPROTO error code
ru: Возврат кода ошибки IPROTO

source: Return the error message
ru: Возврат сообщения ошибки

source: Get the information about the last API call error.
ru: Получение информации о последней ошибке вызова API.

source: The Tarantool error handling works most like libc's errno. All API calls return -1 or NULL in the event of error. An internal pointer to box_error_t type is set by API functions to indicate what went wrong. This value is only significant if API call failed (returned -1 or NULL).
ru: Обработка ошибок в Tarantool'е больше всего похожа на errno в стандартной библиотеке языка С libc. Все вызовы API возвращают -1 или NULL в случае ошибки. Внутренний указатель на тип box_error_t задается функциями, чтобы указать, что пошло не так. Это значение показательно, если вызов API не прошел (вернулось -1 или NULL).

source: Successful function can also touch the last error in some cases. You don't have to clear the last error before calling API functions. The returned object is valid only until next call to **any** API function.
ru: Выполненная функция в некоторых случаях также может затрагивать последнюю ошибку. Необязательно удалять последнюю ошибку перед вызовом API-функций. Возвращаемый объект применим только до следующего вызова **любой** API-функции.

source: You must set the last error using box_error_set() in your stored C procedures if you want to return a custom error message. You can re-throw the last API error to IPROTO client by keeping the current value and returning -1 to Tarantool from your stored procedure.
ru: Следует задать последнюю ошибку с помощью box_error_set() из хранимых процедур на языке C, если необходимо вернуть специальное сообщение об ошибке. Можно повторно сгенерировать последнюю API-ошибку в клиент IPROTO, сохранив текущее значение и вернув -1 to Tarantool из хранимой процедуры.

source: last error
ru: последняя ошибка

source: Clear the last error.
ru: Удаление последней ошибки.

source: Set the last error.
ru: Определение последней ошибки.

source: format arguments
ru: аргументы формата

source: See also: IPROTO :ref:`error code<capi-box_error_code>`
ru: См. также IPROTO :ref:`error code<capi-box_error_code>`

source: A backward-compatible API define.
ru: Обратно совместимые определения API.

source: Module `fiber`
ru: Модуль `fiber`

source: Fiber - contains information about a :ref:`fiber <atomic-threads_fibers_yields>`.
ru: Файбер -- содержит информацию о :ref:`файбере <atomic-threads_fibers_yields>`.

source: Function to run inside a fiber.
ru: Функции для выполнения в файбере.

source: Create a new fiber.
ru: Создание нового файбера.

source: Takes a fiber from the fiber cache, if it's not empty. Can fail only if there is not enough memory for the fiber structure or fiber stack.
ru: Берет файбер из кэша файберов, если в нем что-то есть. Может не сработать, только если недостаточно памяти для структуры файбера или стека файбера.

source: The created fiber automatically returns itself to the fiber cache when its "main" function completes.
ru: Созданный файбер автоматически возвращается в кэш файберов, когда выполнена его основная функция.

source: string with fiber name
ru: строка с именем файбера

source: func for run inside fiber
ru: функция для выполнения в файбере

source: See also: :ref:`fiber_start()<c_api-fiber-fiber_start>`
ru: См. также :ref:`fiber_start()<c_api-fiber-fiber_start>`

source: Create a new fiber with defined attributes.
ru: Создание нового файбера с заданными атрибутами.
