Repository: tarantool/doc
Catalog: locale/*/LC_MESSAGES/doc.po
Languages: ru

source: This section describes how Tarantool stores values and what operations with data it supports.
ru: В этом разделе описывается то, как в Tarantool'е организовано хранение данных и какие операции с данным он поддерживает.

source: If you tried to create a database as suggested in our :ref:`"Getting started" exercises <getting_started>`, then your test database now looks like this:
ru: Если вы пробовали создать базу данных, как предлагается в упражнениях в :ref:`"Руководстве для начинающих" <getting_started>`, то ваша тестовая база данных выглядит следующим образом:

source: Space
ru: Спейс

source: A **space** -- 'tester' in our example -- is a container.
ru: *Спейс* -- с именем 'tester' в нашем примере -- это контейнер.

source: When Tarantool is being used to store data, there is always at least one space. Each space has a unique **name** specified by the user. Besides, each space has a unique **numeric identifier** which can be specified by the user, but usually is assigned automatically by Tarantool. Finally, a space always has an **engine**: *memtx* (default) -- in-memory engine, fast but limited in size, or *vinyl* -- on-disk engine for huge data sets.
ru: Когда Tarantool используется для хранения данных, всегда существует хотя бы один спейс. У каждого спейса есть уникальное **имя**, указанное пользователем. Кроме того, пользователь может указать уникальный **числовой идентификатор**, но обычно Tarantool назначает его автоматически. Наконец, в спейсе всегда есть **движок**: *memtx* (по умолчанию) -- in-memory движок, быстрый, но ограниченный в размере, или *vinyl* -- дисковый движок для огромного количества данных.

source: A space is a container for :ref:`tuples <index-box_tuple>`. To be functional, it needs to have a :ref:`primary index <index-box_index>`. It can also have secondary indexes.
ru: Спейс -- это контейнер для :ref:`кортежей <index-box_tuple>`. Для работы ему необходим :ref:`первичный индекс <index-box_index>`. Также возможно использование вторичных индексов.

source: Tuple
ru: Кортеж

source: A **tuple** plays the same role as a “row” or a “record”, and the components of a tuple (which we call “fields”) play the same role as a “row column” or “record field”, except that:
ru: **Кортеж** играет такую же роль, как “строка” или “запись”, а компоненты кортежа (которые мы называем “полями”) играют такую же роль, что и “столбец” или “поле записи”, не считая того, что:

source: fields can be composite structures, such as arrays or maps, and
ru: поля могут представлять собой композитные структуры, такие как таблицы типа массива или ассоциативного массива, а также

source: fields don't need to have names.
ru: полям не нужны имена.

source: Any given tuple may have any number of fields, and the fields may be of different :ref:`types <index-box_data-types>`. The identifier of a field is the field's number, base 1 (in Lua and other 1-based languages) or base 0 (in PHP or C/C++). For example, “1” or "0" can be used in some contexts to refer to the first field of a tuple.
ru: В любом кортеже может быть любое количество полей, и это могут быть поля разных :ref:`типов <index-box_data-types>`. Идентификатором поля является его номер, начиная с 1 (в Lua и других языках с индексацией с 1) или с 0 (в PHP или C/C++). Например, “1” или "0" могут использоваться в некоторых контекстах для обозначения первого поля кортежа.

source: Tuples in Tarantool are stored as `MsgPack <https://en.wikipedia.org/wiki/MessagePack>`_ arrays.
ru: Кортежи в Tarantool'е хранятся в виде массивов `MsgPack <https://en.wikipedia.org/wiki/MessagePack>`_.

source: When Tarantool returns a tuple value in console, it uses the `YAML <https://en.wikipedia.org/wiki/YAML>`_ format, for example: ``[3, 'Ace of Base', 1993]``.
ru: Когда Tarantool выводит значение в кортеже в консоль, используется формат `YAML <https://ru.wikipedia.org/wiki/YAML>`_, например: ``[3, 'Ace of Base', 1993]``.

source: An **index** is a group of key values and pointers.
ru: **Индекс** -- это совокупность значений ключей и указателей.

source: As with spaces, you should specify the index **name**, and let Tarantool come up with a unique **numeric identifier** ("index id").
ru: Как и для спейсов, индексам следует указать **имена**, а Tarantool определит уникальный **числовой идентификатор** ("ID индекса").

source: An index always has a **type**. The default index type is 'TREE'. TREE indexes are provided by all Tarantool engines, can index unique and non-unique values, support partial key searches, comparisons and ordered results. Additionally, memtx engine supports HASH, RTREE and BITSET indexes.
ru: У индекса всегда есть определенный **тип**. Тип индекса по умолчанию -- 'TREE'. Все движки Tarantool'а предоставляют TREE-индексы, которые могут индексировать уникальные и неуникальные значения, поддерживают поиск по компонентам ключа, сравнение ключей и упорядоченные результаты. Кроме того, движок memtx поддерживает следующие индексы: HASH, RTREE и BITSET.

source: An index may be **multi-part**, that is, you can declare that an index key value is composed of two or more fields in the tuple, in any order. For example, for an ordinary TREE index, the maximum number of parts is 255.
ru: Индекс может быть **многокомпонентным**, то есть можно объявить, что ключ индекса состоит из двух или более полей в кортеже в любом порядке. Например, для обычного TREE-индекса максимальное количество частей равно 255.

source: An index may be **unique**, that is, you can declare that it would be illegal to have the same key value twice.
ru: Индекс может быть **уникальным**, то есть можно объявить, что недопустимо дважды задавать одно значение ключа.

source: The first index defined on a space is called the **primary key index**, and it must be unique. All other indexes are called **secondary indexes**, and they may be non-unique.
ru: Первый индекс, определенный для спейса, называется **первичный индекс**. Он должен быть уникальным. Все остальные индексы называются **вторичными индексами**, они могут строиться по неуникальным значениям.

source: An index definition may include identifiers of tuple fields and their expected **types** (see allowed :ref:`indexed field types <index-box_indexed-field-types>` below).
ru: Индекс может содержать идентификаторы полей кортежа и их предполагаемые **типы** (см. допустимые :ref:`типы индексированных полей <index-box_indexed-field-types>` ниже).

source: In our example, we first defined the primary index (named 'primary') based on field #1 of each tuple:
ru: В нашем примере для начала определяем первичный индекс (под названием 'primary') по полю №1 каждого кортежа:

source: The effect is that, for all tuples in space 'tester', field #1 must exist and must contain an unsigned integer. The index type is 'hash', so values in field #1 must be unique, because keys in HASH indexes are unique.
ru: Смысл в том, что поле №1 должно существовать и содержать целое число без знака для всех кортежей в спейсе 'tester'. Тип индекса -- 'hash', поэтому значения в поле №1 должны быть уникальными, поскольку ключи в HASH-индексах уникальны.

source: After that, we defined a secondary index (named 'secondary') based on field #2 of each tuple:
ru: После этого мы определим вторичный индекс (под названием 'secondary') по полю №2 каждого кортежа:

source: The effect is that, for all tuples in space 'tester', field #2 must exist and must contain a string. The index type is 'tree', so values in field #2 must not be unique, because keys in TREE indexes may be non-unique.
ru: Смысл в том, что поле №2 должно существовать и содержать строку для всех кортежей в спейсе 'tester'. Тип индекса -- 'tree', поэтому значения в поле №2 не должны быть уникальными, поскольку ключи в TREE-индексах могут не быть уникальными.

source: Space definitions and index definitions are stored permanently in Tarantool's system spaces :ref:`_space <box_space-space>` and :ref:`_index <box_space-index>` (for details, see reference on :ref:`box.space <box_space>` submodule).
ru: Определения спейса и определения индексов хранятся в системных спейсах Tarantool'а :ref:`_space <box_space-space>` и :ref:`_index <box_space-index>` соответственно (для получения подробной информации см. справочник по вложенному модулю :ref:`box.space <box_space>`).

source: You can add, drop, or alter the definitions at runtime, with some restrictions. See syntax details in reference on :ref:`box <box-module>` module.
ru: Можно добавлять, опускать или изменять определения во время исполнения кода с некоторыми ограничениями. Более подробно о синтаксисе см. в справочнике по модулю :ref:`box <box-module>`.

source: Data types
ru: Типы данных

source: Tarantool is both a database and an application server. Hence a developer often deals with two type sets: the programming language types (e.g. Lua) and the types of the Tarantool storage format (MsgPack).
ru: Tarantool представляет собой базу данных и сервер приложений одновременно. Следовательно, разработчик часто работает с двумя наборами типов: типы языка программирования (например, Lua) и типы формата хранилища Tarantool (MsgPack).

source: Lua vs MsgPack
ru: Lua в сравнении с MsgPack

source: Scalar / compound
ru: Скалярный / составной

source: MsgPack |nbsp| type
ru: MsgPack-тип |nbsp|

source: Lua type
ru: Lua-тип

source: Example value
ru: Пример значения

source: scalar
ru: скалярный

source: "`nil`_"
ru: "`nil`_" (нулевое значение)

source: "`boolean`_"
ru: "`boolean`_" (логическое значение)

source: "`string`_"
ru: "`string`_" (строка)

source: integer
ru: integer (целое число)

source: "`number`_"
ru: "`number`_" (число)

source: double
ru: double (числа с двойной точностью)

source: compound
ru: составной

source: map
ru: map (ассоциативный массив)

source: "`table`_" (with string keys)
ru: "`table`_" (таблица со строковыми ключами)

source: array
ru: array (массив)

source: "`table`_" (with integer keys)
ru: "`table`_" (таблица с целочисленными ключами)

source: tuple ("`cdata`_")
ru: tuple ("`cdata`_") (кортеж)

source: In Lua, a **nil** type has only one possible value, also called *nil* (displayed as **null** on Tarantool's command line, since the output is in the YAML format). Nils may be compared to values of any types with == (is-equal) or ~= (is-not-equal), but other operations will not work. Nils may not be used in Lua tables; the workaround is to use :ref:`msgpack.NULL <msgpack-null>`
ru: В языке Lua тип *nil* (нулевой) может иметь только одно значение, также называемое *nil* (отображаемое как **null** в командной строке Tarantool'а, поскольку значения выводятся в формате YAML). Нулевое значение можно сравнивать со значениями любых типов с помощью операторов == (равен) или ~= (не равен), но никакие другие операции для нулевых значений не доступны. Нулевые значения также нельзя использовать в Lua-таблицах; вместо нулевого значения в таком случае можно указать :ref:`msgpack.NULL <msgpack-null>`

source: A **boolean** is either ``true`` or ``false``.
ru: Тип *boolean* (логический) может иметь только значения ``true`` или ``false``.

source: A **string** is a variable-length sequence of bytes, usually represented with alphanumeric characters inside single quotes. In both Lua and MsgPack, strings are treated as binary data, with no attempts to determine a string's character set or to perform any string conversion -- unless there is an optional :ref:`collation <index-collation>`. So, usually, string sorting and comparison are done byte-by-byte, without any special collation rules applied. (Example: numbers are ordered by their point on the number line, so 2345 is greater than 500; meanwhile, strings are ordered by the encoding of the first byte, then the encoding of the second byte, and so on, so '2345' is less than '500'.)
ru: Тип **string** (строка) представляет собой последовательность байтов переменной длины, обычно представленную буквенно-цифровые символы в одинарных кавычках. Как в Lua, так и в MsgPack строки рассматриваются как бинарные данные без попыток определить набор символов строки или выполнить преобразование строки -- кроме случаев, когда есть опциональное :ref:`сравнение символов <index-collation>`. Таким образом, обычно сортировка и сравнение строк выполняются побайтово, не применяя дополнительных правил сравнения символов. (Пример: числа упорядочены по их положению на числовой прямой, поэтому 2345 больше, чем 500; а строки упорядочены по кодировке первого байта, затем кодировке второго байта и так далее, таким образом, '2345' меньше, чем '500'.)

source: In Lua, a **number** is double-precision floating-point, but Tarantool allows both integer and floating-point values. Tarantool will try to store a Lua number as floating-point if the value contains a decimal point or is very large (greater than 100 trillion = 1e14), otherwise Tarantool will store it as an integer. To ensure that even very large numbers are stored as integers, use the :ref:`tonumber64 <other-tonumber64>` function, or the LL (Long Long) suffix, or the ULL (Unsigned Long Long) suffix. Here are examples of numbers using regular notation, exponential notation, the ULL suffix and the ``tonumber64`` function: ``-55``, ``-2.7e+20``, ``100000000000000ULL``, ``tonumber64('18446744073709551615')``.
ru: В языке Lua тип **number** (число) -- это число с плавающей запятой двойной точности, но в Tarantool'е можно использовать как целые числа, так и числа с плавающей запятой. Tarantool по возможности сохраняет числа языка Lua в виде чисел с плавающей запятой, если числовое значение содержит десятичную запятую или если оно очень велико (более 100 триллионов = 1e14). В противном случае, Tarantool сохраняет такое значение в виде целого числа. Чтобы даже очень большие величины гарантированно обрабатывались как целые числа, используйте функцию :ref:`tonumber64 <other-tonumber64>`, либо приписывайте в конце суффикс LL (Long Long) или ULL (Unsigned Long Long). Вот примеры записи чисел в обычном представлении, экспоненциальном, с суффиксом ULL и с использованием функции ``tonumber64``: ``-55``, ``-2.7e+20``, ``100000000000000ULL``, ``tonumber64('18446744073709551615')``.

source: Lua **tables** with string keys are stored as MsgPack maps; Lua tables with integer keys starting with 1 -- as MsgPack arrays. Nils may not be used in Lua tables; the workaround is to use :ref:`msgpack.NULL <msgpack-null>`
ru: В Lua **tables** (таблицы) со строковыми ключами хранятся как ассоциативные массивы в MsgPack; Lua-таблицы с целочисленными ключами, начиная с 1, хранятся как массивы в MsgPack. Нулевые значения нельзя использовать в Lua-таблицах; вместо нулевого значения в таком случае можно указать :ref:`msgpack.NULL <msgpack-null>`

source: A **tuple** is a light reference to a MsgPack array stored in the database. It is a special type (cdata) to avoid conversion to a Lua table on retrieval. A few functions may return tables with multiple tuples. For more tuple examples, see :ref:`box.tuple <box_tuple>`.
ru: Тип **tuple** (кортеж) представляет собой легкую ссылку на массив MsgPack, который хранится в базе данных. Это особый тип (cdata), чтобы избежать конвертации в Lua-таблицу при выборке данных. Некоторые функции могут возвращать таблицы с множеством кортежей. Примеры с кортежами см. в :ref:`box.tuple <box_tuple>`.

source: Tarantool uses the MsgPack format for database storage, which is variable-length. So, for example, the smallest number requires only one byte, but the largest number requires nine bytes.
ru: Tarantool использует формат MsgPack для хранения в базе данных переменной длины. Поэтому, например, для наименьшего числа требуется только один байт, но для наибольшего числа требуется девять байтов.

source: Examples of insert requests with different data types:
ru: Примеры запроса вставки с разными типами данных:

source: Indexed field types
ru: Типы индексированных полей

source: Indexes restrict values which Tarantool's MsgPack may contain. This is why, for example, 'unsigned' is a separate **indexed field type**, compared to ‘integer’ data type in MsgPack: they both store ‘integer’ values, but an 'unsigned' index contains only *non-negative* integer values and an ‘integer’ index contains *all* integer values.
ru: Индексы ограничивают значения, которые может содержать MsgPack в Tarantool'е. Вот почему, например, тип 'unsigned' (без знака) представляет собой отдельный **тип индексированного поля** в сравнении с типом данных ‘integer’ (целое число) в MsgPack: оба содержат значения с целыми числами, но индекс 'unsigned' содержит только *неотрицательные* целые числовые значения, а индекс ‘integer’ содержит *все* целые числовые значения.

source: Here's how Tarantool indexed field types correspond to MsgPack data types.
ru: Вот как типы индексированных полей в Tarantool'е соответствуют типам данных MsgPack.

source: Indexed field type
ru: Тип индексированного поля

source: MsgPack data type |br| (and possible values)
ru: Тип данных MsgPack |br| (и возможные значения)

source: **unsigned** (may also be called ‘uint’ or ‘num’, but ‘num’ is deprecated)
ru: **unsigned** (без знака -- может также называться ‘uint’ или ‘num’, но ‘num’ объявлен устаревшим)

source: **integer** (integer between 0 and 18446744073709551615, i.e. about 18 quintillion)
ru: **integer** (целое число в диапазоне от 0 до 18 446 744 073 709 551 615, т.е. около 18 квинтиллионов)

source: TREE, BITSET or HASH
ru: TREE, BITSET или HASH

source: **integer** (may also be called ‘int’)
ru: **integer** (целое число -- может также называться ‘int’)

source: **integer** (integer between -9223372036854775808 and 18446744073709551615)
ru: ``integer`` (целое число в диапазоне от -9 223 372 036 854 775 808 до 18 446 744 073 709 551 615)

source: TREE or HASH
ru: TREE или HASH

source: **double** (single-precision floating point number or double-precision floating point number)
ru: **double** (число с плавающей запятой с одинарной точностью или с двойной точностью)

source: **string** (may also be called ‘str’)
ru: **string** (строка -- может также называться ‘str’)

source: **string** (any set of octets, up to the maximum length)
ru: **string** (строка -- любая последовательность октетов до максимальной длины)

source: **bool** (true or false)
ru: **bool** (логический -- true или false)

source: **array** (list of numbers representing points in a geometric figure)
ru: **array** (массив -- список чисел, который представляет собой точки в геометрической фигуре)

source: **string** (any set of octets)
ru: **string** (строковое значение, т.е. любая последовательность октетов)

source: Note: When there is a mix of types, the key order is: booleans, then numbers, then strings.
ru: Примечание: в сочетании различных типов порядок будет следующим: логические значения, затем числовые, затем строковые.

source: Collations
ru: Сортировка

source: By default, when Tarantool compares strings, it uses what we call a **"binary" collation**. The only consideration here is the numeric value of each byte in the string. Therefore, if the string is encoded with ASCII or UTF-8, then ``'A' < 'B' < 'a'``, because the encoding of 'A' (what used to be called the "ASCII value") is 65, the encoding of 'B' is 66, and the encoding of 'a' is 98. Binary collation is best if you prefer fast deterministic simple maintenance and searching with Tarantool indexes.
ru: По умолчанию, когда Tarantool сравнивает строки, он использует то, что мы называем **"бинарной" сортировкой**. Единственный фактор, который учитывается, это числовое значение каждого байта в строке. Таким образом, если строка кодируется по ASCII или UTF-8, то ``'A' < 'B' < 'a'``, поскольку в кодировке 'A' (что раньше называлось "значение ASCII") соответствует 65, 'B' -- 66, а 'a' -- 98. Бинарная сортировка подходит лучше всего для быстрого детерминированного простого обслуживания и поиска с помощью индексов Tarantool'а.

source: Optional collations use the ordering according to the `Default Unicode Collation Element Table (DUCET) <http://unicode.org/reports/tr10/#Default_Unicode_Collation_Element_Table>`_ and the rules described in `Unicode® Technical Standard #10 Unicode Collation Algorithm (UTS #10 UCA) <http://unicode.org/reports/tr10>`_. The only difference between the two collations is about `weights <https://unicode.org/reports/tr10/#Weight_Level_Defn>`_:
ru: Опциональная сортировка использует распределение в соответствии с `Таблицей сортировки символов Юникода по умолчанию (DUCET) <http://unicode.org/reports/tr10/#Default_Unicode_Collation_Element_Table>`_ и правилами, указанными в `Техническом стандарте Юникода №10 -- Алгоритм сортировки по Юникоду (Unicode® Technical Standard #10 Unicode Collation Algorithm (UTS #10 UCA)) <http://unicode.org/reports/tr10>`_. Единственное отличие между двумя сортировками -- `вес <https://unicode.org/reports/tr10/#Weight_Level_Defn>`_:

source: As an example, let's take some Russian words:
ru: Для примера возьмем некоторые русские слова:

source: ...and show the difference in ordering and selecting by index:
ru: ...и покажем разницу в упорядочении и выборке по индексу:

source: with ``unicode`` collation:
ru: с сортировкой по ``unicode``:

source: with ``unicode_ci`` collation:
ru: с сортировкой по ``unicode_ci``:

source: In fact, though, good collation involves much more than these simple examples of upper case / lower case equivalence in alphabets. We also consider accent marks, non-alphabetic writing systems, and special rules that apply for combinations of characters.
ru: Фактически хорошая сортировка включает в себя гораздо больше, чем простые примеры эквивалентности заглавных букв и строчных в алфавитах. Учитываются также знаки ударения, системы письменности без алфавита и специальные правила, которые применяются в отношении сочетания символов.

source: A **sequence** is a generator of ordered integer values.
ru: **Последовательность** -- это генератор упорядоченных значений целых чисел.

source: As with spaces and indexes, you should specify the sequence **name**, and let Tarantool come up with a unique **numeric identifier** ("sequence id").
ru: Как и для спейсов и индексов, для последовательностей следует указать **имена**, а Tarantool определит уникальный **числовой идентификатор** ("ID последовательности").

source: As well, you can specify several options when creating a new sequence. The options determine what value will be generated whenever the sequence is used.
ru: Кроме того, можно указать несколько параметров при создании новой последовательности. Параметры определяют, какое значение будет генерироваться при использовании последовательности.

source: Options for ``box.schema.sequence.create()``
ru: Параметры для ``box.schema.sequence.create()``

source: Option name
ru: Имя параметра

source: Type and meaning
ru: Тип и значение

source: **start**
ru: **start** (начало)

source: Integer. The value to generate the first time a sequence is used
ru: Целое число. Значение генерируется, когда последовательность используется впервые

source: **min**
ru: **min** (мин)

source: Integer. Values smaller than this cannot be generated
ru: Целое число. Ниже указанного значения не могут генерироваться

source: **max**
ru: **max** (макс)

source: Integer. Values larger than this cannot be generated
ru: Целое число. Выше указанного значения не могут генерироваться

source: **cycle**
ru: **cycle** (цикл)

source: Boolean. Whether to start again when values cannot be generated
ru: Логическое значение. Если значения не могут быть сгенерированы, начинать ли заново

source: **cache**
ru: **cache** (кэш)

source: Integer. The number of values to store in a cache
ru: Целое число. Количество значений для хранения в кэше

source: **step**
ru: **step** (шаг)

source: Integer. What to add to the previous generated value, when generating a new value
ru: Целое число. Что добавить к предыдущему сгенерированному значению, когда генерируется новое значение
