Repository: tarantool/doc
Catalog: locale/*/LC_MESSAGES/doc.po
Languages: ru

source: This report is for a master-master replica set of three instances, each having its own instance id, UUID and log sequence number.
ru: Данный отчет сгенерирован для набора реплик из трех экземпляров с конфигурацией мастер-мастер, у каждого из которых есть свой собственный ID экземпляра, UUID и номер записи в журнале.

source: The request was issued at master #1, and the reply includes statistics for the other two masters, given in regard to master #1.
ru: Запрос был выполнен с мастера №1, и ответ включает в себя статистику по двум другим мастерам относительно мастера №1.

source: The primary indicators of replication health are:
ru: Основные индикаторы работоспособности репликации:

source: :ref:`idle <box_info_replication_upstream_idle>`, the time (in seconds) since the instance received the last event from a master.
ru: :ref:`бездействие <box_info_replication_upstream_idle>`, время (в секундах) с момента получения последнего события от мастера.

source: :ref:`lag <box_info_replication_upstream_lag>`, the time difference between the local time at the instance, recorded when the event was received, and the local time at another master recorded when the event was written to the :ref:`write ahead log <internals-wal>` on that master.
ru: :ref:`отставание <box_info_replication_upstream_lag>`, разница во времени между локальным временем на экземпляре, зарегистрированным при получении события, и локальное время на другом мастере, зарегистрированное при записи события в :ref:`журнал упреждающей записи <internals-wal>` на этом мастере.

source: Recovering from a degraded state
ru: Восстановление после сбоя

source: "Degraded state" is a situation when the master becomes unavailable -- due to hardware or network failure, or due to a programming bug.
ru: "Сбой" -- это ситуация, когда мастер становится недоступен вследствие проблем с оборудованием, сетевых неполадок или программной ошибки.

source: In a master-replica set, if a master disappears, error messages appear on the replicas stating that the connection is lost:
ru: В конфигурации мастер-реплика, если мастер пропадает, на репликах выводятся сообщения об ошибке с указанием потери соединения:

source: $ # messages from a replica's log 2017-06-14 16:23:10.993 [19153] main/105/applier/replicator@192.168.0. I> can't read row 2017-06-14 16:23:10.993 [19153] main/105/applier/replicator@192.168.0. coio.cc:349 !> SystemError unexpected EOF when reading from socket, called on fd 17, aka 192.168.0.101:57815, peer of 192.168.0.101:3301: Broken pipe 2017-06-14 16:23:10.993 [19153] main/105/applier/replicator@192.168.0. I> will retry every 1 second 2017-06-14 16:23:10.993 [19153] relay/[::ffff:192.168.0.101]:/101/main I> the replica has closed its socket, exiting 2017-06-14 16:23:10.993 [19153] relay/[::ffff:192.168.0.101]:/101/main C> exiting the relay loop
ru: $ # сообщения из журнала реплики 2017-06-14 16:23:10.993 [19153] main/105/applier/replicator@192.168.0. I> can't read row 2017-06-14 16:23:10.993 [19153] main/105/applier/replicator@192.168.0. coio.cc:349 !> SystemError unexpected EOF when reading from socket, called on fd 17, aka 192.168.0.101:57815, peer of 192.168.0.101:3301: Broken pipe 2017-06-14 16:23:10.993 [19153] main/105/applier/replicator@192.168.0. I> will retry every 1 second 2017-06-14 16:23:10.993 [19153] relay/[::ffff:192.168.0.101]:/101/main I> the replica has closed its socket, exiting 2017-06-14 16:23:10.993 [19153] relay/[::ffff:192.168.0.101]:/101/main C> exiting the relay loop

source: ... and the master's status is reported as "disconnected":
ru: ... а статус мастера выводится как "отключенный":

source: # report from replica #1 tarantool> box.info.replication --- - 1: id: 1 uuid: 70e8e9dc-e38d-4046-99e5-d25419267229 lsn: 542 upstream: peer: replicator@192.168.0.101:3301 lag: 0.00026607513427734 status: disconnected idle: 182.36929893494 message: connect, called on fd 13, aka 192.168.0.101:58244 2: id: 2 uuid: fb252ac7-5c34-4459-84d0-54d248b8c87e lsn: 0 3: id: 3 uuid: fd7681d8-255f-4237-b8bb-c4fb9d99024d lsn: 0 downstream: vclock: {1: 542} ...
ru: # отчет от реплики №1 tarantool> box.info.replication --- - 1: id: 1 uuid: 70e8e9dc-e38d-4046-99e5-d25419267229 lsn: 542 upstream: peer: replicator@192.168.0.101:3301 lag: 0.00026607513427734 status: disconnected idle: 182.36929893494 message: connect, called on fd 13, aka 192.168.0.101:58244 2: id: 2 uuid: fb252ac7-5c34-4459-84d0-54d248b8c87e lsn: 0 3: id: 3 uuid: fd7681d8-255f-4237-b8bb-c4fb9d99024d lsn: 0 downstream: vclock: {1: 542} ...

source: # report from replica #2 tarantool> box.info.replication --- - 1: id: 1 uuid: 70e8e9dc-e38d-4046-99e5-d25419267229 lsn: 542 upstream: peer: replicator@192.168.0.101:3301 lag: 0.00027203559875488 status: disconnected idle: 186.76988101006 message: connect, called on fd 13, aka 192.168.0.101:58253 2: id: 2 uuid: fb252ac7-5c34-4459-84d0-54d248b8c87e lsn: 0 upstream: status: follow idle: 186.76960110664 peer: replicator@192.168.0.102:3301 lag: 0.00020599365234375 3: id: 3 uuid: fd7681d8-255f-4237-b8bb-c4fb9d99024d lsn: 0 ...
ru: # отчет от реплики №2 tarantool> box.info.replication --- - 1: id: 1 uuid: 70e8e9dc-e38d-4046-99e5-d25419267229 lsn: 542 upstream: peer: replicator@192.168.0.101:3301 lag: 0.00027203559875488 status: disconnected idle: 186.76988101006 message: connect, called on fd 13, aka 192.168.0.101:58253 2: id: 2 uuid: fb252ac7-5c34-4459-84d0-54d248b8c87e lsn: 0 upstream: status: follow idle: 186.76960110664 peer: replicator@192.168.0.102:3301 lag: 0.00020599365234375 3: id: 3 uuid: fd7681d8-255f-4237-b8bb-c4fb9d99024d lsn: 0 ...

source: To declare that one of the replicas must now take over as a new master:
ru: Чтобы объявить, что одна из реплик должна стать новым мастером:

source: Make sure that the old master is gone for good:
ru: Убедитесь, что старый мастер окончательно недоступен:

source: change network routing rules to avoid any more packets being delivered to the master, or
ru: измените правила маршрутизации в сети, чтобы больше не отправлять пакеты на мастер, или

source: shut down the master instance, if you have access to the machine, or
ru: отключите мастер-экземпляр, если у вас есть доступ к машине, или

source: power off the container or the machine.
ru: отключите питание контейнера или машины.

source: Say ``box.cfg{read_only=false, listen=URI}`` on the replica, and ``box.cfg{replication=URI}`` on the other replicas in the set.
ru: Выполните ``box.cfg{read_only=false, listen=URI}`` на реплике и ``box.cfg{replication=URI}`` на других репликах в наборе.

source: If there are updates on the old master that were not propagated before the old master went down, :ref:`re-apply them manually <admin-disaster_recovery-master_replica>` to the new master using ``tarantoolctl cat`` and ``tarantoolctl play`` commands.
ru: Если на старом мастере есть обновления, не переданные до выхода старого мастера из строя, :ref:`примените их вручную <admin-disaster_recovery-master_replica>` на новом мастере с помощью команд ``tarantoolctl cat`` и``tarantoolctl play``.

source: There is no automatic way for a replica to detect that the master is gone forever, since sources of failure and replication environments vary significantly. So the detection of degraded state requires an external observer.
ru: Реплика не может автоматически определить, что мастер не будет доступен в будущем, поскольку причины отказа и среды репликации могут существенно отличаться друг от друга. Поэтому обнаруживать сбой должен человек.

source: Removing instances
ru: Удаление экземпляров

source: On the instance, run ``box.cfg{}`` with a blank replication source:
ru: Выполните ``box.cfg{}`` с пустым источником репликации на экземпляре:

source: The other instances in the replica set will carry on. If later the removed instance rejoins, it will receive all the updates that the other instances made while it was away.
ru: Остальные экземпляры продолжают работать. Если выбывший экземпляр снова возвращается в кластер, то он получит информацию о всех изменениях, которые произошли на остальных экземплярах за время его отсутствия.

source: If the instance is decommissioned forever, delete the instance's record from the following locations:
ru: Если экземпляр больше не будет использоваться, удалите записи об экземпляре из следующих мест:

source: Reseeding a replica
ru: Перезагрузка реплики

source: If any of a replica's .xlog/.snap/.run files are corrupted or deleted, you can "re-seed" the replica:
ru: Если один из файлов формата .xlog/.snap/.run на реплике поврежден или удален, можно "перезагрузить" реплику данными:

source: Stop the replica and destroy all local database files (the ones with extensions .xlog/.snap/.run/.inprogress).
ru: Остановите реплику и удалите все локальные файлы базы данных (с расширениями .xlog/.snap/.run/.inprogress).

source: Delete the replica's record from the following locations:
ru: Удалите запись о реплике из следующих мест:

source: See section :ref:`Removing instances <replication-remove_instances>` for details.
ru: Для получения подробной информации см. Раздел :ref:`Удаление экземпляров <replication-remove_instances>`.

source: Restart the replica with the same instance file to contact the master again. The replica will then catch up with the master by retrieving all the master’s tuples.
ru: Перезапустите реплику с тем же файлом экземпляра для повторного подключения к мастеру. Реплика синхронизируется с мастером после получения всех кортежей.

source: Remember that this procedure works only if the master’s WAL files are present.
ru: Следует отметить, что эта процедура сработает только в том случае, если на мастере есть WAL-файлы.

source: Build and contribute
ru: Содействие в разработке

source: Building documentation
ru: Сборка документации

source: Tarantool documentation is built using a simplified markup system named ``Sphinx`` (see http://sphinx-doc.org). You can build a local version of this documentation and you can contribute to Tarantool's version.
ru: Документация Tarantool'а создается с помощью системы упрощенной разметки под названием ``Sphinx`` (see http://sphinx-doc.org). Вы можете создать локальную версию документации, а также содействовать в разработке версии Tarantool'а.

source: You need to install these packages:
ru: Необходимо установить следующие пакеты:

source: ``git`` (a program for downloading source repositories)
ru: ``git`` (программа для скачивания репозиториев исходного кода)

source: ``CMake`` version 2.8 or later (a program for managing the build process)
ru: ``CMake`` версии 2.8 или более новой (программа для управления процессом сборки)

source: ``Python`` version greater than 2.6 -- preferably 2.7 -- and less than 3.0 (Sphinx is a Python-based tool)
ru: ``Python`` версии выше 2.6 -- рекомендуется 2.7 -- и ниже 3.0 (Sphinx -- это средство на основе Python)

source: ``LaTeX`` (a system for document preparation; the installable package name usually begins with the word 'texlive' or 'tetex', on Ubuntu the name is 'texlive-latex-base')
ru: ``LaTeX`` (система для подготовки документации; название устанавливаемого пакета обычно начинается со слов 'texlive' или 'tetex', на Ubuntu называется 'texlive-latex-base')

source: ``ImageMagick`` (a system for image conversion; on MacOS install it using ``brew``)
ru: ``ImageMagick`` (система для конвертации изображений; на MacOS установите, используя ``brew``)

source: You need to install these Python modules:
ru: Необходимо установить следующие модули Python:

source: `pip <https://pypi.python.org/pypi/pip>`_, any version
ru: `pip <https://pypi.python.org/pypi/pip>`_ любой версии

source: `Sphinx <https://pypi.python.org/pypi/Sphinx>`_ version 1.4.4 or later
ru: `Sphinx <https://pypi.python.org/pypi/Sphinx>`_ версии 1.4.4 или новее

source: If you encounter the "Missing SPHINX_EXECUTABLE" error message on Mac, manually export the PATH variable:
ru: Если на Mac появится сообщение ошибки "Missing SPHINX_EXECUTABLE" Mac, экспортируйте переменную PATH вручную:

source: `sphinx-intl <https://pypi.python.org/pypi/sphinx-intl>`_ version 0.9.9
ru: `sphinx-intl <https://pypi.python.org/pypi/sphinx-intl>`_ версии 0.9.9

source: If you encounter the "Missing SPHINX_INTL_DIR" error message on Mac, manually export the SPHINX_INTL_DIR variable:
ru: Если на Mac появится сообщение ошибки "Missing SPHINX_INTL_DIR" Mac, экспортируйте переменную SPHINX_INTL_DIR вручную:

source: `lupa <https://pypi.python.org/pypi/lupa>`_ -- any version
ru: `lupa <https://pypi.python.org/pypi/lupa>`_ -- любой версии

source: You should specify ``--user`` flag on Mac while installing Python modules for correct installation.
ru: Для правильной установки модулей Python на Mac следует указать флаг ``--user``.

source: See more details about installation in the :ref:`build-from-source <building_from_source>` section of this documentation.
ru: Более подробную информацию об установке см. в разделе :ref:`Сборка из исходных файлов <building_from_source>` данного руководства.

source: Use ``CMake`` to initiate the build.
ru: Используйте ``CMake``, чтобы начать сборку.

source: $ cd ~/tarantool-doc $ make clean # unnecessary, added for good luck $ rm CMakeCache.txt # unnecessary, added for good luck $ cmake . # initiate
ru: $ cd ~/tarantool-doc $ make clean # необязательно, добавлено на удачу $ rm CMakeCache.txt # необязательно, добавлено на удачу $ cmake . # начать

source: Build a local version of the documentation.
ru: Создайте локальную версию документации.

source: Run the ``make`` command with an appropriate option to specify which documentation version to build.
ru: Выполните команду ``make`` с соответствующей опцией, чтобы указать версию собираемой документации.

source: $ cd ~/tarantool-doc $ make sphinx-html # multi-page English version $ make sphinx-singlehtml # one-page English version $ make sphinx-html-ru # multi-page Russian version $ make sphinx-singlehtml-ru # one-page Russian version $ make all # all versions plus the entire web-site
ru: $ cd ~/tarantool-doc $ make sphinx-html # многостраничная английская версия $ make sphinx-singlehtml # одностраничная английская версия $ make sphinx-html-ru # многостраничная русская версия $ make sphinx-singlehtml-ru # одностраничная русская версия $ make all # все версии плюс веб-сайт полностью

source: Documentation will be created in subdirectories of ``/output``:
ru: Документация будет создана в поддиректориях ``/output``:

source: ``/output/en`` (files of the English version)
ru: ``/output/en`` (файлы английской версии)

source: ``/output/ru`` (files of the Russian version)
ru: ``/output/ru`` (файлы русской версии)

source: The entry point for each version is the ``index.html`` file in the appropriate directory.
ru: Точкой входа в каждую версию будет файл ``index.html`` в соответствующей директории.

source: Set up a web server.
ru: Настройте веб-сервер.

source: One way is to say ``make sphinx-webserver``. This will set up and run the web server on port ``8000``:
ru: Один способ сделать это -- выполнить команду ``make sphinx-webserver``. Веб-сервер будет настроен и запущен по порту ``8000``:

source: $ cd ~/tarantool-doc $ make sphinx-html # as an example, build the multi-page English documentation $ make sphinx-webserver # set up and run the web server
ru: $ cd ~/tarantool-doc $ make sphinx-html # в качестве примера соберем многостраничную версию документации на английском языке $ make sphinx-webserver # настройка и запуск веб-сервера

source: In case port ``8000`` is already in use, you can specify any other port number that is bigger than ``1000`` in the ``tarantool-doc/CMakeLists.txt`` file (search it for the ``sphinx-webserver`` target) and rebuild cmake files:
ru: Если порт ``8000`` уже используется, можно указать любой другой номер порта свыше ``1000`` в файле ``tarantool-doc/CMakeLists.txt`` (найдите его по ``sphinx-webserver``) и повторно собрать файлы cmake:

source: $ cd ~/tarantool-doc $ git clean -qfxd # clean up old cmake files $ cmake . # rebuild cmake files $ make sphinx-html # as an example, build the multi-page English documentation $ make sphinx-webserver # set up and run the web server on the custom port
ru: $ cd ~/tarantool-doc $ git clean -qfxd # очистка старых файлов cmake $ cmake . # повторная сборка файлов cmake $ make sphinx-html # в качестве примера соберем многостраничную версию документации на английском языке $ make sphinx-webserver # настройка и запуск веб-сервера по указанному порту

source: Or you can release the port:
ru: Или можно освободить порт:

source: $ sudo lsof -i :8000 # get the process ID (PID) COMMAND PID USER FD TYPE DEVICE SIZE/OFF NODE NAME Python 19516 user 3u IPv4 0xe7f8gc6be1b43c7 0t0 TCP *:irdmi (LISTEN) $ sudo kill -9 19516 # kill the process
ru: $ sudo lsof -i :8000 # получение идентификатора процесса (PID) COMMAND PID USER FD TYPE DEVICE SIZE/OFF NODE NAME Python 19516 user 3u IPv4 0xe7f8gc6be1b43c7 0t0 TCP *:irdmi (LISTEN) $ sudo kill -9 19516 # удаление процесса

source: The other way is to run the built-in web server in Python. Make sure to run it from the documentation ``output`` folder:
ru: Другой способ -- это запустить встроенный веб-сервер на Python. Убедитесь, что запускаете его из папки документации ``output``:

source: In case port ``8000`` is already in use, you can specify any other port number that is bigger than ``1000``.
ru: Если порт ``8000`` уже используется, можно указать любой другой номер порта свыше ``1000`` в файле.

source: If your local documentation build is valid, the manual will appear in the browser.
ru: Если сборка локальной документации выполнена правильно, руководство появится в окне браузера.

source: To contribute to documentation, use the `REST <http://docutils.sourceforge.net/docs/user/rst/quickstart.html>`_ format for drafting and submit your updates as a `pull request <https://help.github.com/articles/creating-a-pull-request/>`_ via GitHub.
ru: Чтобы содействовать в разработке документации, используйте формат `REST <http://docutils.sourceforge.net/docs/user/rst/quickstart.html>`_ для создания чернового варианта и отправьте изменения на рассмотрение в виде `запроса на включение в проект <https://help.github.com/articles/creating-a-pull-request/>`_ через GitHub.

source: To comply with the writing and formatting style, use the :ref:`guidelines <documentation_guidelines>` provided in the documentation, common sense and existing documents.
ru: Чтобы текст соответствовал стилю и формату, воспользуйтесь :ref:`рекомендациями <documentation_guidelines>`, предоставленными в документации, здравым смыслом и уже существующими документами.

source: If you suggest creating a new documentation section (a whole new page), it has to be saved to the relevant section at GitHub.
ru: Если вы предлагаете создать новый раздел документации (отдельную страницу), его следует сохранить в соответствующий раздел на GitHub.

source: If you want to contribute to localizing this documentation (for example into Russian), add your translation strings to ``.po`` files stored in the corresponding locale directory (for example ``/locale/ru/LC_MESSAGES/`` for Russian). See more about localizing with Sphinx at http://www.sphinx-doc.org/en/stable/intl.html
ru: Если вы хотите содействовать в локализации данной документации (например, на русский), добавьте перевод в файлы формата ``.po``, которые хранятся в директории соответствующей локали (например, ``/locale/ru/LC_MESSAGES/`` для русского языка). Более подробную информацию о локализации с помощью Sphinx см. по ссылке http://www.sphinx-doc.org/en/stable/intl.html

source: Building from source
ru: Сборка из исходных файлов

source: For downloading Tarantool source and building it, the platforms can differ and the preferences can differ. But strategically the steps are always the same.
ru: При загрузке исходных файлов и сборке Tarantool'а могут отличаться платформы и настройки, но в целом предпринимаются одинаковые действия.

source: Get tools and libraries that will be necessary for building and testing.
ru: Найдите средства и библиотеки, которые будут нужны для сборки и тестирования.

source: The absolutely necessary ones are:
ru: Абсолютно необходимы следующие:

source: A program for downloading source repositories. |br| For all platforms, this is ``git``. It allows downloading the latest complete set of source files from the Tarantool repository on GitHub.
ru: Программа для скачивания репозиториев исходного кода. |br| Для всех платформ это будет ``git``. Программа позволяет скачивать самый актуальный набор исходных файлов из репозитория Tarantool'а на GitHub.

source: A C/C++ compiler. |br| Ordinarily, this is ``gcc`` and ``g++`` version 4.6 or later. On Mac OS X, this is ``Clang`` version 3.2+.
ru: Компилятор C/C++. |br| Как правило, это ``gcc`` и ``g++`` версии 4.6 или более новой. На Mac OS X это ``Clang`` версии 3.2+.

source: A program for managing the build process. |br| For all platforms, this is ``CMake`` version 2.8+.
ru: Программа для управления процессом сборки. |br| Для всех платформ это будет ``CMake`` версии 2.8+.

source: `ReadLine <http://www.gnu.org/software/readline/>`_ library, any version
ru: библиотека `ReadLine <http://www.gnu.org/software/readline/>`_ любой версии

source: `ncurses <https://www.gnu.org/software/ncurses/>`_ library, any version
ru: библиотека `ncurses <https://www.gnu.org/software/ncurses/>`_ любой версии

source: `OpenSSL <https://www.openssl.org>`_ library, version 1.0.1+
ru: библиотека `OpenSSL <https://www.openssl.org>`_ версии 1.0.1+

source: `cURL <https://curl.haxx.se/>`_ library, version 0.725+
ru: библиотека `cURL <https://curl.haxx.se/>`_ версии 0.725+

source: `LibYAML <http://pyyaml.org/wiki/LibYAML>`_ library, version 0.1.4+
ru: библиотека `LibYAML <http://pyyaml.org/wiki/LibYAML>`_ версии 0.1.4+

source: `ICU <http://site.icu-project.org/download>`_ library, recent version
ru: библиотека `ICU <http://site.icu-project.org/download>`_ последней версии

source: Python and modules. |br| Python interpreter is not necessary for building Tarantool itself, unless you intend to use the "Run the test suite" option in step 5. For all platforms, this is ``python`` version 2.7+ (but not 3.x). You need the following Python modules:
ru: Python и его модули. |br| Интерпретатор для Python не нужен для сборки самого Tarantool'а, если вы не планируете проводить тестирование из шага 5. Для всех платформ это будет ``python`` версии 2.7+ (но не 3.x). Необходимы следующие модули Python:

source: `pyyaml <https://pypi.python.org/pypi/PyYAML>`_ version 3.10
ru: `pyyaml <https://pypi.python.org/pypi/PyYAML>`_ версии 3.10

source: `argparse <https://pypi.python.org/pypi/argparse>`_ version 1.1
ru: `argparse <https://pypi.python.org/pypi/argparse>`_ версии 1.1

source: `msgpack-python <https://pypi.python.org/pypi/msgpack-python>`_ version 0.4.6
ru: `msgpack-python <https://pypi.python.org/pypi/msgpack-python>`_ версии 0.4.6

source: `gevent <https://pypi.python.org/pypi/gevent>`_ version 1.1.2
ru: `gevent <https://pypi.python.org/pypi/gevent>`_ версии 1.1.2

source: `six <https://pypi.python.org/pypi/six>`_ version 1.8.0
ru: `six <https://pypi.python.org/pypi/six>`_ версии 1.8.0

source: To install all required dependencies, follow the instructions for your OS:
ru: Чтобы установить все необходимые зависимости, следуйте инструкциям для вашей ОС:

source: For Debian/Ubuntu, say:
ru: Если вы используете Debian/Ubuntu, выполните команду:

source: For RHEL/CentOS/Fedora, say:
ru: Если вы используете RHEL/CentOS/Fedora, выполните команду:

source: For Mac OS X (instructions below are for OS X El Capitan):
ru: Если вы используете Mac OS X (команды для OS X El Capitan):

source: If you're using Homebrew as your package manager, say:
ru: Если вы пользуетесь Homebrew в качестве менеджера пакетов, выполните команду:
