Repository: tarantool/doc
Catalog: locale/*/LC_MESSAGES/doc.po
Languages: ru

source: field[2] = a uuid
ru: поле [2] = UUID

source: field[3] = number of seconds since 1970-01-01;
ru: поле [3] = количество секунд с 01.01.1970;

source: Get field[3] from what was replaced;
ru: получить поле [3] из того, что заменили;

source: Format the value from field[3] as yyyy-mm-dd hh:mm:ss.ffff;
ru: преобразовать значение из поля [3] в формат yyyy-mm-dd hh:mm:ss.ffff (год-месяц-день час:минута:секунда.десятитысячные доли секунды);

source: Return the formatted value.
ru: вернуть преобразованное значение.

source: The function uses Tarantool box functions :ref:`box.space...select <box_space-select>`, :ref:`box.space...replace <box_space-replace>`, :ref:`fiber.time <fiber-time>`, :ref:`uuid.str <uuid-str>`. The function uses Lua functions `os.date()`_ and `string.sub()`_.
ru: Данная функция использует функции box в Tarantool'е: :ref:`box.space...select <box_space-select>`, :ref:`box.space...replace <box_space-replace>`, :ref:`fiber.time <fiber-time>`, :ref:`uuid.str <uuid-str>`. Данная функция использует Lua-функции `os.date()`_ и `string.sub()`_.

source: ... And here is what happens when one invokes the function:
ru: ... А вот что происходит, когда вызывается функция:

source: Example showing a user-defined iterator
ru: Пример с заданным пользователем итератором

source: Here is an example that shows how to build one's own iterator. The ``paged_iter`` function is an "iterator function", which will only be understood by programmers who have read the Lua manual section `Iterators and Closures <https://www.lua.org/pil/7.1.html>`_. It does paginated retrievals, that is, it returns 10 tuples at a time from a table named "t", whose primary key was defined with ``create_index('primary',{parts={1,'string'}})``.
ru: Здесь приведен пример того, как создать свой собственный итератор. Функция ``paged_iter`` представляет собой "функцию с итератором", что поймут только разработчики, которые ознакомились с разделом руководства по Lua `Итераторы и замыкания <https://www.lua.org/pil/7.1.html>`_. Она делает постраничную выборку, то есть возвращает 10 кортежей одновременно из таблицы под названием "t", первичный ключ которой определен с помощью ``create_index('primary',{parts={1,'string'}})``.

source: Submodule `box.index` with index type = RTREE for spatial searches
ru: Вложенный модуль `box.index` с типом индекса RTREE для поиска в пространственных данных

source: The :ref:`box.index <box_index>` submodule may be used for spatial searches if the index type is RTREE. There are operations for searching *rectangles* (geometric objects with 4 corners and 4 sides) and *boxes* (geometric objects with more than 4 corners and more than 4 sides, sometimes called hyperrectangles). This manual uses the term *rectangle-or-box* for the whole class of objects that includes both rectangles and boxes. Only rectangles will be illustrated.
ru: Вложенный модуль :ref:`box.index <box_index>` может использоваться для поиска в пространственных данных, если тип индекса -- RTREE. Существуют операции для поиска *прямоугольников* (геометрические фигуры с 4 углами и 4 сторонами) и *параллелепипедов* (геометрические фигуры с количеством углов более 4 и количеством сторон более 4, которые иногда называются гиперпрямоугольниками). В данном руководстве используется термин *прямоугольник-или-параллелепипед* для всего класса объектов, который включает в себя прямоугольники и параллелепипеды. Примерами иллюстрируются только прямоугольники.

source: Rectangles are described according to their X-axis (horizontal axis) and Y-axis (vertical axis) coordinates in a grid of arbitrary size. Here is a picture of four rectangles on a grid with 11 horizontal points and 11 vertical points:
ru: Прямоугольники описаны в соответствии с координатами по оси X (горизонтальной оси) и оси Y (вертикальной оси) на сетке произвольного размера. Ниже представлен рисунок четырех прямоугольников на сетке с 11 горизонтальными точками и 11 вертикальными точками:

source: X AXIS 1 2 3 4 5 6 7 8 9 10 11 1 2 #-------+ <-Rectangle#1 Y AXIS 3 | | 4 +-------# 5 #-----------------------+ <-Rectangle#2 6 | | 7 | #---+ | <-Rectangle#3 8 | | | | 9 | +---# | 10 +-----------------------# 11 # <-Rectangle#4
ru: X AXIS 1 2 3 4 5 6 7 8 9 10 11 1 2 #-------+ <-Прямоугольник №1 Y AXIS 3 | | 4 +-------# 5 #-----------------------+ <-Прямоугольник №2 6 | | 7 | #---+ | <-Прямоугольник №3 8 | | | | 9 | +---# | 10 +-----------------------# 11 # <-Прямоугольник №4

source: The rectangles are defined according to this scheme: {X-axis coordinate of top left, Y-axis coordinate of top left, X-axis coordinate of bottom right, Y-axis coordinate of bottom right} -- or more succinctly: {x1,y1,x2,y2}. So in the picture ... Rectangle#1 starts at position 1 on the X axis and position 2 on the Y axis, and ends at position 3 on the X axis and position 4 on the Y axis, so its coordinates are {1,2,3,4}. Rectangle#2's coordinates are {3,5,9,10}. Rectangle#3's coordinates are {4,7,5,9}. And finally Rectangle#4's coordinates are {10,11,10,11}. Rectangle#4 is actually a "point" since it has zero width and zero height, so it could have been described with only two digits: {10,11}.
ru: Прямоугольники определяются в соответствии со следующей схемой: {верхняя левая координата по оси X, верхняя левая координата по оси Y, нижняя правая координата по оси X, нижняя правая координата по оси Y} -- или коротко: {x1,y1,x2,y2}. Таким образом, на рисунке ... Прямоугольник № 1 начинается в точке 1 по оси X и точке 2 по оси Y, а заканчивается в точке 3 по оси X и точке 4 по оси Y, поэтому его координаты будут следующие: {1,2,3,4}. Координаты Прямоугольника № 2: {3,5,9,10}. Координаты Прямоугольника № 3: {4,7,5,9}. И наконец, координаты Прямоугольника № 4: {10,11,10,11}. Прямоугольник № 4, на самом деле, является точкой, поскольку у него нулевая ширина и нулевая высота, так что его можно описать всего двумя числами: {10,11}.

source: Some relationships between the rectangles are: "Rectangle#1's nearest neighbor is Rectangle#2", and "Rectangle#3 is entirely inside Rectangle#2".
ru: Некоторые отношения между прямоугольниками могут быть описаны так: "Прямоугольник №1 является ближайшим соседом Прямоугольника №2", а "Прямоугольник №3 полностью находится внутри Прямоугольника №2".

source: Now let us create a space and add an RTREE index.
ru: Сейчас создадим спейс и добавим RTREE-индекс.

source: Field#1 doesn't matter, we just make it because we need a primary-key index. (RTREE indexes cannot be unique and therefore cannot be primary-key indexes.) The second field must be an "array", which means its values must represent {x,y} points or {x1,y1,x2,y2} rectangles. Now let us populate the table by inserting two tuples, containing the coordinates of Rectangle#2 and Rectangle#4.
ru: Поле №1 не имеет значения, мы создаем его лишь потому, что необходим первичный индекс. (RTREE-индексы не могут быть уникальными, поэтому не могут быть первичными индексами.) Второе поле должно быть массивом ("array"), что означает, что его значения должны представлять собой точки {x,y} или прямоугольники {x1,y1,x2,y2}. Заполним таблицу, вставив два кортежа с координатами Прямоугольника №2 и Прямоугольника №4.

source: And now, following the description of `RTREE iterator types`_, we can search the rectangles with these requests:
ru: Затем, после описания типов RTREE-итераторов (`RTREE iterator types`_), можно произвести поиск прямоугольников с помощью данных запросов:

source: Request#1 returns 1 tuple because the point {10,11} is the same as the rectangle {10,11,10,11} ("Rectangle#4" in the picture). Request#2 returns 1 tuple because the rectangle {4,7,5,9}, which was "Rectangle#3" in the picture, is entirely within{3,5,9,10} which was Rectangle#2. Request#3 returns 2 tuples, because the NEIGHBOR iterator always returns all tuples, and the first returned tuple will be {3,5,9,10} ("Rectangle#2" in the picture) because it is the closest neighbor of {1,2,3,4} ("Rectangle#1" in the picture).
ru: Запрос №1 возвращает 1 кортеж, потому что точка {10,11} представляет собой то же, что и прямоугольник {10,11,10,11} ("Прямоугольник №4" на рисунке). Запрос № 2 возвращает 1 кортеж, потому что прямоугольник {4,7,5,9}, который был "Прямоугольником №3" на рисунке находится полностью внутри {3,5,9,10}, что представляет собой Прямоугольник № 2. Запрос № 3 возвращает 2 кортежа, потому что итератор NEIGHBOR (сосед) всегда возвращает все кортежи, а первым найденным кортежем будет {3,5,9,10} ("Прямоугольник №2" на рисунке), потому что он является ближайшим соседом {1,2,3,4} ("Прямоугольник №1" на рисунке).

source: Now let us create a space and index for cuboids, which are rectangle-or-boxes that have 6 corners and 6 sides.
ru: Теперь создадим спейс и индекс для кубоидов, которые представляют собой прямоугольники-или-параллелепипеды, у которых 6 углов и 6 сторон.

source: The additional option here is ``dimension=3``. The default dimension is 2, which is why it didn't need to be specified for the examples of rectangle. The maximum dimension is 20. Now for insertions and selections there will usually be 6 coordinates. For example:
ru: Здесь задается дополнительный параметр``dimension=3``. По умолчанию, измерений 2, поэтому не было необходимости указывать данный параметр в примерах для прямоугольника. Максимальное количество измерений -- 20. Что касается вставки и выборки, здесь будет 6 координат. Например:

source: Now let us create a space and index for Manhattan-style spatial objects, which are rectangle-or-boxes that have a different way to calculate neighbors.
ru: Теперь создадим спейс и индекс для пространственных объектов с метрикой расстояния городских кварталов (метрика Манхэттена), которые представляют собой прямоугольники-или-параллелепипеды; соседи для них рассчитываются иным образом.

source: The additional option here is ``distance='manhattan'``. The default distance calculator is 'euclid', which is the straightforward as-the-crow-flies method. The optional distance calculator is 'manhattan', which can be a more appropriate method if one is following the lines of a grid rather than traveling in a straight line.
ru: Здесь задается дополнительный параметр ``distance='manhattan'``. По умолчанию, расстояние измеряется по Евклидовой метрике, что лучше всего подходит для измерений по прямой линии. Другой способ расчета расстояния по метрике Манхэттена ('manhattan'), который больше подходит, если необходимо следовать линиям сетки, а не по прямой.

source: More examples of spatial searching are online in the file `R tree index quick start and usage`_.
ru: Другие примеры поиска в пространственных данных см. по ссылке `R tree index quick start and usage`_.

source: Submodule `box.info`
ru: Вложенный модуль `box.info`

source: The ``box.info`` submodule provides access to information about server instance variables.
ru: Вложенный модуль ``box.info`` предоставляет доступ к информации о переменных экземпляра сервера.

source: **cluster.uuid** is the UUID of the replica set. Every instance in a replica set will have the same ``cluster.uuid`` value. This value is also stored in :ref:`box.space._schema <box_space-schema>` system space.
ru: **cluster.uuid** -- это уникальный идентификатор набора реплик (UUID). У каждого экземпляра в наборе реплик будет одно и то же значение ``cluster.uuid``. Данное значение также хранится в системном спейсе :ref:`box.space._schema <box_space-schema>`.

source: **id** corresponds to **replication.id** (see :ref:`below <box_info_replication>`).
ru: **id** соответствует идентификатору **replication.id** (см. :ref:`ниже <box_info_replication>`).

source: **lsn** corresponds to **replication.lsn** (see :ref:`below <box_info_replication>`).
ru: **lsn** соответствует регистрационному номеру **replication.lsn** (см. :ref:`ниже <box_info_replication>`).

source: **pid** is the process ID. This value is also shown by :ref:`tarantool <tarantool-build>` module and by the Linux command ``ps -A``.
ru: **pid** – идентификатор процесса. Это значение также отображается с помощью модуля :ref:`tarantool <tarantool-build>` и по команде ``ps -A`` в Linux.

source: **signature** is the sum of all **lsn** values from the vector clocks (**vclock**) of all instances in the replica set.
ru: **signature** представляет собой сумму всех значений **lsn** из векторных часов (**vclock**) всех экземпляров в наборе реплик.

source: **status** corresponds to **replication.upstream.status** (see below).
ru: **status** соответствует статусу **replication.upstream.status** (см. ниже).

source: **uptime** is the number of seconds since the instance started. This value can also be retrieved with :ref:`tarantool.uptime() <tarantool-build>`.
ru: **uptime** -- это количество секунд с момента запуска экземпляра. Данное значение также можно получить с помощью :ref:`tarantool.uptime() <tarantool-build>`.

source: **uuid** corresponds to **replication.uuid** (see :ref:`below <box_info_replication>`).
ru: **uuid** соответствует идентификатору **replication.uuid** (см. :ref:`ниже <box_info_replication>`).

source: **vclock** corresponds to **replication.downstream.vclock** (see :ref:`below <box_info_replication>`).
ru: **vclock** соответствует часам **replication.downstream.vclock** (см. :ref:`ниже <box_info_replication>`).

source: **version** is the Tarantool version. This value is also shown by :ref:`tarantool -V <index-tarantool_version>`.
ru: **version** -- это версия Tarantool'а. Данное значение также можно отобразить с помощью команды :ref:`tarantool -V <index-tarantool_version>`.

source: **memory().cache** -- number of bytes used for caching user data. The memtx storage engine does not require a cache, so in fact this is the number of bytes in the cache for the tuples stored for the vinyl storage engine.
ru: **memory().cache** --это количество байтов, используемых для кэширования данных пользователей. Движок базы данных memtx не нуждается в кэше, то есть на самом деле это количество байтов в кэше для кортежей движка базы данных vinyl.

source: **memory().data** -- number of bytes used for storing user data (the tuples) with the memtx engine and with level 0 of the vinyl engine, without taking memory fragmentation into account.
ru: **memory().data** -- количество байтов, используемых для хранения данных пользователей (кортежи) в движке memtx и на уровне 0 движка vinyl, не принимая во внимание фрагментацию памяти.

source: **memory().index** -- number of bytes used for indexing user data, including memtx and vinyl memory tree extents, the vinyl page index, and the vinyl bloom filters.
ru: **memory().index** -- количество байтов, используемых для индексирования данных пользователей, включая экстенты для деревьев в memtx'е и vinyl'е, индекс страниц и фильтры Блума в vinyl'е.

source: **memory().lua** -- number of bytes used for Lua runtime.
ru: **memory().lua** -- количество байтов, используемых для времени исполнения Lua-кода.

source: **memory().net** -- number of bytes used for network input/output buffers.
ru: **memory().net** -- количество байтов, используемых буферами для сетевого ввода-вывода.

source: **memory().tx** -- number of bytes in use by active transactions. For the vinyl storage engine, this is the total size of all allocated objects (struct ``txv``, struct ``vy_tx``, struct ``vy_read_interval``) and tuples pinned for those objects.
ru: **memory().tx** -- количество байтов, используемых активными транзакциями. Для движка базы данных vinyl это общий размер всех размещаемых объектов (структура ``txv``, структура ``vy_tx``, структура ``vy_read_interval``) и кортежей, прикрепленных к этим объектам.

source: An example with a minimum allocation while only the memtx storage engine is in use:
ru: Пример с минимальным распределением, когда используется только движок базы данных memtx:

source: The **replication** section of ``box.info()`` contains statistics for all instances in the replica set in regard to the current instance (see also :ref:`"Monitoring a replica set" <replication-monitoring>`):
ru: Раздел **replication** (репликация) во вложенном модуле ``box.info()`` содержит статистику по всем экземплярам в наборе реплик относительно текущего экземпляра (см. также :ref:`"Мониторинг набора реплик" <replication-monitoring>`):

source: **replication.id** is a short numeric identifier of the instance within the replica set.
ru: **replication.id** -- это короткий числовой идентификатор экземпляра в рамках набора реплик.

source: **replication.uuid** is a globally unique identifier of the instance. This value is also stored in :ref:`box.space._cluster <box_space-cluster>` system space.
ru: **replication.uuid** -- это глобально-уникальный идентификатор экземпляра. Данное значение также хранится в системном спейсе :ref:`box.space._cluster <box_space-cluster>`.

source: **replication.lsn** is the :ref:`log sequence number <replication-mechanism>` (LSN) for the latest entry in the instance's :ref:`write ahead log <index-box_persistence>` (WAL).
ru: **replication.lsn** -- это :ref:`номер в журнале <replication-mechanism>` (LSN) для последней записи в :ref:`журнале упреждающей записи <index-box_persistence>` (WAL) экземпляра.

source: **replication.upstream** contains statistics for the replication data uploaded by the instance.
ru: **replication.upstream** содержит статистику по реплицируемым данным, которые переданы экземпляром.

source: **replication.upstream.status** is the replication status of the instance:
ru: **replication.upstream.status** -- это репликационный статус экземпляра:

source: ``auth`` means that the instance is getting :ref:`authenticated <authentication>` to connect to a replication source.
ru: ``auth`` означает, что экземпляр проходит :ref:`аутентификацию <authentication>` для установки соединения с источником репликации.

source: ``connecting`` means that the instance is trying to connect to the replications source(s) listed in its :ref:`replication <cfg_replication-replication>` parameter.
ru: ``connecting`` означает, что экземпляр пытается установить соединение с источниками репликации, перечисленными в параметре :ref:`replication <cfg_replication-replication>`.

source: ``disconnected`` means that the instance is not connected to the replica set (due to network problems, not replication errors).
ru: ``disconnected`` означает, что экземпляр не подключен к набору реплик (по причине проблем в сети, а не ошибок репликации).

source: ``follow`` means that replication is in progress.
ru: ``follow`` означает, что идет репликация.

source: ``running`` means the instance's role is "master" (non read-only) and replication is in progress.
ru: ``running`` означает, что роль экземпляра -- "мастер" (не только для чтения), и идет репликация.

source: ``stopped`` means that replication was stopped due to a replication error (e.g. :ref:`duplicate key <error_codes>`).
ru: ``stopped`` означает, что репликация остановилась по причине ошибки репликации (например, :ref:`повторяющийся ключ <error_codes>`).

source: **replication.upstream.idle** is the time (in seconds) since the instance received the last event from a master. This is the primary indicator of replication health. See more in :ref:`Monitoring a replica set <replication-monitoring>`.
ru: **replication.upstream.idle** -- это время (в секундах) с момента получения экземпляром последнего события от мастера. Это основной индикатор работоспособности репликации. Более подробную информацию см. в разделе :ref:`Мониторинг набора реплик <replication-monitoring>`.

source: **replication.upstream.peer** contains the replication user name, host IP adress and port number used for the instance. See more in :ref:`Monitoring a replica set <replication-monitoring>`.
ru: **replication.upstream.peer** содержит имя пользователя, запустившего репликацию, IP-адрес хоста и номер порта, используемый для экземпляра. Более подробную информацию см. в разделе :ref:`Мониторинг набора реплик <replication-monitoring>`.

source: **replication.upstream.lag** is the time difference between the local time at the instance, recorded when the event was received, and the local time at another master recorded when the event was written to the :ref:`write ahead log <internals-wal>` on that master. See more in :ref:`Monitoring a replica set <replication-monitoring>`.
ru: **replication.upstream.lag** -- это разница во времени между локальным временем на экземпляре, зарегистрированным при получении события, и локальное время на другом мастере, зарегистрированное при записи события в :ref:`журнал упреждающей записи <internals-wal>` на этом мастере. Более подробную информацию см. в разделе :ref:`Мониторинг набора реплик <replication-monitoring>`.

source: **replication.upstream.message** contains an error message in case of a :ref:`degraded state <replication-recover>`, empty otherwise.
ru: **replication.upstream.message** содержит сообщение об ошибке в случае :ref:`системного сбоя <replication-recover>`, в противном случае не заполнен.

source: **replication.downstream** contains statistics for the replication data requested and downloaded from the instance.
ru: **replication.downstream** содержит статистику по реплицируемым данным, которые запрошены и загружены с экземпляра.

source: Since ``box.info`` contents are dynamic, it's not possible to iterate over keys with the Lua ``pairs()`` function. For this purpose, ``box.info()`` builds and returns a Lua table with all keys and values provided in the submodule.
ru: Поскольку содержимое вложенного модуля ``box.info`` является динамическим, невозможно провести итерацию по ключам с помощью Lua-функции ``pairs()``. Для этой цели модуль ``box.info()`` создает и возвращает Lua-таблицу со всеми ключами и значениями во вложенном модуле.

source: keys and values in the submodule
ru: ключи и значения во вложенном модуле

source: This example is for a master-replica set that contains one master instance and one replica instance. The request was issued at the replica instance.
ru: Данный пример приводится для набора со схемой мастер-реплика, который включает в себя один мастер-экземпляр и один реплика-экземпляр. Запрос был отправлен с реплики-экземпляра.

source: Submodule `box.schema`
ru: Вложенный модуль `box.schema`

source: The ``box.schema`` submodule has data-definition functions for spaces, users, roles, function tuples, and sequences.
ru: Вложенный модуль ``box.schema`` содержит функции для определения данных для спейсов, пользователей, ролей, кортежей и последовательностей.

source: Below is a list of all ``box.schema`` functions.
ru: Ниже приведен перечень всех функций модуля ``box.schema``.

source: Create a space
ru: Создание спейса

source: Create a user
ru: Создание пользователя

source: Drop a user
ru: Удаление пользователя

source: Check if a user exists
ru: Проверка существования пользователя

source: Grant privileges to a user or a role
ru: Выдача прав пользователю или роли

source: Revoke privileges from a user or a role
ru: Отмена прав пользователя или роли

source: Get a hash of a user's password
ru: Получение хеша пароля пользователя

source: Associate a password with a user
ru: Ассоциация пароля с пользователем

source: Get a description of a user's privileges
ru: Получение описания прав пользователя

source: Create a role
ru: Создание роли

source: Drop a role
ru: Удаление роли

source: Check if a role exists
ru: Проверка наличия роли

source: Grant privileges to a role
ru: Выдача прав роли

source: Revoke privileges from a role
ru: Отмена прав роли

source: Get a description of a role's privileges
ru: Получение описания прав роли

source: Create a function tuple
ru: Создание кортежа с функцией

source: Drop a function tuple
ru: Удаление кортежа с функцией

source: Check if a function tuple exists
ru: Проверка наличия кортежа с функцией

source: Create a new sequence generator
ru: Создание нового генератора последовательностей
