Repository: tarantool/doc
Catalog: locale/*/LC_MESSAGES/doc.po
Languages: ru

source: ``replication_source`` now accepts an array of URIs, so each replica can have up to 30 peers.
ru: ``replication_source`` принимает массив URI, так что в каждой реплике может быть до 30 узлов.

source: RTREE index now accept two types of ``distance`` functions: ``euclid`` and ``manhattan``.
ru: RTREE-индекс принимает два типа функций ``distance``: ``euclid`` и ``manhattan``.

source: ``fio.abspath()`` - a new function in ``fio`` rock to convert a relative path to absolute.
ru: ``fio.abspath()`` -- новая функция в модуле ``fio`` для конвертации относительного пути в абсолютный.

source: The process title now can be set with an on-board ``title`` rock.
ru: Название процесса теперь можно определить с помощью встроенного модуля ``title``.

source: This release uses LuaJIT 2.1.
ru: В данной версии используется LuaJIT 2.1.

source: ``memcached`` - makes Tarantool understand Memcached binary protocol. Text protocol support is in progress and will be added to the rock itself, without changes to the server core.
ru: ``memcached`` помогает Tarantool'у понимать бинарный протокол Memcached. Поддержка текстового протокола находится в процессе разработки и будет добавлена в отдельный модуль без изменений основных компонентов.

source: **Release 1.6.6**
ru: **Версия 1.6.6**

source: Release type: maintenance. Release date: 2015-08-28.
ru: Тип версии: обновленная. Дата выхода: 2015-08-28.

source: Tarantool 1.6 is no longer getting major new features, although it will be maintained. The developers are concentrating on Tarantool version 1.9.
ru: Tarantool версии 1.6 больше не получает значимых новых функций, но продолжает поддерживаться. Разработчики сосредоточили свои усилия на версии 1.9.

source: A new schema of ``_index`` system space which accommodates multi-dimensional RTREE indexes. Tarantool 1.6.6 works fine with an old snapshot and system spaces, but you will not be able to start Tarantool 1.6.5 with a data directory created by Tarantool 1.6.6, neither will you be able to query Tarantool 1.6.6 schema with 1.6.5 net.box.
ru: Появляется новая схема системного спейса ``_index`` для размещения многомерных RTREE-индексов. Tarantool 1.6.6 нормально работает со старыми снимками и системными спейсами, но нельзя будет запустить Tarantool версии 1.6.5 с директорий, созданной в Tarantool'е версии 1.6.6, как нельзя будет ввести запрос в Tarantool 1.6.6 с net.box версии 1.6.5.

source: ``box.info.snapshot_pid`` is renamed to ``box.info.snapshot_in_progress``
ru: Переименование ``box.info.snapshot_pid`` в ``box.info.snapshot_in_progress``

source: Threaded architecture for network. Network I/O has finally been moved to a separate thread, increasing single instance performance by up to 50%.
ru: Потоковая архитектура для работы по сети. Сетевой ввод-вывод окончательно переведен на отдельный поток, что увеличит производительность отдельного экземпляра до 50%.

source: Threaded architecture for checkpointing. Tarantool no longer forks to create a snapshot, but uses a separate thread, accessing data via a consistent read view. This eliminates all known latency spikes caused by snapshotting.
ru: Потоковая архитектура для создания контрольных точек. Tarantool больше не делает ответвлений для создания снимка, а использует отдельный поток, получая доступ к данным с помощью вида постоянного просмотра. Это помогает устранить скачки задержки отклика во время создания снимков.

source: Stored procedures in C/C++. Stored procedures in C/C++ provide speed (3-4 times, compared to a Lua version in our measurements), as well as unlimited extensibility power. Since C/C++ procedures run in the same memory space as the database, they are also an easy tool to corrupt database memory. See :ref:`The C API description <index-c_api_reference>`.
ru: Хранимые процедуры на языках C/C++. Хранимые процедуры на языках C/C++ дают скорость (в 3-4 раза больше по сравнению с Lua-версией по нашим подсчетам), а также возможность неограниченного расширения. Поскольку процедуры C/C++ выполняются там же, где располагается база данных, они могут с легкостью повредить базу данных. См. :ref:`API для языка C <index-c_api_reference>`.

source: Multidimensional RTREE index. RTREE index type now support a large (up to 32) number of dimensions. RTREE data structure has been optimized to actually use `R\*-TREE <https://en.wikipedia.org/wiki/R*_tree>`_. We're working on further improvements of the index, in particular, configurable distance function. See https://github.com/tarantool/tarantool/wiki/R-tree-index-quick-start-and-usage
ru: Многомерный RTREE-индекс. RTREE-индекс теперь поддерживает большое количество измерений (до 32). Cтруктура данных RTREE была оптимизирована так, чтобы действительно использовать `R\*-TREE <https://en.wikipedia.org/wiki/R*_tree>`_. Мы работаем над дальнейшим улучшением индекса, в частности, над функцией конфигурации расстояния. См. https://github.com/tarantool/tarantool/wiki/R-tree-index-quick-start-and-usage

source: Sophia 2.1.1, with support of compression and multipart primary keys. See https://groups.google.com/forum/#!topic/sophia-database/GfcbEC7ksRg
ru: Sophia 2.1.1 с поддержкой компрессии и составных первичных ключей. См. https://groups.google.com/forum/#!topic/sophia-database/GfcbEC7ksRg

source: New ``upsert`` command available in the binary protocol and in stored functions. The key advantage of upsert is that it's much faster with write-optimized storage (sophia storage engine), but some caveats exists as well. See Issue `905 <https://github.com/tarantool/tarantool/issues/905>`_ for details. Even though upsert performance advantage is most prominent with sophia engine, it works with all storage engines.
ru: В бинарном протоколе и в хранимых функциях доступна новая команда ``upsert``. Ключевое преимущество команды upsert в том, что она работает намного быстрее с хранилищами, оптимизированными для чтения (движок базы данных sophia), однако есть также некоторые оговорки. Для получения дополнительной информации см. проблему `905 <https://github.com/tarantool/tarantool/issues/905>`_. И хотя преимущество производительности upsert наиболее очевидно с движком sophia, команда работает со всеми движками базы данных.

source: Better memory diagnostics information for fibers, tuple and index arena Try a new command ``box.slab.stats()``, for detailed information about tuple/index slabs, ``fiber.info()`` now displays information about memory used by the fiber.
ru: Более точная информация диагностики памяти для файберов, кортежей и индексов. Используйте новую команду ``box.slab.stats()`` для получения подробной информация о кортежах/индексах, команда ``fiber.info()`` отобразит информацию о памяти, занятой файбером.

source: Update and delete now work using a secondary index, if the index is unique.
ru: Операции update и delete работают с использованием вторичного индекса, если индекс уникальный.

source: Authentication triggers. Set ``box.session.on_auth`` triggers to catch authentication events. Trigger API is improved to display all defined triggers, easily remove old triggers.
ru: Триггеры для аутентификации. Установите триггеры ``box.session.on_auth`` для отслеживания событий аутентификации. API для триггеров улучшили, чтобы он отображал все заданные триггеры, старые триггеры легко удалить.

source: Manifold performance improvements of ``net.box`` built-in package.
ru: Разнообразные улучшения производительности встроенного модуля ``net.box``.

source: Performance optimizations of BITSET index.
ru: Оптимизация производительности BITSET-индекса.

source: ``panic_on_wal_error`` is a dynamic configuration option now.
ru: ``panic_on_wal_error`` представляет собой динамический параметр конфигурации.

source: iproto ``sync`` field is available in Lua as ``session.sync()``.
ru: Поле iproto ``sync`` доступно в Lua как ``session.sync()``.

source: ``box.once()`` - a new method to invoke code once in an instance and replica set lifetime. Use ``once()`` to set up spaces and uses, as well as do schema upgrade in production.
ru: ``box.once()`` -- новый метод для вызова кода однократно в течение срока жизни экземпляра и набора реплик. Используйте ``once()`` для настройки спейсов и пользователей, а также для обновления схемы в эксплуатационной среде.

source: ``box.error.last()`` to return the last error in a session.
ru: ``box.error.last()`` возвращает последнюю ошибку в сессии.

source: ``jit.*``, ``jit.dump``, ``jit.util``, ``jit.vmdef`` modules of LuaJIT 2.0 are now available as built-ins. See http://luajit.org/ext_jit.html
ru: Следующие модули LuaJIT 2.0 теперь являются встроенными: ``jit.*``, ``jit.dump``, ``jit.util``, ``jit.vmdef``. См. http://luajit.org/ext_jit.html

source: ``strict`` built-in package, banning use of undeclared variables in Lua. Strict mode is on when Tarantool is compiled with debug. Turn on/off with ``require('strict').on()``/``require('strict').off()``.
ru: ``strict`` -- встроенный пакет, который запрещает использование необъявленных переменных в Lua. Работа ведется в таком режиме, когда Tarantool компилируется с отладкой. Чтобы включить/отключить этот режим, используйте ``require('strict').on()``/``require('strict').off()`` соответственно.

source: ``pg`` and ``mysql`` rocks, available at http://rocks.tarantool.org - working with MySQL and PostgreSQL from Tarantool.
ru: ``pg`` и ``mysql`` -- модули, доступные по ссылке http://rocks.tarantool.org -- работают с MySQL и PostgreSQL из Tarantool'а.

source: ``gperftools`` rock, availble at http://rocks.tarantool.org - getting perfromance data using Google's gperf from Tarantool.
ru: ``gperftools`` -- модуль, доступный по ссылке http://rocks.tarantool.org -- получает данные о производительности с помощью Google gperf из Tarantool'а.

source: ``csv`` built-in rock, to parse and load CSV (comma-separated values) data.
ru: ``csv`` -- встроенный модуль для разбора и загрузки данных в формате CSV (значения, разделенные запятыми).

source: New supported platforms:
ru: Поддержка новой платформы:

source: Tarantool 1.10 manual
ru: Руководство по Tarantool 1.10
