Repository: tarantool/doc
Catalog: locale/*/LC_MESSAGES/doc.po
Languages: ru

source: Tarantool passwords are stored in the :ref:`_user <box_space-user>` system space with a `cryptographic hash function <https://en.wikipedia.org/wiki/Cryptographic_hash_function>`_ so that, if the password is ‘x’, the stored hash-password is a long string like ‘lL3OvhkIPOKh+Vn9Avlkx69M/Ck=‘. When a client connects to a Tarantool instance, the instance sends a random `salt value <https://en.wikipedia.org/wiki/Salt_%28cryptography%29>`_ which the client must mix with the hashed-password before sending to the instance. Thus the original value ‘x’ is never stored anywhere except in the user’s head, and the hashed value is never passed down a network wire except when mixed with a random salt.
ru: Пароли Tarantool'а хранятся в системном спейсе :ref:`_user <box_space-user>` с `криптографической хеш-функцией <https://ru.wikipedia.org/wiki/%D0%9A%D1%80%D0%B8%D0%BF%D1%82%D0%BE%D0%B3%D1%80%D0%B0%D1%84%D0%B8%D1%87%D0%B5%D1%81%D0%BA%D0%B0%D1%8F_%D1%85%D0%B5%D1%88-%D1%84%D1%83%D0%BD%D0%BA%D1%86%D0%B8%D1%8F>`_, так что если паролем является ‘x’, хранится хеш-пароль в виде длинной строки, например ‘lL3OvhkIPOKh+Vn9Avlkx69M/Ck=‘. Когда клиент подключается к экземпляру Tarantool'а, экземпляр отправляет случайное `значение соль <https://ru.wikipedia.org/wiki/%D0%A1%D0%BE%D0%BB%D1%8C_(%D0%BA%D1%80%D0%B8%D0%BF%D1%82%D0%BE%D0%B3%D1%80%D0%B0%D1%84%D0%B8%D1%8F)>`_, которое клиент должен сложить вместе с хеш-паролем перед отправкой на экземпляр. Таким образом, изначальное значение ‘x’ никогда не хранится нигде, кроме как в голове самого пользователя, а хешированное значение никогда не передается по сети, кроме как в смешанном с солью виде.

source: This system prevents malicious onlookers from finding passwords by snooping in the log files or snooping on the wire. It is the same system that `MySQL introduced several years ago <http://dev.mysql.com/doc/refman/5.7/en/password-hashing.html>`_, which has proved adequate for medium-security installations. Nevertheless, administrators should warn users that no system is foolproof against determined long-term attacks, so passwords should be guarded and changed occasionally. Administrators should also advise users to choose long unobvious passwords, but it is ultimately up to the users to choose or change their own passwords.
ru: Система не дает злоумышленнику определить пароли путем просмотра файлов журнала или слежения за активностью. Это та же система, `несколько лет назад внедренная в MySQL <http://dev.mysql.com/doc/refman/5.7/en/password-hashing.html>`_, которой оказалось достаточно для объектов со средней степенью безопасности. Тем не менее, администраторы должны предупреждать пользователей, что никакая система не защищена полностью от постоянных длительных атак, поэтому пароли следует охранять и периодически изменять. Администраторы также должны рекомендовать пользователям выбирать длинные неочевидные пароли, но сами пользователи выбирают свои пароли и изменяют их.

source: There are two functions for managing passwords in Tarantool: :ref:`box.schema.user.password() <box_schema-user_password>` for changing a user's password and :ref:`box.schema.user.passwd() <box_schema-user_passwd>` for getting a hash-password.
ru: Для управления паролями в Tarantool'е есть две функции: :ref:`box.schema.user.password() <box_schema-user_password>` для изменения пароля пользователя и :ref:`box.schema.user.passwd() <box_schema-user_passwd>` для получения хеш-пароля.

source: Owners and privileges
ru: Владельцы и права

source: Here we create a Lua function that will be executed under the user id of its creator, even if called by another user.
ru: Здесь создадим Lua-функциб, которая будет выполняться от ID пользователя, который является ее создателем, даже если она вызывается другим пользователем.

source: First, we create two spaces ('u' and 'i') and grant a no-password user ('internal') full access to them. Then we define a function ('read_and_modify') and the no-password user becomes this function's creator. Finally, we grant another user ('public_user') access to execute Lua functions created by the no-password user.
ru: Для начала создадим два спейса ('u' и 'i') и дадим полный доступ к ним пользователю без пароля ('internal'). Затем определим функцию ('read_and_modify'), и пользователь без пароля становится создателем функции. Наконец, дадим другому пользователю ('public_user') доступ на выполнение Lua-функций, созданных пользователем без пароля.

source: Roles
ru: Роли

source: A **role** is a container for privileges which can be granted to regular users. Instead of granting or revoking individual privileges, you can put all the privileges in a role and then grant or revoke the role.
ru: **Роль** представляет собой контейнер для прав, которые можно предоставить обычным пользователям. Вместо того, чтобы предоставлять или отменять индивидуальные права, можно поместить все права в роль, а затем назначить или отменить роль.

source: Role information is stored in the :ref:`_user <box_space-user>` space, but the third field in the tuple -- the type field -- is ‘role’ rather than ‘user’.
ru: Информация о роли хранится в спейсе :ref:`_user <box_space-user>`, но третье поле кортежа -- поле типа -- это ‘роль’, а не ‘пользователь’.

source: An important feature in role management is that roles can be **nested**. For example, role R1 can be granted a privilege "role R2", so users with the role R1 will subsequently get all privileges from both roles R1 and R2. In other words, a user gets all the privileges that are granted to a user’s roles, directly or indirectly.
ru: В управлении доступом на основе ролей один из главных моментов -- это то, что роли могут быть **вложенными**. Например, роли R1 можно предоставить право типа "роль R2", то есть пользователи с ролью R1 тогда получат все права роли R1 и роли R2. Другими словами, пользователь получает все права, которые предоставляются ролям пользователя напрямую и опосредованно.

source: -- This example will work for a user with many privileges, such as 'admin' -- or a user with the pre-defined 'super' role -- Create space T with a primary index box.schema.space.create('T') box.space.T:create_index('primary', {}) -- Create user U1 so that later we can change the current user to U1 box.schema.user.create('U1') -- Create two roles, R1 and R2 box.schema.role.create('R1') box.schema.role.create('R2') -- Grant role R2 to role R1 and role R1 to user U1 (order doesn't matter) box.schema.role.grant('R1', 'execute', 'role', 'R2') box.schema.user.grant('U1', 'execute', 'role', 'R1') -- Grant read/write privileges for space T to role R2 -- (but not to role R1 and not to user U1) box.schema.role.grant('R2', 'read,write', 'space', 'T') -- Change the current user to user U1 box.session.su('U1') -- An insertion to space T will now succeed because, due to nested roles, -- user U1 has write privilege on space T box.space.T:insert{1}
ru: -- Этот пример сработает для пользователя со множеством прав, например, 'admin' -- или для пользователя с заданной ролью 'super' -- Создать спейс T с первичным индексом box.schema.space.create('T') box.space.T:create_index('primary', {}) -- Создать пользователя U1, чтобы затем можно было заменить текущего пользователя на U1 box.schema.user.create('U1') -- Создать две роли, R1 и R2 box.schema.role.create('R1') box.schema.role.create('R2') -- Предоставить роль R2 для роли R1, а роль R1 пользователю U1 (порядок не имеет значения) box.schema.role.grant('R1', 'execute', 'role', 'R2') box.schema.user.grant('U1', 'execute', 'role', 'R1') -- Предоставить права на чтение/запись на спейс T для роли R2 -- (но не для роли R1 и не пользователю U1) box.schema.role.grant('R2', 'read,write', 'space', 'T') -- Изменить текущего пользователя на пользователя U1 box.session.su('U1') -- Теперь вставка в спейс T сработает, потому что благодаря вложенным ролям -- у пользователя U1 есть права на запись в спейс T box.space.T:insert{1}

source: For details about Tarantool functions related to role management, see reference on :ref:`box.schema <box_schema>` submodule.
ru: Для получения подробной информации о функциях Tarantool'а, связанных с управлением доступом на основе ролей, см. справочник по вложенному модулю :ref:`box.schema <box_schema>`.

source: Sessions and security
ru: Сессии и безопасность

source: A **session** is the state of a connection to Tarantool. It contains:
ru: **Сессия** -- это состояние подключения к Tarantool'у. Она содержит:

source: an integer id identifying the connection,
ru: идентификатор в виде целого числа, определяющий соединение,

source: the :ref:`current user <authentication-users>` associated with the connection,
ru: :ref:`текущий пользователь <authentication-users>`, использующий соединение,

source: text description of the connected peer, and
ru: текстовое описание подключенного узла и

source: session local state, such as Lua variables and functions.
ru: локальное состояние сессии, например, переменные и функции на Lua.

source: In Tarantool, a single session can execute multiple concurrent transactions. Each transaction is identified by a unique integer id, which can be queried at start of the transaction using :ref:`box.session.sync() <box_session-sync>`.
ru: В Tarantool'е отдельная сессия может выполнять несколько транзакций одновременно. Каждая транзакция определяется по уникальному идентификатору в виде целого числа, который можно запросить в начале транзакции с помощью :ref:`box.session.sync() <box_session-sync>`.

source: To track all connects and disconnects, you can use :ref:`connection and authentication triggers <triggers>`.
ru: Чтобы отследить все подключения и отключения, можно использовать :ref:`триггеры соединений и аутентификации <triggers>`.

source: Submodule `box.cfg`
ru: Вложенный модуль `box.cfg`

source: The ``box.cfg`` submodule is for administrators to specify all the :ref:`server configuration parameters <box_cfg_params>`.
ru: Вложенный модуль ``box.cfg`` предназначен для системных администраторов, чтобы указать все :ref:`параметры конфигурации сервера <box_cfg_params>`.

source: Say ``box.cfg`` without braces to view the current configuration, for example:
ru: Введите команду ``box.cfg`` без фигурных скобок для просмотра текущей конфигурации, например:

source: To set the parameters, say ``box.cfg{...}``, for example:
ru: Чтобы установить параметры, введите команду ``box.cfg{...}``, например:

source: If you say ``box.cfg{}`` with no parameters, Tarantool applies default settings:
ru: Если ввести ``box.cfg{}`` без параметров, Tarantool применит настройки по умолчанию:

source: The first call to ``box.cfg{...}`` (with or without parameters) initiates Tarantool's database module :ref:`box <box-module>`. To perform any database operations, you must call ``box.cfg{...}`` first.
ru: Первый вызов ``box.cfg{...}`` (с параметрами или без них) запускает модуль базы данных Tarantool'а под названием :ref:`box <box-module>`. Чтобы выполнить любые операции с базой данных, необходимо сначала вызвать ``box.cfg{...}``.

source: ``box.cfg{...}`` is also the command that reloads :ref:`persistent data files <index-box_persistence>` into RAM upon restart once we have data.
ru: Команда ``box.cfg{...}`` также перезагружает :ref:`файлы с данными длительного хранения <index-box_persistence>` в оперативную память при перезапуске после получения данных.

source: Submodule `box.ctl`
ru: Вложенный модуль `box.ctl`

source: The ``box.ctl`` submodule contains two functions: ``wait_ro`` (wait until read-only) and ``wait_rw`` (wait until read-write). The functions are useful during initialization of a server.
ru: Вложенный модуль ``box.ctl`` включает в себя две функции: ``wait_ro`` (дождаться режима только для чтения) и ``wait_rw`` (дождаться режима чтения и записи). Эти функции используются во время инициализации сервера.

source: A particular use is for :ref:`box_once() <box-once>`. For example, when a replica is initializing, it may call a ``box.once()`` function while the server is still in read-only mode, and fail to make changes that are necessary only once before the replica is fully initialized. This could cause conflicts between a master and a replica if the master is in read-write mode and the replica is in read-only mode. Waiting until "read only mode = false" solves this problem.
ru: Для :ref:`box_once() <box-once>` есть особое предназначение. Например, при инициализации реплика может вызвать функцию ``box.once()``, пока сервер все еще находится в режиме только для чтения, и не сможет применить изменения однократно до окончательной инициализации реплики. Это может привести к конфликту между мастером и репликой, если мастер находится в режиме чтения и записи, а реплика доступна только для чтения. Ожидание условия "read only mode = false" (режим только для чтения отключен) решает эту проблему.

source: To see whether a function is already in read-only or read-write mode, check :ref:`box.info.ro <box_introspection-box_info>`.
ru: Чтобы проверить режим функции -- только для чтения или чтение и запись, используйте :ref:`box.info.ro <box_introspection-box_info>`.

source: Wait until ``box.info.ro`` is true.
ru: Дождаться, пока не будет выполнено ``box.info.ro``.

source: Parameters
ru: Параметры

source: maximum number of seconds to wait
ru: максимальное количество секунд ожидания

source: return
ru: возвращается

source: nil, or error (errors may be due to timeout or fiber cancellation)
ru: нулевое значение nil или ошибка (ошибки могут возникать из-за превышения времени ожидания или прерывания работы файбера)

source: **Example:**
ru: **Пример:**

source: Wait until box.info.ro is false.
ru: Дождаться, пока не перестанет соблюдаться box.info.ro.

source: Submodule `box.index`
ru: Вложенный модуль `box.index`

source: Overview
ru: Общие сведения

source: The ``box.index`` submodule provides read-only access for index definitions and index keys. Indexes are contained in :samp:`box.space.{space-name}.index` array within each space object. They provide an API for ordered iteration over tuples. This API is a direct binding to corresponding methods of index objects of type ``box.index`` in the storage engine.
ru: Вложенный модуль ``box.index`` обеспечивает доступ к схемам индекса и ключам индекса в режиме только для чтения. Индексы хранятся в массиве :samp:`box.space.{имя-спейса}.index` в каждом спейсе. Они предоставляют API для упорядоченной итерации по кортежам. Этот API представляет собой прямую привязку к соответствующим методам объектов типа``box.index`` в движке базы данных.

source: Index
ru: Индекс

source: Below is a list of all ``box.index`` functions and members.
ru: Ниже приведен перечень всех функций и элементов модуля ``box.index``.

source: Name
ru: Имя

source: Use
ru: Использование

source: Flag, true if an index is unique
ru: Флаг, если индекс уникальный -- true

source: Index type
ru: Тип индекса

source: Array of index key fields
ru: Массив полей с ключами индекса

source: Prepare for iterating
ru: Подготовка к итерации

source: Select one or more tuples via index
ru: Выбор одного или более кортежей по индексу

source: Select a tuple via index
ru: Выбор кортежа по индексу

source: Find the minimum value in index
ru: Поиск минимального значения в индексе

source: Find the maximum value in index
ru: Поиск максимального значения в индексе

source: Find a random value in index
ru: Поиск случайного значения в индексе

source: Count tuples matching key value
ru: Подсчет кортежей с совпадающим значением ключа

source: Update a tuple
ru: Обновление кортежа

source: Delete a tuple by key
ru: Удаление кортежа по ключу

source: Alter an index
ru: Изменение индекса

source: Drop an index
ru: Удаление индекса

source: Rename an index
ru: Переименование индекса

source: Get count of bytes for an index
ru: Подсчет байтов для индекса

source: True if the index is unique, false if the index is not unique.
ru: Если индекс уникальный -- true, если индекс не уникален -- false.

source: rtype
ru: тип возвращаемого значения

source: boolean
ru: boolean (логический)

source: Index type, 'TREE' or 'HASH' or 'BITSET' or 'RTREE'.
ru: Тип индекса: 'TREE' или 'HASH' или 'BITSET' или 'RTREE'.

source: An array describing the index fields. To learn more about the index field types, refer to :ref:`this table <box_space-index_field_types>`.
ru: Массив, описывающий поля индекса. Чтобы узнать больше о типах полей индекса, обращайтесь к :ref:`этой таблице <box_space-index_field_types>`.

source: table
ru: таблица

source: Search for a tuple or a set of tuples via the given index, and allow iterating over one tuple at a time.
ru: Поиск кортежа или набора кортежей по заданному индексу и итерация по одному кортежу за раз.

source: The :samp:`{key}` parameter specifies what must match within the index.
ru: Параметр :samp:`{key}` (ключ) задает, что именно должно совпадать в индексе.

source: :samp:`{key}` is only used to find the first match. Do not assume all matched tuples will contain the key.
ru: :samp:`{key}` используется в поиске только первого совпадения. Не стоит ожидать, что все подобранные кортежи будут содержать этот ключ.

source: The :samp:`{iterator}` parameter specifies the rule for matching and ordering. Different index types support different iterators. For example, a TREE index maintains a strict order of keys and can return all tuples in ascending or descending order, starting from the specified key. Other index types, however, do not support ordering.
ru: Параметр :samp:`{iterator}` (итератор) задает правило для совпадений и упорядочивания. Различные типы индексов поддерживают различные итераторы. Например, TREE-индекс поддерживает строгий порядок ключей и может вернуть все кортежи в порядке по возрастанию или по убыванию, начиная с указанного ключа. Однако другие типы индексов не поддерживают упорядочивание.

source: To understand consistency of tuples returned by an iterator, it's essential to know the principles of the Tarantool transaction processing subsystem. An iterator in Tarantool does not own a consistent read view. Instead, each procedure is granted exclusive access to all tuples and spaces until there is a "context switch": which may happen due to :ref:`the implicit yield rules <atomic-implicit-yields>`, or by an explicit call to :ref:`fiber.yield <fiber-yield>`. When the execution flow returns to the yielded procedure, the data set could have changed significantly. Iteration, resumed after a yield point, does not preserve the read view, but continues with the new content of the database. The tutorial :ref:`Indexed pattern search <c_lua_tutorial-indexed_pattern_search>` shows one way that iterators and yields can be used together.
ru: Чтобы понять логику возврата кортежей с помощью итератора, важно знать принципы работы подсистемы обработки транзакций в Tarantool'е. В итераторе Tarantool'а нет собственного постоянного вида просмотра. Наоборот, каждая процедура получает эксклюзивный доступ ко всем кортежам и спейсам до тех пор, пока не "переключится контекст", что может произойти по причине :ref:`неявной передачи управления <atomic-implicit-yields>` или в результате явного вызова функции :ref:`fiber.yield <fiber-yield>`. Когда поток выполнения возвращается к процедуре, передавшей управление, набор данных может уже значительно измениться. Итерация возобновляется после стадии передачи управления и не сохраняет вид просмотра, а продолжает работу с новым содержимым базы данных. В практическом задании :ref:`"Индексированный поиск по шаблонам" <c_lua_tutorial-indexed_pattern_search>` демонстрируется один из способов одновременного использования итераторов и передачи управления.

source: an :ref:`object reference <app_server-object_reference>`.
ru: :ref:`ссылка на объект <app_server-object_reference>`.

source: value to be matched against the index key, which may be multi-part
ru: значение должно совпасть с индексным ключом, который может быть составным

source: as defined in tables below. The default iterator type is 'EQ'
ru: как определено в таблицах ниже. По умолчанию используется итератор 'EQ'

source: `iterator <https://www.lua.org/pil/7.1.html>`_ which can be used in a for/end loop or with `totable() <https://rtsisyk.github.io/luafun/reducing.html#fun.totable>`_
ru: `итератор <https://www.lua.org/pil/7.1.html>`_, который может использовать в цикле for/end или с функцией `totable() <https://rtsisyk.github.io/luafun/reducing.html#fun.totable>`_

source: **Possible errors:**
ru: **Возможные ошибки:**

source: no such space; wrong type;
ru: спейс отсутствует; неправильный тип;

source: selected iteration type is not supported for the index type;
ru: выбранный тип итерации не поддерживается для данного типа индекса;

source: key is not supported for the iteration type.
ru: ключ не поддерживается для данного типа итерации.

source: **Complexity factors:** Index size, Index type; Number of tuples accessed.
ru: **Факторы сложности** Размер индекса, тип индекса; количество кортежей, к которым получен доступ.

source: A search-key-value can be a number (for example ``1234``), a string (for example ``'abcd'``), or a table of numbers and strings (for example ``{1234, 'abcd'}``). Each part of a key will be compared to each part of an index key.
ru: Значение искомого ключа может представлять собой число (например, ``1234``), строку (например, ``'abcd'``) или таблицу из чисел и строк (например, ``{1234, 'abcd'}``). Каждая часть ключа будет сопоставляться с каждой частью ключа в индексе.

source: The returned tuples will be in order by index key value, or by the hash of the index key value if index type = 'hash'. If the index is non-unique, then duplicates will be secondarily in order by primary key value. The order will be reversed if the iterator type is 'LT' or 'LE' or 'REQ'.
ru: Найденные кортежи будут упорядочены по значению ключа в индексе или по хешу значения ключа, если тип индекса -- 'hash'. Если индекс не уникален, то дубликаты будут упорядочены во вторую очередь по первичному значению ключа. Порядок будет обратным, если тип итератора -- 'LT', 'LE' или 'REQ'.

source: **Iterator types for TREE indexes**
ru: **Типы итераторов для TREE-индексов**

source: Arguments
ru: Аргументы

source: Description
ru: Описание

source: box.index.EQ or 'EQ'
ru: box.index.EQ или 'EQ'

source: search value
ru: искомое значение

source: The comparison operator is '==' (equal to). If an index key is equal to a search value, it matches. Tuples are returned in ascending order by index key. This is the default.
ru: Оператором сравнения будет '==' (равный). Если ключ индекса равен искомому значению, получим совпадение. Найденные кортежи упорядочены по возрастанию по ключу индекса. Этот тип используется по умолчанию.

source: box.index.REQ or 'REQ'
ru: box.index.REQ или 'REQ'

source: Matching is the same as for ``box.index.EQ``. Tuples are returned in descending order by index key.
ru: Совпадения находятся таким же образом, что и для ``box.index.EQ``. Найденные кортежи упорядочены по убыванию по ключу индекса.

source: box.index.GT or 'GT'
ru: box.index.GT или 'GT'

source: The comparison operator is '>' (greater than). If an index key is greater than a search value, it matches. Tuples are returned in ascending order by index key.
ru: Оператором сравнения будет '>' (больше чем). Если ключ индекса больше, чем искомое значение, получим совпадение. Найденные кортежи упорядочены по возрастанию по ключу индекса.

source: box.index.GE or 'GE'
ru: box.index.GE или 'GE'

source: The comparison operator is '>=' (greater than or equal to). If an index key is greater than or equal to a search value, it matches. Tuples are returned in ascending order by index key.
ru: Оператором сравнения будет '>=' (больше или равен). Если ключ индекса больше искомого значения или равен ему, получим совпадение. Найденные кортежи упорядочены по возрастанию по ключу индекса.

source: box.index.ALL or 'ALL'
ru: box.index.ALL или 'ALL'
