Repository: tarantool/doc
Catalog: locale/*/LC_MESSAGES/doc.po
Languages: ru

source: Get the latest valid :ref:`.snap file <internals-snapshot>` and use ``tarantoolctl cat`` command to calculate at which lsn the data loss occurred.
ru: Возьмите последний корректный :ref:`.snap-файл <internals-snapshot>` и, используя команду ``tarantoolctl cat``, выясните, на каком именно lsn произошла потеря данных.

source: Start a new instance (instance#1) and use ``tarantoolctl play`` command to play to it the contents of .snap/.xlog files up to the calculated lsn.
ru: Запустите новый экземпляр (экземпляр #1) и с помощью команды ``tarantoolctl play`` скопируйте в него содержимое .snap/.xlog-файлов вплоть до вычисленного lsn.

source: Bootstrap a new replica from the recovered master (instance#1).
ru: Настройте новую реплику с помощью восстановленного мастера (экземпляра #1).

source: Server administration
ru: Администрирование серверной части

source: Tarantool is designed to have multiple running instances on the same host.
ru: Tarantool устроен таким образом, что возможно запустить несколько экземпляров программы на одном компьютере.

source: Here we show how to administer Tarantool instances using any of the following utilities:
ru: Здесь мы показываем, как администрировать экземпляры Tarantool’а с помощью любой из следующих утилит:

source: ``systemd`` native utilities, or
ru: встроенные утилиты ``systemd`` или

source: :ref:`tarantoolctl <tarantoolctl>`, a utility shipped and installed as part of Tarantool distribution.
ru: :ref:`tarantoolctl <tarantoolctl>`, утилита, поставляемая и устанавливаемая вместе с дистрибутивом Tarantool’а.

source: Unlike the rest of this manual, here we use system-wide paths.
ru: В отличие от остальной части руководства, в этой главе мы используем общесистемные пути.

source: Console examples here are for Fedora.
ru: Здесь мы приводим примеры консольного вывода для Fedora.

source: This chapter includes the following sections:
ru: Эта глава включает в себя следующие разделы:

source: Instance configuration
ru: Настройка экземпляров Tarantool’а

source: For each Tarantool instance, you need two files:
ru: Для каждого экземпляра Tarantool’а понадобится два файла:

source: [Optional] An :ref:`application file <app_server-launching_app>` with instance-specific logic. Put this file into the ``/usr/share/tarantool/`` directory.
ru: [Необязательный] :ref:`Файл приложения <app_server-launching_app>`, содержащий логику данного экземпляра. Поместите его в папку ``/usr/share/tarantool/``.

source: For example, ``/usr/share/tarantool/my_app.lua`` (here we implement it as a :ref:`Lua module <app_server-modules>` that bootstraps the database and exports ``start()`` function for API calls):
ru: Например, ``/usr/share/tarantool/my_app.lua`` (здесь мы реализуем его как :ref:`Lua-модуль <app_server-modules>`, который запускает базу данных и экспортирует функцию ``start()`` для API -вызовов):

source: An :ref:`instance file <admin-instance_file>` with instance-specific initialization logic and parameters. Put this file, or a symlink to it, into the **instance directory** (see :ref:`instance_dir <admin-instance_dir>` parameter in ``tarantoolctl`` configuration file).
ru: :ref:`Файл экземпляра <admin-instance_file>`, содержащий логику и параметры инициализации данного экземпляра. Поместите этот файл или символьную ссылку на него в **директорию экземпляра** (см. параметр :ref:`instance_dir <admin-instance_dir>` в конфигурационном файле ``tarantoolctl``).

source: For example, ``/etc/tarantool/instances.enabled/my_app.lua`` (here we load ``my_app.lua`` module and make a call to ``start()`` function from that module):
ru: Например, ``/etc/tarantool/instances.enabled/my_app.lua`` (здесь мы загружаем модуль ``my_app.lua`` и вызываем из него функцию ``start()``):

source: #!/usr/bin/env tarantool box.cfg { listen = 3301; } -- load my_app module and call start() function -- with some app options controlled by sysadmins local m = require('my_app').start({...})
ru: #!/usr/bin/env tarantool box.cfg { listen = 3301; } -- загрузить модуль my_app и вызвать функцию start() -- некоторые опции приложения под контролем сисадминов local m = require('my_app').start({...})

source: Instance file
ru: Файл экземпляра

source: After this short introduction, you may wonder what an instance file is, what it is for, and how ``tarantoolctl`` uses it. After all, Tarantool is an application server, so why not start the application stored in ``/usr/share/tarantool`` directly?
ru: После столь краткого предисловия может возникнуть вопрос: что из себя представляет файл экземпляра, для чего он нужен и как ``tarantoolctl`` использует его? Если Tarantool -- это сервер приложений, так почему бы не запускать хранящееся в ``/usr/share/tarantool`` приложение напрямую?

source: A typical Tarantool application is not a script, but a daemon running in background mode and processing requests, usually sent to it over a TCP/IP socket. This daemon needs to be started automatically when the operating system starts, and managed with the operating system standard tools for service management -- such as ``systemd`` or ``init.d``. To serve this very purpose, we created **instance files**.
ru: Типичное приложение для Tarantool -- это не скрипт, а демон, запущенный в фоновом режиме и обрабатывающий запросы, которые, как правило, посылаются через TCP/IP-сокет. Необходимо запускать этот демон со стартом операционной системы и управлять им с помощью стандартных средств операционной системы для управления сервисами -- таких как ``systemd`` или ``init.d``. С этой целью и были созданы **файлы экземпляра**.

source: You can have more than one instance file. For example, a single application in ``/usr/share/tarantool`` can run in multiple instances, each of them having its own instance file. Or you can have multiple applications in ``/usr/share/tarantool`` -- again, each of them having its own instance file.
ru: Файлов экземпляра может быть больше одного. Например, одно и то же приложение в ``/usr/share/tarantool`` может быть запущено на нескольких экземплярах Tarantool'а, у каждого из которых есть свой файл экземпляра. Или в ``/usr/share/tarantool`` может быть несколько приложений, и на каждое из них будет опять же приходиться свой файл экземпляра.

source: An instance file is typically created by a system administrator. An application file is often provided by a developer, in a Lua rock or an rpm/deb package.
ru: Обычно файл экземпляра создает системный администратор, а файл приложения предоставляет разработчик в Lua-модуле или rpm/deb-пакете.

source: An instance file is designed to not differ in any way from a Lua application. It must, however, configure the database, i.e. contain a call to :ref:`box.cfg{} <box_introspection-box_cfg>` somewhere in it, because it’s the only way to turn a Tarantool script into a background process, and ``tarantoolctl`` is a tool to manage background processes. Other than that, an instance file may contain arbitrary Lua code, and, in theory, even include the entire application business logic in it. We, however, do not recommend this, since it clutters the instance file and leads to unnecessary copy-paste when you need to run multiple instances of an application.
ru: По своему устройству файл экземпляра ничем не отличается от Lua-приложения. Однако с его помощью должна настраиваться база данных, поэтому в нем должен содержаться вызов :ref:`box.cfg{} <box_introspection-box_cfg>`, потому что это единственный способ превратить Tarantool-скрипт в фоновый процесс, а ``tarantoolctl`` -- это инструмент для управления фоновыми процессами. За исключением этого вызова, файл экземпляра может содержать произвольный код на Lua и, теоретически, даже всю бизнес-логику приложения. Однако мы не рекомендуем хранить весь код в файле экземпляра, потому что это приводит как к замусориванию самого файла, так и к ненужному копированию кода при необходимости запустить несколько экземпляров приложения.

source: `tarantoolctl` configuration file
ru: Конфигурационный файл `tarantoolctl`

source: Directory for the pid file and control-socket file; ``tarantoolctl`` will add “/instance_name” to the directory name.
ru: Директория, где хранятся pid-файл и socket-файл; ``tarantoolctl`` добавляет “/имя_экземпляра” к имени директории.

source: Directory for write-ahead .xlog files; ``tarantoolctl`` will add "/instance_name" to the directory name.
ru: Директория, где хранятся .xlog-файлы; ``tarantoolctl`` добавляет “/имя_экземпляра” к имени директории.

source: Directory for snapshot .snap files; ``tarantoolctl`` will add "/instance_name" to the directory name.
ru: Директория, где хранятся .snap-файлы; ``tarantoolctl`` добавляет “/имя_экземпляра” к имени директории.

source: Directory for vinyl files; ``tarantoolctl`` will add "/instance_name" to the directory name.
ru: Директория, где хранятся vinyl-файлы; ``tarantoolctl`` добавляет “/имя_экземпляра” к имени директории.

source: The place where the application log will go; ``tarantoolctl`` will add "/instance_name.log" to the name.
ru: Директория, где хранятся файлы журнала с сообщениями от Tarantool-приложения; ``tarantoolctl`` добавляет “/имя_экземпляра” к имени директории.

source: The user that runs the Tarantool instance. This is the operating-system user name rather than the Tarantool-client user name. Tarantool will change its effective user to this user after becoming a daemon.
ru: Пользователь, запускающий экземпляр Tarantool'а. Это пользователь операционной системы, а не Tarantool-клиента. Став демоном, Tarantool сменит своего пользователя на указанного.

source: The directory where all instance files for this host are stored. Put instance files in this directory, or create symbolic links.
ru: Директория, где хранятся все файлы экземпляра для данного компьютера. Поместите сюда файлы экземпляра или создайте символьные ссылки на них.

source: The default instance directory depends on Tarantool's ``WITH_SYSVINIT`` build option: when ON, it is ``/etc/tarantool/instances.enabled``, otherwise (OFF or not set) it is ``/etc/tarantool/instances.available``. The latter case is typical for Tarantool builds for Linux distros with ``systemd``.
ru: Директория с экземплярами, которая используется по умолчанию, зависит от параметра ``WITH_SYSVINIT`` сборки Tarantool'а: когда его значение "ON", то ``/etc/tarantool/instances.enabled``, в противном случае ("OFF" или значение не установлено), то ``/etc/tarantool/instances.available``. Последний случай характерен для сборок Tarantool'а для дистрибутивов Linux с ``systemd``.

source: To check the build options, say ``tarantool --version``.
ru: Для проверки параметров сборки выполните команду ``tarantool --version``.

source: Logs
ru: Журналирование

source: Tarantool logs important events to a file, e.g. ``/var/log/tarantool/my_app.log``. To build the log file path, ``tarantoolctl`` takes the instance name, prepends the instance directory and appends “.log” extension.
ru: Все важные события Tarantool записывает в файл журнала -- например, в ``/var/log/tarantool/my_app.log``. ``tarantoolctl`` строит путь до файла журнала следующим образом: "путь до директории с экземплярами" + "имя экземпляра" + ".lua".

source: Let’s write something to the log file:
ru: Запишем что-нибудь в файл журнала:

source: Then check the logs:
ru: Затем проверим содержимое журнала:

source: When logging to a file, the system administrator must ensure logs are rotated timely and do not take up all the available disk space. With ``tarantoolctl``, log rotation is pre-configured to use ``logrotate`` program, which you must have installed.
ru: При включенном журналировании системный администратор должен обеспечивать своевременную ротацию журналов, чтобы избежать переполнения дискового пространства. Ротация журналов в ``tarantoolctl`` производится с помощью программы ``logrotate``, которую необходимо установить заранее.

source: File ``/etc/logrotate.d/tarantool`` is part of the standard Tarantool distribution, and you can modify it to change the default behavior. This is what this file is usually like:
ru: Файл ``/etc/logrotate.d/tarantool`` поставляется со стандартным дистрибутивом Tarantool. Его можно редактировать для изменения поведения по умолчанию. Содержимое файла обычно выглядит так:

source: If you use a different log rotation program, you can invoke ``tarantoolctl logrotate`` command to request instances to reopen their log files after they were moved by the program of your choice.
ru: Если вы используете другую программу для ротации журналов, можно вызвать команду ``tarantoolctl logrotate``, чтобы экземпляры переоткрыли свои файлы журнала после того, как выбранная вами программа переместила их.

source: Tarantool can write its logs to a log file, ``syslog`` or a program specified in the configuration file (see :ref:`log <cfg_logging-log>` parameter).
ru: Tarantool может писать события в файл журнала, ``syslog`` или программу, указанную в конфигурационном файле (см. параметр :ref:`log <cfg_logging-log>`).

source: By default, logs are written to a file as defined in ``tarantoolctl`` defaults. ``tarantoolctl`` automatically detects if an instance is using ``syslog`` or an external program for logging, and does not override the log destination in this case. In such configurations, log rotation is usually handled by the external program used for logging. So, ``tarantoolctl logrotate`` command works only if logging-into-file is enabled in the instance file.
ru: По умолчанию запись производится в файл журнала, как указано в исходных настройках ``tarantoolctl``. Скрипт ``tarantoolctl`` автоматически определяет, когда экземпляр использует для журналирования ``syslog`` или внешнюю программу, и не изменяет то, куда ведется запись. В таких случаях ротацию журналов обычно выполняет та же программа, которая используется для журналирования. Именно поэтому команда ``tarantoolctl logrotate`` сработает только в том случае, если в файле экземпляра включена возможность вести запись в файл.

source: Notes for operating systems
ru: Замечания по поводу некоторых операционных систем

source: On Mac OS, you can administer Tarantool instances only with ``tarantoolctl``. No native system tools are supported.
ru: Администрирование экземпляров Tarantool'а на Mac OS возможно только с помощью ``tarantoolctl``. Встроенные системные инструменты не поддерживаются.

source: To make ``tarantoolctl`` work along with ``init.d`` utilities on FreeBSD, use paths other than those suggested in :ref:`Instance configuration <admin-instance_config>`. Instead of ``/usr/share/tarantool/`` directory, use ``/usr/local/etc/tarantool/`` and create the following subdirectories:
ru: Чтобы ``tarantoolctl`` и утилиты ``init.d`` работали на FreeBSD, используйте пути, отличные от предложенных в разделе :ref:`Настройка экземпляров Tarantool’а <admin-instance_config>`. Используйте ``/usr/local/etc/tarantool/`` вместо ``/usr/share/tarantool/`` и создайте следующие поддиректории:

source: ``default`` for ``tarantoolctl`` defaults (see example below),
ru: ``default`` для хранения настроек ``tarantoolctl`` по умолчанию (см. пример ниже),

source: ``instances.available`` for all available instance files, and
ru: ``instances.available`` для хранения всех доступных файлов экземпляра, и

source: ``instances.enabled`` for instance files to be auto-started by sysvinit.
ru: ``instances.enabled`` для хранения файлов экземпляра, которые необходимо запускать автоматически с помощью sysvinit.

source: Here is an example of ``tarantoolctl`` defaults on FreeBSD:
ru: Так выглядят настройки ``tarantoolctl`` по умолчанию на FreeBSD:

source: default_cfg = { pid_file = "/var/run/tarantool", -- /var/run/tarantool/${INSTANCE}.pid wal_dir = "/var/db/tarantool", -- /var/db/tarantool/${INSTANCE}/ snap_dir = "/var/db/tarantool", -- /var/db/tarantool/${INSTANCE} vinyl_dir = "/var/db/tarantool", -- /var/db/tarantool/${INSTANCE} logger = "/var/log/tarantool", -- /var/log/tarantool/${INSTANCE}.log username = "tarantool", } -- instances.available - all available instances -- instances.enabled - instances to autostart by sysvinit instance_dir = "/usr/local/etc/tarantool/instances.available"
ru: default_cfg = { pid_file = "/var/run/tarantool", -- /var/run/tarantool/${INSTANCE}.pid wal_dir = "/var/db/tarantool", -- /var/db/tarantool/${INSTANCE}/ snap_dir = "/var/db/tarantool", -- /var/db/tarantool/${INSTANCE} vinyl_dir = "/var/db/tarantool", -- /var/db/tarantool/${INSTANCE} logger = "/var/log/tarantool", -- /var/log/tarantool/${INSTANCE}.log username = "tarantool", } -- instances.available - все доступные экземпляры -- instances.enabled - экземпляры для автоматического запуска через sysvinit instance_dir = "/usr/local/etc/tarantool/instances.available"

source: The section below is about a dev-db/tarantool package installed from the official layman overlay (named ``tarantool``).
ru: В разделе ниже описывается пакет "dev-db/tarantool", установленный из официального оверлея layman (под названием ``tarantool``).

source: The default instance directory is ``/etc/tarantool/instances.available``, can be redefined in ``/etc/default/tarantool``.
ru: По умолчанию с экземплярами используется директория ``/etc/tarantool/instances.available``, ее можно переопределить в ``/etc/default/tarantool``.

source: Tarantool instances can be managed (start/stop/reload/status/...) using OpenRC. Consider the example how to create an OpenRC-managed instance:
ru: Управление экземплярами Tarantool'а (запуск/остановка/перезагрузка/проверка статуса и т.д.) можно осуществлять с помощью OpenRC. Рассмотрим пример, как создать экземпляр с управлением OpenRC:

source: Checking that it works:
ru: Проверяем, что работает:

source: Security
ru: Безопасность

source: Tarantool allows for two types of connections:
ru: Tarantool разрешает два типа подключений:

source: With :ref:`console.listen() <console-listen>` function from ``console`` module, you can set up a port which can be used to open an administrative console to the server. This is for administrators to connect to a running instance and make requests. ``tarantoolctl`` invokes ``console.listen()`` to create a control socket for each started instance.
ru: Используя функцию :ref:`console.listen() <console-listen>` из модуля ``console``, можно настроить порт для подключения к серверной административной консоли. Этот вариант для администраторов, которым необходимо подключиться к работающему экземпляру и послать некоторые запросы. ``tarantoolctl`` вызывает ``console.listen()``, чтобы создать управляющий сокет для каждого запущенного экземпляра.

source: With :ref:`box.cfg{listen=...} <cfg_basic-listen>` parameter from ``box`` module, you can set up a binary port for connections which read and write to the database or invoke stored procedures.
ru: Используя параметр :ref:`box.cfg{listen=...} <cfg_basic-listen>` из модуля ``box``, можно настроить бинарный порт для соединений, которые читают и пишут в базу данных или вызывают хранимые процедуры.

source: When you connect to an admin console:
ru: Если вы подключены к административной консоли:

source: The client-server protocol is plain text.
ru: Клиент-серверный протокол -- это простой текст.

source: No password is necessary.
ru: Пароль не требуется.

source: The user is automatically 'admin'.
ru: Пользователь автоматически получает права администратора.

source: Each command is fed directly to the built-in Lua interpreter.
ru: Каждая команда напрямую обрабатывается встроенным интерпретатором Lua.

source: Therefore you must set up ports for the admin console very cautiously. If it is a TCP port, it should only be opened for a specific IP. Ideally, it should not be a TCP port at all, it should be a Unix domain socket, so that access to the server machine is required. Thus a typical port setup for admin console is:
ru: Поэтому порты для административной консоли следует настраивать очень осторожно. Если это TCP-порт, он должен быть открыть только для определенного IP-адреса. В идеале вместо TCP-порта лучше настроить доменный Unix-сокет, который требует наличие прав доступа к серверной машине. Тогда типичная настройка порта для административной консоли будет выглядеть следующим образом:

source: and a typical connection :ref:`URI <index-uri>` is:
ru: а типичный :ref:`URI <index-uri>` для соединения будет таким:

source: if the listener has the privilege to write on ``/var/lib/tarantool`` and the connector has the privilege to read on ``/var/lib/tarantool``. Alternatively, to connect to an admin console of an instance started with ``tarantoolctl``, use :ref:`tarantoolctl enter <admin-executing_code_on_an_instance>`.
ru: если у приемника событий есть права на запись в ``/var/lib/tarantool`` и у коннектора есть права на чтение из ``/var/lib/tarantool``. Еще один способ подключиться к административной консоли экземпляра, запущенного с помощью ``tarantoolctl``, -- использовать :ref:`tarantoolctl enter <admin-executing_code_on_an_instance>`.

source: To find out whether a TCP port is a port for admin console, use ``telnet``. For example:
ru: Выяснить, является ли некоторый TCP-порт портом для административной консоли, можно с помощью ``telnet``. Например:

source: In this example, the response does not include the word "binary" and does include the words "Lua console". Therefore it is clear that this is a successful connection to a port for admin console, and you can now enter admin requests on this terminal.
ru: В этом примере в ответе от сервера нет слова "binary" и есть слова "Lua console". Это значит, что мы успешно подключились к порту для административной консоли и можем вводить администраторские запросы на этом терминале.

source: When you connect to a binary port:
ru: Если вы подключены к бинарному порту:

source: The client-server protocol is :ref:`binary <box_protocol-iproto_protocol>`.
ru: Клиент-серверный протокол -- :ref:`бинарный <box_protocol-iproto_protocol>`.

source: The user is automatically ':ref:`guest <authentication-users>`'.
ru: Автоматически выбирается пользователь ':ref:`guest <authentication-users>`'.

source: To change the user, it’s necessary to authenticate.
ru: Для смены пользователя необходимо пройти аутентификацию.

source: For ease of use, ``tarantoolctl connect`` command automatically detects the type of connection during handshake and uses :ref:`EVAL <box_protocol-eval>` binary protocol command when it’s necessary to execute Lua commands over a binary connection. To execute EVAL, the authenticated user must have global "EXECUTE" privilege.
ru: Для удобства использования команда ``tarantoolctl connect`` автоматически определяет тип подключения при установке соединения и использует команду бинарного протокола :ref:`EVAL <box_protocol-eval>` для выполнения Lua-команд по бинарному подключению. Чтобы выполнить команду EVAL, аутентифицированный пользователь должен иметь глобальные "EXECUTE"-права.

source: Therefore, when ``ssh`` access to the machine is not available, creating a Tarantool user with global "EXECUTE" privilege and non-empty password can be used to provide a system administrator **remote** access to an instance.
ru: Поэтому при невозможности подключиться к машине по ``ssh`` системный администратор может получить **удаленный** доступ к экземпляру, создав пользователя Tarantool с глобальными "EXECUTE"-правами и непустым паролем.

source: Server introspection
ru: Просмотр состояния сервера

source: Using Tarantool as a client
ru: Использование Tarantool'а в качестве клиента

source: Tarantool enters the interactive mode if:
ru: Tarantool входит в интерактивный режим, если:

source: you start Tarantool without an :ref:`instance file <admin-instance_file>`, or
ru: вы запускаете его без :ref:`файла экземпляра <admin-instance_file>`, либо

source: the instance file contains :ref:`console.start() <console-start>`.
ru: в файле экземпляра содержится команда :ref:`console.start() <console-start>`.
