Repository: tarantool/doc
Catalog: locale/*/LC_MESSAGES/doc.po
Languages: ru

source: --- Copy any table (shallow and deep version) -- * deepcopy: copies all levels -- * shallowcopy: copies only first level -- Supports __copy metamethod for copying custom tables with metatables -- @function gsplit -- @table inp original table -- @shallow[opt] sep flag for shallow copy -- @returns table (copy)
ru: --- Копирование любой таблицы (поверхностное и глубокое) -- * deepcopy: копирует все уровни -- * shallowcopy: копирует только первый уровень -- Поддержка метаметода __copy для копирования специальных таблиц с метатаблицами -- @function gsplit -- @table inp оригинальная таблица -- @shallow[opt] sep флаг для поверхностной копии -- @returns таблица (копия)

source: Testing
ru: Тестирование

source: Use ``tap`` module for writing efficient tests. Example of test file:
ru: Используйте модуль ``tap``, чтобы написать эффективные тесты. Пример файла с тестом:

source: #!/usr/bin/env tarantool local test = require('tap').test('table') test:plan(31) do -- check basic table.copy (deepcopy) local example_table = { {1, 2, 3}, {"help, I'm very nested", {{{ }}} } } local copy_table = table.copy(example_table) test:is_deeply( example_table, copy_table, "checking, that deepcopy behaves ok" ) test:isnt( example_table, copy_table, "checking, that tables are different" ) test:isnt( example_table[1], copy_table[1], "checking, that tables are different" ) test:isnt( example_table[2], copy_table[2], "checking, that tables are different" ) test:isnt( example_table[2][2], copy_table[2][2], "checking, that tables are different" ) test:isnt( example_table[2][2][1], copy_table[2][2][1], "checking, that tables are different" ) end <...> os.exit(test:check() == true and 0 or 1)
ru: #!/usr/bin/env tarantool local test = require('tap').test('table') test:plan(31) do -- проверка базовой table.copy (глубокая копия) local example_table = { {1, 2, 3}, {"help, I'm very nested", {{{ }}} } } local copy_table = table.copy(example_table) test:is_deeply( example_table, copy_table, "checking, that deepcopy behaves ok" ) test:isnt( example_table, copy_table, "checking, that tables are different" ) test:isnt( example_table[1], copy_table[1], "checking, that tables are different" ) test:isnt( example_table[2], copy_table[2], "checking, that tables are different" ) test:isnt( example_table[2][2], copy_table[2][2], "checking, that tables are different" ) test:isnt( example_table[2][2][1], copy_table[2][2][1], "checking, that tables are different" ) end <...> os.exit(test:check() == true and 0 or 1)

source: When you'll test your code output will be something like this:
ru: После тестирования кода вывод будет примерно таким:

source: Error Handling
ru: Обработка ошибок

source: Be generous in what you accept and strict in what you return.
ru: Принимайте разнообразные значения и выдавайте строго определенные.

source: With error handling this means that you must provide an error object as second multi-return value in case of error. The error object can be a string, a Lua table or cdata, in the latter cases it must have ``__tostring`` metamethod defined.
ru: В рамках обработки ошибок это означает, что в случае ошибки вы должны предоставить объект ошибки как второе возвращаемое значение. Объектом ошибки может быть строка, Lua-таблица или cdata, в последнем случае должен быть определен метаметод ``__tostring``.

source: In case of error, use ``nil`` for the first return value. This makes the error hard to ignore.
ru: В случае ошибки нулевое значение ``nil`` должно быть первым возвращаемым значением. В таком случае ошибку трудно игнорировать.

source: When checking function return values, check the first argument first. If it's ``nil``, look for error in the second argument:
ru: При проверке возвращаемых значений функции проверяйте сначала первый аргумент. Если это ``nil``, ищите ошибку во втором аргументе:

source: Unless performance of your code is paramount, try to avoid using more than two return values.
ru: Если производительность вашего кода не имеет первоочередное значение, постарайтесь избегать использования более двух возвращаемых значений.

source: In rare cases you may want to return ``nil`` as a legal return value. In this case it's OK to check for error first, and return second:
ru: В редких случаях ``nil`` можно сделать возвращаемым значением. В таком случае можно сначала проверить ошибку, а потом вернуть значение:

source: Python Style Guide
ru: Руководство по написанию кода на Python

source: Introduction
ru: Введение

source: This document gives coding conventions for the Python code comprising the standard library in the main Python distribution. Please see the companion informational PEP describing style guidelines for the C code in the C implementation of Python [1]_.
ru: Данный документ описывает соглашение о том, как писать код для языка Python, включая стандартную библиотеку, входящую в состав Python. Посмотрите также на сопутствующую PEP (Python enhanced proposal -- заявку на улучшение языка Python), описывающую, какого стиля следует придерживаться при написании кода на C в реализации языка Python [1]_.

source: This document and PEP 257 (Docstring Conventions) were adapted from Guido's original Python Style Guide essay, with some additions from Barry's style guide [2]_.
ru: Данный документ, а также PEP 257 (Документирование кода) созданы на основе оригинала рекомендаций Гуидо ван Россума с добавлениями от Барри [2]_.

source: A Foolish Consistency is the Hobgoblin of Little Minds
ru: A Foolish Consistency is the Hobgoblin of Little Minds ("Безрассудная согласованность сбивает с толку мелкие умы")

source: One of Guido's key insights is that code is read much more often than it is written. The guidelines provided here are intended to improve the readability of code and make it consistent across the wide spectrum of Python code. As PEP 20 says, "Readability counts".
ru: Одна из ключевых идей Гвидо заключается в том, что код читается намного чаще, чем пишется. И рекомендации по стилю программирования предназначены улучшить читаемость кода и сделать его согласованным во множестве проектов на языке Python. Как написано в PEP 20, "Читаемость имеет значение".

source: A style guide is about consistency. Consistency with this style guide is important. Consistency within a project is more important. Consistency within one module or function is the most important.
ru: В руководстве речь идет о согласованности. Согласованность с руководством очень важна. Согласованность внутри проекта еще важнее. А согласованность в пределах модуля или функции -- самое важное.

source: But most importantly: know when to be inconsistent -- sometimes the style guide just doesn't apply. When in doubt, use your best judgment. Look at other examples and decide what looks best. And don't hesitate to ask!
ru: Но очень важно понимать, когда можно отойти от рекомендаций, потому что руководство неприменимо. Если вы сомневаетесь, используйте свой опыт. Просто посмотрите на другие примеры и решите, какой выглядит лучше. И не бойтесь спросить!

source: Two good reasons to break a particular rule:
ru: Правила можно нарушить по одной из этих причин:

source: When applying the rule would make the code less readable, even for someone who is used to reading code that follows the rules.
ru: Если применение правила сделает код менее читаемым даже для того, кто привык читать код, написанный по правилам.

source: To be consistent with surrounding code that also breaks it (maybe for historic reasons) -- although this is also an opportunity to clean up someone else's mess (in true XP style).
ru: Чтобы не отступать по стилю от уже написанного не по правилам кода (возможно, в силу исторических причин) -- впрочем, это может быть возможность причесать чужой код (в стиле XP).

source: Code lay-out
ru: Размещение кода

source: Indentation
ru: Отступы

source: Use 4 spaces per indentation level.
ru: Используйте 4 пробела на каждый уровень отступа.

source: For really old code that you don't want to mess up, you can continue to use 8-space tabs.
ru: Если вы не хотите наводить путаницу в очень старом коде, можете продолжать использовать отступы в 8 пробелов.

source: Continuation lines should align wrapped elements either vertically using Python's implicit line joining inside parentheses, brackets and braces, or using a hanging indent. When using a hanging indent the following considerations should be applied; there should be no arguments on the first line and further indentation should be used to clearly distinguish itself as a continuation line.
ru: Продолжения строк должны выравнивать переносимые элементы либо вертикально, используя подразумевающееся объединение строк в скобках (круглых, квадратных или фигурных), либо с использованием висячего отступа. При использовании висячего отступа необходимо применять следующие соображения: на первой строке не должно быть аргументов, а остальные строки должны четко восприниматься как продолжение строки.

source: Yes::
ru: Правильно::

source: # Aligned with opening delimiter foo = long_function_name(var_one, var_two, var_three, var_four) # More indentation included to distinguish this from the rest. def long_function_name( var_one, var_two, var_three, var_four): print(var_one)
ru: # выравнивание по открывающему разделителю foo = long_function_name(var_one, var_two, var_three, var_four) # больше отступов, чтобы данный сегмент отличался от остальных. def long_function_name( var_one, var_two, var_three, var_four): print(var_one)

source: No::
ru: Неправильно::

source: # Arguments on first line forbidden when not using vertical alignment foo = long_function_name(var_one, var_two, var_three, var_four) # Further indentation required as indentation is not distinguishable def long_function_name( var_one, var_two, var_three, var_four): print(var_one)
ru: # запрещены аргументы на первой строке, если не используется вертикальное выравнивание foo = long_function_name(var_one, var_two, var_three, var_four) # необходимы дополнительные отступы для четких отличий def long_function_name( var_one, var_two, var_three, var_four): print(var_one)

source: Optional::
ru: Возможно::

source: # Extra indentation is not necessary. foo = long_function_name( var_one, var_two, var_three, var_four)
ru: # Нет необходимости в дополнительных отступах. foo = long_function_name( var_one, var_two, var_three, var_four)

source: The closing brace/bracket/parenthesis on multi-line constructs may either line up under the first non-whitespace character of the last line of list, as in::
ru: Закрывающие круглые/квадратные/фигурные скобки в многострочных конструкциях могут находиться либо под первым символом последней строки списка (не пробелом), например:

source: or it may be lined up under the first character of the line that starts the multi-line construct, as in::
ru: либо под первым символом строки, с которой начинается многострочная конструкция:

source: Tabs or Spaces?
ru: Табуляция или пробелы?

source: Never mix tabs and spaces.
ru: Никогда не смешивайте символы табуляции и пробелы.

source: The most popular way of indenting Python is with spaces only. The second-most popular way is with tabs only. Code indented with a mixture of tabs and spaces should be converted to using spaces exclusively. When invoking the Python command line interpreter with the ``-t`` option, it issues warnings about code that illegally mixes tabs and spaces. When using ``-tt`` these warnings become errors. These options are highly recommended!
ru: Самый распространенный способ отступов в Python -- пробелы. На втором месте -- отступы только с использованием табуляции. Код, в котором используются и те, и другие типы отступов, следует исправить так, чтобы отступы в нем были расставлены только с помощью пробелов. При вызове интерпретатора в командной строке с параметром ``-t`` он выдаст предупреждение в случае использовании смешанного стиля в отступах. Запустив интерпретатор с параметром -tt, вы получите в этих местах ошибки. Рекомендуем использовать эти опции!

source: For new projects, spaces-only are strongly recommended over tabs. Most editors have features that make this easy to do.
ru: В новых проектах для отступов настоятельно рекомендуется использовать только пробелы. Во многих редакторах можно легко это делать.

source: Maximum Line Length
ru: Максимальная длина строки

source: Limit all lines to a maximum of 79 characters.
ru: Ограничьте максимальную длину строки 79 символами.

source: There are still many devices around that are limited to 80 character lines; plus, limiting windows to 80 characters makes it possible to have several windows side-by-side. The default wrapping on such devices disrupts the visual structure of the code, making it more difficult to understand. Therefore, please limit all lines to a maximum of 79 characters. For flowing long blocks of text (docstrings or comments), limiting the length to 72 characters is recommended.
ru: Пока еще есть немало устройств, где длина строки ограничена 80 символами; к тому же, ограничив ширину окна 80 символами, мы можем расположить несколько окон рядом друг с другом. Автоматический перенос строк на таких устройствах нарушит форматирование, и код будет труднее понять. Поэтому ограничьте длину строки 79 символами. Для длинных блоков текста (строки документации или комментарии) рекомендуется ограничиваться 72 символами.

source: The preferred way of wrapping long lines is by using Python's implied line continuation inside parentheses, brackets and braces. Long lines can be broken over multiple lines by wrapping expressions in parentheses. These should be used in preference to using a backslash for line continuation.
ru: Предпочтительный способ переноса длинных строк -- использование подразумевающегося продолжения строки между обычными, квадратными и фигурными скобками. Длинные строки можно разбить на несколько строк в скобках. Это лучше, чем использовать обратную косую черту для продолжения строки.

source: Backslashes may still be appropriate at times. For example, long, multiple ``with``-statements cannot use implicit continuation, so backslashes are acceptable::
ru: Обратную косую черту можно использовать время от времени. Например, длинный оператор with не может работать с неявными продолжениями, так что обратная косая черта здесь подойдет:

source: Another such case is with ``assert`` statements.
ru: Еще один такой случай -- операторы ``assert``.

source: Make sure to indent the continued line appropriately. The preferred place to break around a binary operator is *after* the operator, not before it. Some examples::
ru: Делайте правильные отступы для перенесенной строки. Предпочтительнее вставить перенос строки *после* логического оператора, а не перед ним. Например:

source: Blank Lines
ru: Пустые строки

source: Separate top-level function and class definitions with two blank lines.
ru: Отделяйте функции верхнего уровня и определения классов двумя пустыми строками.

source: Method definitions inside a class are separated by a single blank line.
ru: Определения методов в пределах класса отделяйте одной пустой строкой.

source: Extra blank lines may be used (sparingly) to separate groups of related functions. Blank lines may be omitted between a bunch of related one-liners (e.g. a set of dummy implementations).
ru: Также можно добавлять пустые строки (не слишком часто) для выделения групп связанных функций. Пустые строки не стоит добавлять между несколькими связанными программами в одну строку (например, в формальной реализации).

source: Use blank lines in functions, sparingly, to indicate logical sections.
ru: Не слишком часто можно добавлять пустые строки в коде функций, чтобы отделить друг от друга логические части.

source: Python accepts the control-L (i.e. ^L) form feed character as whitespace; Many tools treat these characters as page separators, so you may use them to separate pages of related sections of your file. Note, some editors and web-based code viewers may not recognize control-L as a form feed and will show another glyph in its place.
ru: Python расценивает символ control+L (или ^L) как пробел. Многие редакторы обрабатывают его как разрыв страницы, поэтому его можно использовать для выделения логических части в файле на разных страницах. Обратите внимание, что не все редакторы распознают control+L и могут на его месте отображать другой символ.

source: Encodings (PEP 263)
ru: Кодировка (PEP 263)

source: Code in the core Python distribution should always use the ASCII or Latin-1 encoding (a.k.a. ISO-8859-1). For Python 3.0 and beyond, UTF-8 is preferred over Latin-1, see PEP 3120.
ru: В коде ядра Python всегда должна использоваться кодировка ASCII или Latin-1 (также известную как ISO-8859-1). Начиная с версии Python 3.0, предпочтительной является кодировка UTF-8, а не Latin-1 (см. PEP 3120).

source: Files using ASCII should not have a coding cookie. Latin-1 (or UTF-8) should only be used when a comment or docstring needs to mention an author name that requires Latin-1; otherwise, using ``\x``, ``\u`` or ``\U`` escapes is the preferred way to include non-ASCII data in string literals.
ru: Для файлов с ASCII не следует объявлять кодировку. Используйте Latin-1 (или UTF-8), только если необходимо указать в комментарии или строке документации имя автора, содержащее в себе символ из Latin-1. В остальных случаях рекомендуется использовать управляющие символы \x, \u или \U, чтобы вставить в строку символы не из ASCII.

source: For Python 3.0 and beyond, the following policy is prescribed for the standard library (see PEP 3131): All identifiers in the Python standard library MUST use ASCII-only identifiers, and SHOULD use English words wherever feasible (in many cases, abbreviations and technical terms are used which aren't English). In addition, string literals and comments must also be in ASCII. The only exceptions are (a) test cases testing the non-ASCII features, and (b) names of authors. Authors whose names are not based on the latin alphabet MUST provide a latin transliteration of their names.
ru: Начиная с версии Python 3.0 и выше, в стандартной библиотеке действует следующая политика (см. PEP 3131): все идентификаторы в стандартной библиотеке Python ДОЛЖНЫ содержать только ASCII-символы и означать английские слова везде, где это возможно (во многих случаях используются сокращения или неанглийские технические термины). Кроме того, строки и комментарии также должны содержать лишь ASCII-символы. Исключения составляют: (a) тестовые сценарии для тестирования функций программы в других кодировках, и (b) имена авторов. Авторы, в именах которых есть буквы не из латинского алфавита, должны транслитерировать свои имена в латиницу.

source: Open source projects with a global audience are encouraged to adopt a similar policy.
ru: В проектах с открытым кодом для широкой аудитории также рекомендуется использовать это правило.

source: Imports
ru: Импорт

source: Imports should usually be on separate lines, e.g.::
ru: Импорт разных модулей должен быть на разных строках, например:

source: It's okay to say this though::
ru: В то же время, можно писать вот так:

source: Imports are always put at the top of the file, just after any module comments and docstrings, and before module globals and constants.
ru: Импорт всегда нужно делать в начале файла сразу после комментариев к модулю и строк документации, перед объявлением глобальных переменных и постоянных.

source: Imports should be grouped in the following order:
ru: Группируйте импорты в следующем порядке:

source: standard library imports
ru: импорты стандартной библиотеки

source: related third party imports
ru: импорты сторонних библиотек

source: local application/library specific imports
ru: импорты модулей текущего проекта

source: You should put a blank line between each group of imports.
ru: Между группами импортов вставляйте пустую строку.

source: Put any relevant ``__all__`` specification after the imports.
ru: Указывайте все необходимые спецификации __all__ после импортов.

source: Relative imports for intra-package imports are highly discouraged. Always use the absolute package path for all imports. Even now that PEP 328 is fully implemented in Python 2.5, its style of explicit relative imports is actively discouraged; absolute imports are more portable and usually more readable.
ru: Относительные импорты крайне не рекомендуются. Всегда указывайте абсолютный путь к модулю для всех видов импорта. Даже сейчас, когда PEP 328 реализован в версии Python 2.5, явно использовать относительные импорты не рекомендуется. Абсолютные импорты более независимы и, как правило, обладают лучшей читаемостью.

source: When importing a class from a class-containing module, it's usually okay to spell this::
ru: При импорте класса из модуля с классами, обычно можно писать так:

source: If this spelling causes local name clashes, then spell them ::
ru: Если такое написание вызывает конфликт локальных имен, пишите:

source: and use "myclass.MyClass" and "foo.bar.yourclass.YourClass".
ru: И используйте "myclass.MyClass" и "foo.bar.yourclass.YourClass".

source: Whitespace in Expressions and Statements
ru: Пробелы в выражениях и операторах

source: Pet Peeves
ru: Наболевшие вопросы

source: Avoid extraneous whitespace in the following situations:
ru: Избегайте использования пробелов в следующих ситуациях:

source: Immediately inside parentheses, brackets or braces. ::
ru: Перед круглыми, фигурными и квадратными скобками и после них:

source: Immediately before a comma, semicolon, or colon::
ru: Сразу перед запятой, точкой с запятой, двоеточием:

source: Immediately before the open parenthesis that starts the argument list of a function call::
ru: Сразу перед открывающей скобкой, после которой начинается список аргументов при вызове функции:

source: Immediately before the open parenthesis that starts an indexing or slicing::
ru: Сразу перед открывающей скобкой, после которой идет индекс или срез:

source: More than one space around an assignment (or other) operator to align it with another.
ru: Больше одного пробела вокруг оператора присваивания (или другого) для того, чтобы выровнять его с другим оператором:

source: Other Recommendations
ru: Прочие рекомендации

source: Always surround these binary operators with a single space on either side: assignment (``=``), augmented assignment (``+=``, ``-=`` etc.), comparisons (``==``, ``<``, ``>``, ``!=``, ``<>``, ``<=``, ``>=``, ``in``, ``not in``, ``is``, ``is not``), Booleans (``and``, ``or``, ``not``).
ru: Всегда окружайте эти знаки двухместных операций пробелами по одному с каждой стороны: присваивание (``=``), комбинированное присваивание (``+=``, ``-=`` и т.д.), сравнения (``==``, ``<``, ``>``, ``!=``, ``<>``, ``<=``, ``>=``, ``in``, ``not in``, ``is``, ``is not``), логические операторы (``and``, ``or``, ``not``).

source: If operators with different priorities are used, consider adding whitespace around the operators with the lowest priority(ies). Use your own judgement; however, never use more than one space, and always have the same amount of whitespace on both sides of a binary operator.
ru: Если используются знаки операций с разными приоритетами, рассмотрите возможность добавить пробелы вокруг операций с самым низким приоритетом. Судите сами, однако, никогда не используйте больше одного пробела, и всегда используйте одинаковое количество пробелов по обе стороны от знака.

source: Don't use spaces around the ``=`` sign when used to indicate a keyword argument or a default parameter value.
ru: Не используйте пробелы для отделения знака ``=``, когда он употребляется для обозначения аргумента ключевого слова или значения параметра по умолчанию.

source: Compound statements (multiple statements on the same line) are generally discouraged.
ru: Не рекомендуется использовать составные операторы (несколько операторов в одной строке).

source: Rather not::
ru: Скорее неправильно:
