Repository: tarantool/doc
Catalog: locale/*/LC_MESSAGES/doc.po
Languages: ru

source: Store the process id in this file. Can be relative to :ref:`work_dir <cfg_basic-work_dir>`. A typical value is “:file:`tarantool.pid`”.
ru: Хранение идентификатора процесса в данном файле. Может относиться к :ref:`work_dir <cfg_basic-work_dir>`. Как правило, используется значение “:file:`tarantool.pid`”.

source: Say ``box.cfg{read_only=true...}`` to put the server instance in read-only mode. After this, any requests that try to change persistent data will fail with error :errcode:`ER_READONLY`. Read-only mode should be used for master-replica :ref:`replication <replication>`. Read-only mode does not affect data-change requests for spaces defined as :ref:`temporary <box_schema-space_create>`. Although read-only mode prevents the server from writing to the :ref:`WAL <internals-wal>`, it does not prevent writing diagnostics with the :ref:`log module <log-module>`.
ru: Чтобы ввести экземпляр сервера в режим только для чтения, выполните команду ``box.cfg{read_only=true...}``. После этого не будут выполняться любые запросы по изменению персистентных данных с ошибкой :errcode:`ER_READONLY`. Режим только для чтения следует использовать в :ref:`репликации <replication>` типа мастер-реплика. Режим только для чтения не влияет на запросы по изменению данных в спейсах, которые считаются :ref:`временными <box_schema-space_create>`. Хотя режим только для чтения не позволяет серверу делать записи в :ref:`WAL-файлы <internals-wal>`, запись диагностической информации в :ref:`модуле log <log-module>` все равно осуществляется.

source: A directory where vinyl files or subdirectories will be stored. Can be relative to :ref:`work_dir <cfg_basic-work_dir>`. If not specified, defaults to ``work_dir``.
ru: Директория, где хранятся файлы или поддиректории vinyl'а. Может относиться к :ref:`work_dir <cfg_basic-work_dir>`. Если не указан, по умолчанию ``work_dir``.

source: Type: float
ru: Тип: число с плавающей запятой

source: Default: 60
ru: По умолчанию: 60

source: UNIX user name to switch to after start.
ru: Имя пользователя в UNIX, на которое переключается система после запуска.

source: A directory where write-ahead log (.xlog) files are stored. Can be relative to :ref:`work_dir <cfg_basic-work_dir>`. Sometimes ``wal_dir`` and :ref:`memtx_dir <cfg_basic-memtx_dir>` are specified with different values, so that write-ahead log files and snapshot files can be stored on different disks. If not specified, defaults to ``work_dir``.
ru: Директория, где хранятся файлы журнала упреждающей записи (.xlog). Может относиться к :ref:`work_dir <cfg_basic-work_dir>`. Иногда в ``wal_dir`` и :ref:`memtx_dir <cfg_basic-memtx_dir>` указываются разные значения, чтобы WAL-файлы и файлы снимков хранились на разных дисках. Если не указан, по умолчанию ``work_dir``.

source: A directory where database working files will be stored. The server instance switches to ``work_dir`` with :manpage:`chdir(2)` after start. Can be relative to the current directory. If not specified, defaults to the current directory. Other directory parameters may be relative to ``work_dir``, for example:
ru: Директория, где хранятся рабочие файлы базы данных. Экземпляр сервера переключается на ``work_dir`` с помощью :manpage:`chdir(2)` после запуска. Может относиться к текущей директории. Если не указан, по умолчанию = текущей директории. Другие параметры директории могут относиться к ``work_dir``, например:

source: will put xlog files in ``/home/user/A/B``, snapshot files in ``/home/user/A/C``, and all other files or subdirectories in ``/home/user/A``.
ru: поместит xlog-файлы в ``/home/user/A/B``, файлы снимков в ``/home/user/A/C``, а все остальные файлы или поддиректории в ``/home/user/A``.

source: The maximum number of threads to use during execution of certain internal processes (currently :ref:`socket.getaddrinfo() <socket-getaddrinfo>` and :ref:`coio_call() <c_api-coio-coio_call>`).
ru: Максимальное количество потоков, используемых во время исполнения определенных внутренних процессов (сейчас :ref:`socket.getaddrinfo() <socket-getaddrinfo>` и :ref:`coio_call() <c_api-coio-coio_call>`).

source: Type: integer
ru: Тип: целое число

source: Default: 4
ru: По умолчанию: 4

source: Configuring the storage
ru: Настройка хранения

source: How much memory Tarantool allocates to actually store tuples, in bytes. When the limit is reached, :ref:`INSERT <box_space-insert>` or :ref:`UPDATE <box_space-insert>` requests begin failing with error :errcode:`ER_MEMORY_ISSUE`. The server does not go beyond the ``memtx_memory`` limit to allocate tuples, but there is additional memory used to store indexes and connection information. Depending on actual configuration and workload, Tarantool can consume up to 20% more than the ``memtx_memory`` limit.
ru: Количество памяти, которое Tarantool выделяет для фактического хранения кортежей, в байтах. При достижении предельного значения запросы вставки :ref:`INSERT <box_space-insert>` или обновления :ref:`UPDATE <box_space-insert>` выполняться не будут, выдавая ошибку :errcode:`ER_MEMORY_ISSUE`. Сервер не выходит за установленный предел памяти ``memtx_memory`` при распределении кортежей, но есть дополнительная память, которая используется для хранения индексов и информации о подключении. В зависимости от рабочей конфигурации и загрузки, Tarantool может потреблять на 20% больше предела ``memtx_memory``.

source: Default: 256 * 1024 * 1024 = 268435456
ru: По умолчанию: 256 * 1024 * 1024 = 268435456

source: Size of the largest allocation unit, in bytes, for the memtx storage engine. It can be increased if it is necessary to store large tuples. See also: :ref:`vinyl_max_tuple_size <cfg_storage-vinyl_max_tuple_size>`.
ru: Размер наибольшего блока выделения памяти в байтах для движка базы данных memtx. Его можно увеличить, если есть необходимость в хранении больших кортежей. См. также :ref:`vinyl_max_tuple_size <cfg_storage-vinyl_max_tuple_size>`.

source: Default: 1024 * 1024 = 1048576
ru: По умолчанию: 1024 * 1024 = 1048576

source: Size of the smallest allocation unit, in bytes. It can be decreased if most of the tuples are very small. The value must be between 8 and 1048280 inclusive.
ru: Размер наименьшего блока выделения памяти в байтах. Его можно уменьшить, если кортежи очень малого размера. Значение должно быть от 8 до 1 048 280 включительно.

source: Default: 16
ru: По умолчанию: 16

source: Bloom filter false positive rate -- the suitable probability of the `bloom filter <https://en.wikipedia.org/wiki/Bloom_filter>`_ to give a wrong result. The ``vinyl_bloom_fpr`` setting is a default value for one of the options in the :ref:`Options for space_object:create_index() <box_space-create_index>` chart.
ru: Доля ложноположительного срабатывания фильтра Блума -- подходящая вероятность того, что `фильтр Блума <https://ru.wikipedia.org/wiki/%D0%A4%D0%B8%D0%BB%D1%8C%D1%82%D1%80_%D0%91%D0%BB%D1%83%D0%BC%D0%B0>`_ выдаст ошибочный результат. Настройка ``vinyl_bloom_fpr`` -- это значение, которое используется по умолчанию для одного из параметров в таблице :ref:`Параметры space_object:create_index() <box_space-create_index>`.

source: Default = 0.05
ru: По умолчанию = 0.05

source: Default = 128 * 1024 * 1024 = 134217728
ru: По умолчанию = 128 * 1024 * 1024 = 134217728

source: Dynamic: **yes**
ru: Динамический: **да**

source: Size of the largest allocation unit, in bytes, for the vinyl storage engine. It can be increased if it is necessary to store large tuples. See also: :ref:`memtx_max_tuple_size <cfg_storage-memtx_max_tuple_size>`.
ru: Размер наибольшего блока выделения памяти в байтах для движка базы данных vinyl. Его можно увеличить, если есть необходимость в хранении больших кортежей. См. также :ref:`memtx_max_tuple_size <cfg_storage-memtx_max_tuple_size>`.

source: The maximum number of in-memory bytes that vinyl uses.
ru: Максимальное количество байтов оперативной памяти, которые использует vinyl.

source: Page size, in bytes. Page is a read/write unit for vinyl disk operations. The ``vinyl_page_size`` setting is a default value for one of the options in the :ref:`Options for space_object:create_index() <box_space-create_index>` chart.
ru: Размер страницы в байтах. Страница представляет собой блок чтения и записи для операций на диске vinyl. Настройка ``vinyl_page_size`` -- это значение, которое используется по умолчанию для одного из параметров в таблице :ref:`Параметры space_object:create_index() `.

source: Default = 8 * 1024 = 8192
ru: По умолчанию = 8 * 1024 = 8192

source: The maximal range size for vinyl, in bytes. The ``vinyl_range_size`` setting is a default value for one of the options in the :ref:`Options for space_object:create_index() <box_space-create_index>` chart.
ru: Максимальный размер диапазона для vinyl'а. Настройка ``vinyl_range_size`` -- это значение, которое используется по умолчанию для одного из параметров в таблице :ref:`Параметры space_object:create_index() `.

source: Default = 1024 * 1024 * 1024 = 1073741824
ru: По умолчанию = 1024 * 1024 * 1024 = 1073741824

source: The maximal number of runs per level in vinyl LSM tree. If this number is exceeded, a new level is created. The ``vinyl_run_count_per_level`` setting is a default value for one of the options in the :ref:`Options for space_object:create_index() <box_space-create_index>` chart.
ru: Максимальное количество забегов на уровень журнально-структурированного дерева со слиянием в vinyl'е. Настройка ``vinyl_run_count_per_level`` -- это значение, которое используется по умолчанию для одного из параметров в таблице :ref:`Параметры space_object:create_index() `.

source: Default = 2
ru: По умолчанию = 2

source: Ratio between the sizes of different levels in the LSM tree. The ``vinyl_run_size_ratio`` setting is a default value for one of the options in the :ref:`Options for space_object:create_index() <box_space-create_index>` chart.
ru: Отношение размеров различных уровней журнально-структурированного дерева со слиянием. Настройка ``vinyl_run_size_ratio`` -- это значение, которое используется по умолчанию для одного из параметров в таблице :ref:`Параметры space_object:create_index() `.

source: Default = 3.5
ru: По умолчанию = 3.5

source: The maximum number of read threads that vinyl can use for some concurrent operations, such as I/O and compression.
ru: Максимальное количество потоков чтения, которые vinyl может использовать в одновременных операциях, такие как ввод-вывод и компрессия.

source: Default = 1
ru: По умолчанию = 1

source: The maximum number of write threads that vinyl can use for some concurrent operations, such as I/O and compression.
ru: Максимальное количество потоков записи, которые vinyl может использовать в одновременных операциях, такие как ввод-вывод и компрессия.

source: Checkpoint daemon
ru: Демон создания контрольных точек

source: The checkpoint daemon is a fiber which is constantly running. At intervals, it may make new :ref:`snapshot (.snap) files <index-box_persistence>` and then may delete old snapshot files.
ru: Демон создания контрольных точек -- это постоянно работающий файбер. Периодически он может создавать :ref:`файлы снимка (.snap) <index-box_persistence>`, а затем может удалять старые файлы снимка.

source: The :ref:`checkpoint_interval <cfg_checkpoint_daemon-checkpoint_interval>` and :ref:`checkpoint_count <cfg_checkpoint_daemon-checkpoint_count>` configuration settings determine how long the intervals are, and how many snapshots should exist before deletions occur.
ru: Настройки конфигурации :ref:`checkpoint_interval <cfg_checkpoint_daemon-checkpoint_interval>` и :ref:`checkpoint_count <cfg_checkpoint_daemon-checkpoint_count>` определяют длительность интервалов и количество снимков, которое должно присутствовать до начала удалений.

source: a **backup** is ongoing and the file has not been backed up (see :ref:`"Hot backup" <admin-backups-hot_backup_vinyl_memtx>`), or
ru: идет **резервное копирование**, и файл еще не был скопирован (см. :ref:`"Резервное копирование" <admin-backups-hot_backup_vinyl_memtx>`), или

source: **replication** is ongoing and the file has not been relayed to a replica (see :ref:`"Replication architecture" <replication-architecture>`),
ru: идет **репликация**, и файл еще не был передан на реплику (см. :ref:`"Архитектуру механизма репликации" <replication-architecture>`),

source: a replica is connecting, or
ru: реплика подключается, или

source: a replica has fallen behind. The progress of each replica is tracked; if a replica's position is far from being up to date, then the server stops to give it a chance to catch up. If an administrator concludes that a replica is permanently down, then the correct procedure is to restart the server, or (preferably) :ref:`remove the replica from the cluster <replication-remove_instances>`.
ru: реплика отстает. Ход выполнения на каждой реплике отслеживается. Если реплика далеко не актуальна, сервер останавливается, чтобы она могла обновиться. Если администратор делает вывод, что реплика окончательно недоступна, необходимо перезагрузить сервер или же (предпочтительно) :ref:`удалить реплику из кластера <replication-remove_instances>`.

source: The interval between actions by the checkpoint daemon, in seconds. If ``checkpoint_interval`` is set to a value greater than zero, and there is activity which causes change to a database, then the checkpoint daemon will call :ref:`box.snapshot <box-snapshot>` every ``checkpoint_interval`` seconds, creating a new snapshot file each time. If ``checkpoint_interval`` is set to zero, then the checkpoint daemon is disabled.
ru: Промежуток времени между действиями демона создания контрольных точек в секундах. Если значение параметра ``checkpoint_interval`` больше нуля, и выполняется изменение базы данных, то демон создания контрольных точек будет вызывать :ref:`box.snapshot <box-snapshot>` каждые ``checkpoint_interval`` секунд, каждый раз создавая новый файл снимка. Если значение параметра ``checkpoint_interval`` равно нулю, то демон создания контрольных точек отключен.

source: will cause the checkpoint daemon to create a new database snapshot once per minute, if there is activity.
ru: приведет к созданию нового снимка базы данных демоном создания контрольных точек каждую минуту, если наблюдается активность в базе данных.

source: Default: 3600 (one hour)
ru: По умолчанию: 3600 (один час)

source: The maximum number of snapshots that may exist on the :ref:`memtx_dir <cfg_basic-memtx_dir>` directory before the checkpoint daemon will delete old snapshots. If ``checkpoint_count`` equals zero, then the checkpoint daemon does not delete old snapshots. For example:
ru: Максимальное количество снимков, которые могут находиться в директории :ref:`memtx_dir <cfg_basic-memtx_dir>` до того, как демон создания контрольных точек будет удалять старые снимки. Если значение ``checkpoint_count`` равно нулю, то демон создания контрольных точек не удаляет старые снимки. Например:

source: will cause the checkpoint daemon to create a new snapshot each hour until it has created ten snapshots. After that, it will delete the oldest snapshot (and any associated write-ahead-log files) after creating a new one.
ru: заставит демон создания контрольных точек создавать снимок каждый час до тех пор, пока не будет создано десять снимков. После этого самый старый снимок (а также любые связанные с ним WAL-файлы) перед созданием нового снимка.

source: Remember that, as noted earlier, snapshots will not be deleted if replication is ongoing and the file has not been relayed to a replica. Therefore ``checkpoint_count`` has no effect unless all replicas are alive.
ru: Следует помнить, что как упоминалось выше, снимки не удаляются, если выполняется репликация, и файл еще не был передан на реплику. Таким образом, параметр ``checkpoint_count`` бесполезен, если какая-то реплика неактивна.

source: Default: 2
ru: По умолчанию: 2

source: Binary logging and snapshots
ru: Записи в бинарный журнал и создание снимков

source: If ``force_recovery`` equals true, Tarantool tries to continue if there is an error while reading a :ref:`snapshot file<index-box_persistence>` (at server instance start) or a :ref:`write-ahead log file<internals-wal>` (at server instance start or when applying an update at a replica): skips invalid records, reads as much data as possible and re-builds the file.
ru: Если значение ``force_recovery`` равно true (правда), Tarantool пытается продолжать работу при обнаружении ошибки во время чтения :ref:`файла снимка <index-box_persistence>` (при запуске экземпляра сервера) или :ref:`файла журнала упреждающей записи <internals-wal>` (при запуске экземпляра сервера или применении обновлений к реплике): пропускает нерабочие записи, считывает максимальное количество данных и пересобирает файл.

source: Otherwise, Tarantool aborts recovery on read errors.
ru: В остальных случаях Tarantool прерывает восстановление на ошибке чтения.

source: Default: true
ru: По умолчанию: true

source: How many log records to store in a single write-ahead log file. When this limit is reached, Tarantool creates another WAL file named :samp:`{<first-lsn-in-wal>}.xlog`. This can be useful for simple rsync-based backups.
ru: Количество записей журнала, которое хранится в отдельном WAL-файле. При достижении предельного значения Tarantool создает другой WAL-файл под названием :samp:`{<первый-lsn-в-журнале>}.xlog`. Эту функцию можно использовать для простого резервного копирования на основе rsync.

source: Default: 500000
ru: По умолчанию: 500000

source: Reduce the throttling effect of :ref:`box.snapshot <box-snapshot>` on INSERT/UPDATE/DELETE performance by setting a limit on how many megabytes per second it can write to disk. The same can be achieved by splitting :ref:`wal_dir <cfg_basic-wal_dir>` and :ref:`memtx_dir <cfg_basic-memtx_dir>` locations and moving snapshots to a separate disk.
ru: Уменьшение загрузки :ref:`box.snapshot <box-snapshot>` при выполнении операций вставки, обновления и удаления (INSERT/UPDATE/DELETE) путем установки предела скорости записи на диск -- количества мегабайт в секунду. Того же эффекта можно достичь, разделив директории :ref:`wal_dir <cfg_basic-wal_dir>` и :ref:`memtx_dir <cfg_basic-memtx_dir>` и перенося снимки на отдельный диск.

source: Specify fiber-WAL-disk synchronization mode as:
ru: Определение синхронизации работы файбера с журналом упреждающей записи:

source: ``none``: write-ahead log is not maintained;
ru: ``none``: журнал упреждающей записи не поддерживается;

source: ``write``: :ref:`fibers <fiber-fibers>` wait for their data to be written to the write-ahead log (no :manpage:`fsync(2)`);
ru: ``write``: :ref:`файберы <fiber-fibers>` ожидают записи данных в журнал упреждающей записи (не :manpage:`fsync(2)`);

source: ``fsync``: fibers wait for their data, :manpage:`fsync(2)` follows each :manpage:`write(2)`;
ru: ``fsync``: файберы ожидают данные, синхронизация :manpage:`fsync(2)` следует за каждой операцией записи :manpage:`write(2)`;

source: Default: "write"
ru: По умолчанию: "write"

source: Number of seconds between periodic scans of the write-ahead-log file directory, when checking for changes to write-ahead-log files for the sake of :ref:`replication <replication>` or :ref:`hot standby <index-hot_standby>`.
ru: Количество секунд между периодическим сканирование директории WAL-файла при проверке изменений в WAL-файле для целей :ref:`репликации <replication>` или :ref:`горячего резервирования <index-hot_standby>`.

source: Hot standby
ru: Горячее резервирование

source: Whether to start the server in **hot standby** mode.
ru: Запуск сервера в режиме **горячего резервирования**.

source: Hot standby is a feature which provides a simple form of failover without :ref:`replication <replication>`.
ru: Горячее резервирование -- это функция, которая обеспечивает простое восстановление после отказа без :ref:`репликации <replication>`.

source: The expectation is that there will be two instances of the server using the same configuration. The first one to start will be the "primary" instance. The second one to start will be the "standby" instance.
ru: Предполагается, что есть два экземпляра сервера, использующих одну и ту же конфигурацию. Первый из них станет "основным" экземпляром. Тот, который запускается вторым, станет "резервным" экземпляром.

source: To initiate the standby instance, start a second instance of the Tarantool server on the same computer with the same :ref:`box.cfg <box_introspection-box_cfg>` configuration settings -- including the same directories and same non-null URIs -- and with the additional configuration setting ``hot_standby = true``. Expect to see a notification ending with the words ``I> Entering hot standby mode``. This is fine. It means that the standby instance is ready to take over if the primary instance goes down.
ru: Чтобы создать резервный экземпляр, запустите второй экземпляр Tarantool-сервера на том же компьютере с теми же настройками конфигурации :ref:`box.cfg <box_introspection-box_cfg>` -- включая одинаковые директории и ненулевые URI -- и с дополнительной настройкой конфигурации ``hot_standby = true``. В ближайшее время вы увидите уведомление, которое заканчивается словами ``I> Entering hot standby mode`` (вход в режим горячего резервирования). Всё в порядке -- это означает, что резервный экземпляр готов взять работу на себя, если основной экземпляр прекратит работу.

source: The standby instance will initialize and will try to take a lock on :ref:`wal_dir <cfg_basic-wal_dir>`, but will fail because the primary instance has made a lock on ``wal_dir``. So the standby instance goes into a loop, reading the write ahead log which the primary instance is writing (so the two instances are always in sync), and trying to take the lock. If the primary instance goes down for any reason, the lock will be released. In this case, the standby instance will succeed in taking the lock, will connect on the :ref:`listen <cfg_basic-listen>` address and will become the primary instance. Expect to see a notification ending with the words ``I> ready to accept requests``.
ru: Резервный экземпляр начнет инициализацию и попытается заблокировать :ref:`wal_dir <cfg_basic-wal_dir>`, но не сможет, поскольку директория ``wal_dir`` заблокирована основным экземпляром. Поэтому резервный экземпляр входит в цикл, выполняя чтение журнала упреждающей записи, в который записывает данные основной экземпляр (поэтому два экземпляра всегда синхронизированы), и пытаясь произвести блокировку. Если основной экземпляр по какой-либо причине прекращает работу, блокировка снимается. В таком случае резервный экземпляр сможет заблокировать директорию на себя, подключится по адресу для :ref:`прослушивания <cfg_basic-listen>` и станет основным экземпляром. В ближайшее время вы увидите уведомление, которое заканчивается словами ``I> ready to accept requests`` (готов принимать запросы).

source: Thus there is no noticeable downtime if the primary instance goes down.
ru: Таким образом, если основной экземпляр прекращает работу, время простоя отсутствует.

source: Hot standby feature has no effect:
ru: Функция горячего резервирования не работает:

source: if :ref:`wal_dir_rescan_delay = a large number <cfg_binary_logging_snapshots-wal_dir_rescan_delay>` (on Mac OS and FreeBSD); on these platforms, it is designed so that the loop repeats every ``wal_dir_rescan_delay`` seconds.
ru: если :ref:`wal_dir_rescan_delay = большое число <cfg_binary_logging_snapshots-wal_dir_rescan_delay>` (в Mac OS и FreeBSD); на этих платформах цикл запрограммирован на повторение каждые ``wal_dir_rescan_delay`` секунд.

source: if :ref:`wal_mode = 'none' <cfg_binary_logging_snapshots-wal_mode>`; it is designed to work with ``wal_mode = 'write'`` or ``wal_mode = 'fsync'``.
ru: если :ref:`wal_mode = 'none' <cfg_binary_logging_snapshots-wal_mode>`; будет работать только при ``wal_mode = 'write'`` или ``wal_mode = 'fsync'``.
