Repository: tarantool/doc
Catalog: locale/*/LC_MESSAGES/doc.po
Languages: ru

source: Tarantool's creator and biggest user is `Mail.Ru`_, the largest internet company in Russia, with 30 million users, 25 million emails per day, and a web site whose Alexa global rank is in the `top 40`_ worldwide. Tarantool services Mail.Ru's hottest data, such as the session data of online users, the properties of online applications, the caches of the underlying data, the distribution and sharding algorithms, and much more. Outside Mail.Ru the software is used by a growing number of projects in online gaming, digital marketing, and social media industries. Although Mail.Ru is the sponsor for product development, the roadmap and the bugs database and the development process are fully open. The software incorporates patches from dozens of community contributors. The Tarantool community writes and maintains most of the drivers for programming languages. The greater Lua community has hundreds of useful packages most of which can become Tarantool extensions.
ru: Создателем Tarantool'а -- а также его основным пользователем -- является компания `Mail.Ru`_, крупнейшая Интернет-компания России (30 млн пользователей, 25 млн электронных писем в день, веб-сайт в списке `top 40`_ международного Alexa-рейтинга). Tarantool используется для обработки самых "горячих" данных Mail.Ru, таких как данные пользовательских онлайн-сессий, настройки онлайн-приложений, кэширование сервисных данных, алгоритмы распределения данных и шардинга, и т.д. Tarantool также используется во всё большем количестве проектов вне стен Mail.Ru. Это, к примеру, онлайн-игры, цифровой маркетинг, социальные сети. Несмотря на то что Mail.Ru спонсирует разработку Tarantool'а, весь процесс разработки, в т.ч. дальнейшие планы и база обнаруженных ошибок, является полностью открытым. В Tarantool включены патчи от большого числа сторонних разработчиков. Усилиями сообщества разработчиков Tarantool'а были написаны (и далее поддерживаются) библиотеки для подключения модулей на внешних языках программирования. А сообщество Lua-разработчиков предоставило сотни полезных пакетов, большинство из которых можно использовать в качестве расширений для Tarantool'а.

source: Users can create, modify and drop **Lua functions** at runtime. Or they can define **Lua programs** that are loaded during startup for triggers, background tasks, and interacting with networked peers. Unlike popular application development frameworks based on a "reactor" pattern, networking in server-side Lua is sequential, yet very efficient, as it is built on top of the **cooperative multitasking** environment that Tarantool itself uses.
ru: Пользователи Tarantool'а могут создавать, изменять и удалять **Lua-функции** прямо во время исполнения кода. Также они могут указывать **Lua-программы**, которые будут загружаться во время запуска Tarantool'а. Такие программы могут служить триггерами, выполнять фоновые задачи и взаимодействовать с другими узлами по сети. В отличие от многих популярных сред разработки приложений, которые используют "реактивный" принцип, сетевое взаимодействие в Lua устроено последовательно, но очень эффективно, т.к. оно использует среду **кооперативной многозадачности** самого Tarantool'а.

source: One of the built-in Lua packages provides an API for the Database Management System. Thus some developers see Tarantool as a DBMS with a popular stored procedure language, while others see it as a Lua interpreter, while still others see it as a replacement for many components of multi-tier Web applications. Performance can be a few hundred thousand transactions per second on a laptop, scalable upwards or outwards to server farms.
ru: Один из встраиваемых Lua-пакетов -- это API для функций СУБД. Таким образом, некоторые разработчики рассматривают Tarantool как СУБД с популярным языком для написания хранимых процедур, другие рассматривают его как Lua-интерпретатор, а третьи -- как вариант замены сразу нескольких компонентов в многозвенных веб-приложениях. Производительность Tarantool'а может достигать сотен тысяч транзакций в секунду на ноутбуке, и ее можно наращивать "вверх" или "вширь" за счет новых серверных ферм.

source: Database features
ru: Возможности СУБД

source: Tarantool can run without it, but "The Box" -- the DBMS server -- is a strong distinguishing feature.
ru: Компонент "box" -- серверная часть с функциями СУБД -- это важная часть Tarantool'а, хотя он может работать и без данного компонента.

source: The database API allows for permanently storing Lua objects, managing object collections, creating or dropping secondary keys, making changes atomically, configuring and monitoring replication, performing controlled fail-over, and executing Lua code triggered by database events. Remote database instances are accessible transparently via a remote-procedure-invocation API.
ru: API для функций СУБД позволяет хранить Lua-объекты, управлять коллекциями объектов, создавать и удалять вторичные ключи, делать атомарные изменения, конфигурировать и мониторить репликацию, производить контролируемое переключение при отказе (failover), а также исполнять код на Lua, который вызывается событиями в базе. А для прозрачного доступа к удаленным (remote) экземплярам баз данных разработан API для вызова удаленных процедур.

source: Tarantool's DBMS server uses the **storage engine** concept, where different sets of algorithms and data structures can be used for different situations. Two storage engines are built-in: an in-memory engine which has all the data and indexes in RAM, and a two-level B-tree engine for data sets whose size is 10 to 1000 times the amount of available RAM. All storage engines in Tarantool support transactions and replication by using a common **write ahead log** (WAL). This ensures consistency and crash safety of the persistent state. Changes are not considered complete until the WAL is written. The logging subsystem supports group commit.
ru: В архитектуре серверной части СУБД Tarantool'а реализована концепция "движков" базы данных (storage engines), где в разных ситуациях используются разные наборы алгоритмов и структуры данных. В Tarantool'е есть два встроенных движка: in-memory движок, который держит все данные и индексы в оперативной памяти, и двухуровневый движок для B-деревьев, который обрабатывает данные размером в 10-1000 раз больше того, что может поместиться в оперативной памяти. Все движки в Tarantool'е поддерживают транзакции и репликацию, поскольку они используют единый механизм **упреждающей записи** (WAL = write ahead log). Это механизм обеспечивает согласованность и сохранность данных при сбоях. Таким образом, изменения не считаются завершенными, пока не проходит запись в лог WAL. Подсистема записи в журнал также поддерживает групповые коммиты.

source: **Tarantool's in-memory storage engine** (memtx) keeps all the data in random-access memory, and therefore has very low read latency. It also keeps persistent copies of the data in non-volatile storage, such as disk, when users request "snapshots". If an instance of the server stops and the random-access memory is lost, then restarts, it reads the latest snapshot and then replays the transactions that are in the log -- therefore no data is lost.
ru: **In-memory движок базы данных Tarantool'а** (memtx) хранит все данные в оперативной памяти, поэтому у него низкое значение задержки чтения. Кроме того, когда пользователи запрашивают снимки данных (snapshots), этот движок создает персистентные копии данных в энергонезависимой памяти, например на диске. Если экземпляр сервера прекращает работать и данные в оперативной памяти теряются, то при следующем запуске сервер загрузит в память самый свежий снимок и воспроизведет все транзакции из журнала. Таким образом, данные не теряются.

source: **Tarantool's in-memory engine is lock-free** in typical situations. Instead of the operating system's concurrency primitives, such as mutexes, Tarantool uses cooperative multitasking to handle thousands of connections simultaneously. There is a fixed number of independent execution threads. The threads do not share state. Instead they exchange data using low-overhead message queues. While this approach limits the number of cores that the instance will use, it removes competition for the memory bus and ensures peak scalability of memory access and network throughput. CPU utilization of a typical highly-loaded Tarantool instance is under 10%. Searches are possible via **secondary index keys** as well as primary keys.
ru: В штатных ситуациях **in-memory движок работает без блокировок**. Вместо многопоточных примитивов, которые предлагает операционная система (таких как mutex'ы), Tarantool использует кооперативную многозадачность для работы с тысячами соединений одновременно. В Tarantool'е есть фиксированное количество независимых потоков управления (thread), и у них нет общего состояния. Для обмена данными между потоками используются очереди сообщений с малой перегрузкой. Хотя такой подход накладывает ограничение на количество процессорных ядер, которые может использовать экземпляр, в то же время он позволяет избежать борьбы за шину памяти, а также дает запас масштабируемости по скорости доступа к памяти и производительности сети. В результате даже при большой нагрузке экземпляр Tarantool'а в среднем использует процессор менее чем на 10%. Кроме того, Tarantool поддерживает поиск как по первичным, так и по **внешним ключам в индексах**.

source: **Tarantool's disk-based storage engine** is a fusion of ideas from modern filesystems, log-structured merge trees and classical B-trees. All data is organized into **ranges**. Each range is represented by a file on disk. Range size is a configuration option and normally is around 64MB. Each range is a collection of pages, serving different purposes. Pages in a fully merged range contain non-overlapping ranges of keys. A range can be partially merged if there were a lot of changes in its key range recently. In that case some pages represent new keys and values in the range. The disk-based storage engine is append only: new data never overwrites old data. The disk-based storage engine is named *vinyl*.
ru: **Дисковый движок базы данных Tarantool'а** совмещает в себе подходы, заимствованные из современных файловых систем, журнально-структурированных деревьев со слиянием (log-structured merge trees) и классических B-деревьев. Все данные разбиты на **диапазоны**. Каждый диапазон представлен файлом на диске. Размер диапазона можно изменять, обычно он равен 64МБ. Каждый диапазон -- это набор страниц, которые служат разным целям. После полного слияния диапазона ключи на его страницах не пересекаются. Если диапазоны ключей недавно сильно изменялись, можно провести частичное слияние диапазона. В этом случае на некоторых страницах появились новые ключи и значения. Дисковый движок обновляет данные по принципу дописывания в конец: новые данные никогда не затирают старые. Дисковый движок базы данных называется *vinyl*.

source: Tarantool supports **multi-part index keys**. The possible index types are HASH, TREE, BITSET, and RTREE.
ru: Tarantool поддерживает работу с **составными ключами в индексах**. Возможные типы ключей: HASH, TREE, BITSET и RTREE.

source: Tarantool supports **asynchronous replication**, locally or to remote hosts. The replication architecture can be **master-master**, that is, many nodes may both handle the loads and receive what others have handled, for the same data sets.
ru: Tarantool также поддерживает **асинхронную репликацию** -- как локальную, так и на удаленных серверах. При этом репликацию можно настроить по принципу **мастер-мастер**, когда несколько узлов могут не только обрабатывать входящую нагрузку, но и получать данные от других узлов.

source: Configuration reference
ru: Справочник по настройке

source: This reference covers all options and parameters which can be set for Tarantool on the command line or in an :ref:`initialization file <index-init_label>`.
ru: В данном справочнике рассматриваются все опции и параметры, которые можно использовать в командной строке или в :ref:`файле инициализации <index-init_label>`.

source: Tarantool is started by entering either of the following command:
ru: Tarantool можно запустить путем ввода одной из следующих команд:

source: Command options
ru: Опции командной строки

source: Print an annotated list of all available options and exit.
ru: Вывод аннотированного списка всех доступных опций и выход.

source: Print product name and version, for example:
ru: Вывод названия и версии продукта, например:

source: In this example:
ru: В данном примере:

source: “Tarantool” is the name of the reusable asynchronous networking programming framework.
ru: “Tarantool” -- это название асинхронной сетевой интегрированной среды программирования многократного использования.

source: The 3-number version follows the standard ``<major>-<minor>-<patch>`` scheme, in which ``<major>`` number is changed only rarely, ``<minor>`` is incremented for each new milestone and indicates possible incompatible changes, and ``<patch>`` stands for the number of bug fix releases made after the start of the milestone. For non-released versions only, there may be a commit number and commit SHA1 to indicate how much this particular build has diverged from the last release.
ru: Версия из 3 чисел создается по стандартной схеме ``<мажорная>-<минорная>-<патч-версия>``, где ``<мажорная>`` версия изменяется редко, ``<минорная>`` последовательно увеличивается с каждым новым выпущенным стабильным релизом и указывает на возможные несовместимые изменения, а ``<патч-версия>`` означает количество версий с исправленными ошибками с момента выхода стабильного релиза. Еще не вышедшие версии могут также содержать номер коммита и коммит SHA1, чтобы показать, насколько данная сборка отходит от последнего релиза.

source: “Target” is the platform tarantool was built on. Some platform-specific details may follow this line.
ru: “Target” -- это платформа, на которой собран Tarantool. Некоторые платформенно-зависимые детали могут следовать за этой строкой.

source: Tarantool uses `git describe <http://www.kernel.org/pub/software/scm/git/docs/git-describe.html>`_ to produce its version id, and this id can be used at any time to check out the corresponding source from our `git repository <http://github.com/tarantool/tarantool.git>`_.
ru: При выставлении номера версии Tarantool'а применяется `git describe <http://www.kernel.org/pub/software/scm/git/docs/git-describe.html>`_, и этот номер версии можно в любое время использовать для проверки соответствующего исходного кода в `репозитории git <http://github.com/tarantool/tarantool.git>`_.

source: URI
ru: Унифицированный идентификатор ресурса (URI)

source: Some configuration parameters and some functions depend on a URI, or "Universal Resource Identifier". The URI string format is similar to the `generic syntax for a URI schema <http://en.wikipedia.org/wiki/URI_scheme#Generic_syntax>`_. So it may contain (in order) a user name for login, a password, a host name or host IP address, and a port number. Only the port number is always mandatory. The password is mandatory if the user name is specified, unless the user name is 'guest'. So, formally, the URI syntax is ``[host:]port`` or ``[username:password@]host:port``. If host is omitted, then '0.0.0.0' or '[::]' is assumed, meaning respectively any IPv4 address or any IPv6 address, on the local machine. If username:password is omitted, then 'guest' is assumed. Some examples:
ru: Некоторые конфигурационные параметры и некоторые функции зависимы от URI (унифицированного идентификатора ресурса). Формат URI-строки похож на `общий синтаксис URI-схемы <http://en.wikipedia.org/wiki/URI_scheme#Generic_syntax>`_. Таким образом, он может содержать (по порядку) имя пользователя для входа в систему, пароль, имя хоста или IP-адрес хоста и номер порта. Только номер порта является обязательным параметром. Обязательно следует указать пароль, если указано имя пользователя за исключением случаев, когда пользователем будет 'guest'. Формально URI-синтаксис представляет собой ``[хост:]порт`` или ``[имя-пользователя:пароль@]хост:порт``. Если хост не указан, то предполагается хост '0.0.0.0' или '[::]', что означает любой IPv4-адрес или IPv6-адрес на локальной машине соответственно. Если не указать имя-пользователя:пароль, предполагается, что пользователем будет 'guest'. Некоторые примеры:

source: URI fragment
ru: Фрагмент URI

source: port
ru: порт

source: host:port
ru: хост:порт

source: username:password@host:port
ru: имя-пользователя:пароль@хост:порт

source: In certain circumstances a Unix domain socket may be used where a URI is expected, for example "unix/:/tmp/unix_domain_socket.sock" or simply "/tmp/unix_domain_socket.sock".
ru: В определенных обстоятельствах можно использовать доменный сокет Unix, когда ожидается URI, например, "unix/:/tmp/unix_domain_socket.sock" или просто "/tmp/unix_domain_socket.sock".

source: A method for parsing URIs is illustrated in :ref:`Module uri <uri-parse>`.
ru: Метод разбора URI проиллюстрирован в :ref:`Module uri <uri-parse>`.

source: Initialization file
ru: Файл инициализации

source: If the command to start Tarantool includes :codeitalic:`lua-initialization-file`, then Tarantool begins by invoking the Lua program in the file, which by convention may have the name "``script.lua``". The Lua program may get further arguments from the command line or may use operating-system functions, such as ``getenv()``. The Lua program almost always begins by invoking ``box.cfg()``, if the database server will be used or if ports need to be opened. For example, suppose ``script.lua`` contains the lines
ru: Если команда запуска Tarantool'а включает в себя :codeitalic:`файл-инициализации-Lua`, то Tarantool запустится посредством вызова Lua-программы в файле, который обычно называется "``script.lua``". В Lua-программу можно добавить дополнительные аргументы из командной строки или функции операционной системы, такие как ``getenv()``. Lua-программа практически всегда запускается посредством вызова ``box.cfg()``, если будет использоваться сервер базы данных или же необходимо открыть порты. Например, предположим, что файл ``script.lua`` содержит строки

source: and suppose the environment variable LISTEN_URI contains 3301, and suppose the command line is ``~/tarantool/src/tarantool script.lua ARG``. Then the screen might look like this:
ru: и предположим, что переменная окружения LISTEN_URI содержит значение 3301, а также предположим, что в командной строке ``~/tarantool/src/tarantool script.lua ARG``. Тогда вывод на экране может выглядеть следующим образом:

source: If you wish to start an interactive session on the same terminal after initialization is complete, you can use :ref:`console.start() <console-start>`.
ru: Если необходимо начать интерактивную сессию на том же терминале по окончании инициализации, можно использовать :ref:`console.start() <console-start>`.

source: Configuration parameters
ru: Конфигурационные параметры

source: Configuration parameters have the form:
ru: Конфигурационные параметры выглядят так:

source: :extsamp:`{**{box.cfg}**}{[{*{key = value}*} [, {*{key = value ...}*}]]}`
ru: :extsamp:`{**{box.cfg}**}{[{*{ключ = значение}*} [, {*{ключ = значение ...}*}]]}`

source: Since ``box.cfg`` may contain many configuration parameters and since some of the parameters (such as directory addresses) are semi-permanent, it's best to keep ``box.cfg`` in a Lua file. Typically this Lua file is the initialization file which is specified on the tarantool command line.
ru: Поскольку в ``box.cfg`` может быть множество конфигурационных параметров, а некоторые параметры (такие как адреса директорий) являются полупостоянными, лучше всего хранить ``box.cfg`` в Lua-файле. Как правило, такой Lua-файл представляет собой файл инициализации, который указан в командной строке Tarantool'а.

source: Most configuration parameters are for allocating resources, opening ports, and specifying database behavior. All parameters are optional. A few parameters are dynamic, that is, they can be changed at runtime by calling ``box.cfg{}`` a second time.
ru: Большинство конфигурационных параметров предназначены для распределения ресурсов, открытия портом и указания поведения базы данных. Все параметры необязательны. Некоторые параметры динамичны, то есть могут изменяться во время исполнения кода посредством повторного вызова ``box.cfg{}``.

source: To see all the non-null parameters, say ``box.cfg`` (no parentheses). To see a particular parameter, for example the listen address, say ``box.cfg.listen``.
ru: Чтобы увидеть все ненулевые параметры, выполните ``box.cfg`` (без круглых скобок). Чтобы увидеть определенный параметр, например, адрес для прослушивания, выполните команду ``box.cfg.listen``.

source: Basic parameters
ru: Базовые параметры

source: Run the server as a background task. The :ref:`log <cfg_logging-log>` and :ref:`pid_file <cfg_basic-pid_file>` parameters must be non-null for this to work.
ru: Запуск сервера в виде фоновой задачи. Параметры :ref:`log <cfg_logging-log>` и :ref:`pid_file <cfg_basic-pid_file>` должны быть не равны нулю, что это сработало.

source: Type: boolean
ru: Тип: логический

source: Default: false
ru: По умолчанию: false (ложь)

source: Dynamic: no
ru: Динамический: нет

source: Add the given string to the server's process title (what’s shown in the COMMAND column for ``ps -ef`` and ``top -c`` commands).
ru: Добавление заданной строки к названию процесса сервера (что показано в столбце COMMAND для команд ``ps -ef`` и ``top -c``.

source: For example, ordinarily :samp:`ps -ef` shows the Tarantool server process thus:
ru: Например, как правило, :samp:`ps -ef` показывает процесс Tarantool-сервера так:

source: But if the configuration parameters include ``custom_proc_title='sessions'`` then the output looks like:
ru: Но если указан конфигурационный параметр ``custom_proc_title='sessions'``, вывод выглядит так:

source: Type: string
ru: Тип: строка

source: Default: null
ru: По умолчанию: null

source: Dynamic: yes
ru: Динамический: да

source: The read/write data port number or :ref:`URI <index-uri>` (Universal Resource Identifier) string. Has no default value, so **must be specified** if connections will occur from remote clients that do not use the :ref:`“admin port” <admin-security>`. Connections made with :samp:`listen = {URI}` are called "binary port" or "binary protocol" connections.
ru: Номер порта для чтения/записи данных или строка :ref:`URI <index-uri>` (унифицированный идентификатор ресурса). Значение, используемое по умолчанию, отсутствует, поэтому его **обязательно указать**, если подключение выполняется с удаленных клиентов, которые не используют :ref:`“порт администрирования” <admin-security>`. Подключения, выполняемые с помощью :samp:`listen = {URI}`, называются соединения по бинарному порту или бинарному протоколу.

source: A typical value is 3301.
ru: Как правило, используется значение 3301.

source: A replica also binds to this port, and accepts connections, but these connections can only serve reads until the replica becomes a master.
ru: Реплика также привязана на этот порт и принимает соединения, но эти соединения служат только для чтения до тех пор, пока реплика не станет мастером.

source: Type: integer or string
ru: Тип: целое число или строка

source: A directory where memtx stores snapshot (.snap) files. Can be relative to :ref:`work_dir <cfg_basic-work_dir>`. If not specified, defaults to ``work_dir``. See also :ref:`wal_dir <cfg_basic-wal_dir>`.
ru: Директория, где memtx хранит файлы снимков (.snap). Может относиться к :ref:`work_dir <cfg_basic-work_dir>`. Если не указан, по умолчанию ``work_dir``. См. также :ref:`wal_dir <cfg_basic-wal_dir>`.

source: Default: "."
ru: По умолчанию: "."
