Repository: tarantool/doc
Catalog: locale/*/LC_MESSAGES/doc.po
Languages: ru

source: * Insert OP = '!' insert <argument> before <field_no> * Assign OP = '=' assign <argument> to field <field_no>. will extend the tuple if <field_no> == <max_field_no> + 1 0 2 +-----------+==========+===========+ | | | | | OP | FIELD_NO | ARGUMENT | | MP_FIXSTR | MP_INT | MP_OBJECT | | | | | +-----------+==========+===========+ MP_ARRAY Works on string fields: * Splice OP = ':' take the string from space[key][field_no] and substitute <offset> bytes from <position> with <argument>
ru: * Вставка OP = '!' вставить <argument> до поля <field_no> * Присвоение OP = '=' присвоить <argument> полю <field_no>. увеличит кортеж, если <field_no> == <max_field_no> + 1 0 2 +-----------+==========+===========+ | | | | | OP | FIELD_NO | ARGUMENT | | MP_FIXSTR | MP_INT | MP_OBJECT | | | | | +-----------+==========+===========+ MP_ARRAY Работает со строковыми полями: * Разделение OP = ':' взять строку из space[key][field_no] и заменить <offset> байтов из положения <position> на <argument>

source: It is an error to specify an argument of a type that differs from the expected type.
ru: Указать аргумент типа, который отличается от ожидаемого типа, будет ошибкой.

source: DELETE: CODE - 0x05 Delete a tuple
ru: DELETE: CODE - 0x05 Удаление кортежа

source: DELETE BODY: +==================+==================+==================+ | | | | | 0x10: SPACE_ID | 0x11: INDEX_ID | 0x20: KEY | | MP_INT: MP_INT | MP_INT: MP_INT | MP_INT: MP_ARRAY | | | | | +==================+==================+==================+ MP_MAP
ru: ТЕЛО СООБЩЕНИЯ УДАЛЕНИЯ DELETE: +==================+==================+==================+ | | | | | 0x10: SPACE_ID | 0x11: INDEX_ID | 0x20: KEY | | MP_INT: MP_INT | MP_INT: MP_INT | MP_INT: MP_ARRAY | | | | | +==================+==================+==================+ MP_MAP

source: CALL_16: CODE - 0x06 Call a stored function, returning an array of tuples. This is deprecated; CALL (0x0a) is recommended instead.
ru: CALL_16: CODE - 0x06 Вызов хранимой функции с возвратом массива кортежей. Объявлен устаревшим; рекомендуется использовать CALL (0x0a).

source: CALL_16 BODY: +=======================+==================+ | | | | 0x22: FUNCTION_NAME | 0x21: TUPLE | | MP_INT: MP_STRING | MP_INT: MP_ARRAY | | | | +=======================+==================+ MP_MAP
ru: ТЕЛО СООБЩЕНИЯ CALL_16: +=======================+==================+ | | | | 0x22: FUNCTION_NAME | 0x21: TUPLE | | MP_INT: MP_STRING | MP_INT: MP_ARRAY | | | | +=======================+==================+ MP_MAP

source: EVAL: CODE - 0x08 Evaulate Lua expression
ru: EVAL: CODE - 0x08 Оценка Lua-выражения

source: EVAL BODY: +=======================+==================+ | | | | 0x27: EXPRESSION | 0x21: TUPLE | | MP_INT: MP_STRING | MP_INT: MP_ARRAY | | | | +=======================+==================+ MP_MAP
ru: ТЕЛО СООБЩЕНИЯ EVAL: +=======================+==================+ | | | | 0x27: EXPRESSION | 0x21: TUPLE | | MP_INT: MP_STRING | MP_INT: MP_ARRAY | | | | +=======================+==================+ MP_MAP

source: UPSERT: CODE - 0x09 Update tuple if it would be found elsewhere try to insert tuple. Always use primary index for key.
ru: UPSERT: CODE - 0x09 Обновление кортежа, если он уже существует, попытка вставить кортеж. Всегда используйте первичный индекс.

source: UPSERT BODY: +==================+==================+==========================+ | | | +~~~~~~~~~~+ | | | | | | | | 0x10: SPACE_ID | 0x21: TUPLE | (OPS) | OP | | | MP_INT: MP_INT | MP_INT: MP_ARRAY | 0x28: | | | | | | MP_INT: +~~~~~~~~~~+ | | | | MP_ARRAY | +==================+==================+==========================+ MP_MAP Operations structure same as for UPDATE operation. 0 2 +-----------+==========+==========+ | | | | | OP | FIELD_NO | ARGUMENT | | MP_FIXSTR | MP_INT | MP_INT | | | | | +-----------+==========+==========+ MP_ARRAY Supported operations: '+' - add a value to a numeric field. If the filed is not numeric, it's changed to 0 first. If the field does not exist, the operation is skipped. There is no error in case of overflow either, the value simply wraps around in C style. The range of the integer is MsgPack: from -2^63 to 2^64-1 '-' - same as the previous, but subtract a value '=' - assign a field to a value. The field must exist, if it does not exist, the operation is skipped. '!' - insert a field. It's only possible to insert a field if this create no nil "gaps" between fields. E.g. it's possible to add a field between existing fields or as the last field of the tuple. '#' - delete a field. If the field does not exist, the operation is skipped. It's not possible to change with update operations a part of the primary key (this is validated before performing upsert).
ru: ТЕЛО СООБЩЕНИЯ ОБНОВЛЕНИЯ И ВСТАВКИ UPSERT: +==================+==================+==========================+ | | | +~~~~~~~~~~+ | | | | | | | | 0x10: SPACE_ID | 0x21: TUPLE | (OPS) | OP | | | MP_INT: MP_INT | MP_INT: MP_ARRAY | 0x28: | | | | | | MP_INT: +~~~~~~~~~~+ | | | | MP_ARRAY | +==================+==================+==========================+ MP_MAP Структура операции аналогична структуре операции обновления UPDATE. 0 2 +-----------+==========+==========+ | | | | | OP | FIELD_NO | ARGUMENT | | MP_FIXSTR | MP_INT | MP_INT | | | | | +-----------+==========+==========+ MP_ARRAY Поддерживаются следующие операции: '+' - прибавление значения к числовому полю. Если поле не является числовым, оно сначала изменяется на 0. Если поле отсутствует, операция пропускается. В случае переполнения ошибки также не будет, значение просто переносится в стиле языка C. Диапазон целых чисел в формате MsgPack: от -2^63 до 2^64-1 '-' - как в предыдущей операции, но значение вычитается '=' - присвоение значения полю. Если поле отсутствует, операция пропускается. '!' - вставка поля. Можно вставить поле, если при этом не будут созданы промежутки с нулевым значением nil между полями. Например, можно добавить поле между существующими полями или последнее поле в кортеже. '#' - удаление поля. Если поле отсутствует, операция пропускается. Нельзя с помощью операции обновления update изменить компонент первичного ключа (это проверяется перед выполнением операции upsert).

source: CALL: CODE - 0x0a Similar to CALL_16, but -- like EVAL, CALL returns a list of values, unconverted
ru: CALL: CODE - 0x0a Аналог CALL_16, но как и операция EVAL, CALL возвращает список неконвертированных значений

source: CALL BODY: +=======================+==================+ | | | | 0x22: FUNCTION_NAME | 0x21: TUPLE | | MP_INT: MP_STRING | MP_INT: MP_ARRAY | | | | +=======================+==================+ MP_MAP
ru: ТЕЛО СООБЩЕНИЯ CALL: +=======================+==================+ | | | | 0x22: FUNCTION_NAME | 0x21: TUPLE | | MP_INT: MP_STRING | MP_INT: MP_ARRAY | | | | +=======================+==================+ MP_MAP

source: Response packet structure
ru: Структура пакета ответа

source: We will show whole packets here:
ru: Здесь мы продемонстрируем пакеты полностью:

source: Set of tuples in the response :code:`<data>` expects a msgpack array of tuples as value EVAL command returns arbitrary `MP_ARRAY` with arbitrary MsgPack values.
ru: Предполагается, что набор кортежей в ответе :code:`<data>` будет представлять собой msgpack-массив кортежей, поскольку команда EVAL возвращается произвольный MsgPack-массив `MP_ARRAY` с произвольными MsgPack-значениями.

source: ERROR: LEN + HEADER + BODY 0 5 +------++================+================++===================+ | || | || | | BODY || 0x00: 0x8XXX | 0x01: SYNC || 0x31: ERROR | |HEADER|| MP_INT: MP_INT | MP_INT: MP_INT || MP_INT: MP_STRING | | SIZE || | || | +------++================+================++===================+ MP_INT MP_MAP MP_MAP Where 0xXXX is ERRCODE.
ru: ОШИБКА: LEN + HEADER + BODY 0 5 +------++================+================++===================+ | || | || | | BODY || 0x00: 0x8XXX | 0x01: SYNC || 0x31: ERROR | |HEADER|| MP_INT: MP_INT | MP_INT: MP_INT || MP_INT: MP_STRING | | SIZE || | || | +------++================+================++===================+ MP_INT MP_MAP MP_MAP Где 0xXXX -- это код ошибки ERRCODE.

source: An error message is present in the response only if there is an error; :code:`<error>` expects as value a msgpack string.
ru: Сообщение об ошибке будет включено в ответ только в случае ошибки; предполагается, что значение :code:`<error>` будет msgpack-строкой.

source: Replication packet structure
ru: Структура пакета при репликации

source: -- replication keys <server_id> ::= 0x02 <lsn> ::= 0x03 <timestamp> ::= 0x04 <server_uuid> ::= 0x24 <cluster_uuid> ::= 0x25 <vclock> ::= 0x26
ru: -- ключи для репликации <server_id> ::= 0x02 <lsn> ::= 0x03 <timestamp> ::= 0x04 <server_uuid> ::= 0x24 <cluster_uuid> ::= 0x25 <vclock> ::= 0x26

source: -- replication codes <join> ::= 0x41 <subscribe> ::= 0x42
ru: -- коды для репликации <join> ::= 0x41 <subscribe> ::= 0x42

source: JOIN: In the beginning you must send initial JOIN HEADER BODY +================+================++===================+ | | || SERVER_UUID | | 0x00: 0x41 | 0x01: SYNC || 0x24: UUID | | MP_INT: MP_INT | MP_INT: MP_INT || MP_INT: MP_STRING | | | || | +================+================++===================+ MP_MAP MP_MAP Then instance, which we connect to, will send last SNAP file by, simply, creating a number of INSERTs (with additional LSN and ServerID) (don't reply). Then it'll send a vclock's MP_MAP and close a socket. +================+================++============================+ | | || +~~~~~~~~~~~~~~~~~+ | | | || | | | | 0x00: 0x00 | 0x01: SYNC || 0x26:| SRV_ID: SRV_LSN | | | MP_INT: MP_INT | MP_INT: MP_INT || MP_INT:| MP_INT: MP_INT | | | | || +~~~~~~~~~~~~~~~~~+ | | | || MP_MAP | +================+================++============================+ MP_MAP MP_MAP SUBSCRIBE: Then you must send SUBSCRIBE: HEADER +===================+===================+ | | | | 0x00: 0x42 | 0x01: SYNC | | MP_INT: MP_INT | MP_INT: MP_INT | | | | +===================+===================+ | SERVER_UUID | CLUSTER_UUID | | 0x24: UUID | 0x25: UUID | | MP_INT: MP_STRING | MP_INT: MP_STRING | | | | +===================+===================+ MP_MAP BODY +================+ | | | 0x26: VCLOCK | | MP_INT: MP_INT | | | +================+ MP_MAP Then you must process every query that'll came through other masters. Every request between masters will have Additional LSN and SERVER_ID.
ru: JOIN: Сначала необходимо отправить изначальный запрос JOIN HEADER BODY +================+================++===================+ | | || SERVER_UUID | | 0x00: 0x41 | 0x01: SYNC || 0x24: UUID | | MP_INT: MP_INT | MP_INT: MP_INT || MP_INT: MP_STRING | | | || | +================+================++===================+ MP_MAP MP_MAP Затем экземпляр, к которому мы подключаемся, отправит последний файл снимка SNAP, просто создав количество запросов вставки INSERT (с дополнительным LSN и ServerID) (не отвечайте). Затем он отправит MP_MAP из vclock и закроет сокет. +================+================++============================+ | | || +~~~~~~~~~~~~~~~~~+ | | | || | | | | 0x00: 0x00 | 0x01: SYNC || 0x26:| SRV_ID: SRV_LSN | | | MP_INT: MP_INT | MP_INT: MP_INT || MP_INT:| MP_INT: MP_INT | | | | || +~~~~~~~~~~~~~~~~~+ | | | || MP_MAP | +================+================++============================+ MP_MAP MP_MAP SUBSCRIBE: Далее необходимо отправить запрос SUBSCRIBE: HEADER +===================+===================+ | | | | 0x00: 0x42 | 0x01: SYNC | | MP_INT: MP_INT | MP_INT: MP_INT | | | | +===================+===================+ | SERVER_UUID | CLUSTER_UUID | | 0x24: UUID | 0x25: UUID | | MP_INT: MP_STRING | MP_INT: MP_STRING | | | | +===================+===================+ MP_MAP BODY +================+ | | | 0x26: VCLOCK | | MP_INT: MP_INT | | | +================+ MP_MAP Затем следует обработать каждый запрос, который пришел от других мастеров. Каждый запрос между мастерами получит дополнительный LSN и SERVER_ID.

source: XLOG and SNAP files have nearly the same format. The header looks like:
ru: Файлы форматов XLOG и SNAP выглядят практически одинаково. Заголовок выглядит следующим образом:

source: <type>\n SNAP\n or XLOG\n <version>\n currently 0.13\n Server: <server_uuid>\n where UUID is a 36-byte string VClock: <vclock_map>\n e.g. {1: 0}\n \n
ru: <type>\n SNAP\n или XLOG\n <version>\n в данный момент 0.13\n Server: <server_uuid>\n где UUID -- это 36-байтная строка VClock: <vclock_map>\n например, {1: 0}\n \n

source: After the file header come the data tuples. Tuples begin with a row marker ``0xd5ba0bab`` and the last tuple may be followed by an EOF marker ``0xd510aded``. Thus, between the file header and the EOF marker, there may be data tuples that have this form:
ru: После файла заголовка идут кортежи с данными. Кортежи начинаются с маркера строки ``0xd5ba0bab``, а после последнего кортежа может стоять маркер конца файла ``0xd510aded``. Таким образом, между заголовком файла и маркером конца файла могут быть кортежи с данными в следующем виде:

source: See the example in the following section.
ru: См. пример в предыдущем разделе.

source: Data persistence and the WAL file format
ru: Персистентность данных и формат WAL-файла

source: Apart from a log sequence number and the data change request (formatted as in :ref:`Tarantool's binary protocol <box_protocol-iproto_protocol>`), each WAL record contains a header, some metadata, and then the data formatted according to `msgpack <https://en.wikipedia.org/wiki/MessagePack>`_ rules. For example, this is what the WAL file looks like after the first INSERT request ("s:insert({1})") for the sandbox database created in our :ref:`"Getting started" exercises <getting_started>`. On the left are the hexadecimal bytes that you would see with:
ru: Помимо номера записи в журнале (LSN) и запроса на изменение данных (в формате :ref:`бинарного протокола Tarantool'а <box_protocol-iproto_protocol>`), каждая запись в WAL-файле содержит заголовок, некоторые метаданные, а также данные, форматированные по правилам `msgpack <https://en.wikipedia.org/wiki/MessagePack>`_. Например, так выглядит WAL-файл после первого запроса вставки INSERT ("s:insert({1})") для базы данных из песочницы, созданной в упражнениях в :ref:`"Руководстве для начинающих" <getting_started>`. Слева представлены шестнадцатеричные байты, которые можно просмотреть с помощью:

source: and on the right are comments.
ru: а справа -- комментарии.

source: Hex dump of WAL file Comment -------------------- ------- 58 4c 4f 47 0a "XLOG\n" 30 2e 31 33 0a "0.13\n" = version 53 65 72 76 65 72 3a 20 "Server: " 38 62 66 32 32 33 65 30 2d [Server UUID]\n 36 39 31 34 2d 34 62 35 35 2d 39 34 64 32 2d 64 32 62 36 64 30 39 62 30 31 39 36 0a 56 43 6c 6f 63 6b 3a 20 "Vclock: " 7b 7d "{}" = vclock value, initially blank ... (not shown = tuples for system spaces) d5 ba 0b ab Magic row marker always = 0xab0bbad5 19 Length, not including length of header, = 25 bytes 00 Record header: previous crc32 ce 8c 3e d6 70 Record header: current crc32 a7 cc 73 7f 00 00 66 39 Record header: padding 84 msgpack code meaning "Map of 4 elements" follows 00 02 element#1: tag=request type, value=0x02=IPROTO_INSERT 02 01 element#2: tag=server id, value=0x01 03 04 element#3: tag=lsn, value=0x04 04 cb 41 d4 e2 2f 62 fd d5 d4 element#4: tag=timestamp, value=an 8-byte "Float64" 82 msgpack code meaning "map of 2 elements" follows 10 cd 02 00 element#1: tag=space id, value=512, big byte first 21 91 01 element#2: tag=tuple, value=1-element fixed array={1}
ru: Шестнадцатеричный дамп WAL-файла Комментарий -------------------- ------- 58 4c 4f 47 0a "XLOG\n" 30 2e 31 33 0a "0.13\n" = version 53 65 72 76 65 72 3a 20 "Server: " 38 62 66 32 32 33 65 30 2d [Server UUID]\n 36 39 31 34 2d 34 62 35 35 2d 39 34 64 32 2d 64 32 62 36 64 30 39 62 30 31 39 36 0a 56 43 6c 6f 63 6b 3a 20 "Vclock: " 7b 7d "{}" = vclock value, initially blank ... (not shown = tuples for system spaces) d5 ba 0b ab Magic row marker always = 0xab0bbad5 19 Length, not including length of header, = 25 bytes 00 Record header: previous crc32 ce 8c 3e d6 70 Record header: current crc32 a7 cc 73 7f 00 00 66 39 Record header: padding 84 msgpack code meaning "Map of 4 elements" follows 00 02 element#1: tag=request type, value=0x02=IPROTO_INSERT 02 01 element#2: tag=server id, value=0x01 03 04 element#3: tag=lsn, value=0x04 04 cb 41 d4 e2 2f 62 fd d5 d4 element#4: tag=timestamp, value=an 8-byte "Float64" 82 msgpack code meaning "map of 2 elements" follows 10 cd 02 00 element#1: tag=space id, value=512, big byte first 21 91 01 element#2: tag=tuple, value=1-element fixed array={1}

source: A tool for reading .xlog files is Tarantool's :ref:`xlog module <xlog>`.
ru: Для чтения файлов в формате .xlog в Tarantool'е предусмотрен :ref:`модуль xlog <xlog>`.

source: Tarantool processes requests atomically: a change is either accepted and recorded in the WAL, or discarded completely. Let's clarify how this happens, using the REPLACE request as an example:
ru: Tarantool обрабатывает запросы атомарно: изменение либо принимается и записывается в WAL-файл, или полностью исключается. Проясним, как этом работает, используя в качестве примера REPLACE-запрос:

source: The server instance attempts to locate the original tuple by primary key. If found, a reference to the tuple is retained for later use.
ru: Экземпляр сервера пытается найти оригинальный кортеж по первичному ключу. Если кортеж найден, ссылка на него сохраняется для дальнейшего использования.

source: The new tuple is validated. If for example it does not contain an indexed field, or it has an indexed field whose type does not match the type according to the index definition, the change is aborted.
ru: Происходит проверка нового кортежа. Например, если в нем нет проиндексированного поля, или же тип проиндексированного поля не совпадает с типом в определении индекса, изменение прерывается.

source: The new tuple replaces the old tuple in all existing indexes.
ru: Новый кортеж заменяет старый кортеж во всех существующих индексах.

source: A message is sent to the writer process running in the WAL thread, requesting that the change be recorded in the WAL. The instance switches to work on the next request until the write is acknowledged.
ru: В процесс записи, запущенный в потоке журнала упреждающей записи, отправляется сообщение о необходимости внесения записи в WAL-файл. Экземпляр переключается на работу со следующим запросом, пока запись не будет подтверждена.

source: On success, a confirmation is sent to the client. On failure, a rollback procedure is begun. During the rollback procedure, the transaction processor rolls back all changes to the database which occurred after the first failed change, from latest to oldest, up to the first failed change. All rolled back requests are aborted with :errcode:`ER_WAL_IO <ER_WAL_IO>` error. No new change is applied while rollback is in progress. When the rollback procedure is finished, the server restarts the processing pipeline.
ru: При успешном выполнении на клиент отправляется подтверждение. В случае ошибки начинается процедура отката. Во время процедуры отката поток обработки транзакций откатывается все изменения в базу данных, которые произошли после первого невыполненного изменения, от последнего с первому, вплоть до первого невыполненного изменения. Все запросы, которые подверглись откату, прерываются с ошибкой :errcode:`ER_WAL_IO <ER_WAL_IO>`. Новые изменения не применяются во время отката. По окончании процедуры отката сервер повторно запускает конвейер обработки операций.

source: One advantage of the described algorithm is that complete request pipelining is achieved, even for requests on the same value of the primary key. As a result, database performance doesn't degrade even if all requests refer to the same key in the same space.
ru: Одно из преимуществ описанного алгоритма заключается в том, что достигается полная обработка запроса по конвейеру даже для запросов с одинаковым значением первичного ключа. В результате производительность базы данных не падает, даже если все запросы относятся к одному ключу в одном спейсе.

source: The transaction processor thread communicates with the WAL writer thread using asynchronous (yet reliable) messaging; the transaction processor thread, not being blocked on WAL tasks, continues to handle requests quickly even at high volumes of disk I/O. A response to a request is sent as soon as it is ready, even if there were earlier incomplete requests on the same connection. In particular, SELECT performance, even for SELECTs running on a connection packed with UPDATEs and DELETEs, remains unaffected by disk load.
ru: Поток обработки транзакций взаимодействует с потоком записи в журнал упреждающей записи с помощью асинхронного (однако надежного) обмена сообщениями. Поток обработки транзакций, который не блокируется при задачах записи в журнал, продолжает быстро обрабатывать запрос даже при большом объеме дискового ввода-вывода. Ответ на запрос отправляется по готовности, даже если ранее на том же соединении были незавершенные запросы. В частности, на производительность выборки не влияет загрузка диска, даже если SELECT-запросы передаются вместе с запросами UPDATE и DELETE.

source: The WAL writer employs a number of durability modes, as defined in configuration variable :ref:`wal_mode <index-wal_mode>`. It is possible to turn the write-ahead log completely off, by setting :ref:`wal_mode <cfg_binary_logging_snapshots-wal_mode>` to *none*. Even without the write-ahead log it's still possible to take a persistent copy of the entire data set with the :ref:`box.snapshot() <box-snapshot>` request.
ru: При записи в WAL можно применять различные режимы долговечности, что определяет конфигурационная переменная :ref:`wal_mode <index-wal_mode>`. Можно полностью отключить журнал упреждающей записи, присвоив :ref:`wal_mode <cfg_binary_logging_snapshots-wal_mode>` значение *none*. Даже без журнала упреждающей записи возможно сделать персистентную копию всего набора данных с помощью запроса :ref:`box.snapshot() <box-snapshot>`.

source: An .xlog file always contains changes based on the primary key. Even if the client requested an update or delete using a secondary key, the record in the .xlog file will contain the primary key.
ru: Файл в формате .xlog всегда содержит изменения на основании первичного ключа. Даже если клиент запрашивает обновление или удаление по вторичному ключу, запись в файле в формате .xlog будет содержать первичный ключ.

source: The snapshot file format
ru: Формат файла снимка

source: The format of a snapshot .snap file is nearly the same as the format of a WAL .xlog file. However, the snapshot header differs: it contains the instance's global unique identifier and the snapshot file's position in history, relative to earlier snapshot files. Also, the content differs: an .xlog file may contain records for any data-change requests (inserts, updates, upserts, and deletes), a .snap file may only contain records of inserts to memtx spaces.
ru: Формат файла снимка .snap практически такой же, что и формат WAL-файла .xlog. Тем не менее, заголовок снимка отличается: он содержит глобально уникальный идентификатор экземпляра и положения файла снимка в истории относительно более ранних файлов снимка. Кроме того, отличается содержание: .xlog-файл может содержать записи о любых запросах изменения данных (вставка, обновление, обновление и вставка и удаление), а .snap-файл может содержать лишь записи о вставках в спейсы memtx'а.
