Repository: tarantool/doc
Catalog: locale/*/LC_MESSAGES/doc.po
Languages: ru

source: ``upsert`` searches for an old tuple by the primary index, NOT by a secondary index. This can lead to a duplication error if the new tuple ruins the uniqueness of a secondary index.
ru: ``upsert`` ищет старый кортеж по первичному индексу, НЕ по вторичному. Это может привести к ошибкам с дубликатами, если новый кортеж нарушает уникальность вторичного индекса.

source: tarantool> s:upsert({2, 200, 3}, {{'=', 3, 300}}) --- - error: Duplicate key exists in unique index 'sk_uniq' in space 'test' ... s:select{} --- - - [1, 200, 3] ... tarantool> -- But this works, when uniqueness is preserved. -- tarantool> s:upsert({2, 0, 0}, {{'=', 3, 300}}) --- ... tarantool> s:select{} --- - - [1, 200, 3] - [2, 0, 0] ... tarantool> s:truncate() --- ...
ru: tarantool> s:upsert({2, 200, 3}, {{'=', 3, 300}}) --- - error: Duplicate key exists in unique index 'sk_uniq' in space 'test' ... s:select{} --- - - [1, 200, 3] ... tarantool> -- Но сработает, если сохраняется уникальность. -- tarantool> s:upsert({2, 0, 0}, {{'=', 3, 300}}) --- ... tarantool> s:select{} --- - - [1, 200, 3] - [2, 0, 0] ... tarantool> s:truncate() --- ...

source: ``replace`` accepts a well-formatted tuple and searches for an old tuple by the primary key of the new tuple.
ru: ``replace`` (замена) работает с кортежами с четким форматом и ищет старый кортеж по первичному ключу нового кортежа.

source: If the old tuple is found, then it is deleted, and the new tuple is inserted.
ru: Если найден старый кортеж, то происходит удаление старого кортежа и вставка нового.

source: If the old tuple was not found, then just the new tuple is inserted.
ru: Если старый кортеж не найден, вставляется новый кортеж.

source: ``replace`` can ruin unique constraints, like ``upsert`` does.
ru: Как и ``upsert``, ``replace`` может нарушить требования уникальности.

source: tarantool> s:insert{1, 1, 1} --- - [1, 1, 1] ... tarantool> s:insert{2, 2, 2} --- - [2, 2, 2] ... tarantool> -- This replace fails, because if the new tuple {1, 2, 0} replaces -- tarantool> -- the old tuple by the primary key from 'pk' index {1, 1, 1}, -- tarantool> -- this results in a duplicate unique secondary key in 'sk_uniq' index: -- tarantool> -- key {2} is used both in the new tuple and in {2, 2, 2}. -- tarantool> s:replace{1, 2, 0} --- - error: Duplicate key exists in unique index 'sk_uniq' in space 'test' ... tarantool> s:truncate() --- ...
ru: tarantool> s:insert{1, 1, 1} --- - [1, 1, 1] ... tarantool> s:insert{2, 2, 2} --- - [2, 2, 2] ... tarantool> -- Такая замена не сработает, поскольку замена новым кортежем {1, 2, 0} -- tarantool> -- старого кортежа по первичному ключу из индекса 'pk' {1, 1, 1}, -- tarantool> -- приведет к созданию дубликата уникального вторичного ключа в индексе 'sk_uniq': -- tarantool> -- ключ {2} используется и в новом кортеже, и в {2, 2, 2}. -- tarantool> s:replace{1, 2, 0} --- - error: Duplicate key exists in unique index 'sk_uniq' in space 'test' ... tarantool> s:truncate() --- ...

source: ``select`` works with any indexes (primary/secondary) and with any keys (unique/non-unique, full/partial).
ru: ``select`` (выборка) работает с любыми индексами (первичными/вторичными) и с любыми ключами (уникальными/неуникальными, полными/компонентами).

source: If a key is partial, then ``select`` searches by all keys, where the prefix matches the specified key part.
ru: Если задан компонент ключа, ``select`` выполняет поиск всех ключей, префикс которых совпадает с указанным компонентом ключа.

source: Submodule `box.stat`
ru: Вложенный модуль `box.stat`

source: Submodule `box.tuple`
ru: Вложенный модуль `box.tuple`

source: The ``box.tuple`` submodule provides read-only access for the ``tuple`` userdata type. It allows, for a single :ref:`tuple <index-box_tuple>`: selective retrieval of the field contents, retrieval of information about size, iteration over all the fields, and conversion to a `Lua table <https://www.lua.org/pil/2.5.html>`_.
ru: Вложенный модуль ``box.tuple`` предоставляет доступ только для чтения к пользовательским данным типа кортеж ``tuple``. С его помощью для отдельного :ref:`кортежа <index-box_tuple>` можно сделать следующее: выборочно искать содержимое поля, получать информацию о размере, проводить итерацию по всем полям и выполнять преобразование в `Lua-таблицу <https://www.lua.org/pil/2.5.html>`_.

source: Below is a list of all ``box.tuple`` functions.
ru: Ниже приведен перечень всех функций модуля ``box.tuple``.

source: Create a tuple
ru: Создание кортежа

source: Count tuple fields
ru: Подсчет полей кортежа

source: Get count of bytes in a tuple
ru: Подсчет байтов в кортеже

source: Get the number of the first field matching the search value
ru: Получение номера первого поля, совпадающего с искомым значением

source: Get the number of all fields matching the search value
ru: Получение номеров всех полей, совпадающих с искомым значением

source: Remove (and replace) a tuple's fields
ru: Удаление (и замена) полей кортежа

source: Get a tuple's fields
ru: Получение полей кортежа

source: Get a tuple's fields as a table
ru: Получение полей кортежа в виде таблицы

source: Get a tuple's fields as a table along with key:value pairs
ru: Получение полей кортежа в виде таблицы, а также пар ключ-значение

source: Construct a new tuple from either a scalar or a Lua table. Alternatively, one can get new tuples from tarantool's :ref:`select <box_space-select>` or :ref:`insert <box_space-insert>` or :ref:`replace <box_space-replace>` or :ref:`update <box_space-update>` requests, which can be regarded as statements that do ``new()`` implicitly.
ru: Создание нового кортежа либо из скаляра, либо из Lua-таблицы. Возможен и вариант получения новых кортежей из запросов :ref:`select <box_space-select>` или :ref:`insert <box_space-insert>`. или :ref:`replace <box_space-replace>`, или :ref:`update <box_space-update>` Tarantool'а, которые можно рассматривать в качестве операторов, косвенно выполняющих операцию создания ``new()``.

source: the value that will become the tuple contents.
ru: значение, которое станет содержимым кортежа.

source: a new tuple
ru: новый кортеж

source: In the following example, ``x`` will be a new table object containing one tuple and ``t`` will be a new tuple object. Saying ``t`` returns the entire tuple ``t``.
ru: В следующем примере ``x`` будет представлять собой новый объект таблицы, который содержит один кортеж, а ``t`` будет представлять собой объект кортежа. Если ввести команду ``t``, будет получен весь кортеж ``t``.

source: The ``#`` operator in Lua means "return count of components". So, if ``t`` is a tuple instance, ``#t`` will return the number of fields.
ru: Оператор ``#`` на языке Lua означает "вернуть количество компонентов". Таким образом, если ``t`` представляет собой кортеж, то ``#t`` вернет количество полей.

source: In the following example, a tuple named ``t`` is created and then the number of fields in ``t`` is returned.
ru: В следующем примере создается кортеж под названием ``t``, а затем возвращается количество полей в кортеже ``t``.

source: If ``t`` is a tuple instance, ``t:bsize()`` will return the number of bytes in the tuple. With both the memtx storage engine and the vinyl storage engine the default maximum is one megabyte (:ref:`memtx_max_tuple_size <cfg_storage-memtx_max_tuple_size>` or :ref:`vinyl_max_tuple_size <cfg_storage-vinyl_max_tuple_size>`). Every field has one or more "length" bytes preceding the actual contents, so ``bsize()`` returns a value which is slightly greater than the sum of the lengths of the contents.
ru: Если ``t`` -- это экземпляр кортежа, то ``t:bsize()`` вернет количество байтов в кортеже. Как для движка базы данных memtx, так и для движка vinyl максимальное количество, используемое по умолчанию, составляет один мегабайт (:ref:`memtx_max_tuple_size <cfg_storage-memtx_max_tuple_size>` или :ref:`vinyl_max_tuple_size <cfg_storage-vinyl_max_tuple_size>`). В каждом поле есть один или более байтов "длины", которые предваряют само содержимое поля, поэтому ``bsize()`` вернет значение, которое незначительно больше, чем сумма длин всего содержимого.

source: If ``t`` is a tuple instance, ``t[field-number]`` will return the field numbered field-number in the tuple. The first field is ``t[1]``.
ru: Если ``t`` -- это экземпляр кортежа, то ``t[номер-поля]`` вернет поле под номером номер-поля в кортеже. Первое поле -- это ``t[1]``.

source: field value.
ru: значение поля.

source: lua-value
ru: Lua-значение

source: In the following example, a tuple named ``t`` is created and then the second field in ``t`` is returned.
ru: В следующем примере создается кортеж под названием ``t``, а затем возвращается второе поле в кортеже ``t``.

source: If ``t`` is a tuple instance, ``t:find(search-value)`` will return the number of the first field in ``t`` that matches the search value, and ``t:findall(search-value [, search-value ...])`` will return numbers of all fields in ``t`` that match the search value. Optionally one can put a numeric argument ``field-number`` before the search-value to indicate “start searching at field number ``field-number``.”
ru: Если ``t`` -- это экземпляр кортежа, то ``t:find(search-value)`` вернет номер первого поля в ``t``, которое совпадает с искомым значением, а ``t:findall(search-value [, search-value ...])`` вернет номера всех колей в ``t``, которые совпадают с искомым значением. Можно дополнительно добавить числовой аргумент ``field-number`` перед search-value, чтобы задать условие “начинать поиск с номера поля ``field-number``.”

source: the number of the field in the tuple.
ru: номер поля в кортеже.

source: In the following example, a tuple named ``t`` is created and then: the number of the first field in ``t`` which matches 'a' is returned, then the numbers of all the fields in ``t`` which match 'a' are returned, then the numbers of all the fields in t which match 'a' and are at or after the second field are returned.
ru: В следующем примере создается кортеж с именем ``t``, а затем: возвращается номер первого поля в ``t``, которое совпадает с 'a', затем возвращаются номера всех полей в ``t``, которые совпадают с 'a', затем возвращаются номера всех полей в t, которые совпадают с 'a', и находятся на втором месте или далее.

source: If ``t`` is a tuple instance, :samp:`t:transform({start-field-number},{fields-to-remove})` will return a tuple where, starting from field ``start-field-number``, a number of fields (``fields-to-remove``) are removed. Optionally one can add more arguments after ``fields-to-remove`` to indicate new values that will replace what was removed.
ru: Если ``t`` -- это экземпляр кортежа, то :samp:`t:transform({start-field-number},{fields-to-remove})` вернет кортеж, где начиная с поля ``start-field-number``, удаляется количество полей (``fields-to-remove``). Дополнительно можно добавить аргументы после ``fields-to-remove``, чтобы указать новые значения на замену удаленных.

source: base 1, may be negative
ru: начиная с 1, может быть отрицательным

source: In the following example, a tuple named ``t`` is created and then, starting from the second field, two fields are removed but one new one is added, then the result is returned.
ru: В следующем примере создается кортеж под названием ``t``, а затем начиная со второго поля, удаляются два поля, а одно новое поле добавляется, затем возвращается результат.

source: If ``t`` is a tuple instance, ``t:unpack()`` will return all fields, ``t:unpack(1)`` will return all fields starting with field number 1, ``t:unpack(1,5)`` will return all fields between field number 1 and field number 5.
ru: Если ``t`` -- это экземпляр кортежа, то ``t:unpack()`` вернет все поля, ``t:unpack(1)`` вернет все поля, начиная с поля №1, ``t:unpack(1,5)`` вернет все поля между полем №1 и полем №5.

source: field(s) from the tuple.
ru: поле или поля из кортежа.

source: lua-value(s)
ru: Lua-значение

source: In the following example, a tuple named ``t`` is created and then all its fields are selected, then the result is returned.
ru: В следующем примере создается кортеж под названием ``t``, а затем делается выборка всех полей, возвращается результат.

source: If ``t`` is a tuple instance, ``t:totable()`` will return all fields, ``t:totable(1)`` will return all fields starting with field number 1, ``t:totable(1,5)`` will return all fields between field number 1 and field number 5.
ru: Если ``t`` -- это экземпляр кортежа, то ``t:totable()`` вернет все поля, ``t:totable(1)`` вернет все поля, начиная с поля №1, ``t:totable(1,5)`` вернет все поля между полем №1 и полем №5.

source: It is preferable to use ``t:totable()`` rather than ``t:unpack()``.
ru: Рекомендуется использовать ``t:totable()``, а не ``t:unpack()``.

source: field(s) from the tuple
ru: поле или поля из кортежа

source: lua-table
ru: Lua-таблица

source: In the following example, a tuple named ``t`` is created, then all its fields are selected, then the result is returned.
ru: В следующем примере создается кортеж под названием ``t``, а затем делается выборка всех полей, возвращается результат.

source: A `Lua table <https://www.lua.org/pil/2.5.html>`_ can have indexed values, also called key:value pairs. For example, here:
ru: В `Lua-таблице <https://www.lua.org/pil/2.5.html>`_ могут быть индексированные значения, которые также называются пары ключ-значение. Например, здесь:

source: ``a`` is a table with "field1: 10" and "field2: 20".
ru: ``a`` -- это таблица с "field1: 10" и "field2: 20".

source: The :ref:`tuple_object:totable() <box_tuple-totable>` function only returns a table containing the values. But the ``tuple_object:tomap()`` function returns a table containing not only the values, but also the key:value pairs.
ru: Функция :ref:`tuple_object:totable() <box_tuple-totable>` вернет только таблицу со значениями. А функция ``tuple_object:tomap()`` вернет таблицу не только со значениями, но и с парами ключ-значение.

source: This only works if the tuple comes from a space that has been formatted with a :ref:`format clause <box_space-format>`.
ru: Это сработает только в том случае, если кортеж приходит из спейса, который был форматирован посредством :ref:`оператора формата <box_space-format>`.

source: In Lua, `lua-table-value:pairs() <https://www.lua.org/pil/7.3.html>`_ is a method which returns: ``function``, ``lua-table-value``, ``nil``. Tarantool has extended this so that ``tuple-value:pairs()`` returns: ``function``, ``tuple-value``, ``nil``. It is useful for Lua iterators, because Lua iterators traverse a value's components until an end marker is reached.
ru: В языке Lua метод `lua-table-value:pairs() <https://www.lua.org/pil/7.3.html>`_ возвращает: ``функция``, ``значение-Lua-таблицы``, ``nil``. В Tarantool'е метод расширен так, что ``tuple-value:pairs()`` возвращает: ``функция``, ``значение-кортежа``, ``nil``, -- что используется для Lua-итераторов, поскольку они обходят компоненты значения до тех пор, пока не достигнут маркера.

source: function, tuple-value, nil
ru: функция, значение кортежа, nil

source: function, lua-value, nil
ru: функция, Lua-значение, nil

source: In the following example, a tuple named ``t`` is created and then all its fields are selected using a Lua for-end loop.
ru: В следующем примере создается кортеж под названием ``t``, а затем все его поля выбираются с помощью Lua-цикла for.

source: This function updates a tuple which is not in a space. Compare the function :extsamp:`box.space.{*{space-name}*}:update({*{key}*}, {{{*{format}*}, {*{field_no}*}, {*{value}*}}, ...})` which updates a tuple in a space.
ru: Эта функция обновляет кортеж, который находится не в спейсе. Ср. функцию :extsamp:`box.space.{*{space-name}*}:update({*{key}*}, {{{*{format}*}, {*{field_no}*}, {*{value}*}}, ...})`, которая обновляет кортеж в спейсе.

source: For details: see the description for ``operator``, ``field_no``, and ``value`` in the section :ref:`box.space.space-name:update{key, format, {field_number, value}...) <box_space-update>`.
ru: Более подробную информацию см. в описании ``operator``, ``field_no`` и ``value`` в разделе :ref:`box.space.space-name:update{key, format, {field_number, value}...) <box_space-update>`.

source: operation type represented in string (e.g. '``=``' for 'assign new value')
ru: тип операции, представленный строкой (например, '``=``' означает 'присвоить новое значение')

source: new tuple
ru: новый кортеж

source: In the following example, a tuple named ``t`` is created and then its second field is updated to equal 'B'.
ru: В следующем примере создается кортеж под названием ``t``, а затем второе поле обновляется до равного 'B'.

source: Example
ru: Пример

source: This function will illustrate how to convert tuples to/from Lua tables and lists of scalars:
ru: Представленная ниже функция проиллюстрирует, как можно преобразовать кортежи в Lua-таблицы и списки скаляров и обратно:

source: tuple = box.tuple.new({scalar1, scalar2, ... scalar_n}) -- scalars to tuple lua_table = {tuple:unpack()} -- tuple to Lua table lua_table = tuple:totable() -- tuple to Lua table scalar1, scalar2, ... scalar_n = tuple:unpack() -- tuple to scalars tuple = box.tuple.new(lua_table) -- Lua table to tuple
ru: tuple = box.tuple.new({scalar1, scalar2, ... scalar_n}) -- скаляры в кортеж lua_table = {tuple:unpack()} -- кортеж в Lua-таблицу lua_table = tuple:totable() -- кортеж в Lua-таблицу scalar1, scalar2, ... scalar_n = tuple:unpack() -- кортеж в скаляры tuple = box.tuple.new(lua_table) -- Lua-таблицу в кортеж

source: Then it will find the field that contains 'b', remove that field from the tuple, and display how many bytes remain in the tuple. The function uses Tarantool ``box.tuple`` functions ``new()``, ``unpack()``, ``find()``, ``transform()``, ``bsize()``.
ru: Затем она найдет поле, которое содержит значение 'b', удалит это поле из кортежа и отобразит количество байтов, оставшихся в кортеже. Данная функция использует следующие функции ``box.tuple`` Tarantool'а: ``new()``, ``unpack()``, ``find()``, ``transform()``, ``bsize()``.

source: Functions for transaction management
ru: Управление экземплярами

source: For general information and examples, see section :ref:`Transaction control <atomic-atomic_execution>`.
ru: Чтобы получить общую информацию и взглянуть на примеры использования, см. раздел :ref:`Управление транзакциями <atomic-atomic_execution>`.

source: Observe the following rules when working with transactions:
ru: Соблюдайте следующие правила в работе с транзакциями:

source: Rule #1
ru: Правило #1

source: The requests in a transaction must be sent to a server as a single block. It is not enough to enclose them between begin and commit or rollback. To ensure they are sent as a single block: put them in a function, or put them all on one line, or use a delimiter so that multi-line requests are handled together.
ru: Запросы в транзакции должны отправляться на сервер в виде единого блока. Недостаточно просто размещать их между началом транзакции и коммитом или откатом. Чтобы убедиться, что они отправляются в виде единого блока: поместите их в функцию, поместите их на одну строку или используйте символы-разделители, чтобы многостроковые запросы обрабатывались совместно.

source: Rule #2
ru: Правило #2

source: All database operations in a transaction should use the same storage engine. It is not safe to access tuple sets that are defined with ``{engine='vinyl'}`` and also access tuple sets that are defined with ``{engine='memtx'}``, in the same transaction.
ru: Все операции с базой данных в рамках транзакции должны работать с одним движком баз данных. Небезопасно в рамках одной транзакции получать доступ к наборам кортежей, которые определяются по ``{engine='vinyl'}``, а также к наборам кортежей, которые определяются по ``{engine='memtx'}``.

source: Rule #3
ru: Правило #3

source: Requests which cause changes to the data definition -- create, alter, drop, truncate -- must not be used.
ru: Нельзя использовать запросы, которые могут приводить к изменению определения данных -- создание, изменение, удаление, очистка.

source: Below is a list of all functions for transaction management.
ru: Ниже приведен перечень всех функций для управления транзакциями.

source: Begin the transaction
ru: Начало транзакции

source: End the transaction and save all changes
ru: Окончание транзакции и сохранение всех изменений

source: End the transaction and discard all changes
ru: Окончание транзакции и отмена всех изменений

source: Get a savepoint descriptor
ru: Получение дескриптора точки сохранения

source: Do not end the transaction and discard all changes made after a savepoint
ru: Запрещение окончания транзакции и отмена всех изменений, сделанных после точки сохранения

source: Execute a function, treating it as a transaction
ru: Выполнение функции как транзакции

source: Begin the transaction. Disable :ref:`implicit yields <atomic-implicit-yields>` until the transaction ends. Signal that writes to the :ref:`write-ahead log <internals-wal>` will be deferred until the transaction ends. In effect the fiber which executes ``box.begin()`` is starting an "active multi-request transaction", blocking all other fibers.
ru: Начало транзакции. Отключение :ref:`неявной передачи управления <atomic-implicit-yields>` до окончания транзакции. Сигнал о записи в :ref :`журнал упреждающей записи <internals-wal>` будет задержан до окончания транзакции. Фактически файбер, который выполняет функцию ``box.begin()``, начинает "активную транзакцию со множеством запросов" с блокировкой всех остальных файберов.

source: End the transaction, and make all its data-change operations permanent.
ru: Окончание транзакции и применение результатов всех операций по изменению данных.

source: End the transaction, but cancel all its data-change operations. An explicit call to functions outside ``box.space`` that always yield, such as :ref:`fiber.sleep() <fiber-sleep>` or :ref:`fiber.yield() <fiber-yield>`, will have the same effect.
ru: Окончание транзакции, но отмена результатов всех операций по изменению данных. Явный вызов функций не из модуля ``box.space``, которые всегда передают управление, например :ref:`fiber.sleep() <fiber-sleep>` или :ref:`fiber.yield() <fiber-yield>`, приведет к тому же результату.

source: Return a descriptor of a savepoint (type = table), which can be used later by :ref:`box.rollback_to_savepoint(savepoint) <box-rollback_to_savepoint>`. Savepoints can only be created while a transaction is active, and they are destroyed when a transaction ends.
ru: Возврат дескриптора точки сохранения (тип = таблица), который может затем использоваться в :ref:`box.rollback_to_savepoint(savepoint) <box-rollback_to_savepoint>`. Точки сохранения могут быть созданы, пока активна транзакция, и удаляются после окончания транзакции.

source: Lua object
ru: Lua-объект.

source: Do not end the transaction, but cancel all its data-change and :ref:`box.savepoint() <box-savepoint>` operations that were done after the specified savepoint.
ru: Запрещение окончания транзакции, но отмена всех изменений и операций :ref:`box.savepoint() <box-savepoint>`, сделанных после точки сохранения.

source: Execute a function, acting as if the function starts with an implicit :ref:`box.begin() <box-begin>` and ends with an implicit :ref:`box.commit() <box-commit>` if successful, or ends with an implicit :ref:`box.rollback() <box-rollback>` if there is an error.
ru: Выполнение функции так, как будто функция начинается с явного вызова :ref:`box.begin() <box-begin>` и заканчивается неявным вызовом :ref:`box.commit() <box-commit>` после успешного выполнения или же заканчивается неявным вызовом :ref:`box.rollback() <box-rollback>` в случае ошибки.

source: Data model
ru: Модель данных
