Repository: tarantool/doc
Catalog: locale/*/LC_MESSAGES/doc.po
Languages: ru

source: Since this is a test, there are deliberate errors. The "golf club" and the "waffle iron" do not have numeric Quantity fields, so must be ignored. Therefore the real sum of the Quantity field in the JSON strings should be: 15 + 7 = 22.
ru: Для целей практики здесь допущены ошибки. В "golf club" и "waffle iron" поля Quantity не являются числовыми, поэтому будут игнорироваться. Таким образом, итоговая сумма для полей Quantity в JSON-строках должна быть следующей: 15 + 7 = 22.

source: Invoke the function with ``sum_json_field("Quantity")``.
ru: Вызовите функцию с помощью ``sum_json_field("Quantity")``.

source: It works. We'll just leave, as exercises for future improvement, the possibility that the "hard coding" assumptions could be removed, that there might have to be an overflow check if some field values are huge, and that the function should contain a :ref:`yield <atomic-threads_fibers_yields>` instruction if the count of tuples is huge.
ru: Сработало. Для дополнительной отработки материала можно убрать заранее заданные значения, добавить проверку потенциально возможного арифметического переполнения при наличии больших значений некоторых полей, а также команду :ref:`передачи управления <atomic-threads_fibers_yields>` при огромном количестве кортежей.

source: Indexed pattern search
ru: Индексированный поиск по шаблонам

source: Here is a generic function which takes a field identifier and a search pattern, and returns all tuples that match. |br| * The field must be the first field of a TREE index. |br| * The function will use `Lua pattern matching <http://www.lua.org/manual/5.2/manual.html#6.4.1>`_, which allows "magic characters" in regular expressions. |br| * The initial characters in the pattern, as far as the first magic character, will be used as an index search key. For each tuple that is found via the index, there will be a match of the whole pattern. |br| * To be :ref:`cooperative <atomic-cooperative_multitasking>`, the function should yield after every 10 tuples, unless there is a reason to delay yielding. |br| With this function, we can take advantage of Tarantool's indexes for speed, and take advantage of Lua's pattern matching for flexibility. It does everything that an SQL "LIKE" search can do, and far more.
ru: Здесь приведена обобщенная функция, которая берет идентификатор поля и шаблон поиска, а затем возвращает все кортежи, которые подходят под критерии. |br| * Поле должно быть первым полем в TREE-индексе. |br| * Функция применяет `шаблоны в языке Lua <http://www.lua.org/manual/5.2/manual.html#6.4.1>`_, что позволяет использовать "магические символы" вы регулярных выражениях. |br| * Начальные символы в шаблоне до самого первого магического символа будут использоваться в качестве ключа поиска по индексу. Каждый кортеж, обнаруженный по индексу, будет соответствовать всему шаблону. |br| * В целях :ref:`кооперативной многозадачности <atomic-cooperative_multitasking>` функция должна передавать управление через каждые 10 кортежей, если только нет причин отложить передачу управления. |br| С помощью данной функции можно воспользоваться индексами Tarantool'а для ускорения и шаблонами на языке Lua для гибкости. Поддерживаются все возможности поиска LIKE в SQL -- и многие другие.

source: Read the following Lua code to see how it works. The comments that begin with "SEE NOTE ..." refer to long explanations that follow the code.
ru: Прочитайте следующий Lua-код, чтобы понять, как он работает. Комментарии, которые начинаются с "СМ. ПРИМЕЧАНИЕ ..." ссылаются на подробные объяснения, приведенные ниже.

source: function indexed_pattern_search(space_name, field_no, pattern) -- SEE NOTE #1 "FIND AN APPROPRIATE INDEX" if (box.space[space_name] == nil) then print("Error: Failed to find the specified space") return nil end local index_no = -1 for i=0,box.schema.INDEX_MAX,1 do if (box.space[space_name].index[i] == nil) then break end if (box.space[space_name].index[i].type == "TREE" and box.space[space_name].index[i].parts[1].fieldno == field_no and (box.space[space_name].index[i].parts[1].type == "scalar" or box.space[space_name].index[i].parts[1].type == "string")) then index_no = i break end end if (index_no == -1) then print("Error: Failed to find an appropriate index") return nil end -- SEE NOTE #2 "DERIVE INDEX SEARCH KEY FROM PATTERN" local index_search_key = "" local index_search_key_length = 0 local last_character = "" local c = "" local c2 = "" for i=1,string.len(pattern),1 do c = string.sub(pattern, i, i) if (last_character ~= "%") then if (c == '^' or c == "$" or c == "(" or c == ")" or c == "." or c == "[" or c == "]" or c == "*" or c == "+" or c == "-" or c == "?") then break end if (c == "%") then c2 = string.sub(pattern, i + 1, i + 1) if (string.match(c2, "%p") == nil) then break end index_search_key = index_search_key .. c2 else index_search_key = index_search_key .. c end end last_character = c end index_search_key_length = string.len(index_search_key) if (index_search_key_length < 3) then print("Error: index search key " .. index_search_key .. " is too short") return nil end -- SEE NOTE #3 "OUTER LOOP: INITIATE" local result_set = {} local number_of_tuples_in_result_set = 0 local previous_tuple_field = "" while true do local number_of_tuples_since_last_yield = 0 local is_time_for_a_yield = false -- SEE NOTE #4 "INNER LOOP: ITERATOR" for _,tuple in box.space[space_name].index[index_no]: pairs(index_search_key,{iterator = box.index.GE}) do -- SEE NOTE #5 "INNER LOOP: BREAK IF INDEX KEY IS TOO GREAT" if (string.sub(tuple[field_no], 1, index_search_key_length) > index_search_key) then break end -- SEE NOTE #6 "INNER LOOP: BREAK AFTER EVERY 10 TUPLES -- MAYBE" number_of_tuples_since_last_yield = number_of_tuples_since_last_yield + 1 if (number_of_tuples_since_last_yield >= 10 and tuple[field_no] ~= previous_tuple_field) then index_search_key = tuple[field_no] is_time_for_a_yield = true break end previous_tuple_field = tuple[field_no] -- SEE NOTE #7 "INNER LOOP: ADD TO RESULT SET IF PATTERN MATCHES" if (string.match(tuple[field_no], pattern) ~= nil) then number_of_tuples_in_result_set = number_of_tuples_in_result_set + 1 result_set[number_of_tuples_in_result_set] = tuple end end -- SEE NOTE #8 "OUTER LOOP: BREAK, OR YIELD AND CONTINUE" if (is_time_for_a_yield ~= true) then break end require('fiber').yield() end return result_set end
ru: function indexed_pattern_search(space_name, field_no, pattern) -- СМ. ПРИМЕЧАНИЕ №1 "ПОИСК НУЖНОГО ИНДЕКСА" if (box.space[space_name] == nil) then print("Error: Failed to find the specified space") return nil end local index_no = -1 for i=0,box.schema.INDEX_MAX,1 do if (box.space[space_name].index[i] == nil) then break end if (box.space[space_name].index[i].type == "TREE" and box.space[space_name].index[i].parts[1].fieldno == field_no and (box.space[space_name].index[i].parts[1].type == "scalar" or box.space[space_name].index[i].parts[1].type == "string")) then index_no = i break end end if (index_no == -1) then print("Error: Failed to find an appropriate index") return nil end -- СМ. ПРИМЕЧАНИЕ №2 "ПОЛУЧЕНИЕ КЛЮЧА ИНДЕКСНОГО ПОИСКА ИЗ ШАБЛОНА" local index_search_key = "" local index_search_key_length = 0 local last_character = "" local c = "" local c2 = "" for i=1,string.len(pattern),1 do c = string.sub(pattern, i, i) if (last_character ~= "%") then if (c == '^' or c == "$" or c == "(" or c == ")" or c == "." or c == "[" or c == "]" or c == "*" or c == "+" or c == "-" or c == "?") then break end if (c == "%") then c2 = string.sub(pattern, i + 1, i + 1) if (string.match(c2, "%p") == nil) then break end index_search_key = index_search_key .. c2 else index_search_key = index_search_key .. c end end last_character = c end index_search_key_length = string.len(index_search_key) if (index_search_key_length < 3) then print("Error: index search key " .. index_search_key .. " is too short") return nil end -- СМ. ПРИМЕЧАНИЕ №3 "ВНЕШНИЙ ЦИКЛ: НАЧАЛО" local result_set = {} local number_of_tuples_in_result_set = 0 local previous_tuple_field = "" while true do local number_of_tuples_since_last_yield = 0 local is_time_for_a_yield = false -- СМ. ПРИМЕЧАНИЕ №4 "ВНУТРЕННИЙ ЦИКЛ: ИТЕРАТОР" for _,tuple in box.space[space_name].index[index_no]: pairs(index_search_key,{iterator = box.index.GE}) do -- СМ. ПРИМЕЧАНИЕ №5 "ВНУТРЕННИЙ ЦИКЛ: ПРЕРЫВАНИЕ, ЕСЛИ КЛЮЧ ИНДЕКСА СЛИШКОМ БОЛЬШОЙ" if (string.sub(tuple[field_no], 1, index_search_key_length) > index_search_key) then break end -- СМ. ПРИМЕЧАНИЕ №6 "ВНУТРЕННИЙ ЦИКЛ: ПРЕРЫВАНИЕ ПОСЛЕ КАЖДЫХ ДЕСЯТИ КОРТЕЖЕЙ -- ВОЗМОЖНО" number_of_tuples_since_last_yield = number_of_tuples_since_last_yield + 1 if (number_of_tuples_since_last_yield >= 10 and tuple[field_no] ~= previous_tuple_field) then index_search_key = tuple[field_no] is_time_for_a_yield = true break end previous_tuple_field = tuple[field_no] -- СМ. ПРИМЕЧАНИЕ №7 "ВНУТРЕННИЙ ЦИКЛ: ДОБАВЛЕНИЕ В РЕЗУЛЬТАТ, ЕСЛИ ШАБЛОН СОВПАДЕТ" if (string.match(tuple[field_no], pattern) ~= nil) then number_of_tuples_in_result_set = number_of_tuples_in_result_set + 1 result_set[number_of_tuples_in_result_set] = tuple end end -- СМ. ПРИМЕЧАНИЕ №8 "ВНЕШНИЙ ЦИКЛ: ПРЕРЫВАНИЕ ИЛИ ПЕРЕДАЧА УПРАВЛЕНИЯ И ПРОДОЛЖЕНИЕ" if (is_time_for_a_yield ~= true) then break end require('fiber').yield() end return result_set end

source: NOTE #1 "FIND AN APPROPRIATE INDEX" |br| The caller has passed space_name (a string) and field_no (a number). The requirements are: |br| (a) index type must be "TREE" because for other index types (HASH, BITSET, RTREE) a search with :ref:`iterator=GE <box_index-iterator-types>` will not return strings in order by string value; |br| (b) field_no must be the first index part; |br| (c) the field must contain strings, because for other data types (such as "unsigned") pattern searches are not possible; |br| If these requirements are not met by any index, then print an error message and return nil.
ru: ПРИМЕЧАНИЕ №1 "ПОИСК НУЖНОГО ИНДЕКСА" |br| Вызывающий клиент передал space_name (имя_спейса -- строка) и field_no (номер_поля -- число). Требования следующие: |br| (a) тип индекса должен быть "TREE", поскольку для других типов индекса (HASH, BITSET, RTREE) поиск с :ref:`итератором=GE <box_index-iterator-types>` не вернет строки, упорядоченные по строковому значению; |br| (b) field_no должен представлять собой первую часть индекса; |br| (c) поле должно содержать строки, потому что для других типов данных (как "unsigned") шаблоны поиска не применяются; |br| Если индекс не удовлетворяет этим требованиям, выдать сообщение об ошибке и вернуть нулевое значение nil.

source: NOTE #2 "DERIVE INDEX SEARCH KEY FROM PATTERN" |br| The caller has passed pattern (a string). The index search key will be the characters in the pattern as far as the first magic character. Lua's magic characters are % ^ $ ( ) . [ ] * + - ?. For example, if the pattern is "ABC.E", the period is a magic character and therefore the index search key will be "ABC". But there is a complication ... If we see "%" followed by a punctuation character, that punctuation character is "escaped" so remove the "%" when making the index search key. For example, if the pattern is "AB%$E", the dollar sign is escaped and therefore the index search key will be "AB$E". Finally there is a check that the index search key length must be at least three -- this is an arbitrary number, and in fact zero would be okay, but short index search keys will cause long search times.
ru: ПРИМЕЧАНИЕ №2 "ПОЛУЧЕНИЕ КЛЮЧА ИНДЕКСНОГО ПОИСКА ИЗ ШАБЛОНА" |br| Вызывающий клиент передал шаблон (строку). Ключом поиска по индексу являются символы в шаблоне до первого магического символа. Магические символы в Lua: % ^ $ ( ) . [ ] * + - ?. Например, если задан шаблон "ABC.E", точка будет магическим символом, и ключом поиска по индексу будет "ABC". Однако есть затруднение ... Если символ "%" будет идти следом за знаком препинания, этот знак препинания экранируется, поэтому следует убрать "%" из ключа поиска по индексу. Например, если задан шаблон "AB%$E", знак доллара экранируется, поэтому ключом поиска по индексу будет "AB$E". Наконец, есть проверка длины ключа поиска по индексу -- не менее трех символов, причем это число выбрано произвольно, и даже ноль здесь подойдет, но по короткому ключу поиск займет длительное время.

source: NOTE #3 -- "OUTER LOOP: INITIATE" |br| The function's job is to return a result set, just as `box.space...select <box_space-select>` would. We will fill it within an outer loop that contains an inner loop. The outer loop's job is to execute the inner loop, and possibly :ref:`yield <atomic-threads_fibers_yields>`, until the search ends. The inner loop's job is to find tuples via the index, and put them in the result set if they match the pattern.
ru: ПРИМЕЧАНИЕ №3 "ВНЕШНИЙ ЦИКЛ: НАЧАЛО" |br| Назначение функции -- вернуть результирующий набор данных, как вернул бы запрос `box.space...select <box_space-select>`. Мы внесем ее во внешний цикл, который включает в себя внутренний цикл. Назначение внешнего цикла -- выполнять внутренний цикл и, при необходимости, :ref:`передачу управления <atomic-threads_fibers_yields>`, пока поиск не будет завершен. Назначение внутреннего цикла -- находить кортежи по индексу и включать их в результирующий набор данных, если они подходят под шаблон.

source: NOTE #4 "INNER LOOP: ITERATOR" |br| The for loop here is using pairs(), see the :ref:`explanation of what index iterators are <box_index-index_pairs>`. Within the inner loop, there will be a local variable named "tuple" which contains the latest tuple found via the index search key.
ru: ПРИМЕЧАНИЕ №4 "ВНУТРЕННИЙ ЦИКЛ: ИТЕРАТОР" |br| Цикл for здесь использует pairs(), см. :ref:`объяснение, что такое итераторы <box_index-index_pairs>`. Во внутреннем цикле будет локальная переменная под названием "tuple" (кортеж), которая содержит последний кортеж, обнаруженный в ходе поиска по индексу.

source: NOTE #5 "INNER LOOP: BREAK IF INDEX KEY IS TOO GREAT" |br| The iterator is GE (Greater or Equal), and we must be more specific: if the search index key has N characters, then the leftmost N characters of the result's index field must not be greater than the search index key. For example, if the search index key is 'ABC', then 'ABCDE' is a potential match, but 'ABD' is a signal that no more matches are possible.
ru: ПРИМЕЧАНИЕ №5 "ВНУТРЕННИЙ ЦИКЛ: ПРЕРЫВАНИЕ, ЕСЛИ КЛЮЧ ИНДЕКСА СЛИШКОМ БОЛЬШОЙ" |br| Используется итератор GE (Greater or Equal - больше или равно), поэтому необходимо уточнить: если ключ поиска по индексу включает в себя N символов, то крайние N символов слева от найденного поля индекса не должны быть больше ключа поиска. Например, если ключом поиска является 'ABC', то 'ABCDE' потенциально подходит, а 'ABD' означает, что в дальнейшем совпадений не будет.

source: NOTE #6 "INNER LOOP: BREAK AFTER EVERY 10 TUPLES -- MAYBE" |br| This chunk of code is for cooperative multitasking. The number 10 is arbitrary, and usually a larger number would be okay. The simple rule would be "after checking 10 tuples, yield, and then resume the search (that is, do the inner loop again) starting after the last value that was found". However, if the index is non-unique or if there is more than one field in the index, then we might have duplicates -- for example {"ABC",1}, {"ABC", 2}, {"ABC", 3}" -- and it would be difficult to decide which "ABC" tuple to resume with. Therefore, if the result's index field is the same as the previous result's index field, there is no break.
ru: ПРИМЕЧАНИЕ №6 "ВНУТРЕННИЙ ЦИКЛ: ПРЕРЫВАНИЕ ПОСЛЕ КАЖДЫХ ДЕСЯТИ КОРТЕЖЕЙ -- ВОЗМОЖНО" |br| Эта часть кода предназначена для кооперативной многозадачности. Число 10 выбрано произвольно, и как правило, большее число также подойдет. Простое правило гласит: "после проверки 10 кортежей передать управление, а затем возобновить поиск (то есть снова выполнять внутренний цикл), начиная с последнего обнаруженного значения". Однако, если индекс не уникален, или в индексе более одного поля, можно получить дублирующиеся результаты, например, {"ABC",1}, {"ABC", 2}, {"ABC", 3}" -- и будет трудно решить, с какого кортежа "ABC" возобновлять поиск. Таким образом, если найденное поле индекса совпадает с предыдущим найденным полем индекса, цикл не прерывается.

source: NOTE #7 "INNER LOOP: ADD TO RESULT SET IF PATTERN MATCHES" |br| Compare the result's index field to the entire pattern. For example, suppose that the caller passed pattern "ABC.E" and there is an indexed field containing "ABCDE". Therefore the initial index search key is "ABC". Therefore a tuple containing an indexed field with "ABCDE" will be found by the iterator, because "ABCDE" > "ABC". In that case string.match will return a value which is not nil. Therefore this tuple can be added to the result set.
ru: ПРИМЕЧАНИЕ №7 "ВНУТРЕННИЙ ЦИКЛ: ДОБАВЛЕНИЕ В РЕЗУЛЬТАТ, ЕСЛИ ШАБЛОН СОВПАДЕТ" |br| Сравнение найденного поля индекса с шаблоном. Например, предположим, что вызывающий клиент передает шаблон "ABC.E", и существует поле индекса, содержащее "ABCDE". В таком случае, начальный ключ поиска будет "ABC". Таким образом, кортеж, содержащий поле индекса с "ABCDE" будет обнаружен итератором, поскольку "ABCDE" > "ABC". В этом случае, string.match вернет значение, отличное от нулевого nil. В итоге, этот кортеж можно добавить в результирующий набор данных.

source: NOTE #8 "OUTER LOOP: BREAK, OR YIELD AND CONTINUE" |br| There are three conditions which will cause a break from the inner loop: (1) the for loop ends naturally because there are no more index keys which are greater than or equal to the index search key, (2) the index key is too great as described in NOTE #5, (3) it is time for a yield as described in NOTE #6. If condition (1) or condition (2) is true, then there is nothing more to do, the outer loop ends too. If and only if condition (3) is true, the outer loop must yield and then continue. If it does continue, then the inner loop -- the iterator search -- will happen again with a new value for the index search key.
ru: ПРИМЕЧАНИЕ №8 "ВНЕШНИЙ ЦИКЛ: ПРЕРЫВАНИЕ ИЛИ ПЕРЕДАЧА УПРАВЛЕНИЯ И ПРОДОЛЖЕНИЕ" |br| Существуют три условия, которые вызовут прерывание из внутреннего цикла: (1) цикл for заканчивается закономерно, потому что отсутствуют ключи индекса, которые больше или равны ключу поиска по индексу, (2) ключ индекса слишком большой, как описано в ПРИМЕЧАНИИ №5, (3) пора передавать управление, как описано в ПРИМЕЧАНИИ №6. Если условие (1) или условие (2) соблюдается, другие действия не требуются, и внешний цикл также заканчивается. Только в том случае, если справедливо условие (3), внешний цикл должен передать управление, а затем продолжить выполнение. Если он продолжит выполнение, то внутренний цикл -- поиск с итератором -- будет выполняться снова с новым значением для ключа поиска по индексу.

source: EXAMPLE:
ru: ПРИМЕР:

source: Start Tarantool, cut and paste the code for function ``indexed_pattern_search()``, and try the following:
ru: Запустите Tarantool, скопируйте и вставьте код для функции ``indexed_pattern_search()`` и попробуйте выполнить следующее:

source: For smaller feature changes and bug fixes, see closed `milestones <https://github.com/tarantool/tarantool/milestones?state=closed>`_ at GitHub.
ru: Более мелкие изменения и исправления дефектов указаны в отчетах о `выпущенных стабильных релизах (milestone = closed) <https://github.com/tarantool/tarantool/milestones?state=closed>`_ на GitHub.

source: Functionality added or changed:
ru: Изменения или добавления функциональности:

source: Version 1.7
ru: Версия 1.7

source: **Release 1.7.6**
ru: **Версия 1.7.6**

source: Release type: stable. Release date: 2017-11-07. Tag: 1.7.6-0-g7b2945d6c.
ru: Тип версии: стабильная. Дата выхода: 2017-11-07. Тег: 1.7.6-0-g7b2945d6c.

source: Announcement: https://groups.google.com/forum/#!topic/tarantool/hzc7O2YDZUc.
ru: Объявление о выходе: https://groups.google.com/forum/#!topic/tarantool/hzc7O2YDZUc.

source: This is the next stable release in the 1.7 series. It resolves more than 75 issues since 1.7.5.
ru: Данная сборка представляет собой очередную стабильную версию в серии 1.7. Это обновление содержит более 75 исправлений по сравнению с версией 1.7.5.

source: What's new in Tarantool 1.7.6?
ru: Что нового в Tarantool 1.7.6?

source: In addition to :ref:`rollback <box-rollback>` of a transaction, there is now rollback to a defined point within a transaction -- :ref:`savepoint <box-savepoint>` support.
ru: В дополнение к :ref:`откату <box-rollback>` транзакции, появился откат на определенную точку в пределах транзакции -- поддержка :ref:`точки сохранения <box-savepoint>`.

source: There is a new object type: :ref:`sequences <index-box_sequence>`. The older option, :ref:`auto-increment <box_space-auto_increment>`, will be deprecated.
ru: Появился новый объектный тип: :ref:`последовательности <index-box_sequence>`. Устаревший вариант, :ref:`автоматическое увеличение <box_space-auto_increment>`, объявлен устаревшим.

source: String indexes can have :ref:`collations <index-collation>`.
ru: В строковых индексах появилась :ref:`сортировка <index-collation>`.

source: New options are available for:
ru: Добавлены новые опции:

source: :ref:`net_box <net_box-module>` (timeouts),
ru: :ref:`net_box <net_box-module>` (время ожидания),

source: :ref:`string <string-module>` functions,
ru: функции :ref:`string <string-module>`,

source: space :ref:`formats <box_space-format>` (user-defined field names and types),
ru: :ref:`форматы <box_space-format>` для спейса (имена и типы полей, задаваемые пользователем),

source: :ref:`base64 <digest-base64_encode>` (``urlsafe`` option), and
ru: :ref:`base64 <digest-base64_encode>` (опция ``urlsafe``), а также

source: index :ref:`creation <box_space-create_index>` (collation, :ref:`is-nullable <box_space-is_nullable>`, field names).
ru: :ref:`создание <box_space-create_index>` индекса (сортировка, :ref:`is-nullable <box_space-is_nullable>` (возможность допустить неопределенное значение), имена полей).

source: Incompatible changes:
ru: Несовместимые изменения:

source: Vinyl: introduced gap locks in Vinyl transaction manager. The new locking mechanism in Vinyl TX manager reduces the number of conflicts in transactions. Issue `2671 <https://github.com/tarantool/tarantool/issues/2671>`_.
ru: Vinyl: появляется блокировка разрывов в менеджере транзакций Vinyl'а. Новый блокирующий механизм в менеджере Vinyl TX снижает количестве конфликтов в транзакциях. Проблема `2671 <https://github.com/tarantool/tarantool/issues/2671>`_.

source: Log conflicted keys in master-master replication. Issue `2779 <https://github.com/tarantool/tarantool/issues/2779>`_.
ru: Запись конфликтов в ключах в журнал в рамках репликации мастер-мастер. Проблема `2779 <https://github.com/tarantool/tarantool/issues/2779>`_.

source: Implemented ``tarantoolctl rocks make *.spec``. Issue `2846 <https://github.com/tarantool/tarantool/issues/2846>`_.
ru: Реализована возможность создания сторонних библиотек ``tarantoolctl rocks make *.spec``. Проблема `2846 <https://github.com/tarantool/tarantool/issues/2846>`_.

source: Extended the default loader to look for ``.rocks`` in the parent dir hierarchy. Issue `2676 <https://github.com/tarantool/tarantool/issues/2676>`_.
ru: Новая функция загрузчика, используемого по умолчанию, позволяет искать модули ``.rocks`` в родительской иерархии. Проблема `2676 <https://github.com/tarantool/tarantool/issues/2676>`_.

source: Partial emulation of LuaSocket on top of Tarantool Socket. Issue `2727 <https://github.com/tarantool/tarantool/issues/2727>`_.
ru: Частичное моделирование LuaSocket поверх Tarantool Socket. Проблема `2727 <https://github.com/tarantool/tarantool/issues/2727>`_.

source: Developer tools:
ru: Инструменты разработчика:
