Repository: tarantool/doc
Catalog: locale/*/LC_MESSAGES/doc.po
Languages: ru

source: These fields are established by :ref:`space.create() <box_schema-space_create>`.
ru: Эти поля определены с помощью :ref:`space.create() <box_schema-space_create>`.

source: The following function will display all simple fields in all tuples of ``_space``.
ru: Следующая функция отобразит все простые поля во всех кортежах спейса ``_space``.

source: Here is what ``example()`` returns in a typical installation:
ru: Вот что при обычной установке вернет ``example()``:

source: The following requests will create a space using ``box.schema.space.create()`` with a :ref:`format clause <box_space-format>`, then retrieve the ``_space`` tuple for the new space. This illustrates the typical use of the ``format`` clause, it shows the recommended names and data types for the fields.
ru: Следующая серия запросов создаст спейс, используя ``box.schema.space.create()`` с :ref:`оператором формата <box_space-format>`, затем выберет кортеж из ``_space`` для нового спейса. Этот пример иллюстрирует стандартное применение оператора ``format``, показывая рекомендованные имена и типы данных для полей.

source: ``_user`` is a system space where user-names and password hashes are stored.
ru: ``_user`` -- это системный спейс, где хранятся имена пользователей и хеши паролей.

source: the numeric id of the tuple ("id"),
ru: числовой идентификатор кортежа ("id"),

source: the numeric id of the tuple’s creator,
ru: числовой идентификатор создателя кортежа,

source: the name,
ru: имя,

source: the type: 'user' or 'role',
ru: тип: 'user' (пользователь) или 'role' (роль),

source: optional password.
ru: пароль по желанию

source: There are five special tuples in the ``_user`` space: 'guest', 'admin', 'public', 'replication', and 'super'.
ru: В спейсе ``_user`` есть пять специальных кортежей: 'guest', 'admin', 'public', 'replication' и 'super'.

source: Default user when connecting remotely. Usually an untrusted user with few privileges.
ru: Пользователь, который используется по умолчанию при удаленном подключении. Как правило, это не заслуживающий доверия пользователь с небольшим количеством прав.

source: Default user when using Tarantool as a console. Usually an :ref:`administrative user <authentication-owners_privileges>` with all privileges.
ru: Пользователь, который используется по умолчанию при работе с Tarantool'ом как с консолью. Как правило, это :ref:`административный пользователь <authentication-owners_privileges>` со всеми правами.

source: role
ru: роль

source: Pre-defined :ref:`role <authentication-roles>`, automatically granted to new users when they are created with ``box.schema.user.create(user-name)``. Therefore a convenient way to grant 'read' on space 't' to every user that will ever exist is with ``box.schema.role.grant('public','read','space','t')``.
ru: Заданная :ref:`роль <authentication-roles>`, которая автоматически выдается новым пользователям при их создании методом ``box.schema.user.create(имя-пользователя)``. Таким образом, лучше всего выдать права на чтение 'read' спейса 't' каждому когда-либо созданному пользователю с помощью ``box.schema.role.grant('public','read','space','t')``.

source: Pre-defined :ref:`role <authentication-roles>`, which the 'admin' user can grant to users who need to use :ref:`replication <replication>` features.
ru: Заданная :ref:`роль <authentication-roles>`, выдаваемая пользователем 'admin' другим пользователям для использования функций :ref:`репликации <replication>`.

source: Pre-defined :ref:`role <authentication-roles>`, which the 'admin' user can grant to users who need all privileges on all objects. The 'super' role has these privileges on 'universe': read, write, execute, create, drop, alter.
ru: Заданная :ref:`роль <authentication-roles>`, выдаваемая пользователем 'admin' другим пользователям для получения всех прав на все объекты. Для роли 'super' такие права выданы на 'universe': чтение, запись, выполнение, создание, удаление, изменение.

source: To select a tuple from the ``_user`` space, use ``box.space._user:select()``. For example, here is what happens with a select for user id = 0, which is the 'guest' user, which by default has no password:
ru: Чтобы выбрать кортеж из спейса ``_user``, используйте ``box.space._user:select()``. Например, при выборке от пользователя с id = 0, который является пользователем 'guest' без пароля по умолчанию, произойдет следующее:

source: To change tuples in the ``_user`` space, do not use ordinary ``box.space`` functions for insert or update or delete. The ``_user`` space is special, so there are special functions which have appropriate error checking.
ru: Чтобы изменить кортежи в спейсе ``_user``, не пользуйтесь стандартными функциями ``box.space`` для вставки, обновления или удаления. Речь идет об особом спейсе ``_user``, поэтому есть особые функции с соответствующей проверкой на ошибки.

source: To create a new user, use :ref:`box.schema.user.create() <box_schema-user_create>`:
ru: Чтобы создать нового пользователя, используйте :ref:`box.schema.user.create() <box_schema-user_create>`:

source: box.schema.user.create(*user-name*) box.schema.user.create(*user-name*, {if_not_exists = true}) box.schema.user.create(*user-name*, {password = *password*})
ru: box.schema.user.create(*имя-пользователя*) box.schema.user.create(*имя-пользователя*, {if_not_exists = true}) box.schema.user.create(*имя-пользователя*, {password = *пароль*})

source: To change the user's password, use :ref:`box.schema.user.password() <box_schema-user_password>`:
ru: Чтобы изменить пароль пользователя, воспользуйтесь :ref:`box.schema.user.password() <box_schema-user_password>`:

source: -- To change the current user's password box.schema.user.passwd(*password*) -- To change a different user's password -- (usually only 'admin' can do it) box.schema.user.passwd(*user-name*, *password*)
ru: -- Чтобы изменить пароль текущего пользователя box.schema.user.passwd(*пароль*) -- Чтобы изменить пароль другого пользователя -- (обычно это может делать только 'admin') box.schema.user.passwd(*имя-пользователя*, *пароль*)

source: To drop a user, use :ref:`box.schema.user.drop() <box_schema-user_drop>`:
ru: Чтобы удалить пользователя, используйте :ref:`box.schema.user.drop() <box_schema-user_drop>`:

source: box.schema.user.drop(*user-name*)
ru: box.schema.user.drop(*имя-пользователя*)

source: To check whether a user exists, use :ref:`box.schema.user.exists() <box_schema-user_exists>`, which returns ``true`` or ``false``:
ru: Чтобы проверить, существует ли пользователь, воспользуйтесь :ref:`box.schema.user.exists() <box_schema-user_exists>`, которая вернет ``true`` (правда) или ``false`` (ложь):

source: box.schema.user.exists(*user-name*)
ru: box.schema.user.exists(*имя-пользователя*)

source: To find what privileges a user has, use :ref:`box.schema.user.info() <box_schema-user_info>`:
ru: Чтобы узнать, какие права есть у пользователя, используйте :ref:`box.schema.user.info() <box_schema-user_info>`:

source: box.schema.user.info(*user-name*)
ru: box.schema.user.info(*имя-пользователя*)

source: Here is a session which creates a new user with a strong password, selects a tuple in the ``_user`` space, and then drops the user.
ru: Ниже представлена сессия, в рамках которой создается новый пользователь с надежным паролем, выбирается кортеж из спейса ``_user``, а затем пользователь удаляется.

source: Example: using box.space functions to read _space tuples
ru: Пример: использование функций box.space для чтения кортежей из _space

source: This function will illustrate how to look at all the spaces, and for each display: approximately how many tuples it contains, and the first field of its first tuple. The function uses Tarantool ``box.space`` functions ``len()`` and ``pairs()``. The iteration through the spaces is coded as a scan of the ``_space`` system space, which contains metadata. The third field in ``_space`` contains the space name, so the key instruction ``space_name = v[3]`` means ``space_name`` is the ``space_name`` field in the tuple of ``_space`` that we've just fetched with ``pairs()``. The function returns a table:
ru: Функция ниже проиллюстрирует, как обращаться ко всем спейсам, и для каждого отобразит примерное количество кортежей и первое поле первого кортежа. В данной функции используются функции из ``box.space`` в Tarantool'е: ``len()`` и ``pairs()``. Итерация по спейсам закодирована в форме сканирования системного спейса ``_space``, который содержит метаданные. Третье поле в ``_space`` содержит имя спейса, поэтому ключевая команда ``space_name = v[3]`` означает, что ``space_name`` -- это поле ``space_name`` в кортеже ``_space``, который мы только что получили с помощью ``pairs()``. Функция возвращает таблицу:

source: And here is what happens when one invokes the function:
ru: А вот что происходит, когда вызывается функция:

source: Example: using box.space functions to organize a _space tuple
ru: Пример: использование функций box.space для организации кортежа из _space

source: The objective is to display field names and field types of a system space -- using metadata to find metadata.
ru: Основная цель -- отобразить имена и типы полей системного спейса, то есть использование метаданных для поиска метаданных.

source: However, the retrieved tuple is not easy to read:
ru: Однако непросто прочитать информацию из полученного кортежа:

source: It looks disorganized because field number 7 has been formatted with recommended names and data types. How can one get those specific sub-fields? Since it's visible that field number 7 is an array of maps, this `for` loop will do the organizing:
ru: Информация подается бессистемно, поскольку по формату поле №7 содержит рекомендованные имена и типы данных. Как же получить эти данные? Поскольку очевидно, что поле №7 представляет собой ассоциативный массив, цикл `for` проведет организацию данных:

source: Example: using data operations
ru: Пример: использование операций с данными

source: This example demonstrates all legal scenarios -- as well as typical errors -- for each :ref:`data operation <index-box_data-operations>` in Tarantool: :ref:`INSERT <box_space-operations-insert>`, :ref:`DELETE <box_space-operations-delete>`, :ref:`UPDATE <box_space-operations-update>`, :ref:`UPSERT <box_space-operations-upsert>`, :ref:`REPLACE <box_space-operations-replace>`, and :ref:`SELECT <box_space-operations-select>`.
ru: Пример ниже иллюстрирует все возможные сценарии -- а также типичные ошибки -- для всех :ref:`операций с данными <index-box_data-operations>` в Tarantool'е: :ref:`INSERT <box_space-operations-insert>`, :ref:`DELETE <box_space-operations-delete>`, :ref:`UPDATE <box_space-operations-update>`, :ref:`UPSERT <box_space-operations-upsert>`, :ref:`REPLACE <box_space-operations-replace>` и :ref:`SELECT <box_space-operations-select>`.

source: -- Bootstrap the database -- box.cfg{} format = {} format[1] = {'field1', 'unsigned'} format[2] = {'field2', 'unsigned'} format[3] = {'field3', 'unsigned'} s = box.schema.create_space('test', {format = format}) -- Create a primary index -- pk = s:create_index('pk', {parts = {{'field1'}}}) -- Create a unique secondary index -- sk_uniq = s:create_index('sk_uniq', {parts = {{'field2'}}}) -- Create a non-unique secondary index -- sk_non_uniq = s:create_index('sk_non_uniq', {parts = {{'field3'}}, unique = false})
ru: -- Настройка базы данных -- box.cfg{} format = {} format[1] = {'field1', 'unsigned'} format[2] = {'field2', 'unsigned'} format[3] = {'field3', 'unsigned'} s = box.schema.create_space('test', {format = format}) -- Создание первичного индекса -- pk = s:create_index('pk', {parts = {{'field1'}}}) -- Создание уникального вторичного индекса -- sk_uniq = s:create_index('sk_uniq', {parts = {{'field2'}}}) -- Создание неуникального вторичного индекса -- sk_non_uniq = s:create_index('sk_non_uniq', {parts = {{'field3'}}, unique = false})

source: ``insert`` accepts a well-formatted tuple and checks all keys for duplicates.
ru: Операция ``insert`` (вставка) работает с кортежами с четким форматом и проверяет все ключи на наличие совпадений.

source: tarantool> -- Unique indexes: ok -- tarantool> s:insert({1, 1, 1}) --- - [1, 1, 1] ... tarantool> -- Conflicting primary key: error -- tarantool> s:insert({1, 1, 1}) --- - error: Duplicate key exists in unique index 'pk' in space 'test' ... tarantool> -- Conflicting unique secondary key: error -- tarantool> s:insert({2, 1, 1}) --- - error: Duplicate key exists in unique index 'sk_uniq' in space 'test' ... tarantool> -- Key {1} exists in sk_non_uniq index, but it is not unique: ok -- tarantool> s:insert({2, 2, 1}) --- - [2, 2, 1] ... tarantool> s:truncate() --- ...
ru: tarantool> -- Уникальные индексы: разрешено -- tarantool> s:insert({1, 1, 1}) --- - [1, 1, 1] ... tarantool> -- Конфликт первичного ключа: ошибка -- tarantool> s:insert({1, 1, 1}) --- - error: Duplicate key exists in unique index 'pk' in space 'test' ... tarantool> -- Конфликт уникального вторичного ключа: ошибка -- tarantool> s:insert({2, 1, 1}) --- - error: Duplicate key exists in unique index 'sk_uniq' in space 'test' ... tarantool> -- Ключ {1} присутствует в индексе sk_non_uniq, но он не уникален: разрешено -- tarantool> s:insert({2, 2, 1}) --- - [2, 2, 1] ... tarantool> s:truncate() --- ...

source: ``delete`` accepts a full key of any unique index.
ru: ``delete`` (удаление) работает с полными ключами любого уникального индекса.

source: ``space:delete`` is an alias for "delete by primary key".
ru: ``space:delete`` -- это псевдоним для операции "удалить по первичному ключу".

source: tarantool> -- Insert some test data -- tarantool> s:insert{3, 4, 5} --- - [3, 4, 5] ... tarantool> s:insert{6, 7, 8} --- - [6, 7, 8] ... tarantool> s:insert{9, 10, 11} --- - [9, 10, 11] ... tarantool> s:insert{12, 13, 14} --- - [12, 13, 14] ... tarantool> -- Nothing done here: no {4} key in pk index -- tarantool> s:delete{4} --- ... tarantool> s:select{} --- - - [3, 4, 5] - [6, 7, 8] - [9, 10, 11] - [12, 13, 14] ... tarantool> -- Delete by a primary key: ok -- tarantool> s:delete{3} --- - [3, 4, 5] ... tarantool> s:select{} --- - - [6, 7, 8] - [9, 10, 11] - [12, 13, 14] ... tarantool> -- Explicitly delete by a primary key: ok -- tarantool> s.index.pk:delete{6} --- - [6, 7, 8] ... tarantool> s:select{} --- - - [9, 10, 11] - [12, 13, 14] ... tarantool> -- Delete by a unique secondary key: ok -- s.index.sk_uniq:delete{10} --- - [9, 10, 11] ... s:select{} --- - - [12, 13, 14] ... tarantool> -- Delete by a non-unique secondary index: error -- tarantool> s.index.sk_non_uniq:delete{14} --- - error: Get() doesn't support partial keys and non-unique indexes ... tarantool> s:select{} --- - - [12, 13, 14] ... tarantool> s:truncate() --- ...
ru: tarantool> -- Вставить некоторые тестовые данные -- tarantool> s:insert{3, 4, 5} --- - [3, 4, 5] ... tarantool> s:insert{6, 7, 8} --- - [6, 7, 8] ... tarantool> s:insert{9, 10, 11} --- - [9, 10, 11] ... tarantool> s:insert{12, 13, 14} --- - [12, 13, 14] ... tarantool> -- Здесь ничего не происходит: нет ключа {4} в индексе pk -- tarantool> s:delete{4} --- ... tarantool> s:select{} --- - - [3, 4, 5] - [6, 7, 8] - [9, 10, 11] - [12, 13, 14] ... tarantool> -- Удалить по первичному ключу: разрешено -- tarantool> s:delete{3} --- - [3, 4, 5] ... tarantool> s:select{} --- - - [6, 7, 8] - [9, 10, 11] - [12, 13, 14] ... tarantool> -- Точно удалить по первичному ключу: разрешено -- tarantool> s.index.pk:delete{6} --- - [6, 7, 8] ... tarantool> s:select{} --- - - [9, 10, 11] - [12, 13, 14] ... tarantool> -- Удалить по уникальному вторичному ключу: разрешено -- s.index.sk_uniq:delete{10} --- - [9, 10, 11] ... s:select{} --- - - [12, 13, 14] ... tarantool> -- Удалить по неуникальному вторичному индексу: ошибка -- tarantool> s.index.sk_non_uniq:delete{14} --- - error: Get() doesn't support partial keys and non-unique indexes ... tarantool> s:select{} --- - - [12, 13, 14] ... tarantool> s:truncate() --- ...

source: The key must be full: ``delete`` cannot work with partial keys.
ru: Ключ должен быть полным: операция ``delete`` не работает с компонентами ключа.

source: tarantool> s2 = box.schema.create_space('test2') --- ... tarantool> pk2 = s2:create_index('pk2', {parts = {{1, 'unsigned'}, {2, 'unsigned'}}}) --- ... tarantool> s2:insert{1, 1} --- - [1, 1] ... tarantool> -- Delete by a partial key: error -- tarantool> s2:delete{1} --- - error: Invalid key part count in an exact match (expected 2, got 1) ... tarantool> -- Delete by a full key: ok -- tarantool> s2:delete{1, 1} --- - [1, 1] ... tarantool> s2:select{} --- - [] ... tarantool> s2:drop() --- ...
ru: tarantool> s2 = box.schema.create_space('test2') --- ... tarantool> pk2 = s2:create_index('pk2', {parts = {{1, 'unsigned'}, {2, 'unsigned'}}}) --- ... tarantool> s2:insert{1, 1} --- - [1, 1] ... tarantool> -- Удалить по компоненту ключа: ошибка -- tarantool> s2:delete{1} --- - error: Invalid key part count in an exact match (expected 2, got 1) ... tarantool> -- Удалить по ключу целиком: разрешено -- tarantool> s2:delete{1, 1} --- - [1, 1] ... tarantool> s2:select{} --- - [] ... tarantool> s2:drop() --- ...

source: Similarly to ``delete``, ``update`` accepts a full key of any unique index, and also the operations to execute.
ru: Как и ``delete``, ``update`` работает с полными ключами любого уникального индекса, а также выполняет операции.

source: ``space:update`` is an alias for "update by primary key".
ru: ``space:update`` -- это псевдоним для операции "обновить по первичному ключу".

source: tarantool> -- Insert some test data -- tarantool> s:insert{3, 4, 5} --- - [3, 4, 5] ... tarantool> s:insert{6, 7, 8} --- - [6, 7, 8] ... tarantool> s:insert{9, 10, 11} --- - [9, 10, 11] ... tarantool> s:insert{12, 13, 14} --- - [12, 13, 14] ... tarantool> -- Nothing done here: no {4} key in pk index -- s:update({4}, {{'=', 2, 400}}) --- ... tarantool> s:select{} --- - - [3, 4, 5] - [6, 7, 8] - [9, 10, 11] - [12, 13, 14] ... tarantool> -- Update by a primary key: ok -- tarantool> s:update({3}, {{'=', 2, 400}}) --- - [3, 400, 5] ... tarantool> s:select{} --- - - [3, 400, 5] - [6, 7, 8] - [9, 10, 11] - [12, 13, 14] ... tarantool> -- Explicitly update by a primary key: ok -- tarantool> s.index.pk:update({6}, {{'=', 2, 700}}) --- - [6, 700, 8] ... tarantool> s:select{} --- - - [3, 400, 5] - [6, 700, 8] - [9, 10, 11] - [12, 13, 14] ... tarantool> -- Update by a unique secondary key: ok -- tarantool> s.index.sk_uniq:update({10}, {{'=', 2, 1000}}) --- - [9, 1000, 11] ... tarantool> s:select{} --- - - [3, 400, 5] - [6, 700, 8] - [9, 1000, 11] - [12, 13, 14] ... tarantool> -- Update by a non-unique secondary key: error -- tarantool> s.index.sk_non_uniq:update({14}, {{'=', 2, 1300}}) --- - error: Get() doesn't support partial keys and non-unique indexes ... tarantool> s:select{} --- - - [3, 400, 5] - [6, 700, 8] - [9, 1000, 11] - [12, 13, 14] ... tarantool> s:truncate() --- ...
ru: tarantool> -- Вставить некоторые тестовые данные -- tarantool> s:insert{3, 4, 5} --- - [3, 4, 5] ... tarantool> s:insert{6, 7, 8} --- - [6, 7, 8] ... tarantool> s:insert{9, 10, 11} --- - [9, 10, 11] ... tarantool> s:insert{12, 13, 14} --- - [12, 13, 14] ... tarantool> -- Здесь ничего не происходит: нет ключа {4} в индексе pk -- s:update({4}, {{'=', 2, 400}}) --- ... tarantool> s:select{} --- - - [3, 4, 5] - [6, 7, 8] - [9, 10, 11] - [12, 13, 14] ... tarantool> -- Обновить по первичному ключу: разрешено -- tarantool> s:update({3}, {{'=', 2, 400}}) --- - [3, 400, 5] ... tarantool> s:select{} --- - - [3, 400, 5] - [6, 7, 8] - [9, 10, 11] - [12, 13, 14] ... tarantool> -- Точно обновить по первичному ключу: разрешено -- tarantool> s.index.pk:update({6}, {{'=', 2, 700}}) --- - [6, 700, 8] ... tarantool> s:select{} --- - - [3, 400, 5] - [6, 700, 8] - [9, 10, 11] - [12, 13, 14] ... tarantool> -- Обновить по уникальному вторичному ключу: разрешено -- tarantool> s.index.sk_uniq:update({10}, {{'=', 2, 1000}}) --- - [9, 1000, 11] ... tarantool> s:select{} --- - - [3, 400, 5] - [6, 700, 8] - [9, 1000, 11] - [12, 13, 14] ... tarantool> -- Обновить по неуникальному вторичному ключу: ошибка -- tarantool> s.index.sk_non_uniq:update({14}, {{'=', 2, 1300}}) --- - error: Get() doesn't support partial keys and non-unique indexes ... tarantool> s:select{} --- - - [3, 400, 5] - [6, 700, 8] - [9, 1000, 11] - [12, 13, 14] ... tarantool> s:truncate() --- ...

source: ``upsert`` accepts a well-formatted tuple and update operations.
ru: ``upsert`` (обновление и вставка) работает с кортежами с четким форматом и выполняет операции обновления.

source: If an old tuple is found by the primary key of the specified tuple, then the update operations are applied to the old tuple, and the new tuple is ignored.
ru: Если найден старый кортеж по первичному ключу, то операции обновления применяются к старому кортежу, а новый кортеж игнорируется.

source: If no old tuple is found, then the new tuple is inserted, and the update operations are **ignored**.
ru: Если старый кортеж не найден, то происходит вставка нового кортежа, а операции обновления **игнорируются**.

source: Indexes have no ``upsert`` method - this is a method of a space.
ru: Для индексов нет метода ``upsert`` -- это метод для спейса.

source: tarantool> s.index.pk.upsert == nil --- - true ... tarantool> s.index.sk_uniq.upsert == nil --- - true ... tarantool> s.upsert ~= nil --- - true ... tarantool> -- As the first argument, upsert accepts -- tarantool> -- a well-formatted tuple, NOT a key! -- tarantool> s:insert{1, 2, 3} --- - [1, 2, 3] ... tarantool> s:upsert({1}, {{'=', 2, 200}}) --- - error: Tuple field count 1 is less than required by space format or defined indexes (expected at least 3) ... tarantool> s:select{} --- - - [1, 2, 3] ... tarantool> s:delete{1} --- - [1, 2, 3] ...
ru: tarantool> s.index.pk.upsert == nil --- - true ... tarantool> s.index.sk_uniq.upsert == nil --- - true ... tarantool> s.upsert ~= nil --- - true ... tarantool> -- В качестве первого аргумента upsert принимает -- tarantool> -- кортеж с четким форматом, НЕ ключ! -- tarantool> s:insert{1, 2, 3} --- - [1, 2, 3] ... tarantool> s:upsert({1}, {{'=', 2, 200}}) --- - error: Tuple field count 1 is less than required by space format or defined indexes (expected at least 3) ... tarantool> s:select{} --- - - [1, 2, 3] ... tarantool> s:delete{1} --- - [1, 2, 3] ...

source: ``upsert`` turns into ``insert`` when no old tuple is found by the primary key.
ru: ``upsert`` превращается в ``insert``, когда старый кортеж не найден по первичному ключу.

source: tarantool> s:upsert({1, 2, 3}, {{'=', 2, 200}}) --- ... tarantool> -- As you can see, {1, 2, 3} were inserted, -- tarantool> -- and the update operations were not applied. -- s:select{} --- - - [1, 2, 3] ... tarantool> -- Performing another upsert with the same primary key, -- tarantool> -- but different values in the other fields. -- s:upsert({1, 20, 30}, {{'=', 2, 200}}) --- ... tarantool> -- The old tuple was found by the primary key {1} -- tarantool> -- and update operations were applied. -- tarantool> -- The new tuple was ignored. -- tarantool> s:select{} --- - - [1, 200, 3] ...
ru: tarantool> s:upsert({1, 2, 3}, {{'=', 2, 200}}) --- ... tarantool> -- Как можно увидеть, произошла вставка {1, 2, 3}, -- tarantool> -- а операции обновления не применились. -- s:select{} --- - - [1, 2, 3] ... tarantool> -- Еще одна операция upsert с тем же первичным ключом, -- tarantool> -- но другими значениями прочих полей. -- s:upsert({1, 20, 30}, {{'=', 2, 200}}) --- ... tarantool> -- Старый кортеж был найден по первичному ключу {1}, -- tarantool> -- и применились операции обновления. -- tarantool> -- Новый кортеж игнорируется. -- tarantool> s:select{} --- - - [1, 200, 3] ...
