Repository: tarantool/doc
Catalog: locale/*/LC_MESSAGES/enterprise/admin.po
Languages: ru

source: Cluster administrator's guide
ru: Руководство администратора кластера

source: This guide focuses on Enterprise-specific administration features available on top of Tarantool Community Edition with Tarantool Cartridge framework:
ru: В этом руководстве особое внимание уделяется функциям разработчика, специфичным для Enterprise-версии, которые доступны в дополнение к версии Tarantool с открытым исходным кодом в среде Tarantool Cartridge:

source: :ref:`space explorer <space_explorer>`
ru: :ref:`проводник спейсов <space_explorer>`

source: :ref:`upgrade of environment-independent applications in production <enterprise-production-upgrade>`
ru: :ref:`обновление независимых от среды приложений на рабочих серверах <enterprise-production-upgrade>`

source: Otherwise, consult the following documentation for:
ru: Либо обратитесь к следующей документации чтобы получить:

source: basic information on `deploying and managing a Tarantool cluster </book/cartridge/cartridge_admin/>`_
ru: базовую информацию о `развертывании и управлении Tarantool-кластером </book/cartridge/cartridge_admin/>`_

source: more information on `managing Tarantool instances </book/admin/>`_.
ru: дополнительную информацию об `управлении экземплярами Tarantool </book/admin/>`_

source: Exploring spaces
ru: Анализ спейсов

source: The web interface lets you connect (in the browser) to any instance in the cluster and see what spaces it stores (if any) and their contents.
ru: Веб-интерфейс позволяет подключиться к любому экземпляру в кластере в браузере, чтобы проверить, какие в нем хранятся спейсы (если они есть) и их содержимое.

source: To explore spaces:
ru: Чтобы просмотреть спейсы:

source: Open the **Space Explorer** tab in the menu on the left:
ru: Откройте вкладку **Space Explorer** (Проводник спейсов) в меню слева:

source: Click **connect** next to an instance that stores data. The basic sanity-check (``test.py``) of the example application puts sample data to one replica set (shard), so its master and replica store the data in their spaces:
ru: Нажмите **connect** (подключиться) рядом с экземпляром, в котором хранятся данные. Базовая проверка работоспособности (``test.py``) из примера приложения размещает образцы данных в одном наборе реплик (шарде), поэтому его мастер и реплика хранят данные в своих спейсах:

source: When connected to a instance, the space explorer shows a table with basic information on its spaces. For more information, see the `box.space reference </reference/reference_lua/box_space>`_.
ru: При подключении к экземпляру проводник спейсов отображает таблицу с базовой информацией по спейсам. Для получения дополнительной информации см. `справочник по box.space </reference/reference_lua/box_space>`_.

source: To see hidden spaces, tick the corresponding checkbox:
ru: Чтобы просмотреть скрытые спейсы, отметьте соответствующий флажок:

source: Click the space's name to see its format and contents:
ru: Нажмите на имя спейса, чтобы увидеть информацию о его формате и содержимом:

source: To search the data, select an index and, optionally, its iteration type from the drop-down lists, and enter the index value:
ru: Для поиска данных выберите индекс и (необязательно) его тип итерации из выпадающего списка и введите значение индекса:

source: Upgrading in production
ru: Обновление в эксплуатационной среде

source: To upgrade either a single instance or a cluster, you need a new version of the packaged (archived) application.
ru: Чтобы выполнить обновление отдельного экземпляра или кластера, необходима новая версия пакетного (или архивированного) приложения.

source: A single instance upgrade is simple:
ru: Обновить отдельный экземпляр просто:

source: Upload the package (archive) to the server.
ru: Загрузите пакет (архив) на сервер.

source: Stop the current instance.
ru: Остановите текущий экземпляр.

source: Deploy the new one as described in :ref:`deploying packaged applications <enterprise-packaged-app>` (or :ref:`archived ones <enterprise-archived-app>`).
ru: Разверните новый экземпляр, как описано в разделе о развертывании :ref:`пакетных приложений <enterprise-packaged-app>` (или :ref:`архивированных <enterprise-archived-app>`).

source: Cluster upgrade
ru: Обновление кластера

source: To upgrade a cluster, choose one of the following scenarios:
ru: Чтобы обновить кластер, выберите один из следующих сценариев:

source: **Cluster shutdown**. Recommended for backward-incompatible updates, requires downtime.
ru: **Завершение работы кластера**. Рекомендуется для обновлений без обратной совместимости, требует простоя.

source: **Instance by instance**. Recommended for backward-compatible updates, does not require downtime.
ru: **Поочередное обновление**. Рекомендуется для обновлений с обратной совместимостью, не требует простоя.

source: To upgrade the cluster, do the following:
ru: Чтобы обновить кластер, выполните следующие действия:

source: Schedule a downtime or plan for the instance-by-instance upgrade.
ru: Запланируйте время простоя или поочередное обновление экземпляров.

source: Upload a new application package (archive) to all servers.
ru: Загрузите новый пакет (или архив) приложения на все серверы.

source: Next, execute the chosen scenario:
ru: Далее действуйте по выбранному сценарию:

source: **Cluster shutdown**:
ru: **Завершение работы кластера**:

source: Stop all instances on all servers.
ru: Остановите все экземпляры на всех серверах.

source: Deploy the new package (archive) on every server.
ru: Разверните новый пакет (архив) на каждом сервере.

source: **Instance by instance**. Do the following in every replica set in succession:
ru: **Поочередное обновление**. Выполните следующие действия для каждого набора реплик поочередно:

source: Stop a replica on any server.
ru: Остановите реплику на любом сервере.

source: Deploy the new package (archive) in place of the old replica.
ru: Разверните новый пакет (архив) на месте старой реплики.

source: Promote the new replica to a master (see `Switching the replica set's master</book/cartridge/cartridge_admin/#switching-the-replica-set-s-master>`_ section in the Tarantool manual).
ru: Переведите новую реплику в статус мастера (см. раздел `Смена мастера в наборе реплик </book/cartridge/cartridge_admin/#switching-the-replica-set-s-master>`_ в руководстве по Tarantool).

source: Redeploy the old master and the rest of the instances in the replica set.
ru: Повторно разверните старый мастер и остальные экземпляры в наборе реплик.

source: Be prepared to resolve possible logic conflicts.
ru: Будьте готовы решать возможные проблемы с логикой.
