Repository: tarantool/doc
Catalog: locale/*/LC_MESSAGES/enterprise/audit.po
Languages: ru

source: Security audit
ru: Аудит безопасности

source: This document will help you audit the security of a Tarantool Enterprise Edition's cluster. It explains certain security aspects, their rationale, and the ways to check them. For details on how to configure Tarantool Enterprise Edition and its infrastructure for each aspect, refer to the :doc:`security hardening guide <security>`.
ru: В этом документе рассказано, как провести аудит безопасности кластера Tarantool Enterprise. Здесь рассмотрены различные аспекты защиты, их смысл, а также способы проверки. Подробнее о том, как настроить Tarantool Enterprise и его инфраструктуру, вы узнаете из :doc:`инструкций по повышению безопасности <security>`.

source: Encryption of external iproto traffic
ru: Шифрование внешнего трафика iproto

source: Tarantool uses the :doc:`iproto binary protocol </dev_guide/internals/box_protocol>` for replicating data between instances and also in the connector libraries. Iproto doesn't have built-in encryption. All iproto connections between data centers must use a separate encryption mechanism, such as a VPN.
ru: В Tarantool используется :doc:`бинарный протокол iproto </dev_guide/internals/box_protocol>` для репликации данных между экземплярами, а также в библиотеках коннекторов. У iproto нет встроенной системы шифрования. Все соединения iproto с дата-центрами должны быть зашифрованы, например через отдельное VPN-соединение.

source: Closed iproto ports
ru: Закрытые порты iproto

source: When a Tarantool cluster does not use iproto for external requests, connections to the iproto ports should be allowed only between Tarantool instances.
ru: Если в кластере Tarantool не используется iproto для внешних запросов, подключение к портам iproto должно разрешаться только между экземплярами Tarantool.

source: For more details on configuring ports for iproto, see the ``advertise_uri`` section in the Cartridge documentation.
ru: Подробнее о настройке портов для iproto см. в разделе ``advertise_uri`` в документации Cartridge.

source: HTTPS connection termination
ru: Механизм HTTPS termination

source: A Tarantool instance can accept HTTP connections from external services or access the administrative web UI. All such connections must go through an HTTPS-providing web server, running on the same host, such as nginx. This requirement is for both virtual and physical hosts. Running HTTP traffic through a few separate hosts with HTTPS termination is not sufficiently secure.
ru: Экземпляр Tarantool может принимать HTTP-подключения от внешних источников или при доступе к веб-интерфейсу администратора. Все такие подключения должны проходить через веб-сервер с HTTPS, работающий на том же хосте (например, nginx). Это требование относится как к виртуальным, так и к физическим хостам. Проведение HTTP-трафика через несколько отдельных хостов с механизмом HTTPS termination недостаточно безопасно.

source: Closed HTTP ports
ru: Закрытые HTTP-порты

source: Tarantool accepts HTTP connections on a specific port, configured with ``http_port: <number>`` value (see :ref:`configuring Cartridge instances <cartridge-config>`). It must be only available on the same host for nginx to connect to it.
ru: Tarantool принимает HTTP-соединения по определенному порту. Его номер указывается в :ref:`конфигурации экземпляров Cartridge <cartridge-config>`: ``http_port: <число>``. Порт должен быть доступен только на этом хосте для подключения nginx.

source: Check that the configured HTTP port is closed and that the HTTPS port (``443`` by default) is open.
ru: Убедитесь, что настроенный HTTP-порт закрыт, а HTTPS-порт ( по умолчанию ``443``) открыт.

source: Restricted access to the administrative console
ru: Ограниченный доступ к административной консоли

source: The :doc:`console </reference/reference_lua/console>` module provides a way to connect to a running instance and run custom Lua code. This can be useful for development and administration. The following code examples open connections on a TCP port and on a UNIX socket.
ru: Модуль :doc:`console </reference/reference_lua/console>` дает возможность подключиться к рабочему экземпляру и запускать пользовательский код Lua. Это полезная возможность для разработчиков и администраторов. В следующих примерах показано, как открыть соединение по TCP-порту и на UNIX-сокете.

source: Opening an administrative console through a TCP port is always unsafe. Check that there are no calls like ``console.listen(<port_number>)`` in the code.
ru: Открывать административную консоль через TCP-порт всегда небезопасно. Убедитесь, что в коде нет вызовов формата ``console.listen(<port_number>)``.

source: Connecting through a socket requires having the write permission on the ``/var/lib/tarantool`` directory. Check that write permission to this directory is limited to the ``tarantool`` user.
ru: При подключении через сокет требуется право write для директории ``/var/lib/tarantool``. Убедитесь, что оно выдано только пользователю ``tarantool``.

source: Limiting the guest user
ru: Ограничения для пользователя guest

source: Connecting to the instance with ``tarantoolctl connect`` without user credentials (under the ``guest`` user) must be disabled.
ru: Подключение к экземпляру с помощью ``tarantoolctl connect`` без учетных данных (под пользователем ``guest``) необходимо отключить.

source: There are two ways to check this vulnerability:
ru: Есть два способа проверить эту уязвимость:

source: Check that the source code doesn't grant access to the ``guest`` user. The corresponding code can look like this:
ru: Убедитесь, что в исходном коде не предоставляются права доступа пользователю ``guest``. Этот участок кода может выглядеть так:

source: Besides searching for the whole code pattern, search for any entries of ``'universe'``.
ru: Помимо сооветствующего фрагмента кода, ищите все вхождения значения ``'universe'``.

source: Try connecting with ``tarantoolctl connect`` to each Tarantool node.
ru: Попытайтесь подключиться с помощью ``tarantoolctl connect`` к каждому из узлов Tarantool.

source: For more details, refer to the documentation on :doc:`access control </book/box/authentication>`.
ru: Подробнее см. в разделе документации :doc:`Управление доступом </book/box/authentication>`.

source: Authorization in the web UI
ru: Авторизация в веб-интерфейсе

source: Using the web interface must require logging in with a username and password. See more details in the documentation on :ref:`configuring web interface authorization <cartridge-auth-enable>`.
ru: Для входа в веб-интерфейс должны требоваться имя пользователя и пароль. Подробнее см. в разделе документации :ref:`Реализация авторизации в веб-интерфейсе <cartridge-auth-enable>`.

source: Running under the tarantool user
ru: Запуск под пользователем tarantool

source: All Tarantool instances should be running under the ``tarantool`` user.
ru: Все экземпляры Tarantool должны работать под пользователем ``tarantool``.

source: Limiting access to the tarantool user
ru: Ограничение доступа для пользователя tarantool

source: The ``tarantool`` user must be a non-privileged user without the ``sudo`` permission. Also, it must not have a password set to prevent logging in via SSH or ``su``.
ru: Пользователь ``tarantool`` не должен иметь права ``sudo``. Кроме того, у него не должно быть пароля, чтобы не допустить входа через SSH или ``su``.

source: Keeping two or more snapshots
ru: Хранение двух и более снимков данных

source: In order to have a reliable backup, a Tarantool instance must keep two or more latest snapshots. This should be checked on each Tarantool instance.
ru: Для надежности резервного копирования в экземпляре Tarantool должны храниться минимум два последних снимка данных. Не забудьте проверить каждый экземпляр.

source: The :ref:`snapshot_count <cfg_checkpoint_daemon-checkpoint_count>` value determines the number of kept snapshots. Configuration values are primarily set in the configuration files but :doc:`can be overridden </book/cartridge/cartridge_api/modules/cartridge.argparse>` with environment variables and command-line arguments. So, it's best to check both the values in the configuration files and the actual values using the console:
ru: Значение :ref:`snapshot_count <cfg_checkpoint_daemon-checkpoint_count>` определяет количество сохраненных снимков данных. Такие параметры задаются в основном в файлах конфигурации, но :doc:`их могут замещать </book/cartridge/cartridge_api/modules/cartridge.argparse>` переменные окружения и аргументы в командной строке. Так что рекомендуется проверить через консоль как значения в файлах конфигурации, так и фактические значения:

source: Enabled write-ahead logging (WAL)
ru: Включен журнал упреждающей записи (WAL)

source: Tarantool records all incoming data in the write-ahead log (WAL). The WAL must be enabled to ensure that data will be recovered in case of a possible instance restart.
ru: Tarantool фиксирует все входящие данные в журнале упреждающей записи (WAL). WAL должен быть включен, чтобы в случае перезапуска экземпляра эти данные можно было восстановить.

source: Secure values of ``wal_mode`` are ``write`` and ``fsync``:
ru: Безопасные значения ``wal_mode`` -- ``write`` и ``fsync``:

source: An exclusion from this requirement is when the instance is processing data, which can be freely rejected. For example, when Tarantool is used for caching. Then WAL can be disabled to reduce i/o load.
ru: Исключением может быть ситуация, когда экземпляр обрабатывает данные, которые можно удалять: к примеру, когда Tarantool используется для кэширования. В этом случае WAL можно отключить, чтобы снизить нагрузку на ввод/вывод.

source: For more details, see the :ref:`wal_mode reference <cfg_binary_logging_snapshots-wal_mode>`.
ru: Подробнее см. в разделе :ref:`справки по wal_mode <cfg_binary_logging_snapshots-wal_mode>`.

source: The logging level is INFO or higher
ru: Уровень ведения журнала: INFO или выше

source: The logging level should be set to 5 (``INFO``), 6 (``VERBOSE``), or 7 (``DEBUG``). Application logs will then have enough information to research a possible security breach.
ru: Уровень ведения журнала должен быть 5 (``INFO``), 6 (``VERBOSE``) или 7 (``DEBUG``). Тогда в случае нарушения безопасности в журналах приложения будет достаточно информации для расследования инцидента.

source: For a full list of logging levels, see the :ref:`log_level reference <cfg_logging-log_level>`.
ru: Полный список существующих уровней см. в разделе :ref:`справки по log_level <cfg_logging-log_level>`.

source: Logging with journald
ru: Ведение журнала с помощью journald

source: Tarantool should use ``journald`` for logging.
ru: В Tarantool для ведения журнала следует использовать ``journald``.
