Repository: tarantool/doc
Catalog: locale/*/LC_MESSAGES/enterprise/audit_log.po
Languages: ru

source: Audit module
ru: Журнал аудита

source: Audit log provides records on the Tarantool DBMS events in the JSON-format. The following event logs are available:
ru: Журнал аудита содержит записи о событиях СУБД Tarantool в формате JSON. Доступны следующие журналы событий:

source: successful/failed user authentication and authorization,
ru: пройденная/непройденная аутентификация и авторизация пользователя,

source: closed connection,
ru: закрытое соединение,

source: password change,
ru: изменение пароля,

source: creation/deletion of a user/role,
ru: создание/удаление пользователя/роли,

source: enabling/disabling a user,
ru: включение/отключение пользователя,

source: changing privileges of a user/role.
ru: изменение прав пользователя/роли.

source: Log structure
ru: Структура журнала

source: Key
ru: Ключ

source: Type
ru: Тип

source: Description
ru: Описание

source: Example
ru: Пример

source: string
ru: строка

source: type of event
ru: тип события

source: number
ru: число

source: id of event
ru: идентификатор события

source: description of event
ru: описание события

source: time of event
ru: время события

source: remote client
ru: удаленный клиент

source: user
ru: пользователь

source: parameters of event
ru: параметры события

source: see below
ru: см. ниже

source: Events description
ru: Описание события

source: Event
ru: Событие

source: Parameters
ru: Параметры

source: user authorized successfully
ru: авторизация пользователя пройдена

source: user authorization failed
ru: авторизация пользователя не пройдена

source: user logged out or quit the session
ru: пользователь вышел из системы или завершил сеанс

source: failed access attempts to secure data (personal records, details, geolocation, etc.)
ru: неудачные попытки доступа к конфиденциальным данным (личные записи, данные, геолокация и т. д.)

source: creating a user
ru: создание пользователя

source: dropping a user
ru: удаление пользователя

source: disabling a user
ru: отключение пользователя

source: enabling a user
ru: включение пользователя

source: granting (changing) privileges (roles, profiles, etc.) for the user
ru: выдача (изменение) прав (роли, профили и т.д.) пользователю

source: resetting password of the user (the user making changes should be specified)
ru: сброс пароля пользователя (должен быть указан пользователь, который вносит изменения)

source: creating a role
ru: создание роли

source: granting (changing) privileges for the role
ru: выдача (изменение) прав для роли
