Repository: tarantool/doc
Catalog: locale/*/LC_MESSAGES/enterprise/deprecated.po
Languages: ru

source: Deprecated features
ru: Устаревшие функции

source: The ZooKeeper along with ``orchestrator`` are no longer supported. However, they still can be used, if necessary.
ru: Прекращена поддержка ZooKeeper и ``orchestrator``. Тем не менее, при необходимости их можно использовать.

source: The following sections describe the corresponding functionality.
ru: В следующих разделах описаны соответствующие функциональные возможности.

source: Controlling the cluster via API
ru: Управление кластером по API

source: To control the cluster, use the ``orchestrator`` included in the delivery package. The ``orchestrator`` uses ZooKeeper to store and distribute the configuration. The ``orchestrator`` provides the REST API for controlling the cluster. Configurations in the ZooKeeper are changed as a result of calling the ``orchestrator``'s API-functions, which in turn leads to changes in configurations of the Tarantool nodes.
ru: Для управления кластером используйте оркестратор ``orchestrator``, включенный в комплект поставки. ``orchestrator`` использует ZooKeeper для хранения и передачи конфигурации. Для управления кластером в ``orchestrator`` есть REST API. Изменение конфигураций в ZooKeeper осуществляется в результате вызова API-функций из ``orchestrator``, что, в свою очередь, приводит к изменениям конфигурации узлов Tarantool.

source: We recommend using a **curl** command line interface to call the API-functions of the ``orchestrator``.
ru: Мы рекомендуем использовать интерфейс командной строки **curl** для вызова API-функций из ``orchestrator``.

source: The following example shows how to register a new availability zone (DC):
ru: В следующем примере показано, как зарегистрировать новую зону доступности (DC):

source: To check whether the DC registration was successful, try the following instruction. It retrieves the list of all registered nodes in the JSON format:
ru: Чтобы проверить, была ли выполнена регистрация DC, попробуйте использовать следующую команду. Результатом будет список всех зарегистрированных узлов в формате JSON:

source: To apply the new configuration directly on the Tarantool nodes, increase the configuration version number after calling the API function. To do this, use the POST request to ``/api/v1/version``:
ru: Чтобы применить новую конфигурацию непосредственно к узлам Tarantool, увеличьте номер версии конфигурации после вызова API-функции. Для этого используйте запрос POST к ``/api/v1/version``:

source: Altogether, to update the cluster configuration:
ru: В целом, чтобы обновить конфигурацию кластера:

source: See the :ref:`Orchestrator API reference <enterprise_orchestrator_api>` for the detailed orchestrator API.
ru: Для получения дополнительной информации об API оркестратора см. :ref:`Справочник по Orchestrator API <enterprise_orchestrator_api>`.

source: Setting up geo redundancy
ru: Настройка геодублирования

source: Logically, cluster nodes can belong to some availability zone. Physically, an availability zone is a separate DC, or a rack inside a DC. You can specify a matrix of weights (distances) for the availability zones.
ru: По логике узлы кластера могут относиться к некоторой зоне доступности. Физически же зона доступности -- это отдельный DC или стойка внутри DC. Можно задать матрицу весов (расстояний) для зон доступности.

source: New zones are added by calling a corresponding API method of the orchestrator.
ru: Новые зоны добавляются путем вызова соответствующего метода API оркестратора.

source: By default, the matrix of weights (distances) for the zones is not configured, and geo-redundancy for such configurations works as follows:
ru: По умолчанию матрица весов (расстояний) для зон не настроена, а геодублирование для таких конфигураций работает следующим образом:

source: Data is always written to the master.
ru: Данные всегда записываются на мастер.

source: If the master is available, then it is used for reading.
ru: Если мастер доступен, то он используется для чтения.

source: If the master is unavailable, then any available replica is used for reading.
ru: Если мастер недоступен, то любая доступная реплика используется для чтения.

source: When you define a matrix of weights (distances) by calling ``/api/v1/zones/weights``, the automatic scale-out system of the Tarantool DBMS finds a replica which is the closest to the specified router in terms of weights, and starts using this replica for reading. If this replica is not available, then the next nearest replica is selected, taking into account the distances specified in the configuration.
ru: Когда вы задаете матрицу весов (расстояний), вызывая ``/api/v1/zones/weights``, система автоматического масштабирования СУБД Tarantool находит реплику, которая ближе всех к указанному роутеру по весам, и начинает использовать эту реплику для чтения. Если эта реплика недоступна, то выбирается следующая ближайшая реплика с учетом расстояний, указанных в конфигурации.
