Repository: tarantool/doc
Catalog: locale/*/LC_MESSAGES/enterprise/dev.po
Languages: ru

source: Developer's guide
ru: Руководство для разработчика

source: To develop an application, use the Tarantool Cartridge framework that is :ref:`installed <enterprise-install>` as part of Tarantool Enterprise.
ru: Для разработки приложений используйте среду Tarantool Cartridge, которая :ref:`установлена <enterprise-install>` как компонент Tarantool Enterprise.

source: Here is a summary of the commands you need:
ru: Ниже приведен список необходимых команд:

source: Create a cluster-aware application from the template:
ru: Создайте приложение с поддержкой кластеров из шаблона:

source: Develop your application:
ru: Разработайте приложение:

source: Package your application:
ru: Упакуйте приложение:

source: Deploy your application:
ru: Разверните приложение:

source: For ``rpm`` package:
ru: Для пакета ``rpm``:

source: Upload the package to all servers dedicated to Tarantool.
ru: Загрузите пакет на все серверы, выделенные для Tarantool.

source: Install the package:
ru: Установите пакет:

source: Launch the application.
ru: Запустите приложение.

source: For ``tgz`` archive:
ru: Для архива ``tgz``:

source: Upload the archive to all servers dedicated to Tarantool.
ru: Загрузите архив на все серверы, выделенные для Tarantool.

source: Unpack the archive:
ru: Распакуйте архив:

source: Launch the application
ru: Запустите приложение

source: For details and examples, please consult the open-source Tarantool documentation:
ru: Более подробную информацию с примерами см. в документации по Tarantool с открытым кодом:

source: a `getting started guide <https://github.com/tarantool/cartridge-cli/blob/master/examples/getting-started-app/README.md>`_ that walks you through developing and deploying a simple clustered application using Tarantool Cartridge,
ru: `руководство для начинающих <https://github.com/tarantool/cartridge-cli/blob/master/examples/getting-started-app/README.md>`_, в котором пошагово разбирается разработка и развертывание простого кластерного приложения с помощью Tarantool Cartridge,

source: a `detailed manual </book/cartridge/>`_ on creating and managing clustered Tarantool applications using Tarantool Cartridge.
ru: `подробное руководство </book/cartridge/>`_ по созданию и управлению кластерными приложениями Tarantool с помощью Tarantool Cartridge.

source: Further on, this guide focuses on Enterprise-specific developer features available on top of the open-source Tarantool version with the Tarantool Cartridge framework:
ru: Кроме того, в этом руководстве особое внимание уделяется функциям разработчика, специфичным для Enterprise-версии, которые доступны в дополнение к версии Tarantool с открытым исходным кодом в среде Tarantool Cartridge:

source: :ref:`LDAP authorization in the web interface <ldap_auth>`,
ru: :ref:`авторизация с использованием LDAP в веб-интерфейсе <ldap_auth>`,

source: :ref:`environment-independent applications <enterprise-env-independent-apps>`,
ru: :ref:`независимые от среды приложения <enterprise-env-independent-apps>`,

source: :ref:`sample applications with Enterprise flavors <enterprise-run-app>`.
ru: :ref:`примеры приложений, которые подходят для Enterprise-версии <enterprise-run-app>`.

source: Implementing LDAP authorization in the web interface
ru: Реализация авторизации с использованием LDAP в веб-интерфейсе

source: If you run an LDAP server in your organization, you can connect Tarantool Enterprise to it and let it handle the authorization. In this case, follow the `general recipe </book/cartridge/cartridge_dev/#implementing-authorization-in-the-web-interface>`_ where in the first step add the ``ldap`` module to the ``.rockspec`` file as a dependency and consider implementing the ``check_password`` function the following way:
ru: Если в вашей организации есть сервер LDAP, можно подключить к нему Tarantool Enterprise для обработки авторизации. В этом случае следуйте `общим рекомендациям </book/cartridge/cartridge_dev/#implementing-authorization-in-the-web-interface>`_ </book/cartridge/cartridge_dev/#implementing-authorization-in-the-web-interface>`_ , где на первом шаге необходимо добавить модуль ``ldap`` в файл ``.rockspec`` в качестве зависимости; рекомендуется также реализовать функцию ``check_password`` следующим образом:

source: Delivering environment-independent applications
ru: Формирование независимых от среды приложений

source: Tarantool Enterprise allows you to build environment-independent applications.
ru: Tarantool Enterprise позволяет создавать независимые от среды приложения.

source: An environment-independent application is an assembly (in one directory) of:
ru: Независимое от среды приложение представляет собой сборку следующих компонентов (в одной директории):

source: files with Lua code,
ru: файлы с кодом на Lua,

source: ``tarantool`` executable,
ru: исполняемый файл ``tarantool``,

source: plugged external modules (if necessary).
ru: подключенные внешние модули (при необходимости).

source: When started by the ``tarantool`` executable, the application provides a service.
ru: Запущенное с помощью исполняемого файла tarantool приложение обеспечивает работу сервиса.

source: The modules are Lua rocks installed into a virtual environment (under the application directory) similar to Python's ``virtualenv`` and Ruby's bundler.
ru: Модули -- это сторонние библиотеки на Lua, установленные в виртуальную среду (в директории приложения), которая аналогична ``virtualenv`` в Python и bundler в Ruby.

source: Such an application has the same structure both in development and production-ready phases. All the application-related code resides in one place, ready to be packed and copied over to any server.
ru: Структура такого приложения остается неизменной как на стадии разработки, так и на стадии производственной эксплуатации. Весь связанный с приложением код находится в одном месте, готов к упаковке и копированию на любой сервер.

source: Packaging applications
ru: Упаковка приложений

source: Once custom cluster role(s) are defined and the application is developed, pack it and all its dependencies (module binaries) together with the ``tarantool`` executable.
ru: После определения пользовательских кластерных ролей и разработки приложения упакуйте его со всеми зависимостями (бинарные файлы модулей) и с исполняемым файлом ``tarantool``.

source: This will allow you to upload, install, and run your application on any server in one go.
ru: Это позволит вам легко загружать, устанавливать и запускать приложение на любом сервере.

source: To pack the application, say:
ru: Чтобы упаковать приложение, выполните команду:

source: where specify a path to your development environment -- the Git repository containing your application code, -- and one of the following build options:
ru: где укажите путь к вашей среде разработки (репозиторию Git, который содержит код приложения), а также один из параметров сборки:

source: ``rpm`` to build an RPM package (recommended), or
ru: ``rpm`` для сборки RPM-пакета (рекомендуется), или

source: ``tgz`` to build a ``tar + gz`` archive (choose this option only if you do not have root privileges on servers dedicated for Tarantool Enterprise).
ru: ``tgz`` для сборки архива ``tar + gz`` (выберите этот параметр, только если у вас нет прав уровня root на серверах, выделенных для Tarantool Enterprise).

source: This will create a package (or compressed archive) named ``<app_name>-<version_tag>-<number_of_commits>`` (e.g., ``myapp-1.2.1-12.rpm``) containing your environment-independent application.
ru: В результате будет создан пакет (или сжатый архив) с именем ``<имя_приложения>-<версия_тег>-<количество_коммитов>`` (например, ``myapp-1.2.1-12.rpm``), который будет хранить ваше приложение в не зависимом от среды виде.

source: Next, proceed to deploying :ref:`packaged applications <enterprise-packaged-app>` (or :ref:`archived ones <enterprise-archived-app>`) on your servers.
ru: Далее переходите к развертыванию :ref:`пакетных <enterprise-packaged-app>` (или же :ref:`архивированных <enterprise-archived-app>`) приложений на серверах.

source: Deploying packaged applications
ru: Развертывание пакетных приложений

source: To deploy your packaged application, do the following on every server dedicated for Tarantool Enterprise:
ru: Чтобы развернуть пакетное приложение, выполните следующие действия на каждом сервере, выделенном для Tarantool Enterprise:

source: Upload the package created in the :ref:`previous step <enterprise-app-package>`.
ru: Загрузите локально пакет, созданный на :ref:`предыдущем шаге <enterprise-app-package>`.

source: Install:
ru: Установите приложение:

source: Start one or multiple Tarantool instances with the corresponding services as described below.
ru: Запустите один или несколько экземпляров Tarantool с соответствующими сервисами, как описано ниже.

source: A single instance:
ru: Отдельный экземпляр:

source: This will start an instantiated ``systemd`` service that will listen to port ``3301``.
ru: Это запустит экземпляр сервиса ``systemd`` с прослушиванием по порту ``3301``.

source: Multiple instances on one or multiple servers:
ru: Несколько экземпляров на одном или нескольких серверах:

source: where ``<app_name>@instance_<number>`` is the instantiated service name for ``systemd`` with an incremental ``<number>`` (unique for every instance) to be added to the ``3300`` port the instance will listen to (e.g., ``3301``, ``3302``, etc.).
ru: где ``<app_name>@instance_<number>`` (<имя_приложения>@экземпляр_<число>) -- это имя экземпляра сервиса ``systemd`` с инкрементным числом ``<number>`` (уникальным для каждого экземпляра), которое следует добавить к порту ``3300`` для настройки прослушивания (например, ``3301``, ``3302`` и т.д.).

source: In case it is a cluster-aware application, proceed to `deploying the cluster </book/cartridge/cartridge_admin/#deploying-the-cluster>`_.
ru: Если это приложение с поддержкой кластеров, далее переходите к `развертыванию кластера </book/cartridge/cartridge_admin/#deploying-the-cluster>`_.

source: To stop all services on a server, use the ``systemctl stop`` command and specify instance names one by one. For example:
ru: Чтобы остановить все сервисы на сервере, используйте команду ``systemctl stop`` и укажите имена экземпляров по одному. Например:

source: Deploying archived applications
ru: Развертывание архивированных приложений

source: While the RPM package places your application to ``/usr/share/tarantool/<app_name>`` on your server by default, the ``tar + gz`` archive does not enforce any structure apart from just the ``<app_name>/`` directory, so you are responsible for placing it appropriately.
ru: Тогда как пакет RPM по умолчанию помещает ваше приложение в ``/usr/share/tarantool/<имя_приложения>`` на вашем сервере, архив ``tar + gz`` не создает какую-либо структуру, помимо директории ``<имя_приложения>/``, поэтому вы сами несете ответственность за правильность размещения приложения.

source: RPM packages are recommended for deployment. Deploy archives only if you do not have root privileges.
ru: Для развертывания рекомендуется использовать RPM-пакеты. Развертывайте архивы, только если у вас нет прав уровня root.

source: To place and deploy the application, do the following on every server dedicated for Tarantool Enterprise:
ru: Чтобы разместить и развернуть приложение, выполните следующие действия на каждом сервере, выделенном для Tarantool Enterprise:

source: Upload the archive, decompress, and extract it to the ``/home/<user>/apps`` directory:
ru: Загрузите архив, распакуйте его и извлеките содержимое в директорию ``/home/<user>/apps``:

source: Start Tarantool instances with the corresponding services.
ru: Запустите экземпляры Tarantool с соответствующими сервисами.

source: To manage instances and configuration, use tools like ``ansible``, ``systemd``, and ``supervisord``.
ru: Для управления и конфигурации экземпляров используйте такие средства, как ``ansible``, ``systemd`` и ``supervisord``.

source: Upgrading code
ru: Обновление кода

source: All instances in the cluster are to run the same code. This includes all the components: custom roles, applications, module binaries, ``tarantool``, and ``tt`` (if necessary) executables.
ru: Все экземпляры в кластере должны использовать один и тот же код. Это относится ко всем компонентам: пользовательским ролям, приложениям, бинарным файлам модулей, исполняемым файлам ``tarantool`` и ``tt`` (при необходимости).

source: Pay attention to possible backward incompatibility that any component may introduce. This will help you choose a scenario for an :ref:`upgrade in production <enterprise-production-upgrade>`. Keep in mind that you are responsible for code compatibility and handling conflicts should inconsistencies occur.
ru: Обратите внимание на возможную обратную совместимость, которую может принести с собой любой компонент. Это поможет вам выбрать сценарий для :ref:`обновления в эксплуатационной среде <enterprise-production-upgrade>`. Имейте в виду, что вы несете ответственность за совместимость кода и обработку конфликтов в случае возникновения несоответствий.

source: To upgrade any of the components, prepare a new version of the package (archive):
ru: Чтобы обновить любой из компонентов, подготовьте новую версию пакета (архива):

source: Update the necessary files in your development environment (directory):
ru: Обновите необходимые файлы в вашей среде разработки (директории):

source: Your own source code: custom roles and/or applications.
ru: Ваш собственный исходный код: пользовательские роли и / или приложения.

source: Module binaries.
ru: Бинарные файлы модулей.

source: Executables. Replace them with ones from the new bundle.
ru: Исполняемые файлы. Замените их на файлы из нового комплекта.

source: Increment the version as described in `application versioning </book/cartridge/cartridge_dev/#application-versioning>`_.
ru: Увеличьте версию, как описано в разделе по `управлению версиями приложения </book/cartridge/cartridge_dev/#application-versioning>`_.

source: Repack the updated files as described in :ref:`packaging applications <enterprise-app-package>`.
ru: Повторно упакуйте обновленные файлы, как описано в разделе по :ref:`упаковке приложений <enterprise-app-package>`.

source: Choose an upgrade scenario as described in the :ref:`Upgrading in production <enterprise-production-upgrade>` section.
ru: Выберите сценарий обновления, как описано в разделе по :ref:`обновлению в эксплуатационной среде <enterprise-production-upgrade>`.

source: Running sample applications
ru: Запуск примеров приложений

source: The Enterprise distribution package includes sample applications in the ``examples/`` directory that showcase basic Tarantool functionality.
ru: Дистрибутив Enterprise включает в себя примеры приложений в директории ``examples/``, которые демонстрируют основные функциональные возможности Tarantool.

source: Sample applications:
ru: Примеры приложений:

source: Write-through cache application for PostgreSQL
ru: Приложение кэширования со сквозной записью в PostgreSQL

source: The example in ``pg_writethrough_cache/`` shows how Tarantool can cache data written *through* it to a PostgreSQL database to speed up the reads.
ru: Пример в ``pg_writethrough_cache/`` показывает, как Tarantool может кэшировать данные, записанные через него в базу данных PostgreSQL для ускорения запросов на чтение.

source: The sample application requires a deployed PostgreSQL database and the following rock modules:
ru: Для примера приложения требуется развернутая база данных PostgreSQL и следующие модули сторонних библиотек:

source: Look through the code in the files to get an understanding of what the application does.
ru: Просмотрите код в файлах, чтобы понять, что может делать приложение.

source: To run the application for a local PostgreSQL database, say:
ru: Чтобы запустить приложение для локальной базы данных PostgreSQL, выполните команду:

source: Write-behind cache application for Oracle
ru: Приложение кэширования с отложенной записью в Oracle

source: The example in ``ora-writebehind-cache/`` shows how Tarantool can cache writes and queue them to an Oracle database to speed up both writes and reads.
ru: Пример в ``ora-writebehind-cache/`` показывает, как Tarantool может кэшировать записи и помещать их в базу данных Oracle для ускорения как записи, так и чтения.

source: Application requirements
ru: Требования приложения

source: The sample application requires:
ru: Для примера приложения необходимы:

source: deployed Oracle database;
ru: развернутая база данных Oracle;

source: Oracle tools: `Instant Client and SQL Plus <https://www.oracle.com/technetwork/topics/linuxx86-64soft-092277.html>`_, both of version 12.2;
ru: инструменты Oracle: `Instant Client and SQL Plus <https://www.oracle.com/technetwork/topics/linuxx86-64soft-092277.html>`_, оба версии 12.2;

source: In case the Oracle Instant Client errors out on ``.so`` files (Oracle's dynamic libraries), put them to some directory and add it to the ``LD_LIBRARY_PATH`` environment variable.
ru: Если Oracle Instant Client выдает ошибки в файлах с расширением ``.so`` (динамические библиотеки Oracle), поместите их в какую-либо директорию и добавьте ее в переменную окружения ``LD_LIBRARY_PATH``.

source: For example: ``export LD_LIBRARY_PATH=$LD_LIBRARY_PATH:$PWD/<path_to_so_files>``
ru: Например: ``export LD_LIBRARY_PATH=$LD_LIBRARY_PATH:$PWD/<путь_к_файлам_so>``

source: rock modules listed in the ``rockspec`` file.
ru: модули сторонних библиотек, перечисленные в файле ``rockspec``.

source: To install the modules, run the following command in the ``examples/ora_writebehind_cache`` directory:
ru: Чтобы установить модули, выполните следующую команду в директории ``examples/ora_writebehind_cache``:

source: If you do not have a deployed Oracle instance at hand, run a dummy in a Docker container:
ru: Если у вас нет развернутого экземпляра Oracle под рукой, запустите пустой объект в контейнере Docker:

source: In the browser, log in to `Oracle container registry <container-registry.oracle.com>`_, click **Database**, and accept the Oracle's Enterprise Terms and Restrictions.
ru: В браузере войдите в `Реестр контейнеров Oracle <container-registry.oracle.com>`_, выберите **Database** (База данных) и примите «Корпоративные условия и ограничения Oracle».

source: In the ``ora-writebehind-cache/`` directory, log in to the repository under the Oracle account, pull, and run an image using the prepared scripts:
ru: В директории ``ora-writebehind-cache/`` войдите в репозиторий под учетной записью Oracle, получите данные и запустите образ с помощью подготовленных скриптов

source: When all is set and done, run the example application.
ru: Когда всё будет готово, запустите пример приложения.

source: Running write-behind cache
ru: Запуск кэширования с отложенной записью

source: To launch the application, run the following in the ``examples/ora_writebehind_cache`` directory:
ru: Чтобы запустить приложение, выполните следующую команду в директории ``examples/ora_writebehind_cache``:

source: The application supports the following requests:
ru: Данное приложение поддерживает следующие запросы:

source: Get: ``GET http://<host>:<http_port>/account/id``;
ru: Получение данных: ``GET http://<host>:<http_port>/account/id``;

source: Add: ``POST http://<host>:<http_port>/account/`` with the following data:
ru: Добавление: ``POST http://<host>:<http_port>/account/`` со следующими данными:

source: Update: ``POST http://<host>:<http_port>/account/id`` with the same data as in the add request;
ru: Обновление: ``POST http://<host>:<http_port>/account/id`` с теми же данными, что и в запросе на добавление;

source: Remove: ``DELETE http://<host>:<http_port>/account/id`` where ``id`` is an account identifier.
ru: Удаление: ``DELETE http://<host>:<http_port>/account/id``,где ``id`` -- это идентификатор учетной записи.

source: Look for sample CURL scripts in the ``examples/ora_writebehind_cache/testing`` directory and check ``README.md`` for more information on implementation.
ru: Взгляните на примеры скриптов CURL в директории ``examples/ora_writebehind_cache/testing`` и просмотрите файл ``README.md`` для получения дополнительной информации об их использовании.

source: Hello-world application in Docker
ru: Простейшее приложение в Docker

source: The example in the ``docker/`` directory contains a hello-world application that you can pack in a Docker container and run on CentOS 7.
ru: Пример в директории ``docker/`` содержит простейшее приложение, которое можно упаковать в контейнер Docker и запустить на CentOS 7.

source: The ``hello.lua`` file is the entry point and it is very bare-bones, so you can add your code here.
ru: Файл ``hello.lua`` представляет собой элементарную точку входа в приложение, поэтому вы можете добавить туда собственный код.

source: To build the container, say:
ru: Чтобы создать контейнер, выполните команду:

source: To run it:
ru: Чтобы запустить его:
