Repository: tarantool/doc
Catalog: locale/*/LC_MESSAGES/enterprise/migration.po
Languages: ru

source: Migration from Tarantool Cartridge
ru: Миграция с Tarantool Cartridge

source: If your company uses a service based on Tarantool Community Edition and Tarantool Cartridge, follow the steps below to update these components to Tarantool Enterprise Edition.
ru: Если в вашей организации развернут сервис, разработанный с использованием Tarantool Community Edition и фреймворка Tarantool Cartridge, вы можете легко обновить его так, чтобы вместо этого использовалась версия Tarantool Enterprise Edition. Для этого выполните шаги ниже.

source: As a reference, the instructions below use a template service created with ``cartridge-cli``, namely with ``cartridge create --name myapp .``.
ru: Инструкции приводятся для шаблонного сервиса, созданного с помощью утилиты ``cartridge-cli`` командой ``cartridge create —name myapp .``.

source: Service build pipeline
ru: Пайплайн сборки сервиса

source: Get access to the source code and build pipeline of your service. Here is an example of what the service build pipeline might look like for CentOS/RHEL 7:
ru: Получите доступ к исходному коду сервиса и пайплайну его сборки. Для простоты предположим, что пайплайн сборки сервиса выглядит так (для CentOS/RHEL 7):

source: Update the pipeline
ru: Внесите изменения в пайплайн

source: In the installation section of your pipeline, replace open-source ``tarantool`` packages with Tarantool Enterprise SDK:
ru: Замените в пайплайне установку open-source-пакетов ``tarantool`` на установку Tarantool Enterprise SDK:

source: Now the pipeline will produce a new service artifact, which includes Tarantool Enterprise.
ru: Теперь в результате исполнения пайплайна получится новый артефакт сервиса, уже включающий в себя ядро Tarantool Enterprise.

source: Update the service
ru: Обновите сервис

source: Update your service to the new version like you usually update Tarantool in your organization. You don't have to interrupt access to the service. To learn how to do it with ``ansible-cartridge``, `check this example <https://github.com/tarantool/ansible-cartridge/blob/master/doc/rolling_update.md>`__.
ru: Обновите сервис на новую версию, используя стандартные подходы к обновлению версий Tarantool в вашей организации. Это может быть сделано без прерывания доступности. `Посмотрите <https://github.com/tarantool/ansible-cartridge/blob/master/doc/rolling_update.md>`__, как это сделать с помощью инструмента ``ansible-cartridge``.

source: That's it!
ru: Готово!

source: You can now use Tarantool Enterprise features in your installation. For example, to enable the audit log, :ref:`set up the audit_log parameter in your node configuration <enterprise-logging>`.
ru: Теперь вы можете использовать функциональные возможности Tarantool Enterprise в своей инсталляции. К примеру, чтобы включить журнал аудита, достаточно задать в конфигурации узлов параметр ``audit_log``, как описано :ref:`в инструкции <enterprise-logging>`.
