Repository: tarantool/doc
Catalog: locale/*/LC_MESSAGES/enterprise/setup.po
Languages: ru

source: Setup
ru: Настройка

source: System requirements
ru: Системные требования

source: The recommended system requirements for running Tarantool Enterprise are as follows.
ru: Ниже представлены рекомендуемые системные требования для запуска Tarantool Enterprise.

source: Hardware requirements
ru: Требования к аппаратному обеспечению

source: To fully ensure the fault tolerance of a distributed data storage system, at least **three** physical computers or virtual servers are required.
ru: Чтобы обеспечить полную отказоустойчивость системы распределенного хранения данных, необходимы как минимум **три** физических компьютера или виртуальных сервера.

source: For testing/development purposes, the system can be deployed using a smaller number of servers; however, it is not recommended to use such configurations for production.
ru: Для целей тестирования или разработки систему можно развернуть, используя меньшее количество серверов. Тем не менее, не рекомендуется использовать такие конфигурации в производственной среде.

source: Software requirements
ru: Требования к программному обеспечению

source: As host operating systems, Tarantool Enterprise Edition supports **Red Hat Enterprise Linux** and **CentOS** versions 7.5 and higher.
ru: Tarantool Enterprise поддерживает операционные системы **Red Hat Enterprise Linux** и **CentOS** версии 7.5 и выше.

source: Tarantool Enterprise can run on other ``systemd``-based Linux distributions but it is not tested on them and may not work as expected.
ru: Tarantool Enterprise может работать на других дистрибутивах Linux на основе ``systemd``, но тестирование на них не проводится, поэтому корректная работа не гарантирована.

source: ``glibc`` 2.17-260.el7_6.6 and higher is required. Take care to check and update, if needed:
ru: Требуется ``glibc`` версии 2.17-260.el7_6.6 и выше. Необходимо проверить текущую версию и обновить в случае необходимости:

source: Network requirements
ru: Сетевые требования

source: Hereinafter, **"storage servers"** or **"Tarantool servers"** are the computers used to store and process data, and **"administration server"** is the computer used by the system operator to install and configure the product.
ru: Здесь и далее по тексту под **серверами хранения данных** или **серверами Tarantool** понимаются компьютеры, которые используются для хранения и обработки данных, а под **сервером администрирования** понимается компьютер, с помощью которого оператор устанавливает и настраивает систему.

source: The Tarantool cluster has a full mesh topology, therefore all Tarantool servers should be able to communicate and send traffic from and to TCP/UDP ports used by the cluster's instances (see ``advertise_uri: <host>:<port>`` and ``config: advertise_uri: '<host>:<port>'`` in ``/etc/tarantool/conf.d/*.yml`` for each instance). For example:
ru: Кластер Tarantool работает по принципам полносвязной топологии (full mesh topology), поэтому все серверы Tarantool должны поддерживать прием и передачу данных по TCP и UDP на всех портах, которые используются экземплярами кластера (см. настройки ``advertise_uri: <host>:<port>`` и ``config: advertise_uri: '<host>:<port>'`` в файле ``/etc/tarantool/conf.d/*.yml`` для каждого экземпляра). Например:

source: To configure remote monitoring or to connect via the administrative console, the administration server should be able to access the following TCP ports on Tarantool servers:
ru: Чтобы настроить удаленный мониторинг или подключиться по административной консоли, сервер администрирования должен иметь доступ к следующим TCP-портам на серверах Tarantool:

source: 22 to use the SSH protocol,
ru: 22 -- чтобы использовать SSH-протокол;

source: Additionally, it is recommended to apply the following settings for ``sysctl`` on all Tarantool servers:
ru: Кроме того, рекомендуется применить следующие настройки для ``sysctl`` на всех серверах Tarantool:

source: This optional setup of the Linux network stack helps speed up the troubleshooting of network connectivity when the server physically fails. To achieve maximum performance, you may also need to configure other network stack parameters that are not specific to the Tarantool DBMS. For more information, please refer to the `Network Performance Tuning Guide <https://access.redhat.com/sites/default/files/attachments/20150325_network_performance_tuning.pdf>`_ section of the RHEL7 user documentation.
ru: Эта необязательная настройка сетевого стека Linux помогает ускорить решение проблем с сетевым подключением при физическом отказе сервера. Для достижения максимальной производительности может также потребоваться настройка других параметров сетевого стека, которые не относятся к СУБД Tarantool. Для получения дополнительной информации обратитесь к разделу Руководство по оптимизации сетевой производительности (`Network Performance Tuning Guide <https://access.redhat.com/sites/default/files/attachments/20150325_network_performance_tuning.pdf>`_) в пользовательской документации по RHEL7.

source: Package contents
ru: Комплектация

source: Each package is distributed as a ``tar + gzip`` archive and includes the following components and features:
ru: Каждый пакет представляет собой архив ``tar + gzip`` и включает в себя следующие компоненты и функции:

source: Archive contents:
ru: Содержимое архива:

source: ``tarantool`` is the main executable of Tarantool.
ru: ``tarantool`` -- основной исполняемый файл Tarantool.

source: ``tarantoolctl`` is the utility script for installing supplementary modules and connecting to the administrative console.
ru: ``tarantoolctl`` -- служебный скрипт для установки вспомогательных модулей и подключения к административной консоли.

source: ``examples/`` is the directory containing sample applications:
ru: ``examples/`` -- директория, которая содержит примеры приложений:

source: ``pg_writethrough_cache/`` is an application showcasing how Tarantool can cache data written to, for example, a PostgreSQL database;
ru: ``pg_writethrough_cache/`` -- приложение, которое наглядно показывает, как Tarantool может кэшировать данные, например, записанные в базу данных PostgreSQL;

source: ``ora_writebehind_cache/`` is an application showcasing how Tarantool can cache writes and queue them to, for example, an Oracle database;
ru: ``ora_writebehind_cache/`` -- приложение, которое наглядно показывает, как Tarantool может кэшировать вставки и ставить их в очередь, например, в базу данных Oracle;

source: ``docker/`` is an application designed to be easily packed into a Docker container;
ru: ``docker/`` -- приложение, предназначенное для простой упаковки в Docker-контейнер;

source: ``rocks/`` is the directory containing a selection of additional open and closed source modules included in the distribution as an offline rocks repository. See the :ref:`rocks reference <enterprise-rocks>` for details.
ru: ``rocks/`` -- директория, которая содержит набор дополнительных модулей с открытым и закрытым исходным кодом, включенных в дистрибутив в качестве автономного репозитория сторонних библиотек. Для получения более подробной информации см. :ref:`справочник по сторонним библиотекам <enterprise-rocks>`.

source: ``templates/`` is the directory containing template files for your application development environment.
ru: ``templates/`` -- директория, которая содержит файлы шаблонов для среды разработки приложений.

source: ``deprecated/`` is a set of modules that are no longer supported:
ru: ``deprecated/`` -- это набор модулей, которые больше не поддерживаются:

source: ``vshard-zookeeper-orchestrator`` is a Python application for launching ``orchestrator``,
ru: ``vshard-zookeeper-orchestrator`` -- это приложение на Python для запуска orchestrator,

source: ``zookeeper-scm`` files are the ZooKeeper integration modules (require ``usr/`` libraries).
ru: файлы ``zookeeper-scm`` представляют собой модули для интеграции с ZooKeeper (требуются библиотеки ``usr/``).

source: Installation
ru: Установка

source: The delivered ``tar + gzip`` archive should be uploaded to a server and unpacked:
ru: Готовый архив ``tar + gzip`` необходимо загрузить на сервер и распаковать:

source: No further installation is required as the unpacked binaries are almost ready to go. Go to the directory with the binaries (``tarantool-enterprise``) and add them to the executable path by running the script provided by the distribution:
ru: Дополнительная установка не требуется, поскольку распакованные бинарные файлы практически готовы к работе. Перейдите в каталог с бинарными файлами (``tarantool-enterprise``) и добавьте их в путь для поиска исполняемых файлов, запустив скрипт из дистрибутива:

source: Make sure you have enough privileges to run the script and that the file is executable. Otherwise, try ``chmod`` and ``chown`` commands to adjust it.
ru: Убедитесь, что вы можете запускать данный скрипт, а также что файл со скриптом является исполняемым. В противном случае задайте разрешения в помощью команд ``chmod`` и ``chown``.

source: Next, set up your development environment as described in :ref:`the developer's guide <enterprise-app-development>`.
ru: Затем настройте среду разработки, как описано в :ref:`руководстве для разработчика <enterprise-app-development>`.
