Repository: tarantool/doc
Catalog: locale/*/LC_MESSAGES/how-to/getting_started_net_box.po
Languages: ru

source: Getting started with net.box
ru: Начало работы с net.box

source: The tutorial shows how to work with some common ``net.box`` methods.
ru: Ниже приводится пример использования большинства методов ``net.box``.

source: For more information about the ``net.box`` module, check the :ref:`corresponding module reference <net_box-module>`.
ru: Подробную информацию о модуле ``net.box`` вы найдете в соответствующем :ref:`разделе справочника по модулям <net_box-module>`.

source: Sandbox configuration
ru: Настройка песочницы

source: The sandbox configuration for the tutorial assumes that:
ru: Данный пример сработает на конфигурации из песочницы, предполагается, что:

source: The Tarantool instance is running on ``localhost 127.0.0.1:3301``.
ru: экземпляр Tarantool запущен на ``localhost 127.0.0.1:3301``;

source: There is a space named ``tester`` with a numeric primary key.
ru: создан спейс под названием ``tester`` с первичным числовым ключом;

source: The space contains a tuple with the key value = ``800``.
ru: спейс содержит кортеж, в котором есть ключ со значением = 800;

source: The current user has read, write, and execute privileges.
ru: у текущего пользователя есть права на чтение, запись и выполнение.

source: Use the commands below for a quick sandbox setup:
ru: Используйте команды ниже для быстрой настройки песочницы:

source: Creating a net.box connection
ru: Создание подключения

source: First, load the ``net.box`` module with the ``require('net.box')`` method:
ru: Чтобы начать работу, запустите модуль ``net.box``,

source: The next step is to create a new connection.In ``net.box``, self-connection is pre-established. That is, ``conn = net_box.connect('localhost:3301')`` command can be replaced with the ``conn = net_box.self`` object call:
ru: Далее необходимо создать новое подключение.В ``net.box`` для локального Tarantool-сервера есть заданный объект ``self`` всегда установленного подключения. Таким образом, команду ``conn = net_box.connect('localhost:3301')`` можно заменить на вызов объекта ``conn = net_box.self``.

source: Then, make a ping:
ru: Запустите команду ``ping()``:

source: Using data operations
ru: Операции с данными

source: Select all tuples in the ``tester`` space where the key value is ``800``:
ru: Сделайте выборку всех кортежей в спейсе ``tester``, где значение ключа равно ``800``:

source: Insert two tuples into the space:
ru: Вставьте два кортежа в спейс:

source: After the insert, there is one tuple where the key value is ``600``.To select this tuple, you can use the ``get()`` method.Unlike the ``select()`` command, ``get()`` returns only one tuple that satisfies the stated condition.
ru: После вставки в спейсе появился один кортеж со значением ключа ``600``.Для выбора этого кортежа вы можете использовать метод ``get()``.В отличие от команды ``select()``, метод ``get()`` возвращает только один кортеж, удовлетворяющий условиям.

source: To update the existing tuple, you can use either ``update()`` or ``upsert()``.The ``update()`` method can be used for assignment, arithmetic (if the field is numeric), cutting and pasting fragments of a field, and deleting or inserting a field.
ru: Чтобы обновить существующий кортеж, вы можете использовать как метод ``update()``, так и метод ``upsert()``.Функция ``update()`` может использоваться для присваивания, арифметических операций (если поле числовое), вырезания и вставки фрагментов поля, а также для удаления или вставки поля.

source: In this tutorial, the ``update()`` command is used to update the tuple identified by primary key value = ``800``.The operation assigns a new value to the second field in the tuple:
ru: В этом руководстве команда ``update()`` используется для обновления кортежа, определенного значением ключа ``800``.Операция присваивает новое значение второму полю в кортеже:

source: As for the ``upsert`` function, if there is an existing tuple that matches the key field of tuple, then the command has the same effect as ``update()``. Otherwise, the effect is equal to the ``insert()`` method.
ru: Для функции ``upsert``, если уже существует кортеж, который совпадает с ключевыми полями tuple, запрос приведет к тому же результату, что и метод ``update()``. Если нет кортежа, совпадающего с ключевыми полями tuple,

source: To delete a tuple where the key value is ``600``, run the ``delete()`` method below:
ru: Чтобы удалить кортеж, где значение ключа равно ``600`, запустите метод ``delete()``:

source: Then, replace the existing tuple with a new one:
ru: Затем замените существующий кортеж на новый:

source: Finally, select all tuples from the space:
ru: Наконец, сделайте выборку по всем кортежам из спейса:

source: Closing the connection
ru: Закрытие подключения

source: In the end, close the connection when it is no longer needed:
ru: Закройте соединение явным образом, когда оно больше не используется:
