Repository: tarantool/doc
Catalog: locale/*/LC_MESSAGES/how-to/vshard_quick.po
Languages: ru

source: Sharding
ru: Шардирование

source: For installation instructions, check out the :ref:`vshard installation manual <vshard-install>`.
ru: Чтобы получить инструкции по установке, обратитесь к :ref:`руководству по установке vshard <vshard-install>`.

source: ``router_1`` – a ``router`` instance
ru: ``router_1`` – экземпляр роутера (``router``)

source: ``storage_1_a`` – a ``storage`` instance, the **master** of the **first** replica set
ru: ``storage_1_a`` – экземпляр хранилища (``storage``), **мастер** **первого** набора реплик

source: ``storage_1_b`` – a ``storage`` instance, the **replica** of the **first** replica set
ru: ``storage_1_b`` – экземпляр хранилища (``storage``), **реплика** из **первого** набора реплик

source: ``storage_2_a`` – a ``storage`` instance, the **master** of the **second** replica set
ru: ``storage_2_a`` – экземпляр хранилища (``storage``), **мастер** **второго** набора реплик

source: ``storage_2_b`` – a ``storage`` instance, the **replica** of the **second** replica set
ru: ``storage_2_b`` – экземпляр хранилища (``storage``), **реплика** из **второго** набора реплик

source: Change the directory to ``example/`` and use ``make`` to run the development cluster:
ru: Измените директорию ``example/`` и используйте команду ``make`` для запуска кластера:

source: Some ``tarantoolctl`` commands:
ru: Некоторые команды ``tarantoolctl``:

source: ``tarantoolctl start router_1`` – start the router instance
ru: ``tarantoolctl start router_1`` – запуск экземпляра роутера

source: ``tarantoolctl enter router_1`` – enter the admin console
ru: ``tarantoolctl enter router_1`` – вход в административную консоль

source: The full list of ``tarantoolctl`` commands for managing Tarantool instances is available in the :ref:`tarantoolctl reference <tarantoolctl>`.
ru: Полный список команд ``tarantoolctl`` для управления экземплярами Tarantool можно найти в :ref:`справочнике по tarantoolctl <tarantoolctl>`.

source: Essential ``make`` commands you need to know:
ru: Необходимо знать следующие команды ``make``:

source: ``make start`` – start all Tarantool instances
ru: ``make start`` – запуск всех экземпляров Tarantool

source: ``make stop`` – stop all Tarantool instances
ru: ``make stop`` – остановка всех экземпляров Tarantool

source: ``make logcat`` – show logs from all instances
ru: ``make logcat`` – вывод журналов всех экземпляров

source: ``make enter`` – enter the admin console on ``router_1``
ru: ``make enter`` – вход в административную консоль на роутере ``router_1``

source: ``make clean`` – clean up all persistent data
ru: ``make clean`` – очистка всех персистентных данных

source: ``make test`` – run the test suite (you can also run ``test-run.py`` in the ``test`` directory)
ru: ``make test`` – запуск набора тестов (можно также выполнить ``test-run.py`` в директории с тестами ``test``)

source: ``make`` – execute ``make stop``, ``make clean``, ``make start`` and ``make enter``
ru: ``make`` – выполнить ``make stop``, ``make clean``, ``make start`` и ``make enter``

source: For example, to start all instances, use ``make start``:
ru: Например, для запуска всех экземпляров используйте ``make start``:

source: To perform commands in the admin console, use the router's :ref:`public API <vshard_api_reference-router_public_api>`:
ru: Для выполнения команд в административной консоли, используйте :ref:`общедоступный API <vshard_api_reference-router_public_api>`:

source: Sample configuration
ru: Образец конфигурации

source: The configuration of a simple sharded cluster can look like this:
ru: Конфигурация простого сегментированного кластера может выглядеть следующим образом:

source: This cluster includes one ``router`` instance and two ``storage`` instances. Each ``storage`` instance includes one master and one replica. The ``sharding`` field defines the logical topology of a sharded Tarantool cluster. All the other fields are passed to ``box.cfg()`` as they are, without modifications. See the :ref:`Configuration reference <vshard-config-reference>` section for details.
ru: Данный кластер включает в себя один роутер (``router``) и два хранилища (``storage``). Каждое хранилище ``storage`` включает в себя один мастер и одну реплику. Поле ``sharding`` (шардинг) определяет логическую топологию сегментированного кластера Tarantool. Все остальные поля передаются в ``box.cfg()`` в неизменном виде. Для получения подробной информации см. раздел :ref:`Справочник по настройке <vshard-config-reference>`.

source: On routers, call ``vshard.router.cfg(cfg)``:
ru: На роутерах вызовите ``vshard.router.cfg(cfg)``:

source: cfg.listen = 3300 -- Start the database with sharding vshard = require('vshard') vshard.router.cfg(cfg)
ru: cfg.listen = 3300 -- Запуск базы данных с шардингом vshard = require('vshard') vshard.router.cfg(cfg)

source: On storages, call ``vshard.storage.cfg(cfg, instance_uuid)``:
ru: На хранилищах вызовите ``vshard.storage.cfg(cfg, uuid_экземпляра)``:

source: -- Get instance name local MY_UUID = "de0ea826-e71d-4a82-bbf3-b04a6413e417" -- Call a configuration provider local cfg = require('localcfg') -- Start the database with sharding vshard = require('vshard') vshard.storage.cfg(cfg, MY_UUID)
ru: -- Получение имени экземпляра local MY_UUID = "de0ea826-e71d-4a82-bbf3-b04a6413e417" -- Вызов поставщика конфигурации local cfg = require('localcfg') -- Запуск базы данных с шардингом vshard = require('vshard') vshard.storage.cfg(cfg, MY_UUID)

source: ``vshard.storage.cfg()`` automatically calls ``box.cfg()`` and configures the listen port and replication parameters.
ru: ``vshard.storage.cfg()`` автоматически вызывает ``box.cfg()`` и настраивает порт для прослушивания и параметры репликации.

source: For a sample configuration, see ``router.lua`` and ``storage.lua`` in the ``example/`` directory of the `vshard repository <https://github.com/tarantool/vshard>`__.
ru: Образец конфигурации можно посмотреть в файлах ``router.lua`` и ``storage.lua`` в директории ``example/`` `репозитория vshard <https://github.com/tarantool/vshard>`__.
