Repository: tarantool/doc
Catalog: locale/*/LC_MESSAGES/platform/sharding/vshard_admin.po
Languages: ru

source: Replica set lock and rebalancing
ru: Заблокированный набор реплик и балансировка

source: Locked replica sets simply do not participate in rebalancing. This means that even if the actual total number of buckets is not equal to the etalon number, the disbalance cannot be fixed due to the lock. When the rebalancer detects that one of the replica sets is locked, it recalculates the etalon number of buckets of the non-locked replica sets as if the locked replica set and its buckets did not exist at all.
ru: Заблокированные наборы реплик просто не участвуют в балансировке. Это означает, что даже если фактическое общее количество сегментов не равно эталонному числу, дисбаланс нельзя исправить из-за блокировки. Когда балансировщик обнаруживает, что один из наборов реплик заблокирован, он пересчитывает эталонное число сегментов неблокированных наборов реплик, как если бы заблокированный набор реплик и его сегменты вообще не существовали.

source: Bucket pin and rebalancing
ru: Закрепленный набор реплик и балансировка

source: Rebalancing replica sets with pinned buckets requires a more complex algorithm. Here ``pinned_count[o]`` is the number of pinned buckets, and ``etalon_count`` is the etalon number of buckets for a replica set:
ru: Балансировка наборов реплик с закрепленными сегментами требует более сложного алгоритма. Здесь ``pinned_count[o]`` -- это число закрепленных сегментов, а ``etalon_count`` -- это эталонное число сегментов для набора реплик:

source: The ``rebalancer`` calculates the etalon number of buckets as if all buckets were not pinned. Then the rebalancer checks each replica set and compares the etalon number of buckets with the number of pinned buckets in a replica set. If ``pinned_count < etalon_count``, non-locked replica sets (at this point all locked replica sets already are filtered out) with pinned buckets can receive new buckets.
ru: Балансировщик рассчитывает эталонное число сегментов, как если бы все сегменты не были закреплены. Затем балансировщик проверяет каждый набор реплик и сопоставляет эталонное число сегментов с числом закрепленных сегментов в наборе реплик. Если ``pinned_count < etalon_count``, незаблокированные наборы реплик (на данном этапе все заблокированные наборы реплик уже отфильтрованы) с закрепленными сегментами могут получать новые сегменты.

source: If ``pinned_count > etalon_count``, the disbalance cannot be fixed, as the ``rebalancer`` cannot move pinned buckets out of this replica set. In such a case the etalon number is updated and set equal to the number of pinned buckets. The replica sets with ``pinned_count > etalon_count`` are not processed by the ``rebalancer``, and the number of pinned buckets is subtracted from the total number of buckets. The rebalancer tries to move out as many buckets as possible from such replica sets.
ru: Если же ``pinned_count > etalon_count``, дисбаланс исправить нельзя, так как балансировщик не может вывести закрепленные сегменты из этого набора реплик. В таком случае эталонное число обновляется как равное числу закрепленных сегментов. Наборы реплик с ``pinned_count > etalon_count`` не обрабатываются балансировщиком`, а число закрепленных сегментов вычитается из общего числа сегментов. Балансировщик пытается вывести как можно больше сегментов из таких наборов реплик.

source: This procedure is restarted from step 1 for replica sets with ``pinned_count >= etalon_count`` until ``pinned_count <= etalon_count`` on all replica sets. The procedure is also restarted when the total number of buckets is changed.
ru: Эта процедура перезапускается с шага 1 для наборов реплик с ``pinned_count >= etalon_count`` до тех пор, пока не будет выполнено условие ``pinned_count <= etalon_count`` для всех наборов реплик. Процедура также перезапускается при изменении общего числа сегментов.

source: Here is the pseudocode for the algorithm:
ru: Псевдокод для данного алгоритма будет следующим:

source: function cluster_calculate_perfect_balance(replicasets, bucket_count) -- rebalance the buckets using weights of the still viable replica sets -- end; cluster = <all of the non-locked replica sets>; bucket_count = <the total number of buckets in the cluster>; can_reach_balance = false while not can_reach_balance do can_reach_balance = true cluster_calculate_perfect_balance(cluster, bucket_count); foreach replicaset in cluster do if replicaset.perfect_bucket_count < replicaset.pinned_bucket_count then can_reach_balance = false bucket_count -= replicaset.pinned_bucket_count; replicaset.perfect_bucket_count = replicaset.pinned_bucket_count; end; end; end; cluster_calculate_perfect_balance(cluster, bucket_count);
ru: function cluster_calculate_perfect_balance(replicasets, bucket_count) -- балансировка сегментов с использованием веса рабочих наборов реплик -- end; cluster = <all of the non-locked replica sets>; bucket_count = <the total number of buckets in the cluster>; can_reach_balance = false while not can_reach_balance do can_reach_balance = true cluster_calculate_perfect_balance(cluster, bucket_count); foreach replicaset in cluster do if replicaset.perfect_bucket_count < replicaset.pinned_bucket_count then can_reach_balance = false bucket_count -= replicaset.pinned_bucket_count; replicaset.perfect_bucket_count = replicaset.pinned_bucket_count; end; end; end; cluster_calculate_perfect_balance(cluster, bucket_count);

source: The complexity of the algorithm is ``O(N^2)``, where N is the number of replica sets. On each step, the algorithm either finishes the calculation, or ignores at least one new replica set overloaded with the pinned buckets, and updates the etalon number of buckets on other replica sets.
ru: Сложность алгоритма составляет ``O(N^2)``, где N -- количество наборов реплик. На каждом шаге алгоритм либо завершает вычисление, либо игнорирует хотя бы один новый набор реплик, перегруженный закрепленными сегментами, и обновляет эталонное число сегментов в других наборах реплик.

source: Bucket ref
ru: Ссылка в сегменте

source: Bucket ref is an in-memory counter that is similar to the :ref:`bucket pin <vshard-lock-pin>`, but has the following differences:
ru: Ссылка в сегменте -- это счетчик в оперативной памяти, который похож на :ref:`закрепление сегмента <vshard-lock-pin>` со следующими отличиями:

source: Bucket ref is not persistent. Refs are intended for forbidding bucket transfer during request execution, but on restart all requests are dropped.
ru: Ссылка в сегменте никогда не сохраняется. Ссылки предназначены для запрета передачи сегментов во время выполнения запроса, но при перезапуске все запросы отбрасываются.

source: There are two types of bucket refs: read-only (RO) and read-write (RW).
ru: Есть 2 типа ссылок в сегменте: только чтение (RO) и чтение-запись (RW).

source: If a bucket has RW refs, it cannot be moved. However, when the rebalancer needs it to be sent, it locks the bucket for new write requests, waits until all current requests are finished, and then sends the bucket.
ru: Если в сегменте есть ссылки типа RW, его нельзя перемещать. Однако, если балансировщику требуется отправка этого сегмента, он блокирует его для новых запросов на запись, ожидает завершения всех текущих запросов, а затем отправляет сегмент.

source: If a bucket has RO refs, it can be sent, but cannot be dropped. Such a bucket can even enter GARBAGE or SENT state, but its data is kept until the last reader is gone.
ru: Если в сегменте есть ссылки типа RO, его можно отправить, но нельзя удалить. Такой сегмент может даже перейти в статус мусора GARBAGE или отправки SENT, но его данные сохраняются до тех пор, пока не уйдет последний читатель.

source: A single bucket can have both RO and RW refs.
ru: В одном сегменте могут быть ссылки как типа RO, так и типа RW.

source: Bucket ref is countable.
ru: Ссылки в сегменте исчисляются.

source: The :ref:`vshard.storage.bucket_ref/unref()<storage_api-bucket_ref>` methods are called automatically when :ref:`vshard.router.call() <router_api-call>` or :ref:`vshard.storage.call() <storage_api-call>` is used. For raw API like ``r = vshard.router.route() r:callro/callrw`` you should explicitly call the ``bucket_ref()`` method inside the function. Also, make sure that you call ``bucket_unref()`` after ``bucket_ref()``, otherwise the bucket cannot be moved from the storage until the instance restart.
ru: Методы :ref:`vshard.storage.bucket_ref/unref()<storage_api-bucket_ref>` вызываются автоматически при использовании :ref:`vshard.router.call() <router_api-call>` или :ref:`vshard.storage.call() <storage_api-call>`. При использовании API, например ``r = vshard.router.route() r:callro/callrw``, следует дополнительно вызвать метод ``bucket_ref()`` в рамках функции. Кроме того, следует убедиться, что после ``bucket_ref()`` вызывается ``bucket_unref()``, иначе сегмент нельзя перемещать из хранилища до перезапуска экземпляра.

source: To see how many refs there are for a bucket, use :ref:`vshard.storage.buckets_info([bucket_id]) <storage_api-buckets_info>` (the ``bucket_id`` parameter is optional).
ru: Чтобы узнать количество ссылок в сегменте, используйте :ref:`vshard.storage.buckets_info([идентификатор_сегмента]) <storage_api-buckets_info>` (параметр ``идентификатор_сегмента`` необязателен).

source: For example:
ru: Пример:

source: Defining spaces
ru: Определение спейса

source: Database Schema is stored on ``storages``, while ``routers`` know nothing about spaces and tuples.
ru: Схема базы данных хранится на хранилищах, а роутеры ничего не знают о спейсах и кортежах.

source: Spaces should be defined within a storage application using ``box.once()``. For example:
ru: В приложении хранилища следует определить спейсы с помощью ``box.once()``. Например:

source: Every space you plan to shard must have a field with :ref:`bucket id <vshard-vbuckets>` numbers, indexed by the :ref:`shard index <cfg_basic-shard_index>`.
ru: В каждом спейсе, который вы планируете шардировать, должно быть поле с :ref:`идентификаторами сегментов <vshard-vbuckets>`, проиндексированное с помощью :ref:`shard index <cfg_basic-shard_index>`.

source: Adding data
ru: Добавление данных

source: All DML operations with data should be performed via ``router``. The only operation supported by ``router`` is `CALL` via ``bucket_id``:
ru: Все DML-операции с данными следует выполнять через роутер. Роутер поддерживает только вызов `CALL` через идентификатор сегмента ``bucket_id``:

source: result = vshard.router.call(bucket_id, mode, func, args)
ru: result = vshard.router.call(идентификатор_сегмента, режим, функция, аргументы)

source: ``vshard.router.call()`` routes ``result = func(unpack(args))`` call to a shard which serves ``bucket_id``.
ru: ``vshard.router.call()`` направляет вызов ``result = func(unpack(args))`` на шард, который обслуживает идентификатор сегмента ``bucket_id``.

source: ``bucket_id`` is just a regular number in the range ``1..``:ref:`bucket_count<cfg_basic-bucket_count>`. This number can be assigned in an arbitrary way by the client application. A sharded Tarantool cluster uses this number as an opaque unique identifier to distribute data across replica sets. It is guaranteed that all records with the same ``bucket_id`` will be stored on the same replica set.
ru: Идентификатор сегмента ``bucket_id`` -- это обычное число в диапазоне ``1...```:ref:`bucket_count<cfg_basic-bucket_count>". Этот номер можно произвольным образом назначить с помощью клиентского приложения. Сегментированный кластер Tarantool использует этот номер в качестве непрозрачного уникального идентификатора для распределения данных по множествам реплик. Мы гарантируем, что все записи с одним и тем же ``bucket_id`` будут храниться в одном и том же наборе реплик.

source: Bootstrapping and restarting a storage
ru: Настройка и перезапуск хранилища

source: If a replica set master fails, it is recommended to:
ru: В случае отказа мастера в наборе реплик рекомендуется:

source: Switch one of the replicas into the master mode. This allows the new master to process all the incoming requests.
ru: Переключить одну из реплик в режим мастера, что позволит новому мастеру обрабатывать все входящие запросы.

source: Update the configuration of all the cluster members. This forwards all the requests to the new master.
ru: Обновить конфигурацию всех членов кластера, в результате чего все запросы будут перенаправлены на новый мастер.

source: Monitoring the master and switching the instance modes can be handled by any external utility.
ru: Мониторинг состояния мастера и переключение режимов экземпляров можно осуществлять с помощью внешней утилиты.

source: To perform a scheduled downtime of a replica set master, it is recommended to:
ru: Для проведения запланированного остановки мастера в наборе реплик рекомендуется:

source: Update the configuration of the master and wait for the replicas to get into sync. All the requests then are forwarded to a new master.
ru: Обновить конфигурацию мастера и подождать синхронизации всех реплик, в результате чего все запросы будут перенаправлены на новый мастер.

source: Switch another instance into the master mode.
ru: Переключить другой экземпляр в режим мастера.

source: Update the configuration of all the nodes.
ru: Обновить конфигурацию всех узлов.

source: Shut down the old master.
ru: Отключить старый мастер.

source: To perform a scheduled downtime of a replica set, it is recommended to:
ru: Для проведения запланированной остановки набора реплик рекомендуется:

source: Migrate all the buckets to the other cluster storages.
ru: Произвести миграцию всех сегментов в другие хранилища кластера.

source: Shut down the replica set.
ru: Отключить набор реплик.

source: In case a whole replica set fails, some part of the dataset becomes inaccessible. Meanwhile, the ``router`` tries to reconnect to the master of the failed replica set. This way, once the replica set is up and running again, the cluster is automatically restored.
ru: В случае отказа всего набора реплик некоторая часть набора данных становится недоступной. Тем временем ``роутер`` пытается повторно подключиться к мастеру отказавшего набора реплик. Таким образом, после того, как набор реплик снова запущен, кластер автоматически восстанавливается.

source: Fibers
ru: Файберы

source: Searches for buckets, buckets recovery, and buckets rebalancing are performed automatically and do not require manual intervention.
ru: Поиск сегментов, восстановление сегментов и балансировка сегментов выполняются автоматически и не требуют ручного вмешательства.

source: Technically, there are multiple fibers responsible for different types of operations:
ru: С технической точки зрения есть несколько файберов, которые отвечают за различные типы действий:

source: a **discovery** fiber on the ``router`` searches for buckets in the background
ru: файбер **обнаружения** на ``роутере`` выполняет поиск сегментов в фоновом режиме

source: a **failover** fiber on the ``router`` maintains replica connections
ru: файбер **восстановления после отказа** на ``роутере`` поддерживает соединения с репликами

source: a **garbage collector** fiber on each master ``storage`` removes the contents of buckets that were moved
ru: файбер **сборки мусора** на каждом мастер-хранилище удаляет содержимое перемещенных сегментов

source: a **bucket recovery** fiber on each master ``storage`` recovers buckets in the SENDING and RECEIVING states in case of reboot
ru: файбер **восстановления сегмента** на каждом мастер-хранилище восстанавливает сегменты в статусах отправки SENDING и получения RECEIVING в случае перезагрузки

source: a **rebalancer** on a single master ``storage`` among all replica sets executes the rebalancing process.
ru: **балансировщик** на отдельном мастер-хранилище среди множества наборов реплик выполняет процесс балансировки.

source: See the :ref:`Rebalancing process <vshard-rebalancing>` and :ref:`Migration of buckets <vshard-migrate-buckets>` sections for details.
ru: Для получения подробной информации см. разделы :ref:`Процесс балансировки <vshard-rebalancing>` и :ref:`Миграция сегментов <vshard-migrate-buckets>`.

source: Garbage collector
ru: Сборщик мусора

source: A **garbage collector** fiber runs in the background on the master storages of each replica set. It starts deleting the contents of the bucket in the GARBAGE state part by part. Once the bucket is empty, its record is deleted from the ``_bucket`` system space.
ru: Файбер **сборщик мусора** работает в фоновом режиме на мастер-хранилищах в каждом наборе реплик. Он начинает удалять содержимое сегмента в состоянии мусора GARBAGE по частям. Когда сегмент пуст, запись о нем удаляется из системного спейса ``_bucket``.

source: Bucket recovery
ru: Восстановление сегмента

source: A **bucket recovery** fiber runs on the master storages. It helps to recover buckets in the SENDING and RECEIVING states in case of reboot.
ru: Файбер **восстановления сегмента** работает на мастер-хранилищах. Он помогает восстановить сегменты в статусах отправки SENDING и получения RECEIVING в случае перезагрузки.

source: Buckets in the SENDING state are recovered as follows:
ru: Сегменты в статусе SENDING восстанавливаются следующим образом:

source: The system first searches for buckets in the SENDING state.
ru: Сначала система ищет сегменты в статусе SENDING.

source: If such a bucket is found, the system sends a request to the destination replica set.
ru: Если такой сегмент обнаружен, система отправляет запрос в целевой набор реплик.

source: If the bucket on the destination replica set is ACTIVE, the original bucket is deleted from the source node.
ru: Если сегмент в целевом наборе реплик находится в активном статусе ACTIVE, исходный сегмент удаляется из исходного узла.

source: Buckets in the RECEIVING state are deleted without extra checks.
ru: Сегменты в статусе RECEIVING удаляются без дополнительных проверок.

source: Failover
ru: Восстановление после отказа

source: A **failover** fiber runs on every ``router``. If a master of a replica set becomes unavailable, the failover fiber redirects read requests to the replicas. Write requests are rejected with an error until the master becomes available.
ru: Файбер **восстановления после отказа** работает на каждом роутере. Если мастер набора реплик становится недоступным, файбер перенаправляет запросы на чтение к репликам. Запросы на запись отклоняются с ошибкой до тех пор, пока мастер не будет доступен.
