Repository: tarantool/doc
Catalog: locale/*/LC_MESSAGES/platform/sharding/vshard_admin.po
Languages: ru

source: Sharding with vshard
ru: Шардирование с vshard

source: Sharding in Tarantool is implemented in the ``vshard`` module. For a quick start with ``vshard``, refer to the :ref:`guide <vshard-quick-start>`.
ru: Шардирование БД в Tarantool реализует модуль ``vshard``. Вы можете обратиться к :ref:`руководству по быстрому запуску <vshard-quick-start>` этого модуля.

source: Installation
ru: Установка

source: The ``vshard`` module is distributed separately from the main Tarantool package. To install the module, execute the following command:
ru: Модуль ``vshard`` не входит в основной дистрибутив Tarantool. Чтобы установить модуль, выполните команду:

source: The ``vshard`` module requires Tarantool of the version 1.10.1 or higher, :ref:`Tarantool development package <f_c_tutorial-c_stored_procedures>`, ``git``, ``cmake`` and ``gcc`` packages installed.
ru: Для работы с модулем ``vshard`` необходимо установить: Tarantool версии 1.10.1 или выше, :ref:`пакет программ для разработки Tarantool <f_c_tutorial-c_stored_procedures>`, ``git``, ``cmake`` и ``gcc``.

source: Configuration
ru: Настройка

source: Any viable sharded cluster consists of:
ru: Любой рабочий сегментированный кластер состоит из:

source: one or more replica sets, each containing two or more :ref:`storage <vshard-storage>` instances,
ru: одного или нескольких наборов реплик с двумя или несколькими :ref:`хранилищами <vshard-storage>` в каждом,

source: one or more :ref:`router <vshard-router>` instances.
ru: одного или нескольких :ref:`роутеров <vshard-router>`.

source: The number of ``storage`` instances in a replica set defines the redundancy factor of the data. The recommended value is 3 or more. The number of ``router`` instances is not limited, because routers are completely stateless. We recommend increasing the number of routers when an existing ``router`` instance becomes CPU or I/O bound.
ru: Количество хранилищ в наборе реплик определяет коэффициент избыточности данных. Рекомендуемое значение: 3 или более. Количество роутеров не ограничено, потому что у роутеров нет состояния. Рекомендуем увеличивать количество роутеров, если существующий экземпляр роутера ограничен возможностями процессора или ввода-вывода.

source: ``vshard`` supports multiple ``router`` instances on a single Tarantool instance. Each ``router`` can be connected to any ``vshard`` cluster. Multiple ``router`` instances can be connected to the same cluster.
ru: ``vshard`` поддерживает работу с несколькими роутерами в отдельном экземпляре Tarantool. Каждый роутер может подключиться к любому кластеру ``vshard``. Несколько роутеров могут быть подключены к одному кластеру.

source: As the ``router`` and ``storage`` applications perform completely different sets of functions, they should be deployed to different Tarantool instances. Although it is technically possible to place the router application on every ``storage`` node, this approach is highly discouraged and should be avoided on production deployments.
ru: Поскольку приложения роутера (``router``) и хранилища (``storage``) выполняют совершенно разные наборы функций, их следует разворачивать на различных экземплярах Tarantool. Хотя технически возможно разместить приложение роутера на каждом узле типа хранилища, такой подход крайне не рекомендуется, и его следует избегать при развертывании в производственной среде.

source: All ``storage`` instances can be deployed using identical instance (configuration) files.
ru: Все хранилища можно развернуть, используя один набор файлов экземпляра (конфигурационных файлов).

source: Self-identification is currently performed using ``tarantoolctl``:
ru: Самоопределение в настоящий момент осуществляется с помощью ``tarantoolctl``:

source: $ tarantoolctl instance_name
ru: $ tarantoolctl имя_экземпляра

source: All ``router`` instances can also be deployed using identical instance (configuration) files.
ru: Все роутеры также можно развернуть, используя один набор файлов экземпляра (конфигурационных файлов).

source: All cluster nodes must share a common topology. An administrator must ensure that the configurations are identical. We suggest using a configuration management tool like Ansible or Puppet to deploy the cluster.
ru: Топология всех узлов кластера должна быть одинаковой. Администратор должен убедиться, что конфигурации совпадают. Рекомендуем использовать инструмент управления конфигурациями, такой как Ansible или Puppet, во время развертывания кластера.

source: Sharding is not integrated into any system for centralized configuration management. It is expected that the application itself is responsible for interacting with such a system and passing the sharding parameters.
ru: Шардинг не интегрирован ни в одну систему для централизованного управления конфигурациями. Предполагается, что само приложение отвечает за взаимодействие с такой системой и передачу параметров шардинга.

source: The configuration example of a simple sharded cluster is available :ref:`here <vshard-config-cluster-example>`.
ru: Пример настройки простого сегментированного кластера можно найти :ref:`здесь <vshard-config-cluster-example>`.

source: Replica weights
ru: Вес реплики

source: The ``router`` sends all read-write requests to the master instance only. Setting replica weights allows sending read-only requests not only to the master instance, but to any available replica that is the 'nearest' to the ``router``. Weights are used to define distances between replicas within a replica set.
ru: Роутер отправляет все запросы чтения и записи только на мастер-экземпляр. Задав вес реплики, можно разрешить отправку запросов только на чтение не только на мастер-экземпляр, но и на доступную реплику, которая находится ближе всего к роутеру. Вес используется для определения расстояния между репликами в наборе реплик.

source: Weights can be used, for example, to define the physical distance between the ``router`` and each replica in each replica set. In this case read requests are sent to the nearest replica (with the lowest weight).
ru: Например, вес можно использовать для определения физического расстояния между роутером и каждой репликой в наборе реплик. В таком случае запросы на чтение будут отправляться на ближайшую реплику (с наименьшим весом).

source: Setting weights can also help to define the most powerful replicas: the ones that can process the largest number of requests per second.
ru: Кроме того, можно задать вес реплик, чтобы определить наиболее мощную реплику, которая может обрабатывать наибольшее количество запросов в секунду.

source: The idea is to specify the zone for every ``router`` and every replica, therefore filling a matrix of relative zone weights. This approach allows setting different weights in different zones for the same replica set.
ru: Основная идея состоит в том, чтобы указать зону для каждого ``роутера`` и каждой реплики, и таким образом составить матрицу относительных весов зоны. Этот подход позволяет устанавливать разный вес в разных зонах для одного набора реплик.

source: To set weights, use the zone attribute for each replica during configuration:
ru: Чтобы задать вес, используйте атрибут zone (зона) для каждой реплики во время конфигурации:

source: local cfg = { sharding = { ['...replicaset_uuid...'] = { replicas = { ['...replica_uuid...'] = { ..., zone = <number or string> } } } } }
ru: local cfg = { sharding = { ['...uuid_набора_реплик...'] = { replicas = { ['...uuid_реплики...'] = { ..., zone = <число или строка> } } } } }

source: Then, specify relative weights for each zone pair in the ``weights`` parameter of ``vshard.router.cfg``. For example:
ru: Затем укажите относительный вес для каждой пары зон в параметре ``weights`` (вес) в ``vshard.router.cfg``. Например:

source: weights = { [1] = { [2] = 1, -- Routers of the 1st zone see the weight of the 2nd zone as 1. [3] = 2, -- Routers of the 1st zone see the weight of the 3rd zone as 2. [4] = 3, -- ... }, [2] = { [1] = 10, [2] = 0, [3] = 10, [4] = 20, }, [3] = { [1] = 100, [2] = 200, -- Routers of the 3rd zone see the weight of the 2nd zone as 200. -- Mind that it is not equal to the weight of the 2nd zone visible -- from the 1st zone (= 1). [4] = 1000, } } local cfg = vshard.router.cfg({weights = weights, sharding = ...})
ru: weights = { [1] = { [2] = 1, -- Роутеры 1 зоны видят вес 2 зоны = 1. [3] = 2, -- Роутеры 1 зоны видят вес 3 зоны = 2 . [4] = 3, -- ... }, [2] = { [1] = 10, [2] = 0, [3] = 10, [4] = 20, }, [3] = { [1] = 100, [2] = 200, -- Роутеры 3 зоны видят вес 2 зоны = 200. -- Обратите внимание, что этот вес не равен весу 2 зоны (= 2), -- который видят роутеры 1 зоны (= 1). [4] = 1000, } } local cfg = vshard.router.cfg({weights = weights, sharding = ...})

source: Replica set weights
ru: Вес набора реплик

source: A replica set weight is not the same as the replica weight. The weight of a replica set defines the capacity of the replica set: the larger the weight, the more buckets the replica set can store. The total size of all sharded spaces in the replica set is also its capacity metric.
ru: Вес набора реплик не равноценен весу реплики. Вес набора реплик определяет производительность набора реплик: чем больше вес, тем больше сегментов может хранить набор реплик. Общий размер всех сегментированных спейсов в наборе реплик также определяет его производительность.

source: You can consider replica set weights as the relative amount of data within a replica set. For example, if ``replicaset_1 = 100``, and ``replicaset_2 = 200``, the second replica set stores twice as many buckets as the first one. By default, all weights of all replica sets are equal.
ru: Вес набора реплик можно рассматривать как относительный объем данных в наборе реплик. Например, если ``replicaset_1 = 100``, и ``replicaset_2 = 200``, второй набор реплик хранит в два раза больше сегментов, чем первый. По умолчанию веса всех наборов реплик равны.

source: You can use weights, for example, to store the prevailing amount of data on a replica set with more memory space.
ru: Вес можно использовать, к примеру, чтобы хранить преобладающий объем данных в наборе реплик с большим объемом памяти.

source: Rebalancing process
ru: Процесс балансировки

source: There is an **etalon number** of buckets for a replica set. (Etalon in this context means "ideal".) If there is no deviation from this number in the whole replica set, then the buckets are distributed evenly.
ru: Существует **эталонное число** сегментов в наборе реплик ("эталонный" в данном случае значит идеальный). Если во всем наборе реплик это число остается неизменным, то сегменты распределяются равномерно.

source: The etalon number is calculated automatically considering the number of buckets in the cluster and weights of the replica sets.
ru: Эталонное число рассчитывается автоматически с учетом количества сегментов в кластере и веса наборов реплик.

source: Rebalancing starts if the **disbalance threshold of a replica set** exceeds the disbalance threshold :ref:`specified in the configuration <cfg_basic-rebalancer_disbalance_threshold>`.
ru: Балансировка начинается, когда **предел дисбаланса в наборе реплик** превышает предел дисбаланса, :ref:`указанный в конфигурации<cfg_basic-rebalancer_disbalance_threshold>`.

source: The disbalance threshold of a replica set is calculated as follows:
ru: Предел дисбаланса набора реплик рассчитывается следующим образом:

source: |etalon_bucket_number - real_bucket_number| / etalon_bucket_number * 100
ru: |эталонное_число_сегментов - текущее_число_сегментов| / эталонное_число_сегментов * 100

source: For example: The user specified the number of buckets is 3000, and weights of 3 replica sets are 1, 0.5, and 1.5. The resulting etalon numbers of buckets for the replica sets are: 1st replica set – 1000, 2nd replica set – 500, 3rd replica set – 1500.
ru: Например: Пользователь указал, что количество сегментов = 3000, а вес 3 наборов реплик составляет 1, 0,5 и 1,5. В результате получаем следующее эталонное число сегментов для наборов реплик: 1 набор реплик – 1000, 2 набор реплик – 500, 3 набор реплик – 1500.

source: This approach allows assigning a zero weight to a replica set, which initiates migration of its buckets to the remaining cluster nodes. It also allows adding a new zero-load replica set, which initiates migration of the buckets from the loaded replica sets to the zero-load replica set.
ru: Такой подход позволяет назначить нулевой вес для набора реплик, который запускает миграцию сегментов на оставшиеся узлы кластера. Это также позволяет добавить новый набор реплик с нулевой нагрузкой, который запускает миграцию сегментов из загруженных наборов реплик в набор реплик с нулевой нагрузкой.

source: A new zero-load replica set should be assigned a weight for rebalancing to start.
ru: Новому набору реплик с нулевой нагрузкой следует присвоить вес, чтобы начать процесс балансировки.

source: When a new shard is added, the configuration can be updated dynamically:
ru: При добавлении нового шарда конфигурацию можно обновить динамически:

source: The configuration should be updated on all the ``routers`` first, and then on all the ``storages``.
ru: Конфигурацию следует сначала обновить на всех роутерах, а затем на всех хранилищах.

source: The new shard becomes available for rebalancing in the ``storage`` layer.
ru: Новый шард становится доступен для балансирования на уровне хранилища.

source: As a result of rebalancing, buckets are migrated to the new shard.
ru: В результате балансировки происходит миграция сегментов на новый шард.

source: If a migrated bucket is requested, ``router`` receives an error code containing information about the new location of the bucket.
ru: Если происходит запрос к перемещенному сегменту, ``роутер`` получает код ошибки с информацией о новом местонахождении сегмента.

source: At this time, the new shard is already present in the ``router``'s pool of connections, so redirection is transparent for the application.
ru: В это время новый шард уже включен в пул соединений ``роутера``, поэтому переадресация видима для приложения.

source: Parallel rebalancing
ru: Параллельная балансировка

source: Originally, ``vshard`` had quite a simple ``rebalancer`` – one process on one node that calculated *routes* which should send buckets, how many, and to whom. The nodes applied these routes one by one sequentially.
ru: Балансировщик в ``vshard`` первоначально был довольно прост: один процесс на одном узле, который рассчитывал *маршруты* отправки сегментов, сколько их отправлять и куда. Узлы применяли эти маршруты один за другим последовательно.

source: Unfortunately, such a simple schema worked not fast enough, especially for Vinyl, where costs of reading disk were comparable with network costs. In fact, with Vinyl the ``rebalancer`` routes applier was sleeping most of the time.
ru: К сожалению, такая простая схема работала недостаточно быстро, особенно для Vinyl'а, где затраты ресурсов на чтение диска были сопоставимы с сетевыми затратами. На самом деле, механизм применения маршрутов в балансировщике Vinyl'а большую часть времени был в режиме ожидания.

source: Now each node can send multiple buckets in parallel in a round-robin manner to multiple destinations, or to just one.
ru: Теперь каждый узел может параллельно посылать несколько сегментов по кругу в несколько пунктов назначения или всего в один.

source: To set the degree of parallelism, a new option was added -- :ref:`rebalancer_max_sending <cfg_basic-rebalancer_max_sending>`. You can specify it in a storage configuration in the root table:
ru: Чтобы определять степень параллельности, используется новая опция :ref:`rebalancer_max_sending <cfg_basic-rebalancer_max_sending>`. Задавать ее можно в конфигурации хранилища в корневой таблице:

source: In routers, this option is ignored.
ru: Этот параметр не учитывается для роутеров.

source: Specifying ``cfg.rebalancer_max_sending = N`` probably won't give N times speed up. It depends on network, disk, number of other fibers in the system.
ru: Задав ``cfg.rebalancer_max_sending = N``, вы вряд ли получите N-кратное ускорение. На это влияют многие факторы: сеть, диск, количество других файберов в системе.

source: **Example #1:**
ru: **Пример №1:**

source: You have 10 replica sets and a new one is added. Now all the 10 replica sets will try to send buckets to the new one.
ru: У вас уже есть 10 наборов реплик, добавили новый. Теперь все 10 наборов реплик будут пытаться отправить сегменты на новый.

source: Assume that each replica set can send up to 5 buckets at once. In that case, the new replica set will experience a rather big load of 50 buckets being downloaded at once. If the node needs to do some other work, perhaps such a big load is undesirable. Also too many parallel buckets can cause timeouts in the rebalancing process itself.
ru: Предположим, каждый набор реплик может отправить до 5 сегментов одновременно. В этом случае будет довольно большая нагрузка на новый набор реплик: одновременная загрузка 50 сегментов. Если узлу нужно выполнить какую-то другую работу, возможно, такая большая нагрузка нежелательна. Кроме того, слишком большое количество параллельно загружаемых сегментов может привести к задержкам самого процесса балансировки.

source: To fix the problem, you can set a lower value for ``rebalancer_max_sending`` for old replica sets, or decrease ``rebalancer_max_receiving`` for the new one. In the latter case some workers on old nodes will be throttled, and you will see that in the logs.
ru: Чтобы исправить это, можно установить меньшее значение ``rebalancer_max_sending`` для старых наборов реплик или же уменьшить ``rebalancer_max_receiving`` для нового набора реплик. В последнем случае будет происходить управление загрузкой на старых узлах, и вы увидите это в логах.

source: ``rebalancer_max_sending`` is important, if you have restrictions for the maximal number of buckets that can be read-only at once in the cluster. As you remember, when a bucket is being sent, it does not accept new write requests.
ru: Важно значение параметра ``rebalancer_max_sending``, если у вас есть ограничение на максимальное количество сегментов, которые могут быть одновременно доступны только для чтения в кластере. Как упоминалось выше, во время отправки сегмент не принимает новые запросов на запись.

source: **Example #2:**
ru: **Пример №2:**

source: You have 100000 buckets and each bucket stores ~0.001% of your data. The cluster has 10 replica sets. And you never can afford > 0.1% of data locked on write. Then you should not set ``rebalancer_max_sending`` > 10 on these nodes. It guarantees that the rebalancer won't send more than 100 buckets at once in the whole cluster.
ru: У вас есть 100 000 сегментов, и каждый сегмент хранит ~ 0,001% ваших данных. В кластере 10 наборов реплик. И нельзя позволить себе заблокировать для записи > 0,1% данных. Таким образом, не следует устанавливать значение ``rebalancer_max_sending`` > 10 на этих узлах. Тогда балансировщик не будет посылать более 100 сегментов одновременно по всему кластеру.

source: If ``max_sending`` is too high and ``max_receiving`` is too low, then some buckets will try to get relocated – and will fail with that. This problem will consume network resources and time. It is important to configure these parameters to not conflict with each other.
ru: Если значение ``max_sending`` задано слишком высоко, а ``max_receiving`` слишком низко, то некоторые сегменты будут пытаться переместиться -- и не смогут. При этом будут расходоваться сетевые ресурсы и время. Важно настроить эти параметры так, чтобы они не конфликтовали друг с другом.

source: Replica set lock and bucket pin
ru: Блокировка набора реплик и закрепление корзины

source: A replica set lock makes a replica set invisible to the ``rebalancer``: a locked replica set can neither receive new buckets nor migrate its own buckets.
ru: Блокировка набора реплик делает набор реплик невидимым для балансировщика: заблокированный набор реплик не может ни принимать новые сегменты, ни мигрировать собственные сегменты.

source: A bucket pin blocks a specific bucket from migrating: a pinned bucket stays on the replica set to which it is pinned, until it is unpinned.
ru: В результате закрепления сегмента определенный сегмент блокируется для миграции: закрепленный сегмент остается в наборе реплик, в котором он закреплен, до отмены закрепления.

source: Pinning all replica set buckets is not equivalent to locking a replica set. Even if you pin all buckets, a non-locked replica set can still receive new buckets.
ru: Закрепление всех сегментов в наборе реплик не означает блокирование набора реплик. Даже после закрепления всех сегментов незаблокированный набор реплик может принимать новые сегменты.

source: Replica set lock is helpful, for example, to separate a replica set from production replica sets for testing, or to preserve some application metadata that must not be sharded for a while. A bucket pin is used for similar cases but in a smaller scope.
ru: Блокировка набора реплик используется, к примеру, чтобы выделить для тестирования набор реплик из наборов реплик, используемых в производстве, или чтобы сохранить некоторые метаданные приложения, которые в течение некоторого времени не должны быть сегментированы. Закрепление сегмента используется в похожих случаях, но в меньшем масштабе.

source: By both locking a replica set and pinning all buckets, one can isolate an entire replica set.
ru: Блокировка набора реплик и закрепление всех сегментов означает изоляцию целого набора реплик.

source: Locked replica sets and pinned buckets affect the rebalancing algorithm as the ``rebalancer`` must ignore locked replica sets and consider pinned buckets when attempting to reach the best possible balance.
ru: Заблокированные наборы реплик и закрепленные сегменты влияют на алгоритм балансировки, так как ``балансировщик`` должен игнорировать заблокированные наборы реплик и учитывать закрепленные сегменты при попытке достичь наилучшего возможного баланса.

source: The issue is not trivial as a user can pin too many buckets to a replica set, so a perfect balance becomes unreachable. For example, consider the following cluster (assume all replica set weights are equal to 1).
ru: Это нетривиальная задача, поскольку пользователь может закрепить слишком много сегментов в наборе реплик, так что становится невозможным достижение идеального баланса. Например, рассмотрим следующий кластер (предположим, что все веса наборов реплик равны 1).

source: The initial configuration:
ru: Начальная конфигурация:

source: rs1: bucket_count = 150 rs2: bucket_count = 150, pinned_count = 120
ru: rs1: bucket_count = 150 -- число сегментов rs2: bucket_count = 150, pinned_count = 120 -- число сегментов, число закрепленных сегментов

source: Adding a new replica set:
ru: Добавление нового набора реплик:

source: The perfect balance would be ``100 - 100 - 100``, which is impossible since the ``rs2`` replica set has 120 pinned buckets. The best possible balance here is the following:
ru: Идеальным балансом было бы ``100 - 100 - 100``, чего невозможно достичь, поскольку набор реплик ``rs2`` содержит 120 закрепленных сегментов. The best possible balance here is the following:

source: The ``rebalancer`` moved as many buckets as possible from ``rs2`` to decrease the disbalance. At the same time it respected equal weights of ``rs1`` and ``rs3``.
ru: ``Балансировщик`` переместил максимально возможное количество сегментов из ``rs2``, чтобы уменьшить дисбаланс. В то же время он учел одинаковый вес respected ``rs1`` и ``rs3``.

source: The algorithms for implementing locks and pins are completely different, although they look similar in terms of functionality.
ru: Алгоритмы реализации блокировки и закрепления совершенно разные, хотя с точки зрения функций они похожи.
