Repository: tarantool/doc
Catalog: locale/*/LC_MESSAGES/reference/reference_lua/box_slab/runtime_info.po
Languages: ru

source: Show runtime memory usage report in bytes.
ru: Отображение отчета по использованию runtime-памяти в байтах.

source: The runtime memory encompasses internal Lua memory as well as the runtime arena. The Lua memory stores Lua objects. The runtime arena stores Tarantool-specific objects -- for example, runtime tuples, network buffers and other objects associated with the application server subsystem.
ru: Runtime-память включает в себя внутреннюю память Lua и runtime-арену. В памяти Lua хранятся объекты Lua. На runtime-арене хранятся объекты, специфичные для Tarantool: временные пользовательские кортежи, сетевые буферы и прочие объекты, связанные с подсистемой сервера приложений.

source: return
ru: возвращает

source: ``lua`` is the size of the Lua heap that is controlled by the Lua garbage collector.
ru: ``lua`` -- размер динамической памяти Lua, контролируемой сборщиком мусора в Lua;

source: ``maxalloc`` is the maximum size of the runtime memory.
ru: ``maxalloc`` -- максимальный размер runtime-памяти;

source: ``used`` is the current number of bytes used by the runtime memory.
ru: ``used`` -- объем памяти, используемый runtime-памятью в данный момент.

source: rtype
ru: тип возвращаемого значения

source: table
ru: таблица

source: **Example:**
ru: **Пример:**
