Repository: tarantool/doc
Catalog: locale/*/LC_MESSAGES/reference/reference_lua/box_slab/slab_info.po
Languages: ru

source: Show an aggregated memory usage report (in bytes) for the slab allocator. This report is useful for assessing out-of-memory risks.
ru: Отображение обобщенного отчета по использованию памяти (в байтах) для распределения slab. Данный отчет используется для оценки риска нехватки памяти.

source: ``box.slab.info`` gives a few ratios:
ru: ``box.slab.info`` выдает несколько показателей:

source: Here are two possible cases for monitoring memtx memory usage:
ru: При мониторинге используемой памяти в memtx'е есть два возможных сценария:

source: **Case 1:** 0.5 < ``items_used_ratio`` < 0.9
ru: **1 сценарий:** 0.5 < ``items_used_ratio`` < 0.9

source: Apparently your memory is highly fragmented. Check how many slab classes you have by looking at ``box.slab.stats()`` and counting the number of different classes. If there are many slab classes (more than a few dozens), you may run out of memory even though memory utilization is not high. While each slab may have few items used, whenever a tuple of a size different from any existing slab class size is allocated, Tarantool may need to get a new slab from the slab arena, and since the arena has few empty slabs left, it will attempt to increase its quota usage, which, in turn, may end up with an out-of-memory error due to the low remaining quota.
ru: Очевидно, память сильно фрагментирована. Проверьте, сколько у вас классов slab, подсчитав количество различных классов с помощью ``box.slab.stats()``. Если классов slab много (больше нескольких десятков), то память может закончиться, даже если её занято не так много. На каждом slab может быть использовано мало элементов. Но всякий раз при выделении кортежа, размер которого отличается от любого существующего класса, Tarantool может понадобиться новый slab из области распределения slab. И если осталось мало пустых slab, то произойдет попытка увеличения квоты, что, в свою очередь, может привести к ошибке нехватки памяти из-за низкой оставшейся квоты памяти.

source: **Case 2:** ``items_used_ratio`` > 0.9
ru: **2 сценарий:** ``items_used_ratio`` > 0.9

source: You are running out of memory. All memory utilization indicators are high. Your memory is not fragmented, but there are few reserves left on each slab allocator level. You should consider increasing Tarantool's memory limit (``box.cfg.memtx_memory``).
ru: Память заканчивается. Высокие показатели использования памяти. Память не фрагментирована, но каждый уровень механизма распределения slab почти пуст. Следует подумать об увеличении лимита памяти Tarantool (``box.cfg.memtx_memory``).

source: **To sum up:** your main out-of-memory indicator is ``quota_used_ratio``. However, there are lots of perfectly stable setups with a high ``quota_used_ratio``, so you only need to pay attention to it when both arena and item used ratio are also high.
ru: **Вывод:** основной показатель нехватки памяти -- ``quota_used_ratio``. Тем не менее, существует множество абсолютно стабильных установок с высоким показателем ``quota_used_ratio`` , поэтому необходимо обращать на это внимание, когда два других показателя также высоки (arena и item used).

source: return
ru: возвращает

source: ``quota_size`` - memory limit for slab allocator (as configured in the :ref:`memtx_memory <cfg_storage-memtx_memory>` parameter, the default is 2^28 bytes = 268,435,456 bytes)
ru: ``quota_size`` -- лимит памяти для механизма распределения slab (как настроено в параметре :ref:`memtx_memory <cfg_storage-memtx_memory>`, по умолчанию 2^28 байтов = 268 435 456 байтов)

source: ``quota_used`` - used by slab allocator
ru: ``quota_used`` -- использовано механизмом распределения slab

source: ``items_size`` - allocated only for tuples
ru: ``items_size`` -- выделено только для кортежей

source: ``items_used`` - used only for tuples
ru: ``items_used`` -- использовано только для кортежей

source: ``arena_size`` - allocated for both tuples and indexes
ru: ``arena_size`` -- выделено для кортежей и индексов вместе

source: ``arena_used`` - used for both tuples and indexes
ru: ``arena_used`` -- использовано для кортежей и индексов вместе

source: rtype
ru: тип возвращаемого значения

source: table
ru: таблица

source: **Example:**
ru: **Пример:**
