Repository: tarantool/doc
Catalog: locale/*/LC_MESSAGES/book/connectors.po
Languages: ru

source: Connectors
ru: Коннекторы

source: This chapter documents APIs for various programming languages:
ru: В этой главе описаны API для различных языков программирования:

source: Protocol
ru: Протокол

source: Tarantool's binary protocol was designed with a focus on asynchronous I/O and easy integration with proxies. Each client request starts with a variable-length binary header, containing request id, request type, instance id, log sequence number, and so on.
ru: Бинарный протокол передачи данных в Tarantool был разработан с учетом потребностей асинхронного ввода-вывода для облегчения интеграции с прокси-серверами. Каждый клиентский запрос начинается с бинарного заголовка переменной длины. В заголовке указывается идентификатор и тип запроса, идентификатор экземпляра, номер записи в журнале и т.д.

source: The mandatory length, present in request header simplifies client or proxy I/O. A response to a request is sent to the client as soon as it is ready. It always carries in its header the same type and id as in the request. The id makes it possible to match a request to a response, even if the latter arrived out of order.
ru: Также в заголовке обязательно указывается длина запроса, что облегчает обмен данными с клиентом или прокси. Ответ на запрос посылается по мере готовности. В заголовке ответа указывается тот же идентификатор и тип запроса, что и в изначальном запросе. По идентификатору легко соотнести запрос с ответом, даже если ответы приходят в произвольном порядке.

source: Unless implementing a client driver, you needn't concern yourself with the complications of the binary protocol. Language-specific drivers provide a friendly way to store domain language data structures in Tarantool. A complete description of the binary protocol is maintained in annotated Backus-Naur form in the source tree. For detailed examples and diagrams of all binary-protocol requests and responses, see :ref:`Tarantool's binary protocol <box_protocol-iproto_protocol>`.
ru: Вдаваться в тонкости реализации бинарного протокола нужно, только если вы разрабатываете новый коннектор для Tarantool. В остальных случаях достаточно взять уже существующий коннектор для нужного вам языка программирования. Такие коннекторы позволяют без труда хранить в формате Tarantool структуры данных из разных языков. Полное описание бинарного протокола в Tarantool хранится в дереве исходного кода в виде аннотированных форм Бэкуса --- Наура (BNF-диаграмм). Подробные примеры и диаграммы всех запросов и ответов можно найти в :ref:`описании бинарного протокола в Tarantool <box_protocol-iproto_protocol>`.

source: Packet example
ru: Пример пакета данных

source: The Tarantool API exists so that a client program can send a request packet to a server instance, and receive a response. Here is an example of a what the client would send for ``box.space[513]:insert{'A', 'BB'}``. The BNF description of the components is on the page about :ref:`Tarantool's binary protocol <box_protocol-iproto_protocol>`.
ru: С помощью API Tarantool клиентские программы могут отправлять на адрес экземпляра пакеты с запросами и получать на них ответы. Пример ниже относится к клиентскому запросу ``box.space[513]:insert{'A', 'BB'}``. Описания компонентов запроса, представленные в форме Бэкуса --- Наура, вы найдете на странице о :ref:`бинарном протоколе Tarantool <box_protocol-iproto_protocol>`.

source: Component
ru: Компонент

source: Byte #0
ru: Байт 0

source: Byte #1
ru: Байт 1

source: Byte #2
ru: Байт 2

source: Byte #3
ru: Байт 3

source: code for insert
ru: код операции insert

source: rest of header
ru: остальная часть заголовка

source: 2-digit number: space id
ru: двузначное число: ID спейса

source: code for tuple
ru: код кортежа

source: 1-digit number: field count = 2
ru: однозначное число: количество полей = 2

source: 1-character string: field[1]
ru: односимвольная строка: поле[1]

source: 2-character string: field[2]
ru: двухсимвольная строка: поле[2]

source: Now, you could send that packet to the Tarantool instance, and interpret the response (the page about :ref:`Tarantool's binary protocol <box_protocol-iproto_protocol>` has a description of the packet format for responses as well as requests). But it would be easier, and less error-prone, if you could invoke a routine that formats the packet according to typed parameters. Something like ``response = tarantool_routine("insert", 513, "A", "B");``. And that is why APIs exist for drivers for Perl, Python, PHP, and so on.
ru: Этот пакет можно отправить экземпляру Tarantool, а затем расшифровать ответ. Формат пакетов запроса и ответа также описан на странице о :ref:`бинарном протоколе Tarantool <box_protocol-iproto_protocol>`. Однако проще и надежнее вызвать процедуру, которая сформирует готовый пакет с заданными параметрами. Например, она могла бы выглядеть так: ``response = tarantool_routine("insert", 513, "A", "B");``. Для этого и существуют API для драйверов Perl, Python, PHP и т. д.

source: Setting up the server for connector examples
ru: Настройка окружения для работы с примерами

source: This chapter has examples that show how to connect to a Tarantool instance via the Perl, PHP, Python, node.js, and C connectors. The examples contain hard code that will work if and only if the following conditions are met:
ru: В этой главе приводятся примеры того, как можно установить соединение с сервером Tarantool с помощью коннекторов для языков Perl, PHP, Python, Node.js и C. Примеры содержат фиксированные значения и будут корректно работать только при следующих условиях:

source: the Tarantool instance (tarantool) is running on localhost (127.0.0.1) and is listening on port 3301 (``box.cfg.listen = '3301'``),
ru: Экземпляр (tarantool) запущен на локальной машине (``localhost = 127.0.0.1``), а прослушивание для него настроено на порту 3301 (``box.cfg.listen = '3301'``).

source: space ``examples`` has id = 999 (``box.space.examples.id = 999``) and has a primary-key index for a numeric field (``box.space[999].index[0].parts[1].type = "unsigned"``),
ru: В базе есть спейс ``examples`` с идентификатором 999 (``box.space.examples.id = 999``). Первичный индекс этого спейса построен по ключу числового типа (``box.space[999].index[0].parts[1].type = "unsigned"``).

source: user 'guest' has privileges for reading and writing.
ru: Пользователь 'guest' имеет разрешение на чтение и запись.

source: It is easy to meet all the conditions by starting the instance and executing this script:
ru: Можно легко соблюсти все условия, запустив экземпляр и выполнив следующий скрипт:

source: There are two Java connectors available:
ru: В Tarantool доступны два Java-коннектора:

source: `cartridge-java <http://github.com/tarantool/cartridge-java/>`__ supports both single Tarantool nodes and clusters, as well as applications built using the :doc:`Cartridge framework </book/cartridge/index>` and its modules. The Tarantool team actively updates this module with the newest Tarantool features.
ru: `cartridge-java <http://github.com/tarantool/cartridge-java/>`__ поддерживает как отдельные узлы и кластеры Tarantool, так и приложения, созданные с использованием :doc:`фреймворка Cartridge </book/cartridge/index>` и его модулей. Команда Tarantool активно добавляет в этот модуль новейшие функциональные возможности платформы.

source: `tarantool-java <http://github.com/tarantool/tarantool-java/>`__ works with early Tarantool versions (1.6 and later) and offers JDBC interface support for single Tarantool nodes. This module *isn't currently maintained* and does not support the newest 2.x Tarantool features or Tarantool clusters.
ru: `tarantool-java <http://github.com/tarantool/tarantool-java/>`__ предназначен для ранних версий Tarantool (1.6 и выше) и предоставляет поддержку интерфейса JDBC для одиночных узлов Tarantool. Этот модуль *в настоящее время не поддерживается* и не работает ни с новейшими функциональными возможностями Tarantool 2.x, ни с кластерами Tarantool.

source: The following modules support Java libraries and frameworks:
ru: Для работы с библиотеками и фреймворками Java в Tarantool есть следующие модули:

source: `TestContainers Tarantool module <http://github.com/tarantool/cartridge-java-testcontainers/>`__ adds support for the popular `TestСontainers framework <https://www.testcontainers.org/>`__ used for integration testing of Java applications.
ru: Модуль Tarantool `TestContainers <http://github.com/tarantool/cartridge-java-testcontainers/>`__ добавляет поддержку популярного `фреймворка TestСontainers <https://www.testcontainers.org/>`__, который используется для интеграционного тестирования приложений Java.

source: `Spring Data Tarantool module <http://github.com/tarantool/cartridge-springdata/>`__ adds support for the `Spring framework <https://projects.spring.io/spring-data/>`__.
ru: `Модуль Tarantool Spring Data <http://github.com/tarantool/cartridge-springdata/>`__ добавляет поддержку `фреймворка Spring <https://projects.spring.io/spring-data/>`__.

source: Check out the `Spring Pet Clinic project <http://github.com/tarantool/spring-petclinic-tarantool/>`__ to get familiar with using this module in real applications.
ru: Чтобы узнать, как использовать этот модуль в реальных приложениях, ознакомьтесь с `проектом Spring Pet Clinic <http://github.com/tarantool/spring-petclinic-tarantool/>`__.

source: The following connectors are available:
ru: В Tarantool доступны следующие коннекторы для Go:

source: Tarantool-supported `go-tarantool <https://github.com/tarantool/go-tarantool>`__
ru: `go-tarantool <https://github.com/tarantool/go-tarantool>`__, поддерживаемый командой Tarantool.

source: Community-supported `viciious/go-tarantool <https://github.com/viciious/go-tarantool>`_
ru: `viciious/go-tarantool <https://github.com/viciious/go-tarantool>`_, поддерживаемый сообществом разработчиков.

source: Community-supported `FZambia/tarantool <https://github.com/FZambia/tarantool>`_.
ru: `FZambia/tarantool <https://github.com/FZambia/tarantool>`_, поддерживаемый сообществом разработчиков.

source: Feature comparison
ru: Сравнение функций

source: Last update: January 2022
ru: Последнее обновление: январь 2022

source: License
ru: Лицензия

source: Last update
ru: Последнее обновление

source: Documentation
ru: Документация

source: README with examples and up-to-date GoDoc
ru: README с примерами и актуальный GoDoc

source: README with examples, code comments
ru: README с примерами, комментарии к коду

source: README with examples
ru: README с примерами

source: Testing / CI / CD
ru: Тестирование / CI / CD

source: GitHub Stars
ru: GitHub-звезды

source: Static analysis
ru: Статический анализ

source: No
ru: Нет

source: Packaging
ru: Способ упаковки

source: Code coverage
ru: Покрытие кода

source: msgpack driver
ru: Драйвер msgpack

source: Async work
ru: Асинхронная работа

source: Yes
ru: Да

source: Schema reload
ru: Обновление схемы

source: Yes (manual pull)
ru: Есть (запускается вручную)

source: Space / index names
ru: Имена спейсов/индексов

source: Tuples as structures
ru: Кортежи как структуры

source: Yes (structure and marshall functions must be predefined in Go code)
ru: Есть (структура и функции маршалинга должны быть предопределены в коде Go)

source: Access tuple fields by names
ru: Доступ к полям кортежей по именам

source: Only if marshalled to structure
ru: Только при маршалинге в структуру

source: `SQL <https://www.tarantool.io/en/doc/latest/reference/reference_sql/>`_ support
ru: Поддержка `SQL <https://www.tarantool.io/en/doc/latest/reference/reference_sql/>`_

source: No (`#62 <https://github.com/tarantool/go-tarantool/issues/62>`_)
ru: Нет (`#62 <https://github.com/tarantool/go-tarantool/issues/62>`_)

source: No (`#18 <https://github.com/viciious/go-tarantool/issues/18>`_, closed)
ru: Нет (`#18 <https://github.com/viciious/go-tarantool/issues/18>`_, тикет закрыт)

source: `Interactive transactions <https://www.tarantool.io/en/doc/latest/book/box/stream/>`_
ru: `Интерактивные транзакции <https://www.tarantool.io/en/doc/latest/book/box/stream/>`_

source: No (`#101 <https://github.com/tarantool/go-tarantool/issues/101>`_)
ru: Нет (`#101 <https://github.com/tarantool/go-tarantool/issues/101>`_)

source: `Varbinary <https://www.tarantool.io/en/doc/latest/book/box/data_model/>`_ support
ru: Поддержка `varbinary <https://www.tarantool.io/en/doc/latest/book/box/data_model/>`_

source: Yes (with in-built language tools)
ru: Есть (встроенными инструментами языка)

source: Yes (decodes to string by default, see `#6 <https://github.com/FZambia/tarantool/issues/6>`_)
ru: Есть (декодирование в строку по умолчанию, см. `#6 <https://github.com/FZambia/tarantool/issues/6>`_)

source: `UUID <https://www.tarantool.io/en/doc/latest/book/box/data_model/>`_ support
ru: Поддержка `UUID <https://www.tarantool.io/en/doc/latest/book/box/data_model/>`_

source: Decimal support
ru: Поддержка decimal

source: No (`#96 <https://github.com/tarantool/go-tarantool/issues/96>`_)
ru: Нет (`#96 <https://github.com/tarantool/go-tarantool/issues/96>`_)

source: `EXT_ERROR <https://www.tarantool.io/ru/doc/latest/dev_guide/internals/msgpack_extensions/#the-error-type>`_ support
ru: Поддержка `EXT_ERROR <https://www.tarantool.io/ru/doc/latest/dev_guide/internals/msgpack_extensions/#the-error-type>`_

source: `Datetime <https://github.com/tarantool/tarantool/discussions/6244>`_ support
ru: Поддержка `datetime <https://github.com/tarantool/tarantool/discussions/6244>`_

source: No (`#118 <https://github.com/tarantool/go-tarantool/issues/118>`_)
ru: Нет (`#118 <https://github.com/tarantool/go-tarantool/issues/118>`_)

source: `box.session.push() responses <https://www.tarantool.io/ru/doc/latest/reference/reference_lua/box_session/push/>`_
ru: `Возвращаемые значения box.session.push() <https://www.tarantool.io/ru/doc/latest/reference/reference_lua/box_session/push/>`_

source: No (`#67 <https://github.com/tarantool/go-tarantool/issues/67>`_)
ru: Нет (`#67 <https://github.com/tarantool/go-tarantool/issues/67>`_)

source: No (`#21 <https://github.com/viciious/go-tarantool/issues/21>`_)
ru: Нет (`#21 <https://github.com/viciious/go-tarantool/issues/21>`_)

source: `Session settings <https://www.tarantool.io/en/doc/latest/reference/reference_lua/box_space/_session_settings/>`_
ru: `Настройки сессии <https://www.tarantool.io/en/doc/latest/reference/reference_lua/box_space/_session_settings/>`_

source: `Graceful shutdown <https://github.com/tarantool/tarantool/issues/5924>`_
ru: `Мягкое завершение <https://github.com/tarantool/tarantool/issues/5924>`_

source: `IPROTO_ID (feature discovering) <https://github.com/tarantool/tarantool/issues/6253>`_
ru: `IPROTO_ID (обнаружение поддерживаемых функций) <https://github.com/tarantool/tarantool/issues/6253>`_

source: `tarantool/crud <https://github.com/tarantool/crud>`_ support
ru: Поддержка `tarantool/crud <https://github.com/tarantool/crud>`_

source: Connection pool
ru: Пул соединений

source: Yes (round-robin failover, no balancing, master discovering planned in `#113 <https://github.com/tarantool/go-tarantool/issues/113>`_)
ru: Есть (циклическое восстановление после сбоев; без балансировки; обнаружение мастера планируется в `#113 <https://github.com/tarantool/go-tarantool/issues/113>`_)

source: Transparent reconnecting
ru: Прозрачное переподключение

source: Yes (see comments in `#129 <https://github.com/tarantool/go-tarantool/issues/129>`_)
ru: Есть (см. комментарии к `#129 <https://github.com/tarantool/go-tarantool/issues/129>`_)

source: No (handle reconnects explicitly, refer to `#11 <https://github.com/viciious/go-tarantool/issues/11>`_)
ru: Нет (дескриптор переподключается явно, см. `#11 <https://github.com/viciious/go-tarantool/issues/11>`_)

source: Yes (see comments in `#7 <https://github.com/FZambia/tarantool/issues/7>`_)
ru: Есть (см. комментарии к `#7 <https://github.com/FZambia/tarantool/issues/7>`_)

source: Transparent request retrying
ru: Прозрачная переотправка запроса

source: `Watchers <https://github.com/tarantool/tarantool/pull/6510>`_
ru: `Наблюдатели (watchers) <https://github.com/tarantool/tarantool/pull/6510>`_

source: Language features
ru: Возможности языка

source: No (`#48 <https://github.com/tarantool/go-tarantool/issues/48>`_)
ru: Нет (`#48 <https://github.com/tarantool/go-tarantool/issues/48>`_)

source: Miscellaneous
ru: Прочее

source: Supports `tarantool/queue <https://github.com/tarantool/queue>`_ API
ru: Поддержка API `tarantool/queue <https://github.com/tarantool/queue>`_

source: Can mimic a Tarantool instance (also as replica). Provides instrumentation for reading snapshot and xlog files via `snapio module <https://github.com/viciious/go-tarantool/tree/master/snapio>`_. Implements unpacking of query structs if you want to implement your own iproto proxy
ru: Может имитировать экземпляр Tarantool (в том числе реплику). Предоставляет инструментарий для чтения снимков данных и файлов xlog с помощью `модуля snapio <https://github.com/viciious/go-tarantool/tree/master/snapio>`_. Реализует распаковку структур запросов, если нужно реализовать свой собственный прокси iproto

source: API is experimental and breaking changes may happen
ru: API коннектора экспериментальный и может значительно измениться

source: Use the `tarantoolr <https://github.com/thekvs/tarantoolr>`__ connector.
ru: Используйте коннектор `tarantoolr <https://github.com/thekvs/tarantoolr>`__.

source: Use the `Erlang tarantool driver <https://github.com/stofel/taran>`__.
ru: Используйте `драйвер Tarantool на Erlang <https://github.com/stofel/taran>`__.

source: The most commonly used Perl driver is `tarantool-perl <https://github.com/tarantool/tarantool-perl>`__. It is not supplied as part of the Tarantool repository; it must be installed separately. The most common way to install it is by cloning from GitHub.
ru: Самый распространенный драйвер для Perl --- `tarantool-perl <https://github.com/tarantool/tarantool-perl>`_. Он не входит в репозиторий Tarantool, его необходимо устанавливать отдельно. Проще всего установить его, склонировав с GitHub.

source: To avoid minor warnings that may appear the first time ``tarantool-perl`` is installed, start with installing some other modules that ``tarantool-perl`` uses, with `CPAN, the Comprehensive Perl Archive Network <https://en.wikipedia.org/wiki/Cpan>`__:
ru: Чтобы избежать нескольких незначительных предупреждений, которые может выдать система после первой установки ``tarantool-perl``, начните установку с модуля `CPAN (Comprehensive Perl Archive Network, Всеобъемлющая сеть архивов Perl) <https://ru.wikipedia.org/wiki/CPAN>`__. Этот модуль необходим для работы ``tarantool-perl``:

source: Then, to install ``tarantool-perl`` itself, say:
ru: Затем установите ``tarantool-perl``:

source: Here is a complete Perl program that inserts ``[99999,'BB']`` into ``space[999]`` via the Perl API. Before trying to run, check that the server instance is listening at ``localhost:3301`` and that the space ``examples`` exists, as :ref:`described earlier <index-connector_setting>`. To run, paste the code into a file named :file:`example.pl` and say :samp:`perl example.pl`. The program will connect using an application-specific definition of the space. The program will open a socket connection with the Tarantool instance at ``localhost:3301``, then send an :ref:`space_object:INSERT <box_space-insert>` request, then — if all is well — end without displaying any messages. If Tarantool is not running on ``localhost`` with :ref:`listen <cfg_basic-listen>` port = 3301, the program will print “Connection refused”.
ru: В следующем примере приводится полноценная программа на Perl, которая осуществляет вставку кортежа ``[99999,'BB']`` в спейс ``space[999]`` с помощью API для языка Perl. Перед запуском проверьте, что экземпляр прослушивает порт ``localhost:3301``, а в базе создан спейс ``examples``, как :ref:`предложено выше <index-connector_setting>`. Чтобы запустить программу, сохраните код в файл :file:`example.pl` и выполните команду :samp:`perl example.pl`. Программа установит соединение, используя определение спейса. Затем она откроет сокет для соединения с экземпляром по адресу ``localhost:3301`` и отправит запрос :ref:`space_object:INSERT<box_space-insert>`. Если запрос будет выполнен успешно, программа после этого закончит работу, не выводя никаких сообщений. Если Tarantool не запущен по адресу ``localhost`` и порт 3301 не :ref:`прослушивается <cfg_basic-listen>`, то программа выведет сообщение об ошибке "Connection refused".

source: #!/usr/bin/perl use DR::Tarantool ':constant', 'tarantool'; use DR::Tarantool ':all'; use DR::Tarantool::MsgPack::SyncClient; my $tnt = DR::Tarantool::MsgPack::SyncClient->connect( host => '127.0.0.1', # look for tarantool on localhost port => 3301, # on port 3301 user => 'guest', # username. for 'guest' we do not also say 'password=>...' spaces => { 999 => { # definition of space[999] ... name => 'examples', # space[999] name = 'examples' default_type => 'STR', # space[999] field type is 'STR' if undefined fields => [ { # definition of space[999].fields ... name => 'field1', type => 'NUM' } ], # space[999].field[1] name='field1',type='NUM' indexes => { # definition of space[999] indexes ... 0 => { name => 'primary', fields => [ 'field1' ] } } } } ); $tnt->insert('examples' => [ 99999, 'BB' ]);
ru: #!/usr/bin/perl use DR::Tarantool ':constant', 'tarantool'; use DR::Tarantool ':all'; use DR::Tarantool::MsgPack::SyncClient; my $tnt = DR::Tarantool::MsgPack::SyncClient->connect( host => '127.0.0.1', # поиск сервера Tarantool по адресу localhost port => 3301, # на порту 3301 user => 'guest', # имя пользователя; здесь же можно задать пароль через 'password=>...' # для пользователя 'guest' пароль не задается spaces => { 999 => { # определение спейса 'space[999]' ... name => 'examples', # имя спейса 'space[999]' = 'examples' default_type => 'STR', # если тип поля в 'space[999]' не задан, то = 'STR' fields => [ { # определение полей в спейсе 'space[999]' ... name => 'field1', type => 'NUM' } ], # имя поля space[999].field[1]='field1', тип ='NUM' indexes => { # определение индексов спейса 'space[999]' ... 0 => { name => 'primary', fields => [ 'field1' ] } } } } ); $tnt->insert('examples' => [ 99999, 'BB' ]);

source: The example program uses field type names 'STR' and 'NUM' instead of :ref:`'string' and 'unsigned' <box_space-create_index>`, due to a temporary Perl limitation.
ru: Из-за временных ограничений языка Perl вместо полей типа :ref:`'string' и 'unsigned' <box_space-create_index>` в тестовой программе используются поля типа 'STR' и 'NUM'.

source: The example program only shows one request and does not show all that's necessary for good practice. For that, please see the `tarantool-perl repository <https://github.com/tarantool/tarantool-perl>`__.
ru: Эта программа --- пример отправки единственного запроса. Чтобы узнать больше о том, как работать с Tarantool, пользуясь языком Perl, обратитесь к документации в `репозитории tarantool-perl <https://github.com/tarantool/tarantool-perl>`__.

source: `tarantool-php <https://github.com/tarantool/tarantool-php>`__ is the official PHP connector for Tarantool. It is not supplied as part of the Tarantool repository and must be installed separately (see `installation instructions <https://github.com/tarantool/tarantool-php/#installing-and-building>`__ in the connector's ``README`` file).
ru: `tarantool-php <https://github.com/tarantool/tarantool-php>`_ --- официальный PHP-коннектор для Tarantool. Он не входит в репозиторий Tarantool, так что его необходимо устанавливать отдельно. Прочитайте `инструкции по установке <https://github.com/tarantool/tarantool-php/#installing-and-building>`_ в файле коннектора :file:`README`.
