Repository: tarantool/doc
Catalog: locale/*/LC_MESSAGES/book/connectors.po
Languages: ru

source: #include <stdio.h> #include <stdlib.h> #include <tarantool/tarantool.h> #include <tarantool/tnt_net.h> #include <tarantool/tnt_opt.h> void main() { struct tnt_stream *tnt = tnt_net(NULL); /* See note = SETUP */ tnt_set(tnt, TNT_OPT_URI, "localhost:3301"); if (tnt_connect(tnt) < 0) { /* See note = CONNECT */ printf("Connection refused\n"); exit(-1); } struct tnt_stream *tuple = tnt_object(NULL); /* See note = MAKE REQUEST */ tnt_object_format(tuple, "[%d%s]", 99999, "B"); tnt_insert(tnt, 999, tuple); /* See note = SEND REQUEST */ tnt_flush(tnt); struct tnt_reply reply; tnt_reply_init(&reply); /* See note = GET REPLY */ tnt->read_reply(tnt, &reply); if (reply.code != 0) { printf("Insert failed %lu.\n", reply.code); } tnt_close(tnt); /* See below = TEARDOWN */ tnt_stream_free(tuple); tnt_stream_free(tnt); }
ru: #include <stdio.h> #include <stdlib.h> #include <tarantool/tarantool.h> #include <tarantool/tnt_net.h> #include <tarantool/tnt_opt.h> void main() { struct tnt_stream *tnt = tnt_net(NULL); /* См. раздел "Настройка" ниже */ tnt_set(tnt, TNT_OPT_URI, "localhost:3301"); if (tnt_connect(tnt) < 0) { /* См. раздел "Соединение" ниже */ printf("Connection refused\n"); exit(-1); } struct tnt_stream *tuple = tnt_object(NULL); /* См. раздел "Формирование запроса" ниже */ tnt_object_format(tuple, "[%d%s]", 99999, "B"); tnt_insert(tnt, 999, tuple); /* См. раздел "Отправка запроса" ниже */ tnt_flush(tnt); struct tnt_reply reply; tnt_reply_init(&reply); /* См. раздел "Получение ответа" ниже */ tnt->read_reply(tnt, &reply); if (reply.code != 0) { printf("Insert failed %lu.\n", reply.code); } tnt_close(tnt); /* См. раздел "Завершение" ниже */ tnt_stream_free(tuple); tnt_stream_free(tnt); }

source: Paste the code into a file named :file:`example.c` and install ``tarantool-c``. One way to install ``tarantool-c`` (using Ubuntu) is:
ru: Скопируйте код программы в файл :file:`example.c` и установите коннектор ``tarantool-c``. Вот один из способов установки ``tarantool-c`` (на Ubuntu):

source: To compile and link the program, run:
ru: Чтобы скомпилировать и слинковать программу, выполните следующую команду:

source: $ # sometimes this is necessary: $ export LD_LIBRARY_PATH=/usr/local/lib $ gcc -o example example.c -ltarantool
ru: $ # иногда это необходимо: $ export LD_LIBRARY_PATH=/usr/local/lib $ gcc -o example example.c -ltarantool

source: Before trying to run, check that a server instance is listening at ``localhost:3301`` and that the space ``examples`` exists, as :ref:`described earlier <index-connector_setting>`. To run the program, say :samp:`./example`. The program will connect to the Tarantool instance, and will send the request. If Tarantool is not running on localhost with listen address = 3301, the program will print “Connection refused”. If the insert fails, the program will print "Insert failed" and an error number (see all error codes in the source file `/src/box/errcode.h <https://github.com/tarantool/tarantool/blob/2.1/src/box/errcode.h>`__).
ru: Перед запуском проверьте, что экземпляр прослушивает порт ``localhost:3301``, а в базе создан спейс ``examples``, как :ref:`предложено выше <index-connector_setting>`. Чтобы запустить программу, выполните команду :samp:`./example`. Программа установит соединение с экземпляром Tarantool и отправит запрос. Если Tarantool не запущен по адресу ``localhost`` и порт 3301 не прослушивается, то программа выведет сообщение об ошибке “Connection refused”. Если запрос на вставку не будет выполнен, программа выведет сообщение "Insert failed" и код ошибки. Все коды ошибок можно найти в исходном файле `/src/box/errcode.h <https://github.com/tarantool/tarantool/blob/2.1/src/box/errcode.h>`__.

source: Here are notes corresponding to comments in the example program.
ru: Ниже вы найдете подробные комментарии к коду тестовой программы.

source: SETUP
ru: **Настройка**

source: The setup begins by creating a stream.
ru: Настройка начинается с создания потока.

source: In this program, the stream will be named ``tnt``. Before connecting on the ``tnt`` stream, some options may have to be set. The most important option is TNT_OPT_URI. In this program, the :ref:`URI <index-uri>` is ``localhost:3301``, since that is where the Tarantool instance is supposed to be listening.
ru: В нашей программе поток назван ``tnt``. Перед установкой соединения с потоком ``tnt`` нужно задать ряд опций. Самая важная из них --- TNT_OPT_URI. Для этой опции указан :ref:`URI <index-uri>` ``localhost:3301``: по этому адресу должно быть настроено прослушивание на стороне экземпляра Tarantool.

source: Function description:
ru: Описание функции:

source: CONNECT
ru: **Соединение**

source: Now that the stream named ``tnt`` exists and is associated with a URI, this example program can connect to a server instance.
ru: Теперь, когда мы создали поток ``tnt`` и связали его с конкретным URI, наша программа может установить соединение с экземпляром.

source: The connection might fail for a variety of reasons, such as: the server is not running, or the URI contains an invalid :ref:`password<authentication-passwords>`. If the connection fails, the return value will be -1.
ru: Попытка соединения может оказаться неудачной по разным причинам, например если Tarantool-сервер не запущен или в строке URI указан неверный :ref:`пароль <authentication-passwords>`. В случае неудачи функция вернет -1.

source: MAKE REQUEST
ru: **Создание запроса**

source: Most requests require passing a structured value, such as the contents of a tuple.
ru: В большинстве запросов требуется передавать структурированные данные, например содержимое кортежа.

source: In this program, the request will be an :ref:`INSERT<box_space-insert>`, and the tuple contents will be an integer and a string. This is a simple serial set of values, that is, there are no sub-structures or arrays. Therefore it is easy in this case to format what will be passed using the same sort of arguments that one would use with a C ``printf()`` function: ``%d`` for the integer, ``%s`` for the string, then the integer value, then a pointer to the string value.
ru: В этом примере программы формируется запрос :ref:`INSERT<box_space-insert>`, а кортеж содержит целое число и строку. Это простой набор значений без каких-либо вложенных структур или массивов. Так что передаваемые значения можно указать самым простым образом --- аналогично тому, как это сделано в стандартной C-функции ``printf()``: целое число ``%d``, строка ``%s``, числовое значение, указатель на строковое значение.

source: SEND REQUEST
ru: **Отправка запроса**

source: The database-manipulation requests are analogous to the requests in the box library.
ru: Отправка запросов на изменение данных в базе выполняется аналогично тому, как это реализовано в библиотеке Tarantool ``box``.

source: In this program, the choice is to do an INSERT request, so the program passes the ``tnt_stream`` that was used for connection (``tnt``) and the ``tnt_stream`` that was set up with :c:func:`tarantoolc:tnt_object_format` (``tuple``).
ru: В этом примере выполняется INSERT-запрос. Передается поток ``tnt``, который использовался для установки соединения, и поток ``tuple``, ранее настроенный с помощью функции :c:func:`tarantoolc:tnt_object_format`.

source: GET REPLY
ru: **Получение ответа**

source: For most requests, the client will receive a reply containing some indication whether the result was successful, and a set of tuples.
ru: В большинстве случаев ответ клиенту содержит информацию о том, был ли запрос выполнен успешно, а также набор кортежей.

source: This program checks for success but does not decode the rest of the reply.
ru: Эта программа проверяет, был ли запрос выполнен успешно, но никак не интерпретирует оставшуюся часть ответа.

source: TEARDOWN
ru: **Завершение**

source: When a session ends, the connection that was made with :c:func:`tarantoolc:tnt_connect` should be closed, and the objects that were made in the setup should be destroyed.
ru: По окончании сессии необходимо завершить соединение, созданное с помощью функции :c:func:`tarantoolc:tnt_connect()`, и удалить объекты, созданные на этапе настройки.

source: Example 2
ru: Пример 2

source: Here is a complete C program that selects, using index key ``[99999]``, from space ``examples`` via the high-level C API. To display the results, the program uses functions in the `MsgPuck <https://github.com/tarantool/msgpuck>`__ library which allow decoding of `MessagePack <https://en.wikipedia.org/wiki/MessagePack>`__ arrays.
ru: В следующем примере приводится полноценная программа на языке C, которая осуществляет выборку по индекс-ключу ``[99999]`` из спейса ``examples`` с помощью высокоуровневого API для языка C. Результаты выводятся с помощью функций из библиотеки `MsgPuck <https://github.com/tarantool/msgpuck>`__, позволяющих декодировать массивы значений в формате `MessagePack <https://en.wikipedia.org/wiki/MessagePack>`__.

source: #include <stdio.h> #include <stdlib.h> #include <tarantool/tarantool.h> #include <tarantool/tnt_net.h> #include <tarantool/tnt_opt.h> #define MP_SOURCE 1 #include <msgpuck.h> void main() { struct tnt_stream *tnt = tnt_net(NULL); tnt_set(tnt, TNT_OPT_URI, "localhost:3301"); if (tnt_connect(tnt) < 0) { printf("Connection refused\n"); exit(1); } struct tnt_stream *tuple = tnt_object(NULL); tnt_object_format(tuple, "[%d]", 99999); /* tuple = search key */ tnt_select(tnt, 999, 0, (2^32) - 1, 0, 0, tuple); tnt_flush(tnt); struct tnt_reply reply; tnt_reply_init(&reply); tnt->read_reply(tnt, &reply); if (reply.code != 0) { printf("Select failed.\n"); exit(1); } char field_type; field_type = mp_typeof(*reply.data); if (field_type != MP_ARRAY) { printf("no tuple array\n"); exit(1); } long unsigned int row_count; uint32_t tuple_count = mp_decode_array(&reply.data); printf("tuple count=%u\n", tuple_count); unsigned int i, j; for (i = 0; i < tuple_count; ++i) { field_type = mp_typeof(*reply.data); if (field_type != MP_ARRAY) { printf("no field array\n"); exit(1); } uint32_t field_count = mp_decode_array(&reply.data); printf(" field count=%u\n", field_count); for (j = 0; j < field_count; ++j) { field_type = mp_typeof(*reply.data); if (field_type == MP_UINT) { uint64_t num_value = mp_decode_uint(&reply.data); printf(" value=%lu.\n", num_value); } else if (field_type == MP_STR) { const char *str_value; uint32_t str_value_length; str_value = mp_decode_str(&reply.data, &str_value_length); printf(" value=%.*s.\n", str_value_length, str_value); } else { printf("wrong field type\n"); exit(1); } } } tnt_close(tnt); tnt_stream_free(tuple); tnt_stream_free(tnt); }
ru: #include <stdio.h> #include <stdlib.h> #include <tarantool/tarantool.h> #include <tarantool/tnt_net.h> #include <tarantool/tnt_opt.h> #define MP_SOURCE 1 #include <msgpuck.h> void main() { struct tnt_stream *tnt = tnt_net(NULL); tnt_set(tnt, TNT_OPT_URI, "localhost:3301"); if (tnt_connect(tnt) < 0) { printf("Connection refused\n"); exit(1); } struct tnt_stream *tuple = tnt_object(NULL); tnt_object_format(tuple, "[%d]", 99999); /* кортеж tuple = ключ для поиска */ tnt_select(tnt, 999, 0, (2^32) - 1, 0, 0, tuple); tnt_flush(tnt); struct tnt_reply reply; tnt_reply_init(&reply); tnt->read_reply(tnt, &reply); if (reply.code != 0) { printf("Select failed.\n"); exit(1); } char field_type; field_type = mp_typeof(*reply.data); if (field_type != MP_ARRAY) { printf("no tuple array\n"); exit(1); } long unsigned int row_count; uint32_t tuple_count = mp_decode_array(&reply.data); printf("tuple count=%u\n", tuple_count); unsigned int i, j; for (i = 0; i < tuple_count; ++i) { field_type = mp_typeof(*reply.data); if (field_type != MP_ARRAY) { printf("no field array\n"); exit(1); } uint32_t field_count = mp_decode_array(&reply.data); printf(" field count=%u\n", field_count); for (j = 0; j < field_count; ++j) { field_type = mp_typeof(*reply.data); if (field_type == MP_UINT) { uint64_t num_value = mp_decode_uint(&reply.data); printf(" value=%lu.\n", num_value); } else if (field_type == MP_STR) { const char *str_value; uint32_t str_value_length; str_value = mp_decode_str(&reply.data, &str_value_length); printf(" value=%.*s.\n", str_value_length, str_value); } else { printf("wrong field type\n"); exit(1); } } } tnt_close(tnt); tnt_stream_free(tuple); tnt_stream_free(tnt); }

source: Similarly to the first example, paste the code into a file named :file:`example2.c`.
ru: Как и в первом примере, сохраните исходный код программы в файле :file:`example2.c`.

source: To compile and link the program, say:
ru: Чтобы скомпилировать и слинковать программу, выполните следующую команду:

source: To run the program, say :samp:`./example2`.
ru: Чтобы запустить программу, выполните команду :samp:`./example2`.

source: The two example programs only show a few requests and do not show all that's necessary for good practice. See more in the `tarantool-c documentation at GitHub <http://github.com/tarantool/tarantool-c>`__.
ru: Эти две программы представляют собой примеры отправки двух запросов. Чтобы узнать больше о том, как работать с Tarantool, пользуясь API для языка C, обратитесь к документации `проекта tarantool-c на GitHub <http://github.com/tarantool/tarantool-c>`__.

source: Interpreting function return values
ru: Интерпретация возвращаемых значений

source: For all connectors, calling a function via Tarantool causes a return in the MsgPack format. If the function is called using the connector's API, some conversions may occur. All scalar values are returned as tuples (with a MsgPack type-identifier followed by a value); all non-scalar values are returned as a group of tuples (with a MsgPack array-identifier followed by the scalar values). If the function is called via the binary protocol command layer -- "eval" -- rather than via the connector's API, no conversions occur.
ru: При работе с любым Tarantool-коннектором функции, вызванные Tarantool, возвращают значения в формате MsgPack. Для функций, вызываемых через API коннектора, формат возвращаемых значений следующий: скалярные значения возвращаются в виде кортежей (идентификатор типа в формате MsgPack, затем значение); все прочие (не скалярные) значения возвращаются в виде групп кортежей (идентификатор массива в формате MsgPack, затем скалярные значения). Если функция вызывается в рамках бинарного протокола (с помощью команды ``eval``), а не через API коннектора, формат возвращаемых ею значений не меняется.

source: In the following example, a Lua function will be created. Since it will be accessed externally by a :ref:`'guest' user<box_space-user>`, a :doc:`grant </reference/reference_lua/box_schema/user_grant>` of an execute privilege will be necessary. The function returns an empty array, a scalar string, two booleans, and a short integer. The values are the ones described in the table :ref:`Common Types and MsgPack Encodings <msgpack-common_types_and_msgpack_encodings>`.
ru: В примере ниже создается Lua-функция. Поскольку эту функцию будет вызывать внешний пользователь :ref:`'guest' user<box_space-user>`, необходимо с помощью :doc:`grant </reference/reference_lua/box_schema/user_grant>` настроить права на исполнение. Функция возвращает пустой массив, строку-скаляр, два логических значения и короткое целое число. Значения соответствуют приведенным в таблице :ref:`стандартных типов в MsgPack-кодировке <msgpack-common_types_and_msgpack_encodings>`.

source: Here is a C program which calls the function. Although C is being used for the example, the result would be precisely the same if the calling program was written in Perl, PHP, Python, Go, or Java.
ru: Следующая программа на C вызывает эту функцию. Хотя в примере приводится код на C, результат будет одинаковым, на каком бы языке ни была написана программа: Perl, PHP, Python, Go или Java.

source: #include <stdio.h> #include <stdlib.h> #include <tarantool/tarantool.h> #include <tarantool/tnt_net.h> #include <tarantool/tnt_opt.h> void main() { struct tnt_stream *tnt = tnt_net(NULL); /* SETUP */ tnt_set(tnt, TNT_OPT_URI, "localhost:3301"); if (tnt_connect(tnt) < 0) { /* CONNECT */ printf("Connection refused\n"); exit(-1); } struct tnt_stream *arg; arg = tnt_object(NULL); /* MAKE REQUEST */ tnt_object_add_array(arg, 0); struct tnt_request *req1 = tnt_request_call(NULL); /* CALL function f() */ tnt_request_set_funcz(req1, "f"); uint64_t sync1 = tnt_request_compile(tnt, req1); tnt_flush(tnt); /* SEND REQUEST */ struct tnt_reply reply; tnt_reply_init(&reply); /* GET REPLY */ tnt->read_reply(tnt, &reply); if (reply.code != 0) { printf("Call failed %lu.\n", reply.code); exit(-1); } const unsigned char *p= (unsigned char*)reply.data; /* PRINT REPLY */ while (p < (unsigned char *) reply.data_end) { printf("%x ", *p); ++p; } printf("\n"); tnt_close(tnt); /* TEARDOWN */ tnt_stream_free(arg); tnt_stream_free(tnt); }
ru: #include <stdio.h> #include <stdlib.h> #include <tarantool/tarantool.h> #include <tarantool/tnt_net.h> #include <tarantool/tnt_opt.h> void main() { struct tnt_stream *tnt = tnt_net(NULL); /* Настройка */ tnt_set(tnt, TNT_OPT_URI, "localhost:3301"); if (tnt_connect(tnt) < 0) { /* Соединение */ printf("Connection refused\n"); exit(-1); } struct tnt_stream *arg; arg = tnt_object(NULL); /* Формирование запроса */ tnt_object_add_array(arg, 0); struct tnt_request *req1 = tnt_request_call(NULL); /* Вызов функции f() */ tnt_request_set_funcz(req1, "f"); uint64_t sync1 = tnt_request_compile(tnt, req1); tnt_flush(tnt); /* Отправка запроса */ struct tnt_reply reply; tnt_reply_init(&reply); /* Получение ответа */ tnt->read_reply(tnt, &reply); if (reply.code != 0) { printf("Call failed %lu.\n", reply.code); exit(-1); } const unsigned char *p= (unsigned char*)reply.data; /* Вывод ответа */ while (p < (unsigned char *) reply.data_end) { printf("%x ", *p); ++p; } printf("\n"); tnt_close(tnt); /* Завершение */ tnt_stream_free(arg); tnt_stream_free(tnt); }

source: When this program is executed, it will print:
ru: По завершении программа выведет на экран следующие значения:

source: The first five bytes --- ``dd 0 0 0 5`` --- are the MsgPack encoding for "32-bit array header with value 5" (see `MsgPack specification <http://github.com/msgpack/msgpack/blob/master/spec.md>`__). The rest are as described in the table :ref:`Common Types and MsgPack Encodings <msgpack-common_types_and_msgpack_encodings>`.
ru: Первые пять байт, ``dd 0 0 0 5``, представляют собой фрагмент данных в формате MsgPack и обозначают 32-битный заголовок массива со значением 5 (см. `спецификацию формата MsgPack <http://github.com/msgpack/msgpack/blob/master/spec.md>`_). Остальные значения описаны в таблице :ref:`стандартных типов в MsgPack-кодировке <msgpack-common_types_and_msgpack_encodings>`.
