Repository: tarantool/doc
Catalog: locale/*/LC_MESSAGES/book/connectors.po
Languages: ru

source: Here is a complete PHP program that inserts ``[99999,'BB']`` into a space named ``examples`` via the PHP API.
ru: В следующем примере приводится полноценная программа на языке PHP, которая осуществляет вставку кортежа ``[99999,'BB']`` в спейс ``examples`` с помощью API для языка PHP.

source: Before trying to run, check that the server instance is :ref:`listening <cfg_basic-listen>` at ``localhost:3301`` and that the space ``examples`` exists, as :ref:`described earlier <index-connector_setting>`.
ru: Перед запуском проверьте, что экземпляр :ref:`прослушивает <cfg_basic-listen>` порт ``localhost:3301``, а в базе создан спейс ``examples``, как :ref:`предложено выше <index-connector_setting>`.

source: To run, paste the code into a file named :file:`example.php` and say:
ru: Чтобы запустить программу, сохраните код в файл :file:`example.php` и выполните следующую команду:

source: The program will open a socket connection with the Tarantool instance at ``localhost:3301``, then send an :ref:`INSERT <box_space-insert>` request, then -- if all is well -- print "Insert succeeded".
ru: Программа откроет сокет для соединения с экземпляром по адресу ``localhost:3301`` и отправит :ref:`INSERT-запрос <box_space-insert>`. При успешном выполнении запроса программа выведет сообщение "Insert succeeded".

source: If the tuple already exists, the program will print "Duplicate key exists in unique index 'primary' in space 'examples'".
ru: Если такой кортеж уже существует, то программа выведет сообщение об ошибке: “Duplicate key exists in unique index 'primary' in space 'examples'”.

source: The example program only shows one request and does not show all that's necessary for good practice. For that, please see `tarantool/tarantool-php <https://github.com/tarantool/tarantool-php>`__ project at GitHub.
ru: Эта программа --- пример отправки единственного запроса. Чтобы узнать больше о том, как работать с Tarantool, пользуясь языком PHP, обратитесь к документации `проекта tarantool-php на GitHub <https://github.com/tarantool/tarantool-php>`_.

source: Besides, there is another community-driven `tarantool-php GitHub project <https://github.com/tarantool-php>`__ which includes an `alternative connector <https://github.com/tarantool-php/client>`__ written in pure PHP, an `object mapper <https://github.com/tarantool-php/mapper>`__, a `queue <https://github.com/tarantool-php/queue>`__ and other packages.
ru: Кроме того, сообщество разработчиков поддерживает несколько проектов на GitHub. Среди них --- `проект tarantool-php <https://github.com/tarantool-php>`_, который включает в себя `вариант коннектора <https://github.com/tarantool-php/client>`_, написанный на чистом PHP, `модуль сопоставления объектов <https://github.com/tarantool-php/mapper>`_, `администратор очередей <https://github.com/tarantool-php/queue>`_ и другие пакеты.

source: `tarantool-python <http://github.com/tarantool/tarantool-python>`__ is the official Python connector for Tarantool. It is not supplied as part of the Tarantool repository and must be installed separately (see below for details).
ru: `tarantool-python <http://github.com/tarantool/tarantool-python>`_ --- официальный Python-коннектор для Tarantool. Он не входит в репозиторий Tarantool, так что его необходимо устанавливать отдельно (см. подробную информацию ниже).

source: Here is a complete Python program that inserts ``[99999,'Value','Value']`` into space ``examples`` via the high-level Python API.
ru: В следующем примере приводится полноценная программа на языке Python, которая осуществляет вставку кортежа ``[99999,'Value','Value']`` в спейс ``examples`` с помощью высокоуровневого API для языка Python.

source: To prepare, paste the code into a file named :file:`example.py` and install the ``tarantool-python`` connector with either :samp:`pip install tarantool\>0.4` to install in :file:`/usr` (requires **root** privilege) or :samp:`pip install tarantool\>0.4 --user` to install in :file:`~` i.e. user's default directory.
ru: Перед запуском тестовой программы сохраните ее код в файл :file:`example.py` и установите коннектор ``tarantool-python``. Чтобы установить его в директорию :file:`/usr`, используйте команду :samp:`pip install tarantool\>0.4`. Для этого требуются права уровня **root**. Вместо этого вы можете установить коннектор в директорию :file:`~`, т.е. в используемую по умолчанию директорию текущего пользователя. Для этого выполните команду :samp:`pip install tarantool\>0.4 --user`.

source: Before trying to run, check that the server instance is :ref:`listening <cfg_basic-listen>` at ``localhost:3301`` and that the space ``examples`` exists, as :ref:`described earlier <index-connector_setting>`. To run the program, say :samp:`python example.py`. The program will connect to the Tarantool server, will send the :ref:`INSERT <box_space-insert>` request, and will not throw any exception if all went well. If the tuple already exists, the program will throw ``tarantool.error.DatabaseError: (3, "Duplicate key exists in unique index 'primary' in space 'examples'")``.
ru: Перед запуском проверьте, что экземпляр прослушивает порт ``localhost:3301``, а в базе создан спейс ``examples``, как :ref:`предложено выше <index-connector_setting>`. Чтобы запустить тестовую программу, выполните команду :samp:`python example.py`. Программа установит соединение с сервером Tarantool и отправит запрос :ref:`INSERT<box_space-insert>`. Если запрос будет выполнен успешно, программа не сгенерирует исключений. Если окажется, что такой кортеж уже существует, то программа сгенерирует исключение `tarantool.error.DatabaseError: (3, "Duplicate key exists in unique index 'primary' in space 'examples'")`.

source: The example program only shows one request and does not show all that's necessary for good practice. For that, please see `tarantool-python <http://github.com/tarantool/tarantool-python>`__ project at GitHub. For an example of using Python API with `queue managers for Tarantool <https://github.com/tarantool/queue>`__, see `queue-python <https://github.com/tarantool/queue-python>`__ project at GitHub.
ru: Эта программа --- пример отправки единственного запроса. Чтобы узнать больше о том, как работать с Tarantool, пользуясь языком Python, обратитесь к документации `проекта tarantool-python на GitHub <http://github.com/tarantool/tarantool-python>`_. А на странице `проекта queue-python на GitHub <https://github.com/tarantool/queue-python>`_ вы найдете примеры использования Python API для работы с `очередями сообщений в Tarantool <https://github.com/tarantool/queue>`_.

source: Also there are several community-driven Python connectors:
ru: Кроме того, сообщество разработчиков поддерживает следующие Python-коннекторы:

source: `asynctnt <https://github.com/igorcoding/asynctnt>`__ with asyncio support
ru: `asynctnt <https://github.com/igorcoding/asynctnt>`_ с поддержкой asyncio

source: `aiotarantool <https://github.com/shveenkov/aiotarantool>`__ also with asyncio support
ru: `aiotarantool <https://github.com/shveenkov/aiotarantool>`_, также с поддержкой asyncio

source: `gtarantool <https://github.com/shveenkov/gtarantool>`__ with gevent support, **no active maintenance**
ru: `gtarantool <https://github.com/shveenkov/gtarantool>`__ с поддержкой gevent, **не обновляется**

source: The table below contains a feature comparison for asynctnt, gtarantool and tarantool-python. aiotarantool is absent there because it is quite outdated and unmaintained.
ru: В этой таблице сравниваются функции коннекторов asynctnt, gtarantool и tarantool-python. aiotarantool здесь отсутствует, так как он устарел и больше не поддерживается.

source: Last update: February 2022
ru: Последнее обновление: февраль 2022

source: Parameter
ru: Параметры

source: Is maintained
ru: Поддерживается

source: No (last updated in 2018)
ru: Нет (последнее обновление в 2018)

source: Known Issues
ru: Известные проблемы

source: `issue #18 <https://github.com/igorcoding/asynctnt/issues/18>`__ (no running event loop)
ru: `тикет #18 <https://github.com/igorcoding/asynctnt/issues/18>`__ (нет событийного цикла)

source: None
ru: Нет

source: `issue #105 <https://github.com/tarantool/tarantool-python/issues/105>`__ (unpack of binary data)
ru: `тикет #105 <https://github.com/tarantool/tarantool-python/issues/105>`__ (распаковка бинарных данных)

source: Yes (`github.io <https://igorcoding.github.io/asynctnt/>`__)
ru: Есть (`github.io <https://igorcoding.github.io/asynctnt/>`__)

source: Yes (`tarantool.io <https://www.tarantool.io/en/doc/latest/getting_started/getting_started_python/>`__ and `readthedocs <https://tarantool-python.readthedocs.io/en/latest/quick-start.en.html>`__ (`obsolete <https://github.com/tarantool/tarantool-python/issues/67>`__))
ru: Есть (`tarantool.io <https://www.tarantool.io/en/doc/latest/getting_started/getting_started_python/>`__ и `readthedocs <https://tarantool-python.readthedocs.io/en/latest/quick-start.en.html>`__ (`неактуальна <https://github.com/tarantool/tarantool-python/issues/67>`__))

source: No (tests exist)
ru: Нет (есть тесты)

source: AppVeyor (only Windows)
ru: AppVeyor (только на Windows)

source: Static Analysis
ru: Статический анализ

source: Yes (Flake8)
ru: Есть (Flake8)

source: Support asynchronous mode
ru: Поддержка асинхронного режима

source: Yes, `asyncio <https://docs.python.org/3/library/asyncio.html>`__
ru: Есть, `asyncio <https://docs.python.org/3/library/asyncio.html>`__

source: Yes (`gevent <https://www.gevent.org/api/gevent.event.html#gevent.event.AsyncResult>`__, example: `test_gevent.py <https://github.com/shveenkov/gtarantool/blob/master/tests/test_gevent.py>`__)
ru: Есть, `gevent <https://www.gevent.org/api/gevent.event.html#gevent.event.AsyncResult>`__ (пример: `test_gevent.py <https://github.com/shveenkov/gtarantool/blob/master/tests/test_gevent.py>`__)

source: Batching support
ru: Поддержка пакетной обработки

source: No (`issue #55 <https://github.com/tarantool/tarantool-python/issues/55>`__)
ru: Нет (`тикет #55 <https://github.com/tarantool/tarantool-python/issues/55>`__)

source: Yes (automatically, see `auto_refetch_schema <https://igorcoding.github.io/asynctnt/api.html>`__)
ru: Автоматическое (см. `auto_refetch_schema <https://igorcoding.github.io/asynctnt/api.html>`__)

source: Yes (automatically)
ru: Автоматическое

source: `SQL support <https://www.tarantool.io/en/doc/latest/reference/reference_sql/>`__
ru: `Поддержка SQL <https://www.tarantool.io/en/doc/latest/reference/reference_sql/>`__

source: Yes (tests/test_op_sql.py)
ru: Есть (tests/test_op_sql.py)

source: Yes (tarantool/connection.py)
ru: Есть (tarantool/connection.py)

source: `Interactive transactions <https://www.tarantool.io/en/doc/latest/book/box/stream/>`__
ru: `Интерактивные транзакции <https://www.tarantool.io/en/doc/latest/book/box/stream/>`__

source: No (`issue #163 <https://github.com/tarantool/tarantool-python/issues/163>`__)
ru: Нет (`тикет #163 <https://github.com/tarantool/tarantool-python/issues/163>`__)

source: `Varbinary support <https://www.tarantool.io/en/doc/latest/book/box/data_model/>`__
ru: `Поддержка varbinary <https://www.tarantool.io/en/doc/latest/book/box/data_model/>`__

source: Yes (`issue #105 <https://github.com/tarantool/tarantool-python/issues/105>`__)
ru: Есть (`тикет #105 <https://github.com/tarantool/tarantool-python/issues/105>`__)

source: `UUID support <https://www.tarantool.io/en/doc/latest/book/box/data_model/>`__
ru: `Поддержка UUID <https://www.tarantool.io/en/doc/latest/book/box/data_model/>`__

source: `Decimal support <https://www.tarantool.io/en/doc/latest/book/box/data_model/>`__
ru: `Поддержка decimal <https://www.tarantool.io/en/doc/latest/book/box/data_model/>`__

source: Almost (v2 branch)
ru: Частично (в ветке v2)

source: `EXT_ERROR support <https://www.tarantool.io/ru/doc/latest/dev_guide/internals/msgpack_extensions/#the-error-type>`__
ru: `Поддержка EXT_ERROR <https://www.tarantool.io/ru/doc/latest/dev_guide/internals/msgpack_extensions/#the-error-type>`__

source: `Datetime support <https://github.com/tarantool/tarantool/discussions/6244>`__
ru: `Поддержка datetime <https://github.com/tarantool/tarantool/discussions/6244>`__

source: `box.session.push() responses <https://www.tarantool.io/ru/doc/latest/reference/reference_lua/box_session/push/>`__
ru: `Возвращаемые значения box.session.push() <https://www.tarantool.io/ru/doc/latest/reference/reference_lua/box_session/push/>`__

source: Yes (see push_subscribe option and docs/pushes.rst)
ru: Есть (см. push_subscribe option и docs/pushes.rst)

source: `Session settings <https://www.tarantool.io/en/doc/latest/reference/reference_lua/box_space/_session_settings/>`__
ru: `Настройки сессии <https://www.tarantool.io/en/doc/latest/reference/reference_lua/box_space/_session_settings/>`__

source: `Graceful shutdown <https://github.com/tarantool/tarantool/issues/5924>`__
ru: `Мягкое завершение <https://github.com/tarantool/tarantool/issues/5924>`__

source: `IPROTO_ID (feature discovering) <https://github.com/tarantool/doc/issues/2419>`__
ru: `IPROTO_ID (обнаружение поддерживаемых функций) <https://github.com/tarantool/doc/issues/2419>`__

source: Support `CRUD <https://github.com/tarantool/crud>`__
ru: Поддержка `CRUD <https://github.com/tarantool/crud>`__

source: Autoreconnect
ru: Автоматическое переподключение

source: Yes (reconnect_max_attempts, reconnect_delay)
ru: Есть (reconnect_max_attempts, reconnect_delay)

source: Yes (reconnect_max_attempts, reconnect_delay), checking of connection liveness
ru: Есть (reconnect_max_attempts, reconnect_delay), проверка состояния соединения

source: Yes (round robin failover)
ru: Есть (циклическое восстановление после сбоев)

source: Support of `PEP 249 -- Python Database API Specification v2.0 <https://www.python.org/dev/peps/pep-0249/>`__
ru: Поддержка `PEP 249 --- Python Database API Specification v2.0 <https://www.python.org/dev/peps/pep-0249/>`__

source: `Yes <https://github.com/tarantool/tarantool-python/wiki/PEP-249-Database-API>`__
ru: `Есть <https://github.com/tarantool/tarantool-python/wiki/PEP-249-Database-API>`__

source: The most commonly used node.js driver is the `Node Tarantool driver <https://github.com/KlonD90/node-tarantool-driver>`_. It is not supplied as part of the Tarantool repository; it must be installed separately. The most common way to install it is with `npm <https://www.sitepoint.com/beginners-guide-node-package-manager/>`_. For example, on Ubuntu, the installation could look like this after npm has been installed:
ru: Самый распространенный драйвер для Node.js --- `Node Tarantool driver <https://github.com/KlonD90/node-tarantool-driver>`_. Он не входит в репозиторий Tarantool, так что его необходимо устанавливать отдельно. Проще всего установить его с помощью `npm <https://www.sitepoint.com/beginners-guide-node-package-manager/>`_. Например, на Ubuntu установка драйвера будет выглядеть следующим образом (в этом примере менеджер пакетов npm уже установлен):

source: Here is a complete node.js program that inserts ``[99999,'BB']`` into ``space[999]`` via the node.js API. Before trying to run, check that the server instance is :ref:`listening <cfg_basic-listen>` at ``localhost:3301`` and that the space ``examples`` exists, as :ref:`described earlier <index-connector_setting>`. To run, paste the code into a file named :file:`example.rs` and say ``node example.rs``. The program will connect using an application-specific definition of the space. The program will open a socket connection with the Tarantool instance at ``localhost:3301``, then send an :ref:`INSERT <box_space-insert>` request, then — if all is well — end after saying "Insert succeeded". If Tarantool is not running on ``localhost`` with listen port = 3301, the program will print “Connect failed”. If :ref:`the 'guest' user <box_space-user>` does not have authorization to connect, the program will print "Auth failed". If the insert request fails for any reason, for example because the tuple already exists, the program will print "Insert failed".
ru: В следующем примере приводится полноценная программа, написанная с использованием Node.js. Эта программа осуществляет вставку кортежа ``[99999,'BB']`` в спейс ``space[999]`` с помощью API для Node.js. Перед запуском проверьте, что экземпляр :ref:`прослушивает <cfg_basic-listen>` порт ``localhost:3301``, а в базе создан спейс ``examples``, как :ref:`предложено выше <index-connector_setting>`. Чтобы запустить программу, сохраните код в файл :file:`example.rs` и выполните команду ``node example.rs``. Программа установит соединение, используя определение спейса. Затем она откроет сокет для соединения с экземпляром по адресу ``localhost:3301`` и отправит :ref:`INSERT-запрос <box_space-insert>`. Если запрос будет выполнен успешно, программа выведет сообщение "Insert succeeded". Если Tarantool не запущен по адресу ``localhost`` и порт 3301 не прослушивается, то программа выведет сообщение об ошибке “Connect failed”. Если у :ref:`пользователя 'guest' <box_space-user>` нет прав на установку соединения, программа выведет сообщение об ошибке "Auth failed". Если запрос на вставку по какой-либо причине не сработает (например, такой кортеж уже существует), то программа выведет сообщение об ошибке "Insert failed".

source: The example program only shows one request and does not show all that's necessary for good practice. For that, please see `The node.js driver repository <https://github.com/KlonD90/node-tarantool-driver>`_.
ru: Эта программа --- пример отправки единственного запроса. Чтобы узнать больше о том, как работать с Tarantool, пользуясь Node.js, обратитесь к документации в `репозитории драйвера для Node.js <https://github.com/KlonD90/node-tarantool-driver>`_.

source: The most commonly used C# driver is `progaudi.tarantool <https://github.com/progaudi/progaudi.tarantool>`__, previously named ``tarantool-csharp``. It is not supplied as part of the Tarantool repository; it must be installed separately. The makers recommend `cross-platform installation using Nuget <https://www.nuget.org/packages/progaudi.tarantool>`__.
ru: Самый распространенный драйвер для C# --- `progaudi.tarantool <https://github.com/progaudi/progaudi.tarantool>`_, который раньше назывался ``tarantool-csharp``. Он не входит в репозиторий Tarantool, так что его необходимо устанавливать отдельно. Создатели драйвера рекомендуют `кроссплатформенную установку с помощью Nuget <https://www.nuget.org/packages/progaudi.tarantool>`__.

source: To be consistent with the other instructions in this chapter, here is a way to install the driver directly on Ubuntu 16.04.
ru: По аналогии с остальными инструкциями в главе приводится способ установки драйвера напрямую на Ubuntu 16.04.

source: Install .net core from Microsoft. Follow `.net core installation instructions <https://dotnet.microsoft.com/download>`__.
ru: Установите среду .NET Core от Microsoft. Следуйте `инструкциям по установке .NET Core <https://dotnet.microsoft.com/download>`__.

source: Mono will not work, nor will .Net from xbuild. Only .net core supported on Linux and Mac.
ru: Так как на Linux и macOS поддерживается только .NET Core, установить коннектор с помощью Mono или .NET от xbuild невозможно.

source: Read the Microsoft End User License Agreement first, because it is not an ordinary open-source agreement and there will be a message during installation saying "This software may collect information about you and your use of the software, and send that to Microsoft." Still you can `set environment variables <https://docs.microsoft.com/en-us/dotnet/core/tools/telemetry>`__ to opt out from telemetry.
ru: Прочитайте Условия лицензионного соглашения Microsoft, поскольку оно не похоже на обычные соглашения для ПО с открытым кодом. Во время установки появится сообщение, что ПО может собирать информацию о вас и о том, как вы используете программу: "This software may collect information about you and your use of the software, and send that to Microsoft". Тем не менее вы можете `задать переменные окружения <https://docs.microsoft.com/en-us/dotnet/core/tools/telemetry>`_, чтобы не участвовать в сборе телеметрических данных.

source: Create a new console project.
ru: Создайте новый проект консольного приложения:

source: Add ``progaudi.tarantool`` reference.
ru: Добавьте пакет ``progaudi.tarantool``:

source: Change code in ``Program.cs``.
ru: Замените код в ``Program.cs`` на следующий:

source: Build and run your application.
ru: Соберите и запустите приложение.

source: Before trying to run, check that the server is listening at ``localhost:3301`` and that the space ``examples`` exists, as :ref:`described earlier <index-connector_setting>`.
ru: Перед запуском проверьте, что экземпляр прослушивает порт ``localhost:3301``, а в базе создан спейс ``examples``, как :ref:`предложено выше <index-connector_setting>`.

source: The program will:
ru: Программа выполнит следующие действия:

source: connect using an application-specific definition of the space,
ru: Установит соединение, используя определение спейса.

source: open a socket connection with the Tarantool server at ``localhost:3301``,
ru: Откроет сокет для соединения с сервером Tarantool по адресу ``localhost:3301``.

source: send an INSERT request, and — if all is well — end without saying anything.
ru: Отправит INSERT-запрос. Если он будет выполнен успешно, программа закончит работу, не выводя сообщений.

source: If Tarantool is not running on localhost with listen port = 3301, or if user 'guest' does not have authorization to connect, or if the INSERT request fails for any reason, the program will print an error message, among other things (stacktrace, etc).
ru: Если Tarantool не запущен по адресу ``localhost``, порт 3301 не прослушивается, у пользователя 'guest' нет прав на установку соединения или запрос на вставку по какой-либо причине не сработал, то программа выведет сообщение об ошибке и сопутствующую информацию (в частности, трассировку стека).

source: The example program only shows one request and does not show all that’s necessary for good practice. For that, please see the `progaudi.tarantool driver repository <https://github.com/progaudi/progaudi.tarantool>`__.
ru: Эта программа --- пример отправки единственного запроса. Чтобы узнать больше о том, как работать с Tarantool, пользуясь PHP API, обратитесь к документации `проекта tarantool-php на GitHub <https://github.com/tarantool/tarantool-php>`__.

source: Here follow two examples of using Tarantool's high-level C API.
ru: В этом разделе приведены два примера использования высокоуровневого API Tarantool для языка C.

source: Example 1
ru: Пример 1

source: Here is a complete C program that inserts :code:`[99999,'B']` into space :code:`examples` via the high-level C API.
ru: В следующем примере приводится полноценная программа на языке C, которая осуществляет вставку кортежа :code:``[99999,'B']`` в спейс :code:`examples` с помощью высокоуровневого API для языка C.
