Repository: tarantool/doc
Catalog: locale/*/LC_MESSAGES/enterprise/deprecated/orchestrator_api.po
Languages: ru

source: Orchestrator API reference
ru: Справочник по Orchestrator API

source: Create a new zone.
ru: Создание новой зоны.

source: **Request**
ru: **Запрос**

source: **Response**
ru: **Ответ**

source: **Potential errors**
ru: **Возможные ошибки**

source: ``zone_exists`` - the specified zone already exists
ru: ``zone_exists`` -- указанная зона уже существует

source: Return information on the specified zone or on all the zones.
ru: Возврат информации об указанной зоне или обо всех зонах.

source: ``zone_not_found`` - the specified zone is not found
ru: ``zone_not_found`` -- указанная зона не обнаружена

source: Update information on the zone.
ru: Обновление информации о зоне.

source: **Body**
ru: **Тело**

source: Delete a zone if it doesn’t store any nodes.
ru: Удаление зоны, если в ней нет узлов.

source: ``zone_in_use`` - the specified zone stores at least one node
ru: ``zone_in_use`` -- в указанной зоне есть хотя бы один узел

source: Configuring the zone weights
ru: Настройка веса зоны

source: Set the zone weights configuration.
ru: Конфигурация веса зоны.

source: ``zones_weights_error`` - configuration error
ru: ``zones_weights_error`` -- ошибка конфигурации

source: Return the zone weights configuration.
ru: Возврат конфигурации веса зоны.

source: Configuring registry
ru: Настройка реестра

source: Return all the detected nodes.
ru: Возврат всех обнаруженных узлов.

source: Register the detected node.
ru: Регистрация обнаруженного узла.

source: ``node_already_registered`` - the specified node is already registered
ru: ``node_already_registered`` -- указанный узел уже зарегистрирован

source: ``node_not_discovered`` - the specified node is not detected
ru: ``node_not_discovered`` -- указанный узел не обнаружен

source: Update the registered node parameters.
ru: Обновление параметров зарегистрированного узла.

source: Pass only those parameters that need to be updated.
ru: Передача только обновляемых параметров.

source: ``node_not_registered`` - the specified node is not registered
ru: ``node_not_registered`` -- указанный узел не зарегистрирован

source: Return information on the nodes in a cluster. If ``node_uuid`` is passed, information on this node only is returned.
ru: Возврат информации об узлах в кластере. Если передать ``node_uuid``, вернется информация только по данному узлу.

source: Delete the node if it doesn’t belong to any replica set.
ru: Удаление узла, если он не относится ни к одному набору реплик.

source: ``node_in_use`` - the specified node is in use by a replica set
ru: ``node_in_use`` -- указанный узел используется в наборе реплик

source: Routers API
ru: API по роутерам

source: Return the list of all nodes that constitute the router.
ru: Возврат списка всех узлов, которые представляют собой роутер.

source: Assign the router role to the node.
ru: Присвоение узлу роли роутера.

source: Release the router role from the node.
ru: Снятие роли роутера с узла.

source: Configuring replica sets
ru: Настройка наборов реплик

source: Create a replica set containing all the registered nodes.
ru: Создание набора реплик со всеми зарегистрированными узлами.

source: ``replicaset_exists`` – the specified replica set already exists
ru: ``replicaset_exists`` -- указанный набор реплик уже существует

source: ``replicaset_empty`` – the specified replica set doesn’t contain any nodes
ru: ``replicaset_empty`` -- указанный набор реплик не содержит ни одного узла

source: ``node_not_registered`` – the specified node is not registered
ru: ``node_not_registered`` -- указанный узел не зарегистрирован

source: ``node_in_use`` – the specified node is in use by another replica set
ru: ``node_in_use`` -- указанный узел используется в другом наборе реплик

source: Update the replica set parameters.
ru: Обновление параметров набора реплик.

source: ``replicaset_not_found`` – the specified replica set is not found
ru: ``replicaset_not_found`` -- указанный набор реплик не обнаружен

source: Return information on all the cluster components. If ``replicaset_uuid`` is passed, information on this replica set only is returned.
ru: Возврат информации обо всех компонентах кластера. Если передать ``replicaset_uuid``, вернется информация только по данному набору реплик.

source: Delete a replica set.
ru: Удаление набора реплик.

source: ``replicaset_not_found`` - the specified replica set is not found
ru: ``replicaset_not_found`` -- указанный набор реплик не обнаружен

source: Switch the master in the replica set.
ru: Смена мастера в наборе реплик.

source: ``node_not_in_replicaset`` – the specified node is not in the specified replica set
ru: ``node_not_in_replicaset`` -- указанный узел находится не в указанном наборе реплик

source: Add a node to the replica set.
ru: Добавление узла в набор реплик.

source: Return statistics on the cluster.
ru: Возврат статистики по кластеру.

source: Setting up configuration versions
ru: Настройка версии конфигурации

source: Set the configuration version.
ru: Настройка версии конфигурации.

source: ``cfg_error`` - configuration error
ru: ``cfg_error`` -- ошибка конфигурации

source: Return the configuration version.
ru: Возврат версии конфигурации.

source: Configuring sharding
ru: Конфигурация шардинга

source: Add a new sharding configuration.
ru: Добавление новой конфигурации шардинга.

source: Return the current sharding configuration.
ru: Возврат текущей конфигурации шардинга.

source: Resetting cluster configuration
ru: Сброс конфигурации кластера

source: Reset the cluster configuration.
ru: Сброс конфигурации кластера.

source: Reset the cluster configuration and delete information on the cluster nodes from the ZooKeeper catalogues.
ru: Сброс конфигурации кластера и удаление информации об узлах кластера из каталогов ZooKeeper.
