.. code-block:: tarantoolsession

    <... ...>
    tarantool> box.space._cluster:select({0}, {iterator = 'GE'})
    - - [1, '6190d919-1133-4452-b123-beca0b178b32']
      - [2, '236230b8-af3e-406b-b709-15a60b44c20c']
    ...
    tarantool> s = box.space.tester
    ---
    ...
    tarantool> s:select({1}, {iterator = 'GE'})
    ---
    - - [1, 'Tuple inserted on Terminal #1']
    ...
    tarantool> s:insert{2, 'Tuple inserted on Terminal #2'}
    ---
    - [2, 'Tuple inserted on Terminal #2']
    ...
