Repository: tarantool/doc
Catalog: locale/*/LC_MESSAGES/dev_guide/internals/box_protocol.po
Languages: ru

source: If authentication is not skipped, then at any time an authentication packet can be prepared using the greeting, the user's name and password, and `sha-1 <https://en.wikipedia.org/wiki/SHA-1>`_ functions, as follows.
ru: Если аутентификация проводится, то в любое время может быть подготовлен пакет аутентификации с использованием приветствия, имени и пароля пользователя и функции `sha-1 <https://en.wikipedia.org/wiki/SHA-1>`_, как показано ниже.

source: The client sends an authentication packet as an IPROTO_AUTH message:
ru: Клиент отправляет пакет аутентификации в виде сообщения IPROTO_AUTH:

source: :code:`<key>` holds the user name. :code:`<tuple>` must be an array of 2 fields: authentication mechanism ("chap-sha1" is the only supported mechanism right now) and scramble, encrypted according to the specified mechanism.
ru: :code:`<key>` содержит имя пользователя. :code:`<tuple>` должен представлять собой массив из 2 полей: механизм аутентификации (на данный момент поддерживается только механизм "chap-sha1") и сообщение, зашифрованное в соответствии с указанным механизмом.

source: The server instance responds to an authentication packet with a standard response with 0 tuples.
ru: На пакет аутентификации экземпляр сервера отправляет стандартный ответ с 0 кортежей.

source: To see how Tarantool handles this, look at `net_box.c <https://github.com/tarantool/tarantool/blob/master/src/box/lua/net_box.c>`_ function ``netbox_encode_auth``.
ru: Чтобы понять, как Tarantool это обрабатывает, обратите внимание на функцию `netbox_encode_auth`` в файле `net_box.c <https://github.com/tarantool/tarantool/blob/master/src/box/lua/net_box.c>`_.

source: Binary protocol -- streams
ru: Бинарный протокол — стримы

source: The :ref:`Streams and interactive transactions <box_stream>` feature, which was added in Tarantool version :tarantool-release:`2.10.0-beta1`, allows two things: sequential processing and interleaving.
ru: :ref:`Стримы и интерактивные транзакции <box_stream>`, добавленные в Tarantool :tarantool-release:`2.10.0-beta1`, делают возможными две процедуры: последовательную обработку и чередование.

source: Sequential processing: With streams there is a guarantee that the server instance will not handle the next request in a stream until it has completed the previous one.
ru: Последовательная обработка гарантирует, что экземпляр не будет обрабатывать следующий запрос в стриме, пока не завершит работу с предыдущим.

source: Interleaving: For example, a series of requests can include "begin for stream #1", "begin for stream #2", "insert for stream #1", "insert for stream #2", "delete for stream #1", "commit for stream #1", "rollback for stream #2".
ru: Чередование допускает, например, такую последовательность запросов: "begin для стрима 1", "begin для стрима 2", "insert для стрима 1", "insert для стрима 2", "delete для стрима 1", "commit для стрима 1", "rollback для стрима 2".

source: To make these things possible, the engine should be :ref:`vinyl <engines-vinyl>` or :ref:`memtx with mvcc <cfg_basic-memtx_use_mvcc_engine>`, and the client is responsible for ensuring that the stream identifier, unsigned integer :ref:`IPROTO_STREAM_ID <box_protocol-iproto_stream_id>`, is in the request header. IPROTO_STREAM_ID can be any positive 64-bit number, and should be unique for the connection. If IPROTO_STREAM_ID equals zero the server instance will ignore it.
ru: Эти процедуры возможны, если используется движок :ref:`vinyl <engines-vinyl>` или :ref:`memtx с mvcc <cfg_basic-memtx_use_mvcc_engine>`. При этом клиент отвечает за наличие идентификатора стрима, беззнакового целого числа :ref:`IPROTO_STREAM_ID <box_protocol-iproto_stream_id>`, в заголовке запроса. Идентификатор IPROTO_STREAM_ID должен быть положительным 64-битовым числом, уникальным для соединения. Если IPROTO_STREAM_ID стрима равен нулю, экземпляр его проигнорирует.

source: For example, suppose that the client has started a stream with the :ref:`net.box module <net_box-module>`
ru: Предположим, что клиент запустил стрим с помощью :ref:`модуля net.box<net_box-module>`.

source: At this point the stream object will look like a duplicate of the conn object, with just one additional member: ``stream_id``. Now, using stream instead of conn, the client sends two requests:
ru: В этот момент объект ``stream`` будет выглядеть так же, как объект ``conn``, но включать один дополнительный элемент: ``stream_id``. Пусть теперь клиент, используя ``stream`` вместо ``conn``, отправит два запроса:

source: The header and body of these requests will be the same as in non-stream :ref:`IPROTO_INSERT <box_protocol-insert>` requests, except that the header will contain an additional item: IPROTO_STREAM_ID=0x0a with MP_UINT=0x01. It happens to equal 1 for this example because each call to conn:new_stream() assigns a new number, starting with 1.
ru: Заголовок и тело этих запросов будут такими же, как в обычных запросах :ref:`IPROTO_INSERT <box_protocol-insert>`, но заголовок будет содержать дополнительный элемент ``IPROTO_STREAM_ID=0x0a``, где ``MP_UINT=0x01``. В этом примере значение IPROTO_STREAM_ID равно 1, так как при вызове ``conn:new_stream()`` идентификатору каждого нового стрима присваивается уникальное значение, начиная с 1.

source: The client makes stream transactions by sending, in order: IPROTO_BEGIN, the transaction data-change and query requests, IPROTO_COMMIT or IPROTO_ROLLBACK. Each request must contain the same IPROTO_STREAM_ID value. With streaming there is no need to add :ref:`IPROTO_FLAGS <box_protocol-flags>` and IPROTO_FLAG_COMMIT in the header of the last request of a transaction. Rollback will be automatic if disconnect occurs before commit is possible.
ru: Клиент запускает транзакцию внутри стрима, отправляя запросы в следующем порядке: IPROTO_BEGIN, запросы на изменение и получение данных транзакции, затем IPROTO_COMMIT или IPROTO_ROLLBACK. Каждый запрос должен содержать переменную IPROTO_STREAM_ID с одним и тем же значением. Используя стримы, не нужно добавлять в заголовок последнего запроса транзакции :ref:`IPROTO_FLAGS <box_protocol-flags>` и IPROTO_FLAG_COMMIT. Если транзакция прервется до того, как можно будет выполнить коммит, она будет автоматически отменена.

source: Thus there are now multiple ways to do transactions: with net_box and stream:begin() and stream:commit() or stream:rollback() which cause IPROTO_BEGIN and IPROTO_COMMIT or IPROTO_ROLLBACK with the current value of stream.stream_id; with :ref:`box.begin() <box-begin>` and :ref:`box.commit() <box-commit>` or :ref:`box.rollback() <box-rollback>`; with SQL and :ref:`START TRANSACTION <sql_start_transaction>` and :ref:`COMMIT <sql_commit>` or :ref:`ROLLBACK <sql_rollback>`. An application can use any or all of these ways.
ru: Таким образом, у приложения есть несколько способов выполнять транзакции. Во-первых, можно использовать модуль ``net_box`` с методами ``stream:begin()`` и ``stream:commit()``/``stream:rollback()``, которые отправляют запросы IPROTO_BEGIN и IPROTO_COMMIT/IPROTO_ROLLBACK с текущим значением ``stream.stream_id``. Другой способ --- применять методы :ref:`box.begin() <box-begin>` и :ref:`box.commit() <box-commit>`/:ref:`box.rollback() <box-rollback>`. Наконец, можно пользоваться инструкциями SQL :ref:`START TRANSACTION <sql_start_transaction>` и :ref:`COMMIT <sql_commit>`/:ref:`ROLLBACK <sql_rollback>`.

source: Binary protocol -- replication
ru: Бинарный протокол — репликация

source: **IPROTO_JOIN** = 0x41. First you must send an initial IPROTO_JOIN request.
ru: **IPROTO_JOIN** = 0x41. Сначала нужно отправить первоначальный запрос IPROTO_JOIN.

source: Then the instance which you want to connect to will send its last SNAP file, by simply creating a number of INSERTs (with additional LSN and ServerID) (do not reply to this). Then that instance will send a vclock's MP_MAP and close a socket.
ru: Затем экземпляр, к которому вы хотите подключиться, отправит свой последний SNAP-файл, просто создав несколько запросов типа INSERT (с дополнительными LSN и ServerID) (не отвечайте на них). Затем этот экземпляр отправит MP_MAP vclock и закроет сокет.

source: **IPROTO_SUBSCRIBE** = 0x42. Then you must send an IPROTO_SUBSCRIBE request.
ru: **IPROTO_SUBSCRIBE** = 0x42. Затем нужно отправить запрос IPROTO_SUBSCRIBE.

source: Then you must process every request that could come through other masters. Every request between masters will have additional LSN and SERVER_ID.
ru: Затем нужно обработать каждый запрос, который может прийти через других мастеров. В каждом запросе между мастерами будут дополнительные LSN и SERVER_ID.

source: **HEARTBEATS**
ru: **КОНТРОЛЬНЫЕ СИГНАЛЫ**

source: Frequently a master sends a :ref:`heartbeat <heartbeat>` message to a replica. For example, if there is a replica with id = 2, and a timestamp with a moment in 2020, a master might send this:
ru: Часто мастер отправляет реплике сообщение :ref:`контрольного сигнала <heartbeat>`. Например, если есть реплика с ID = 2 и метка с моментом времени в 2020 году, мастер может послать такое сообщение:

source: and the replica might send back this:
ru: и реплика может отправить в ответ следующее:

source: Later in :ref:`Binary protocol -- illustration <box_protocol-illustration>` we will show actual byte codes of the above heartbeat examples.
ru: Далее, в разделе :ref:`Бинарный протокол — примеры <box_protocol-illustration>`, мы покажем фактические байт-коды вышеприведенных сообщений контрольного сигнала.

source: **BALLOTS**
ru: **ГОЛОСОВАНИЕ**

source: While connecting for replication, an instance sends a request with header IPROTO_VOTE (0x44). The normal response is ER_OK,and IPROTO_BALLOT (0x29). The fields within IPROTO_BALLOT are map items:
ru: При подключении для репликации экземпляр отправляет запрос с заголовком IPROTO_VOTE (0x44). Обычно ответом будет ER_OK и IPROTO_BALLOT (0x29). Поля в IPROTO_BALLOT — это элементы ассоциативного массива:

source: IPROTO_BALLOT_IS_RO_CFG (0x01) and MP_BOOL IPROTO_BALLOT_VCLOCK (0x02) and vclock IPROTO_BALLOT_GC_VCLOCK (0x03) and vclock IPROTO_BALLOT_IS_RO (0x04) and MP_BOOL IPROTO_BALLOT_IS_ANON = 0x05 and MP_BOOL IPROTO_BALLOT_IS_BOOTED = 0x06 and MP_BOOL
ru: IPROTO_BALLOT_IS_RO_CFG (0x01) и MP_BOOL IPROTO_BALLOT_VCLOCK (0x02) и vclock IPROTO_BALLOT_GC_VCLOCK (0x03) и vclock IPROTO_BALLOT_IS_RO (0x04) и MP_BOOL IPROTO_BALLOT_IS_ANON = 0x05 и MP_BOOL IPROTO_BALLOT_IS_BOOTED = 0x06 и MP_BOOL

source: IPROTO_BALLOT_IS_RO_CFG and IPRO_BALLOT_VCLOCK and IPROTO_BALLOT_GC_VCLOCK and IPROTO_BALLOT_IS_RO were added in version :doc:`2.6.1 </release/2.6.1>`. IPROTO_BALLOT_IS_ANON was added in version :doc:`2.7.1 </release/2.7.1>`. IPROTO_BALLOT_IS_BOOTED was added in version 2.7.3 and 2.8.2 and 2.9.1. There have been some name changes starting with version 2.7.3 and 2.8.2 and 2.9.1: IPROTO_BALLOT_IS_RO_CFG was formerly called IPROTO_BALLOT_IS_RO, and IPROTO_BALLOT_IS_RO was formerly called IPROTO_BALLOT_IS_LOADING.
ru: IPROTO_BALLOT_IS_RO_CFG, IPRO_BALLOT_VCLOCK, IPROTO_BALLOT_GC_VCLOCK и IPROTO_BALLOT_IS_RO добавлены в версии :doc:`2.6.1 </release/2.6.1>`. Константа IPROTO_BALLOT_IS_ANON добавлена в версии :doc:`2.7.1 </release/2.7.1>`. Константа IPROTO_BALLOT_IS_BOOTED добавлена в версиях 2.7.3, 2.8.2 и 2.9.1. В версиях 2.7.3, 2.8.2, 2.9.1 и более поздних константа IPROTO_BALLOT_IS_RO переименована в IPROTO_BALLOT_IS_RO_CFG, а IPROTO_BALLOT_IS_LOADING — в IPROTO_BALLOT_IS_RO.

source: IPROTO_BALLOT_IS_RO_CFG corresponds to :ref:`box.cfg.read_only <cfg_basic-read_only>`.
ru: Значение IPROTO_BALLOT_IS_RO_CFG соответствует значению :ref:`box.cfg.read_only <cfg_basic-read_only>`.

source: IPROTO_BALLOT_GC_VCLOCK can be the vclock value of the instance's oldest WAL entry, which corresponds to :ref:`box.info.gc().vclock <box_info_gc>`.
ru: IPROTO_BALLOT_GC_VCLOCK может принимать значение vclock самой старой записи журнала WAL на экземпляре. Это соответствует значению :ref:`box.info.gc().vclock <box_info_gc>`.

source: IPROTO_BALLOT_IS_RO is true if the instance is not writable, which may happen for a variety of reasons, such as: it was configured as :ref:`read_only <cfg_basic-read_only>`, or it has :ref:`orphan status <replication-orphan_status>`, or it is a :ref:`Raft <repl_leader_elect>` follower.
ru: IPROTO_BALLOT_IS_RO принимает значение ``true``, если экземпляр недоступен для записи. Причины у этого могут быть разные: например, экземпляр настроен как :ref:`read_only <cfg_basic-read_only>`, :ref:`имеет статус orphan <replication-orphan_status>` или является последователем (follower) при :ref:`выполнении алгоритма Raft <repl_leader_elect>`.

source: IPROTO_BALLOT_IS_ANON corresponds to :ref:`box.cfg.replication_anon <cfg_replication-replication_anon>`.
ru: Значение IPROTO_BALLOT_IS_ANON соответствует значению :ref:`box.cfg.replication_anon <cfg_replication-replication_anon>`.

source: IPROTO_BALLOT_IS_BOOTED is true if the instance has finished its bootstrap or recovery process.
ru: IPROTO_BALLOT_IS_BOOTED принимает значение ``true``, если экземпляр завершил инициализацию или восстановление.

source: **FLAGS**
ru: **ФЛАГИ**

source: For replication of :doc:`synchronous transactions </book/replication/repl_sync>` a header may contain a key = IPROTO_FLAGS and an MP_UINT value = one or more bits: IPROTO_FLAG_COMMIT or IPROTO_FLAG_WAIT_SYNC or IPROTO_FLAG_WAIT_ACK.
ru: При репликации :doc:`синхронных транзакций </book/replication/repl_sync>` заголовок может содержать ключ = IPROTO_FLAGS и значение MP_UINT = один или несколько битов: IPROTO_FLAG_COMMIT, IPROTO_FLAG_WAIT_SYNC или IPROTO_FLAG_WAIT_ACK.

source: # <size> msgpack(:samp:`{{MP_UINT unsigned integer = size(<header>) + size(<body>)}}`) # <header> msgpack({ # ... other header items ..., IPROTO_FLAGS: :samp:`{{MP_UINT unsigned integer}}` }) # <body> msgpack({ # ... message for a transaction ... })
ru: # <size> msgpack(:samp:`{{MP_UINT unsigned integer = size(<header>) + size(<body>)}}`) # <header> msgpack({ # ... другие элементы заголовка ..., IPROTO_FLAGS: :samp:`{{MP_UINT unsigned integer}}` }) # <body> msgpack({ # ... message for a transaction ... })

source: IPROTO_FLAG_COMMIT (0x01) will be set if this is the last message for a transaction, IPROTO_FLAG_WAIT_SYNC (0x02) will be set if this is the last message for a transaction which cannot be completed immediately, IPROTO_FLAG_WAIT_ACK (0x04) will be set if this is the last message for a synchronous transaction.
ru: IPROTO_FLAG_COMMIT (0x01) указывает на последнее сообщение для транзакции. IPROTO_FLAG_WAIT_SYNC (0x02) указывает на последнее сообщение для транзакции, которую нельзя завершить немедленно. IPROTO_FLAG_WAIT_ACK (0x04) указывает на последнее сообщение для синхронной транзакции.

source: Binary protocol -- illustration
ru: Бинарный протокол — примеры

source: To follow the examples in this section, get a single Linux computer and start three command-line shells ("terminals").
ru: Чтобы выполнить примеры, приведенные в этом разделе, запустите на компьютере с Linux три командных оболочки (терминала).

source: -- On terminal #1, Start monitoring port 3302 with `tcpdump <https://www.tcpdump.org/manpages/tcpdump.1.html>`_: |br|
ru: -- На терминале №1 запустите мониторинг порта 3302 с помощью `tcpdump <https://www.tcpdump.org/manpages/tcpdump.1.html>`_: |br|

source: On terminal #2, start a server with:
ru: На терминале №2 запустите сервер так:

source: On terminal #3, start another server, which will act as a client, with:
ru: На терминале №3 запустите ещё один сервер, который будет выступать в качестве клиента, так:

source: Now look at what tcpdump shows for the job connecting to 3302. -- the "request". After the words "length 32" is a packet that ends with with these 32 bytes: (we have added indented comments):
ru: Теперь посмотрите, что tcpdump покажет для запроса — задания подключения к порту 3302. После слов "length 32" идет пакет, который заканчивается этими 32 байтами (мы добавили комментарии после отступов):

source: ce 00 00 00 1b MP_UINT = decimal 27 = number of bytes after this 82 MP_MAP, size 2 (we'll call this "Main-Map") 01 IPROTO_SYNC (Main-Map Item#1) 04 MP_INT = 4 = number that gets incremented with each request 00 IPROTO_REQUEST_TYPE (Main-Map Item#2) 01 IPROTO_SELECT 86 MP_MAP, size 6 (we'll call this "Select-Map") 10 IPROTO_SPACE_ID (Select-Map Item#1) cd 02 00 MP_UINT = decimal 512 = id of tspace (could be larger) 11 IPROTO_INDEX_ID (Select-Map Item#2) 00 MP_INT = 0 = id of index within tspace 14 IPROTO_ITERATOR (Select-Map Item#3) 00 MP_INT = 0 = Tarantool iterator_type.h constant ITER_EQ 13 IPROTO_OFFSET (Select-Map Item#4) 00 MP_INT = 0 = amount to offset 12 IPROTO_LIMIT (Select-Map Item#5) ce ff ff ff ff MP_UINT = 4294967295 = biggest possible limit 20 IPROTO_KEY (Select-Map Item#6) 91 MP_ARRAY, size 1 (we'll call this "Key-Array") cd 01 18 MP_UINT = 280 (Select-Map Item#6, Key-Array Item#1) -- 280 is the key value that we are searching for
ru: ce 00 00 00 1b MP_UINT = 27, десятичное число = число байт после этого 82 MP_MAP, размер 2 (назовем это Main-Map) 01 IPROTO_SYNC (1-й элемент Main-Map) 04 MP_INT = 4 = число, которое увеличивается на 1 с каждым запросом 00 IPROTO_REQUEST_TYPE (2-й элемент Main-Map) 01 IPROTO_SELECT 86 MP_MAP, размер 6 (назовем это Select-Map) 10 IPROTO_SPACE_ID (1-й элемент Select-Map) cd 02 00 MP_UINT = 512, десятичное число = id tspace (может быть больше) 11 IPROTO_INDEX_ID (2-й элемент Select-Map) 00 MP_INT = 0 = id индекса в tspace 14 IPROTO_ITERATOR (3-й элемент Select-Map) 00 MP_INT = 0 = константа Tarantool iterator_type.h ITER_EQ 13 IPROTO_OFFSET (4-й элемент Select-Map) 00 MP_INT = 0 = смещение 12 IPROTO_LIMIT (5-й элемент Select-Map) ce ff ff ff ff MP_UINT = 4294967295 = наибольший возможный предел 20 IPROTO_KEY (6-й элемент Select-Map) 91 MP_ARRAY, размер 1 (назовем это Key-Array) cd 01 18 MP_UINT = 280 (6-й элемент Select-Map, 1-й элемент Key-Array) -- 280, ключевое значение, которое мы ищем

source: Now read the source code file `net_box.c <https://github.com/tarantool/tarantool/blob/master/src/box/lua/net_box.c>`_ and skip to the line ``netbox_encode_select(lua_State *L)``. From the comments and from simple function calls like ``mpstream_encode_uint(&stream, IPROTO_SPACE_ID);`` you will be able to see how net_box put together the packet contents that you have just observed with tcpdump.
ru: Теперь в файле исходного кода `net_box.c <https://github.com/tarantool/tarantool/blob/master/src/box/lua/net_box.c>`_ перейдите к строке ``netbox_encode_select(lua_State *L)``. Из комментариев и из простых вызовов функций типа ``mpstream_encode_uint(&stream, IPROTO_SPACE_ID);`` можно понять, как net_box собирает воедино содержимое пакета, описанного выше с помощью tcpdump.

source: There are libraries for reading and writing MessagePack objects. C programmers sometimes include `msgpuck.h <https://github.com/rtsisyk/msgpuck>`_.
ru: Существуют библиотеки для чтения и записи объектов в формате MessagePack. Программисты на языке C иногда включают `msgpuck.h <https://github.com/rtsisyk/msgpuck>`_.

source: Now you know how Tarantool itself makes requests with the binary protocol. When in doubt about a detail, consult ``net_box.c`` -- it has routines for each request. Some :ref:`connectors <index-box_connectors>` have similar code.
ru: Теперь вы знаете, как сам Tarantool выполняет запросы по бинарному протоколу. Если какие-то детали остаются неясными, обратитесь к файлу ``net_box.c``, где описаны процедуры для каждого запроса. Некоторые :ref:`коннекторы <index-box_connectors>` написаны аналогично.

source: For an IPROTO_UPDATE example, suppose a user changes field #2 in tuple #2 in space #256 to ``'BBBB'``. The body will look like this: (notice that in this case there is an extra map item IPROTO_INDEX_BASE, to emphasize that field numbers start with 1, which is optional and can be omitted):
ru: Рассмотрим пример IPROTO_UPDATE. Предположим, пользователь изменяет поле №2 кортежа №2 в спейсе №256 на `'BBBB'``. Тело будет выглядеть так (обратите внимание, что в этом случае дополнительный необязательный элемент ассоциативного массива IPROTO_INDEX_BASE подчеркивает, что номера полей начинаются с 1 — это можно опустить):

source: 04 IPROTO_UPDATE 85 IPROTO_MAP, size 5 10 IPROTO_SPACE_ID, Map Item#1 cd 02 00 MP_UINT 256 11 IPROTO_INDEX_ID, Map Item#2 00 MP_INT 0 = primary-key index number 15 IPROTO_INDEX_BASE, Map Item#3 01 MP_INT = 1 i.e. field numbers start at 1 21 IPROTO_TUPLE, Map Item#4 91 MP_ARRAY, size 1, for array of operations 93 MP_ARRAY, size 3 a1 3d MP_STR = OPERATOR = '=' 02 MP_INT = FIELD_NO = 2 a5 42 42 42 42 42 MP_STR = VALUE = 'BBBB' 20 IPROTO_KEY, Map Item#5 91 MP_ARRAY, size 1, for array of key values 02 MP_UINT = primary-key value = 2
ru: 04 IPROTO_UPDATE 85 IPROTO_MAP, размер 5 10 IPROTO_SPACE_ID, 1-й элемент ассоциативного массива cd 02 00 MP_UINT 256 11 IPROTO_INDEX_ID, 2-й элемент ассоциативного массива 00 MP_INT 0 = номер индекса первичного ключа 15 IPROTO_INDEX_BASE, 3-й элемент ассоциативного массива 01 MP_INT = 1, т.е. нумерация полей начинается с 1 21 IPROTO_TUPLE, 4-й элемент ассоциативного массива 91 MP_ARRAY, размер 1, для массива операций 93 MP_ARRAY, размер 3 a1 3d MP_STR = OPERATOR = '=' 02 MP_INT = FIELD_NO = 2 a5 42 42 42 42 42 MP_STR = VALUE = 'BBBB' 20 IPROTO_KEY, 5--й элемент ассоциативного массива 91 MP_ARRAY, размер 1, для массива ключей 02 MP_UINT = значение первичного ключа = 2

source: Byte codes for the :ref:`IPROTO_EXECUTE <box_protocol-execute>` example:
ru: Байт-код для примера :ref:`IPROTO_EXECUTE <box_protocol-execute>`:

source: 0b IPROTO_EXECUTE 83 MP_MAP, size 3 43 IPROTO_STMT_ID Map Item#1 ce d7 aa 74 1b MP_UINT value of n.stmt_id 41 IPROTO_SQL_BIND Map Item#2 92 MP_ARRAY, size 2 01 MP_INT = 1 = value for first parameter a1 61 MP_STR = 'a' = value for second parameter 2b IPROTO_OPTIONS Map Item#3 90 MP_ARRAY, size 0 (there are no options)
ru: 0b IPROTO_EXECUTE 83 MP_MAP, размер 3 43 IPROTO_STMT_ID 1-й элемент ассоциативного массива ce d7 aa 74 1b MP_UINT значение n.stmt_id 41 IPROTO_SQL_BIND 2-й элемент ассоциативного массива 92 MP_ARRAY, размер 2 01 MP_INT = 1 = значение первого параметра a1 61 MP_STR = 'a' = значение второго параметра 2b IPROTO_OPTIONS 3-й элемент ассоциативного массива 90 MP_ARRAY, размер 0 (никакие опции не выбраны)

source: Byte codes for the response to the :codenormal:`box.space.`:codeitalic:`space-name`:codenormal:`:insert{6}` example:
ru: Байт-код для ответа на пример :codenormal:`box.space.`:codeitalic:`space-name`:codenormal:`:insert{6}`:

source: ce 00 00 00 20 MP_UINT = HEADER AND BODY SIZE 83 MP_MAP, size 3 00 Response-Code-Indicator ce 00 00 00 00 MP_UINT = IPROTO_OK 01 IPROTO_SYNC cf 00 00 00 00 00 00 00 53 MP_UINT = sync value 05 IPROTO_SCHEMA_VERSION ce 00 00 00 68 MP_UINT = schema version 81 MP_MAP, size 1 30 IPROTO_DATA dd 00 00 00 01 MP_ARRAY, size 1 (row count) 91 MP_ARRAY, size 1 (field count) 06 MP_INT = 6 = the value that was inserted
ru: ce 00 00 00 20 MP_UINT = размер заголовка и тела 83 MP_MAP, размер 3 00 индикатор кода ответа ce 00 00 00 00 MP_UINT = IPROTO_OK 01 IPROTO_SYNC cf 00 00 00 00 00 00 00 53 MP_UINT = значение синхронизации 05 IPROTO_SCHEMA_VERSION ce 00 00 00 68 MP_UINT = версия схемы 81 MP_MAP, размер 1 30 IPROTO_DATA dd 00 00 00 01 MP_ARRAY, размер 1 (число строк) 91 MP_ARRAY, размер 1 (число полей) 06 MP_INT = 6 = добавленное значение

source: Byte codes for the response to the ``conn:eval([[box.schema.space.create('_space');]])`` example:
ru: Байт-код для ответа на пример ``conn:eval([[box.schema.space.create('_space');]])``:
