Repository: tarantool/doc
Catalog: locale/*/LC_MESSAGES/dev_guide/internals/box_protocol.po
Languages: ru

source: Use IPROTO_STMT_ID (0x43) and statement-id (MP_INT) if executing a prepared statement, or use IPROTO_SQL_TEXT (0x40) and statement-text (MP_STR) if executing an SQL string, then IPROTO_SQL_BIND (0x41) and array of parameter values to match ? placeholders or :name placeholders, IPROTO_OPTIONS (0x2b) and array of options (usually empty).
ru: При выполнении подготовленного оператора используйте IPROTO_STMT_ID (0x43) и ID оператора (MP_INT), при работе со строками SQL — IPROTO_SQL_TEXT (0x40) и текст оператора (MP_STR), а затем IPROTO_SQL_BIND (0x41) и массив значений параметров для подстановочных знаков ``?`` или ``:name``, IPROTO_OPTIONS (0x2b) и массив параметров (обычно пустой).

source: For example, suppose we prepare a statement with two ? placeholders, and execute with two parameters, thus: |br| :code:`n = conn:prepare([[VALUES (?, ?);]])` |br| :code:`conn:execute(n.stmt_id, {1,'a'})` |br| Then the body will look like this:
ru: Например, предположим, что мы создаем подготовленный оператор с двумя подстановочными знаками ? и выполняем его с двумя параметрами таким образом: |br| :code:`n = conn:prepare([[VALUES (?, ?);]])` |br| :code:`conn:execute(n.stmt_id, {1,'a'})` |br| Тогда тело сообщения будет выглядеть так:

source: Later in :ref:`Binary protocol -- illustration <box_protocol-illustration>` we will show actual byte codes of the IPROTO_EXECUTE message.
ru: Далее, в разделе :ref:`Бинарный протокол — примеры <box_protocol-illustration>`, мы покажем фактические байт-коды сообщения IPROTO_EXECUTE.

source: To call a prepared statement with named parameters from a connector pass the parameters within an array of maps. A client should wrap each element into a map, where the key holds a name of the parameter (with a colon) and the value holds an actual value. So, to bind foo and bar to 42 and 43, a client should send ``IPROTO_SQL_TEXT: <...>, IPROTO_SQL_BIND: [{"foo": 42}, {"bar": 43}]``.
ru: Чтобы вызвать подготовленный оператор с именованными параметрами из коннектора, передайте параметры в массиве ассоциативных массивов. Клиент должен поместить каждый элемент в ассоциативный массив, где ключ содержит имя параметра (с двоеточием), а значение — фактическое значение. Так, чтобы связать foo и bar с 42 и 43, клиент должен отправить ``IPROTO_SQL_TEXT: <...>, IPROTO_SQL_BIND: [{"foo": 42}, {"bar": 43}]``.

source: If a statement has both named and non-named parameters, wrap only named ones into a map. The rest of the parameters are positional and will be substituted in order.
ru: Если оператор содержит как именованные, так и неименованные параметры, поместите в ассоциативный массив только именованные параметры. Остальные параметры являются позиционными и будут подставляться по порядку.

source: There is no Lua request exactly equivalent to IPROTO_NOP. It causes the LSN to be incremented. It could be sometimes used for updates where the old and new values are the same, but the LSN must be increased because a data-change must be recorded. The body is: nothing.
ru: Нет такого запроса на Lua, который бы соответствовал IPROTO_NOP. IPROTO_NOP приводит к увеличению LSN. Иногда константу можно использовать для обновления значения, когда старое и новое значения одинаковы, но LSN нужно увеличить, поскольку нужно зарегистрировать изменение данных. Тело сообщения пустое.

source: See :ref:`box.prepare <box-sql_box_prepare>`, this is only for SQL. The body is a 1-item map:
ru: См. :ref:`box.prepare <box-sql_box_prepare>`, используется только для SQL. Тело сообщения представляет собой ассоциативный массив из 1 элемента:

source: # <size> msgpack(:samp:`{{MP_UINT unsigned integer = size(<header>) + size(<body>)}}`) # <header> msgpack({ IPROTO_REQUEST_TYPE: IPROTO_PREPARE, IPROTO_SYNC: :samp:`{{MP_UINT unsigned integer}}` }) # <body> msgpack({ IPROTO_STMT_ID: :samp:`{{MP_INT integer}}` or IPROTO_SQL_TEXT: :samp:`{{MP_STR string}}` })
ru: # <size> msgpack(:samp:`{{MP_UINT unsigned integer = size(<header>) + size(<body>)}}`) # <header> msgpack({ IPROTO_REQUEST_TYPE: IPROTO_PREPARE, IPROTO_SYNC: :samp:`{{MP_UINT unsigned integer}}` }) # <body> msgpack({ IPROTO_STMT_ID: :samp:`{{MP_INT integer}}` или IPROTO_SQL_TEXT: :samp:`{{MP_STR string}}` })

source: IPROTO_STMT_ID (0x43) and statement-id (MP_INT) if executing a prepared statement or IPROTO_SQL_TEXT (0x40) and statement-text (string) if executing an SQL string. Thus the IPROTO_PREPARE map item is the same as the first item of the :ref:`IPROTO_EXECUTE <box_protocol-execute>` body.
ru: При выполнении подготовленного оператора используйте IPROTO_STMT_ID (0x43) и ID оператора (MP_INT), при работе со строками SQL --- IPROTO_SQL_TEXT (0x40) и текст оператора (string). Таким образом, элемент ассоциативного массива IPROTO_PREPARE — это то же самое, что и первый элемент тела сообщения :ref:`IPROTO_EXECUTE <box_protocol-execute>`.

source: This is for starting a transaction. Typically the header will include IPROTO_STREAM_ID. The body is: nothing. See the later section :ref:`Binary protocol -- streams <box_protocol-streams>`.
ru: Этот запрос начинает транзакцию. Как правило, заголовок запроса включает IPROTO_STREAM_ID. Тело запроса пустое. См. раздел ниже :ref:`Бинарный протокол -- стримы<box_protocol-streams>`.

source: This is for ending a transaction. Typically the header will include IPROTO_STREAM_ID. The body is: nothing. See the later section :ref:`Binary protocol -- streams <box_protocol-streams>`.
ru: Этот запрос завершает транзакцию. Как правило, заголовок запроса включает IPROTO_STREAM_ID. Тело запроса пустое. См. раздел ниже :ref:`Бинарный протокол -- стримы<box_protocol-streams>`.

source: See :ref:`conn:ping() <conn-ping>`. The body will be an empty map because IPROTO_PING in the header contains all the information that the server instance needs.
ru: См. :ref:`conn:ping() <conn-ping>`. В теле сообщения будет пустой ассоциативный массив, потому что IPROTO_PING в заголовке содержит всю информацию, необходимую экземпляру сервера.

source: IPROTO_JOIN = 0x41 -- for replication IPROTO_SUBSCRIBE = 0x42 -- for replication SUBSCRIBE IPROTO_VOTE_DEPRECATED = 0x43 -- for old style vote, superseded by IPROTO_VOTE IPROTO_VOTE = 0x44 -- for master election IPROTO_FETCH_SNAPSHOT = 0x45 -- for starting anonymous replication IPROTO_REGISTER = 0x46 -- for leaving anonymous replication.
ru: IPROTO_JOIN = 0x41 — для репликации IPROTO_SUBSCRIBE = 0x42 — для репликации SUBSCRIBE IPROTO_VOTE_DEPRECATED = 0x43 — для устаревшего типа голосования, взамен используется IPROTO_VOTE IPROTO_VOTE = 0x44 — для выбора мастера IPROTO_FETCH_SNAPSHOT = 0x45 — для начала анонимной репликации IPROTO_REGISTER = 0x46 — для выхода из анонимной репликации

source: Tarantool constants 0x41 to 0x46 (decimal 65 to 70) are for replication. Connectors and clients do not need to send replication packets. See :ref:`Binary protocol -- replication <box_protocol-replication>`.
ru: Константы Tarantool 0x41-0x46 (в десятичной системе 65-70) предназначены для репликации. Коннекторы и клиенты не должны отправлять репликационные пакеты. См. :ref:`Бинарный протокол — репликация <box_protocol-replication>`.

source: The next two IPROTO messages are used in replication connections between Tarantool nodes in :ref:`synchronous replication <repl_sync>`. The messages are not supposed to be used by any client applications in their regular connections.
ru: Следующие два сообщения IPROTO используются в соединениях репликации между узлами Tarantool при :ref:`синхронной репликации <repl_sync>`. Эти сообщения не должны использоваться клиентскими приложениями при обычном соединении.

source: This message confirms that the transactions originated from the instance with id = IPROTO_REPLICA_ID have achieved quorum and can be committed, up to and including LSN = IPROTO_LSN. Prior to Tarantool version 2.10-beta1, IPROTO_RAFT_CONFIRM was called IPROTO_CONFIRM.
ru: Это сообщение подтверждает, что транзакции до ``LSN = IPROTO_LSN`` включительно из экземпляра с ``id = IPROTO_REPLICA_ID`` набрали кворум и могут пройти коммит. До версии Tarantool 2.10-beta1 запрос IPROTO_RAFT_CONFIRM назывался IPROTO_CONFIRM.

source: The body is a 2-item map:
ru: Тело сообщения представляет собой ассоциативный массив из 2 элементов:

source: This message says that the transactions originated from the instance with id = IPROTO_REPLICA_ID couldn't achieve quorum for some reason and should be rolled back, down to LSN = IPROTO_LSN and including it. Prior to Tarantool version 2.10, IPROTO_RAFT_ROLLBACK was called IPROTO_ROLLBACK.
ru: В этом сообщении говорится, что транзакции до ``LSN = IPROTO_LSN`` включительно из экземпляра с ``id = IPROTO_REPLICA_ID`` не смогли набрать кворум и будут отменены. До версии Tarantool 2.10 запрос IPROTO_RAFT_ROLLBACK назывался IPROTO_ROLLBACK.

source: Binary protocol -- responses if no error and no SQL
ru: Бинарный протокол — ответы на запросы без ошибок и без SQL

source: After the :ref:`header <box_protocol-header>`, for a response, there will be a body. If there was no error, it will contain IPROTO_OK (0x00). If there was an error, it will contain an error code other than IPROTO_OK. Responses to SQL statements are slightly different and will be described in the later section, :ref:`Binary protocol -- responses for SQL <box_protocol-sql_protocol>`.
ru: В ответе после :ref:`заголовка <box_protocol-header>` идет тело сообщения. Если ошибки не было, оно будет содержать IPROTO_OK (0x00). Если была ошибка, то он будет содержать код ошибки, отличный от IPROTO_OK. Ответы на операторы SQL немного отличаются и будут описаны в последующем разделе :ref:`Бинарный протокол — ответы на SQL-запросы <box_protocol-sql_protocol>`.

source: For IPROTO_OK, the header Response-Code-Indicator will be 0 and the body is a 1-item map.
ru: Для IPROTO_OK индикатор кода ответа в заголовке будет 0, а тело сообщения будет представлять собой ассоциативный массив, состоящий из 1 элемента.

source: For :ref:`IPROTO_PING <box_protocol-ping>` the body will be an empty map. For most data-access requests (IPROTO_SELECT IPROTO_INSERT IPROTO_DELETE etc.) the body is an IPROTO_DATA map with an array of tuples that contain an array of fields. For :ref:`IPROTO_EVAL <box_protocol-eval>` and :ref:`IPROTO_CALL <box_protocol-call>` it will usually be an array but, since Lua requests can result in a wide variety of structures, bodies can have a wide variety of structures.
ru: В теле сообщения :ref:`IPROTO_PING <box_protocol-ping>` будет пустой ассоциативный массив. В теле большинства запросов доступа к данным (IPROTO_SELECT, IPROTO_INSERT, IPROTO_DELETE и т.д.) будет ассоциативный массив IPROTO_DATA с массивом кортежей, содержащих массив полей. Для :ref:`IPROTO_EVAL <box_protocol-eval>` и :ref:`IPROTO_CALL <box_protocol-call>` телом обычно будет массив, но поскольку запросы на Lua могут возвращать самые разные структуры, сами тела могут содержать самые разные структуры.

source: Example: if this is the fifth message and the request is :codenormal:`box.space.`:codeitalic:`space-name`:codenormal:`:insert{6}`, and the previous schema version was 100, a successful response will look like this:
ru: Пример: если это пятое сообщение, запрос такой: :codenormal:`box.space.`:codeitalic:`space-name`:codenormal:`:insert{6}`, и предыдущая версия схемы была 100, ответ после успешного выполнения будет выглядеть следующим образом:

source: Later in :ref:`Binary protocol -- illustration <box_protocol-illustration>` we will show actual byte codes of the response to the IPROTO_INSERT message.
ru: Далее, в разделе :ref:`Бинарный протокол — примеры <box_protocol-illustration>`, мы покажем фактические байт-коды ответа на сообщение IPROTO_INSERT.

source: IPROTO_DATA is what we get with net_box and :ref:`Module buffer <buffer-module>` so if we were using net_box we could decode with :ref:`msgpack.decode_unchecked() <msgpack-decode_unchecked_string>`, or we could convert to a string with :samp:`ffi.string({pointer},{length})`. The :ref:`pickle.unpack() <pickle-unpack>` function might also be helpful.
ru: IPROTO_DATA возвращается в результате использования net_box и :ref:`модуля buffer <buffer-module>`. То есть если бы мы использовали net_box, то могли бы интерпретировать результат с помощью :ref:`msgpack.decode_unchecked() <msgpack-decode_unchecked_string>` или преобразовать его в строку с помощью :samp:`ffi.string({pointer},{length})`. Также здесь можно использовать функцию :ref:`pickle.unpack() <pickle-unpack>`.

source: Binary protocol -- responses for errors
ru: Бинарный протокол — ответы на запросы c ошибками

source: For a response other than IPROTO_OK, the header Response-Code-Indicator will be ``0x8XXX`` and the body will be a 1-item map.
ru: Для ответа, отличного от IPROTO_OK, индикатор кода ответа в заголовке будет ``0x8XXX``, а тело будет представлять собой ассоциативный массив, состоящий из 1 элемента.

source: where ``0x8XXX`` is the indicator for an error and ``XXX`` is a value in `src/box/errcode.h <https://github.com/tarantool/tarantool/blob/master/src/box/errcode.h>`_. ``src/box/errcode.h`` also has some convenience macros which define hexadecimal constants for return codes.
ru: где ``0x8XXX`` — это индикатор ошибки, а ``XXX`` — это значение из файла `src/box/errcode.h <https://github.com/tarantool/tarantool/blob/master/src/box/errcode.h>`_. В ``src/box/errcode.h`` также есть несколько удобных макросов, которые определяют шестнадцатеричные константы для кодов возврата.

source: Example: in version 2.4.0 and earlier, if this is the fifth message and the request is to create a duplicate space with ``conn:eval([[box.schema.space.create('_space');]])`` the unsuccessful response will look like this:
ru: Пример: в версии 2.4.0 и раньше, если это пятое сообщение и отправляется запрос на создание дубликата спейса с помощью ``conn:eval([[box.schema.space.create('_space');]])``, то ответ на невыполненный запрос будет выглядеть следующим образом:

source: Later in :ref:`Binary protocol -- illustration <box_protocol-illustration>` we will show actual byte codes of the response to the IPROTO_EVAL message.
ru: Далее, в разделе :ref:`Бинарный протокол — примеры <box_protocol-illustration>`, мы покажем фактические байт-коды ответа на сообщение IPROTO_EVAL.

source: Looking in errcode.h we find that error code 0x0a (decimal 10) is ER_SPACE_EXISTS, and the string associated with ER_SPACE_EXISTS is "Space '%s' already exists".
ru: Заглянув в errcode.h, по коду ошибки 0x0a (10 в десятичной системе) мы обнаружим ER_SPACE_EXISTS, чему соответствует строка "Space '%s' already exists" ("Спейс '%s' уже существует").

source: Since version :doc:`2.4.1 </release/2.4.1>`, responses for errors have extra information following what was described above. This extra information is given via MP_ERROR extension type. See details in :ref:`MessagePack extensions <msgpack_ext-error>` section.
ru: Начиная с версии :doc:`2.4.1 </release/2.4.1>`, ответы на ошибки содержат дополнительную информацию, как описано выше. Эта дополнительная информация передается с помощью расширения MP_ERROR. Подробную информацию см. в разделе :ref:`расширения MessagePack <msgpack_ext-error>`.

source: Binary protocol -- responses for SQL
ru: Бинарный протокол — ответы на запросы с SQL

source: After the :ref:`header <box_protocol-header>`, for a response to an SQL statement, there will be a body that is slightly different from the body for :ref:`Binary protocol -- responses if no error and no SQL <box_protocol-responses>`.
ru: В ответе на SQL-запрос после :ref:`заголовка <box_protocol-header>` идет тело сообщения, которое немного отличается от тела сообщения, описанного в разделе :ref:`Бинарный протокол — ответы на запросы без ошибок и без SQL <box_protocol-responses>`.

source: If the SQL request is not SELECT or VALUES or PRAGMA, then the response body contains only IPROTO_SQL_INFO (0x42). Usually IPROTO_SQL_INFO is a map with only one item -- SQL_INFO_ROW_COUNT (0x00) -- which is the number of changed rows.
ru: Если SQL-запрос не содержит операторы SELECT, VALUES или PRAGMA, то тело ответа содержит только IPROTO_SQL_INFO (0x42). Обычно IPROTO_SQL_INFO представляет собой ассоциативный массив с одним элементом — SQL_INFO_ROW_COUNT (0x00) — количество измененных строк.

source: For example, if the request is :samp:`INSERT INTO {table-name} VALUES (1), (2), (3)`, then the response body contains an :samp:`IPROTO_SQL_INFO map with SQL_INFO_ROW_COUNT = 3`. :samp:`SQL_INFO_ROW_COUNT` can be 0 for statements that do not change rows, but can be 1 for statements that create new objects.
ru: Например, для запроса :samp:`INSERT INTO {table-name} VALUES (1), (2), (3)` тело ответа содержит ассоциативный массив :samp:`IPROTO_SQL_INFO с SQL_INFO_ROW_COUNT = 3`. :samp:`SQL_INFO_ROW_COUNT` может быть 0, если оператор не изменяет строку, и может быть 1, если оператор создает новый объект.

source: The IPROTO_SQL_INFO map may contain a second item -- :samp:`SQL_INFO_AUTO_INCREMENT_IDS (0x01)` -- which is the new primary-key value (or values) for an INSERT in a table defined with PRIMARY KEY AUTOINCREMENT. In this case the MP_MAP will have two keys, and one of the two keys will be 0x01: SQL_INFO_AUTO_INCREMENT_IDS, which is an array of unsigned integers.
ru: Ассоциативный массив IPROTO_SQL_INFO может содержать второй элемент :samp:`SQL_INFO_AUTO_INCREMENT_IDS (0x01)`, который представляет собой новое значение (или значения) первичного ключа в операции вставки INSERT в таблицу с автоматическим увеличением первичного ключа PRIMARY KEY AUTOINCREMENT. В этом случае MP_MAP будет содержать два ключа, и одним из двух ключей будет 0x01: SQL_INFO_AUTO_INCREMENT_IDS, который представляет собой массив целых беззнаковых чисел.

source: If the SQL statement is SELECT or VALUES or PRAGMA, the response contains:
ru: Если запрос содержит SQL-оператор SELECT, VALUES или PRAGMA, ответ будет:

source: :samp:`IPROTO_METADATA: {array of column maps}` = array of column maps, with each column map containing at least IPROTO_FIELD_NAME (0x00) and MP_STR, and IPROTO_FIELD_TYPE (0x01) and MP_STR. Additionally, if ``sql_full_metadata`` in the :ref:`_session_settings <box_space-session_settings>` system space is TRUE, then the array will have these additional column maps which correspond to components described in the :ref:`box.execute() <box-sql_if_full_metadata>` section:
ru: :samp:`IPROTO_METADATA: {array of column maps}` --- массив ассоциативных массивов, причем каждый ассоциативный массив содержит по крайней мере IPROTO_FIELD_NAME (0x00) + MP_STR и IPROTO_FIELD_TYPE (0x01) + MP_STR. Кроме того, если в системном спейсе :ref:`_session_settings <box_space-session_settings>` задано значение TRUE для ``sql_full_metadata``, то массив будет содержать такие дополнительные ассоциативные массивы, которые соответствуют компонентам, описанным в разделе :ref:`box.execute() <box-sql_if_full_metadata>`:

source: IPROTO_FIELD_COLL (0x02) and MP_STR IPROTO_FIELD_IS_NULLABLE (0x03) and MP_BOOL IPROTO_FIELD_IS_AUTOINCREMENT (0x04) and MP_BOOL IPROTO_FIELD_SPAN (0x05) and MP_STR or MP_NIL
ru: IPROTO_FIELD_COLL (0x02) + MP_STR IPROTO_FIELD_IS_NULLABLE (0x03) + MP_BOOL IPROTO_FIELD_IS_AUTOINCREMENT (0x04) + MP_BOOL IPROTO_FIELD_SPAN (0x05) + MP_STR или MP_NIL

source: :samp:`IPROTO_DATA:{array of tuples}` = the result set "rows".
ru: :samp:`IPROTO_DATA:{array of tuples}` = строки результирующего набора.

source: Example: If we ask for full metadata by saying |br| :code:`conn.space._session_settings:update('sql_full_metadata', {{'=', 'value', true}})` |br| and we select the two rows from a table named t1 that has columns named DD and Д, with |br| :code:`conn:execute([[SELECT dd, дд AS д FROM t1;]])` |br| we could get this response, in the body:
ru: Пример: Если мы запросим полные метаданные, вызвав |br| :code:`conn.space._session_settings:update('sql_full_metadata', {{'=', 'value', true}})` |br| и выберем две строки из таблицы t1, в которой есть столбцы DD и Д, с помощью |br| :code:`conn:execute([[SELECT dd, дд AS д FROM t1;]])` |br| мы можем получить такой ответ:

source: If instead we said |br| :code:`conn:prepare([[SELECT dd, дд AS д FROM t1;]])` |br| then we could get almost the same response, but there would be no IPROTO_DATA and there would be two additional items: |br| ``34 00 = IPROTO_BIND_COUNT and MP_UINT = 0`` (there are no parameters to bind), |br| ``33 90 = IPROTO_BIND_METADATA and MP_ARRAY, size 0`` (there are no parameters to bind).
ru: Если бы вместо этого мы вызвали :code:`conn:prepare([[SELECT dd, дд AS д FROM t1;]])`, мы получили бы почти такой же ответ, но без IPROTO_DATA и с двумя дополнительными элементами: |br| ``34`` (IPROTO_BIND_COUNT) и ``00`` (MP_UINT = 0, нет параметров), ``33`` (IPROTO_BIND_METADATA) и ``90`` (MP_ARRAY размера 0, нет параметров).

source: Now read the source code file `net_box.c <https://github.com/tarantool/tarantool/blob/master/src/box/lua/net_box.c>`_ where the function "decode_metadata_optional" is an example of how Tarantool itself decodes extra items.
ru: Теперь обратитесь к файлу исходного кода `net_box.c <https://github.com/tarantool/tarantool/blob/master/src/box/lua/net_box.c>`_, где функция "decode_metadata_optional" показывает, как Tarantool сам интерпретирует дополнительные элементы.

source: Later in :ref:`Binary protocol -- illustration <box_protocol-illustration>` we will show actual byte codes of responses to the above SQL messages.
ru: Далее, в разделе :ref:`Бинарный протокол — примеры <box_protocol-illustration>`, мы покажем фактические байт-коды ответов на вышеприведенные SQL сообщения.

source: Binary protocol -- authentication
ru: Бинарный протокол — аутентификация

source: When a client connects to the server instance, the instance responds with a 128-byte text greeting message, not in MsgPack format: |br| 64-byte Greeting text line 1 |br| 64-byte Greeting text line 2 |br| 44-byte base64-encoded salt |br| 20-byte NULL
ru: Когда клиент подключается к экземпляру сервера, тот выдает в ответе 128-байтовое текстовое сообщение приветствия не в формате MsgPack: |br| 64 байта — строка 1 текста приветствия |br| 64 байта — строка 2 текста приветствия |br| 44 байта —закодированное в формате base-64 значение соль |br| 20 байтов — NULL

source: The greeting contains two 64-byte lines of ASCII text. Each line ends with a newline character (:code:`\n`). The first line contains the instance version and protocol type. The second line contains up to 44 bytes of base64-encoded random string, to use in the authentication packet, and ends with up to 23 spaces.
ru: Приветствие содержит две 64-байтные строки текста в формате ASCII. Каждая строка заканчивается символом разрыва строки (:code:`\n`). Первая строка описывает версию экземпляра и тип протокола. Вторая строка содержит случайную строку в кодировке base-64 размером до 44 байтов для использования в пакете аутентификации и заканчивается на пробелы (до 23).

source: Part of the greeting is a base64-encoded session salt - a random string which can be used for authentication. The maximum length of an encoded salt (44 bytes) is more than the amount necessary to create the authentication message. An excess is reserved for future authentication schemas.
ru: Часть приветствия представляет собой закодированное в формате base-64 значение соль для сессии (случайная строка), которое можно использовать для аутентификации. Максимальная длина закодированного значения соль (44 байта) больше, чем размер создаваемого сообщения аутентификации. Остаток предназначается для будущих схем аутентификации.

source: Authentication is optional -- if it is skipped, then the session user is ``'guest'`` (the ``'guest'`` user does not need a password).
ru: Аутентификация необязательна: если аутентификация не проводится, то пользователем в сеансе будет ``'guest'`` (пользователю ``'guest'`` пароль не нужен).
