Repository: tarantool/doc
Catalog: locale/*/LC_MESSAGES/dev_guide/internals/box_protocol.po
Languages: ru

source: ce 00 00 00 3b MP_UINT = HEADER AND BODY SIZE 83 MP_MAP, size 3 (i.e. 3 items in header) 00 Response-Code-Indicator ce 00 00 80 0a MP_UINT = hexadecimal 800a 01 IPROTO_SYNC cf 00 00 00 00 00 00 00 26 MP_UINT = sync value 05 IPROTO_SCHEMA_VERSION ce 00 00 00 78 MP_UINT = schema version value 81 MP_MAP, size 1 31 IPROTO_ERROR_24 db 00 00 00 1d 53 70 61 63 etc. MP_STR = "Space '_space' already exists"
ru: ce 00 00 00 3b MP_UINT = размер заголовка и тела 83 MP_MAP, размер 3 (3 элемента в заголовке) 00 индикатор кода ответа ce 00 00 80 0a MP_UINT = шестнадцатеричное значение 800a 01 IPROTO_SYNC cf 00 00 00 00 00 00 00 26 MP_UINT = значение синхронизации 05 IPROTO_SCHEMA_VERSION ce 00 00 00 78 MP_UINT = версия схемы 81 MP_MAP, размер 1 31 IPROTO_ERROR_24 db 00 00 00 1d 53 70 61 63 ... MP_STR = "Space '_space' already exists"

source: Byte codes, if we use the same net.box connection that we used for :ref:`Binary protocol -- illustration <box_protocol-illustration>` and we say |br| ``conn:execute([[CREATE TABLE t1 (dd INT PRIMARY KEY AUTOINCREMENT, дд STRING COLLATE "unicode");]])`` |br| ``conn:execute([[INSERT INTO t1 VALUES (NULL, 'a'), (NULL, 'b');]])`` |br| and we watch what tcpdump displays, we will see two noticeable things: (1) the CREATE statement caused a schema change so the response has a new IPROTO_SCHEMA_VERSION value and the body includes the new contents of some system tables (caused by requests from net.box which users will not see); (2) the final bytes of the response to the INSERT will be:
ru: Подключимся через то же соединение net.box, что приводилось в разделе :ref:`Бинарный протокол --- примеры <box_protocol-illustration>`, и выполним следующее: |br| ``conn:execute([[CREATE TABLE t1 (dd INT PRIMARY KEY AUTOINCREMENT, дд STRING COLLATE "unicode");]])`` |br| ``conn:execute([[INSERT INTO t1 VALUES (NULL, 'a'), (NULL, 'b');]])`` |br| Результат вывода tcpdump покажет два интересных момента: (1) инструкция CREATE привела к изменению схемы, так что в ответе указано новое значение IPROTO_SCHEMA_VERSION. При этом тело включает новое содержимое некоторых системных таблиц, полученное в результате невидимых для пользователя запросов от net.box; (2) последние байты ответа на INSERT будут следующими:

source: 81 MP_MAP, size 1 42 IPROTO_SQL_INFO 82 MP_MAP, size 2 00 Tarantool constant (not in iproto_constants.h) = SQL_INFO_ROW_COUNT 02 1 = row count 01 Tarantool constant (not in iproto_constants.h) = SQL_INFO_AUTOINCREMENT_ID 92 MP_ARRAY, size 2 01 first autoincrement number 02 second autoincrement number
ru: 81 MP_MAP, размер 1 42 IPROTO_SQL_INFO 82 MP_MAP, размер 2 00 константа Tarantool (не из iproto_constants.h) = SQL_INFO_ROW_COUNT 02 1 = число строк 01 константа Tarantool (не из iproto_constants.h) = SQL_INFO_AUTOINCREMENT_ID 92 MP_ARRAY, размер 2 01 первое число с автоинкрементом 02 второе число с автоинкрементом

source: Byte codes for the SQL SELECT example, if we ask for full metadata by saying |br| :code:`conn.space._session_settings:update('sql_full_metadata', {{'=', 'value', true}})` |br| and we select the two rows from the table that we just created |br| :code:`conn:execute([[SELECT dd, дд AS д FROM t1;]])` |br| then tcpdump will show this response, after the header:
ru: Байт-код для примера с SQL SELECT. Запросим полные метаданные, вызвав :code:`conn.space._session_settings:update('sql_full_metadata', {{'=', 'value', true}})`, и выберем две строки из только что созданной таблицы: :code:`conn:execute([[SELECT dd, дд AS д FROM t1;]])`. tcpdump выдаст следующий ответ (после заголовка):

source: 82 MP_MAP, size 2 (i.e. metadata and rows) 32 IPROTO_METADATA 92 MP_ARRAY, size 2 (i.e. 2 columns) 85 MP_MAP, size 5 (i.e. 5 items for column#1) 00 a2 44 44 IPROTO_FIELD_NAME and 'DD' 01 a7 69 6e 74 65 67 65 72 IPROTO_FIELD_TYPE and 'integer' 03 c2 IPROTO_FIELD_IS_NULLABLE and false 04 c3 IPROTO_FIELD_IS_AUTOINCREMENT and true 05 c0 PROTO_FIELD_SPAN and nil 85 MP_MAP, size 5 (i.e. 5 items for column#2) 00 a2 d0 94 IPROTO_FIELD_NAME and 'Д' upper case 01 a6 73 74 72 69 6e 67 IPROTO_FIELD_TYPE and 'string' 02 a7 75 6e 69 63 6f 64 65 IPROTO_FIELD_COLL and 'unicode' 03 c3 IPROTO_FIELD_IS_NULLABLE and true 05 a4 d0 b4 d0 b4 IPROTO_FIELD_SPAN and 'дд' lower case 30 IPROTO_DATA 92 MP_ARRAY, size 2 92 MP_ARRAY, size 2 01 MP_INT = 1 i.e. contents of row#1 column#1 a1 61 MP_STR = 'a' i.e. contents of row#1 column#2 92 MP_ARRAY, size 2 02 MP_INT = 2 i.e. contents of row#2 column#1 a1 62 MP_STR = 'b' i.e. contents of row#2 column#2
ru: 82 MP_MAP, размер 2 (метаданные и строки) 32 IPROTO_METADATA 92 MP_ARRAY, размер 2 (2 столбца) 85 MP_MAP, размер 5 (5 элементов для столбца 1) 00 a2 44 44 IPROTO_FIELD_NAME и 'DD' 01 a7 69 6e 74 65 67 65 72 IPROTO_FIELD_TYPE и 'integer' 03 c2 IPROTO_FIELD_IS_NULLABLE и false 04 c3 IPROTO_FIELD_IS_AUTOINCREMENT и true 05 c0 PROTO_FIELD_SPAN и nil 85 MP_MAP, размер 5 (5 элементов для столбца 2) 00 a2 d0 94 IPROTO_FIELD_NAME и 'Д' в верхнем регистре 01 a6 73 74 72 69 6e 67 IPROTO_FIELD_TYPE и 'string' 02 a7 75 6e 69 63 6f 64 65 IPROTO_FIELD_COLL и 'unicode' 03 c3 IPROTO_FIELD_IS_NULLABLE и true 05 a4 d0 b4 d0 b4 IPROTO_FIELD_SPAN и 'дд' в нижнем регистре 30 IPROTO_DATA 92 MP_ARRAY, размер 2 92 MP_ARRAY, размер 2 01 MP_INT = 1: содержимое строки 1, столбца 1 a1 61 MP_STR = 'a': содержимое строки 1, столбца 2 92 MP_ARRAY, размер 2 02 MP_INT = 2: содержимое строки 2, столбца 1 a1 62 MP_STR = 'b': содержимое строки 2, столбца 2

source: Byte code for the SQL PREPARE example. If we said |br| :code:`conn:prepare([[SELECT dd, дд AS д FROM t1;]])` |br| then tcpdump would show almost the same response, but there would be no IPROTO_DATA. Instead, additional items will appear:
ru: Байт-код для примера SQL PREPARE. Если вызвать :code:`conn:prepare([[SELECT dd, дд AS д FROM t1;]])`, вывод tcpdump будет почти таким же, но исчезнет IPROTO_DATA. Вместо этого появятся дополнительные байты:

source: 34 IPROTO_BIND_COUNT 00 MP_UINT = 0 33 IPROTO_BIND_METADATA 90 MP_ARRAY, size 0
ru: 34 IPROTO_BIND_COUNT 00 MP_UINT = 0 33 IPROTO_BIND_METADATA 90 MP_ARRAY, размер 0

source: ``MP_UINT = 0`` and ``MP_ARRAY`` has size 0 because there are no parameters to bind. Full output:
ru: ``MP_UINT = 0``. Массив ``MP_ARRAY`` имеет размер 0, поскольку параметров нет. Вывод целиком:

source: 84 MP_MAP, size 4 43 IPROTO_STMT_ID ce c2 3c 2c 1e MP_UINT = statement id 34 IPROTO_BIND_COUNT 00 MP_INT = 0 = number of parameters to bind 33 IPROTO_BIND_METADATA 90 MP_ARRAY, size 0 = there are no parameters to bind 32 IPROTO_METADATA 92 MP_ARRAY, size 2 (i.e. 2 columns) 85 MP_MAP, size 5 (i.e. 5 items for column#1) 00 a2 44 44 IPROTO_FIELD_NAME and 'DD' 01 a7 69 6e 74 65 67 65 72 IPROTO_FIELD_TYPE and 'integer' 03 c2 IPROTO_FIELD_IS_NULLABLE and false 04 c3 IPROTO_FIELD_IS_AUTOINCREMENT and true 05 c0 PROTO_FIELD_SPAN and nil 85 MP_MAP, size 5 (i.e. 5 items for column#2) 00 a2 d0 94 IPROTO_FIELD_NAME and 'Д' upper case 01 a6 73 74 72 69 6e 67 IPROTO_FIELD_TYPE and 'string' 02 a7 75 6e 69 63 6f 64 65 IPROTO_FIELD_COLL and 'unicode' 03 c3 IPROTO_FIELD_IS_NULLABLE and true 05 a4 d0 b4 d0 b4 IPROTO_FIELD_SPAN and 'дд' lower case
ru: 84 MP_MAP, размер 4 43 IPROTO_STMT_ID ce c2 3c 2c 1e MP_UINT = ID инструкции 34 IPROTO_BIND_COUNT 00 MP_INT = 0 = число привязываемых параметров 33 IPROTO_BIND_METADATA 90 MP_ARRAY, размер 0 = нет привязываемых параметров 32 IPROTO_METADATA 92 MP_ARRAY, размер 2 (2 столбца) 85 MP_MAP, размер 5 (5 элементов для столбца 1) 00 a2 44 44 IPROTO_FIELD_NAME и 'DD' 01 a7 69 6e 74 65 67 65 72 IPROTO_FIELD_TYPE и 'integer' 03 c2 IPROTO_FIELD_IS_NULLABLE и false 04 c3 IPROTO_FIELD_IS_AUTOINCREMENT и true 05 c0 PROTO_FIELD_SPAN и nil 85 MP_MAP, размер 5 (5 элементов для столбца 2) 00 a2 d0 94 IPROTO_FIELD_NAME + 'Д' в верхнем регистре 01 a6 73 74 72 69 6e 67 IPROTO_FIELD_TYPE и 'string' 02 a7 75 6e 69 63 6f 64 65 IPROTO_FIELD_COLL и 'unicode' 03 c3 IPROTO_FIELD_IS_NULLABLE и true 05 a4 d0 b4 d0 b4 IPROTO_FIELD_SPAN и 'дд' в нижнем регистре

source: Byte code for the heartbeat example. The master might send this body:
ru: Байт-код для примера с контрольным сигналом. Мастер может отправить следующее тело:

source: 83 MP_MAP, size 3 00 Main-Map Item #1 IPROTO_REQUEST_TYPE 00 MP_UINT = 0 02 Main-Map Item #2 IPROTO_REPLICA_ID 02 MP_UINT = 2 = id 04 Main-Map Item #3 IPROTO_TIMESTAMP cb MP_DOUBLE (MessagePack "Float 64") 41 d7 ba 06 7b 3a 03 21 8-byte timestamp
ru: 83 MP_MAP, размер 3 00 1-й элемент Main-Map IPROTO_REQUEST_TYPE 00 MP_UINT = 0 02 2-й элемент Main-Map IPROTO_REPLICA_ID 02 MP_UINT = 2 = id 04 3-й элемент Main-Map IPROTO_TIMESTAMP cb MP_DOUBLE (MessagePack "Float 64") 41 d7 ba 06 7b 3a 03 21 8-байтовая временная отметка

source: Byte code for the heartbeat example. The replica might send back this body
ru: Байт-код ответа на пример с контрольным сигналом. Реплика может вернуть следующее тело:

source: 81 MP_MAP, size 1 00 Main-Map Item #1 Response-code-indicator 00 MP_UINT = 0 = IPROTO_OK 81 Main-Map Item #2, MP_MAP, size 1 26 Sub-Map Item #1 IPROTO_VCLOCK 81 Sub-Map Item #2, MP_MAP, size 1 01 MP_UINT = 1 = id (part 1 of vclock) 06 MP_UINT = 6 = lsn (part 2 of vclock)
ru: 81 MP_MAP, размер 1 00 1-й элемент Main-Map: индикатор кода ответа 00 MP_UINT = 0 = IPROTO_OK 81 2-й элемент Main-Map: MP_MAP, размер 1 (Sub-Map) 26 1-й элемент Sub-Map: IPROTO_VCLOCK 81 2-й элемент Sub-Map: MP_MAP, размер 1 01 MP_UINT = 1 = id (1-я часть vclock) 06 MP_UINT = 6 = lsn (2-я часть vclock)

source: .xlog and .snap files have nearly the same format. The header looks like:
ru: Файлы форматов .xlog и .snap выглядят практически одинаково. Заголовок выглядит так:

source: <type>\n SNAP\n or XLOG\n <version>\n currently 0.13\n Server: <server_uuid>\n where UUID is a 36-byte string VClock: <vclock_map>\n e.g. {1: 0}\n \n
ru: <type>\n SNAP\n или XLOG\n <version>\n в данный момент 0.13\n Server: <server_uuid>\n где UUID -- это 36-байтная строка VClock: <vclock_map>\n например, {1: 0}\n \n

source: After the file header come the data tuples. Tuples begin with a row marker ``0xd5ba0bab`` and the last tuple may be followed by an EOF marker ``0xd510aded``. Thus, between the file header and the EOF marker, there may be data tuples that have this form:
ru: После файла заголовка идут кортежи с данными. Кортежи начинаются с маркера строки ``0xd5ba0bab``, а после последнего кортежа может стоять маркер конца файла ``0xd510aded``. Таким образом, между заголовком файла и маркером конца файла могут быть кортежи с данными в следующем виде:

source: See the example in the :ref:`File formats <internals-data_persistence>` section.
ru: См. пример в разделе :ref:`Форматы файлов <internals-data_persistence>`.
