Repository: tarantool/doc
Catalog: locale/*/LC_MESSAGES/dev_guide/internals/box_protocol.po
Languages: ru

source: Binary protocol
ru: Бинарный протокол

source: The binary protocol is called a "request/response" protocol because it is for sending requests to a Tarantool server and receiving responses. There is complete access to Tarantool functionality, including:
ru: Бинарный протокол передает данные по схеме "запрос-ответ", то есть он предназначен для отправки запросов на сервер Tarantool и получения ответов. Протокол предоставляет полный доступ к функциям Tarantool, включая:

source: request multiplexing, for example ability to issue multiple requests asynchronously via the same connection
ru: мультиплексирование запросов, т.е. возможность асинхронной отправки множества запросов по одному соединению;

source: response format that supports zero-copy writes
ru: формат ответа, который поддерживает запись в режиме без копирования (zero-copy).

source: The protocol can be called "binary" because the most-frequently-used database accesses are done with binary codes instead of Lua request text. Tarantool experts use it to write their own connectors, to understand network messages, to support new features that their favorite connector doesn't support yet, or to avoid repetitive parsing by the server.
ru: Протокол можно назвать "бинарным", поскольку наиболее частые обращения к базе данных выполняются с помощью бинарного кода, а не текста запроса на языке Lua. Специалисты по Tarantool используют его, чтобы писать собственные коннекторы, понимать сетевые сообщения, поддерживать новые функции, которые их любимый коннектор еще не поддерживает, или чтобы избежать повторного разбора на сервере.

source: Index
ru: Указатель

source: Section
ru: Раздел

source: Description
ru: Описание

source: :ref:`Symbols and terms <box_protocol-notation>`
ru: :ref:`Обозначения и термины <box_protocol-notation>`

source: Notation of binary protocol
ru: Условные обозначения в бинарном протоколе

source: :ref:`Header and body <box_protocol-header>`
ru: :ref:`Заголовок и тело сообщения <box_protocol-header>`

source: Header of a request
ru: Заголовок запроса

source: Requests: |br|:ref:`IPROTO_SELECT <box_protocol-select>` |br|:ref:`IPROTO_INSERT <box_protocol-insert>` |br|:ref:`IPROTO_REPLACE <box_protocol-replace>` |br|:ref:`IPROTO_UPDATE <box_protocol-update>` |br|:ref:`IPROTO_DELETE <box_protocol-delete>` |br|:ref:`IPROTO_CALL_16 <box_protocol-call16>` |br|:ref:`IPROTO_AUTH <box_protocol-auth>` |br|:ref:`IPROTO_EVAL <box_protocol-eval>` |br|:ref:`IPROTO_UPSERT <box_protocol-upsert>` |br|:ref:`IPROTO_CALL <box_protocol-call>` |br|:ref:`IPROTO_EXECUTE <box_protocol-execute>` |br|:ref:`IPROTO_NOP <box_protocol-nop>` |br|:ref:`IPROTO_PREPARE <box_protocol-prepare>` |br|:ref:`IPROTO_PING <box_protocol-ping>` |br|:ref:`IPROTO_JOIN <box_protocol-join>` |br|:ref:`IPROTO_SUBSCRIBE <box_protocol-join>` |br|:ref:`IPROTO_VOTE_DEPRECATED <box_protocol-join>` |br|:ref:`IPROTO_VOTE <box_protocol-join>` |br|:ref:`IPROTO_FETCH_SNAPSHOT <box_protocol-join>` |br|:ref:`IPROTO_REGISTER <box_protocol-join>` |br|:ref:`IPROTO_BEGIN <box_protocol-begin>` |br|:ref:`IPROTO_COMMIT <box_protocol-commit>` |br|:ref:`IPROTO_ROLLBACK <box_protocol-rollback>`
ru: Запросы: |br|:ref:`IPROTO_SELECT <box_protocol-select>` |br|:ref:`IPROTO_INSERT <box_protocol-insert>` |br|:ref:`IPROTO_REPLACE <box_protocol-replace>` |br|:ref:`IPROTO_UPDATE <box_protocol-update>` |br|:ref:`IPROTO_DELETE <box_protocol-delete>` |br|:ref:`IPROTO_CALL_16 <box_protocol-call16>` |br|:ref:`IPROTO_AUTH <box_protocol-auth>` |br|:ref:`IPROTO_EVAL <box_protocol-eval>` |br|:ref:`IPROTO_UPSERT <box_protocol-upsert>` |br|:ref:`IPROTO_CALL <box_protocol-call>` |br|:ref:`IPROTO_EXECUTE <box_protocol-execute>` |br|:ref:`IPROTO_NOP <box_protocol-nop>` |br|:ref:`IPROTO_PREPARE <box_protocol-prepare>` |br|:ref:`IPROTO_PING <box_protocol-ping>` |br|:ref:`IPROTO_JOIN <box_protocol-join>` |br|:ref:`IPROTO_SUBSCRIBE <box_protocol-join>` |br|:ref:`IPROTO_VOTE_DEPRECATED <box_protocol-join>` |br|:ref:`IPROTO_VOTE <box_protocol-join>` |br|:ref:`IPROTO_FETCH_SNAPSHOT <box_protocol-join>` |br|:ref:`IPROTO_REGISTER <box_protocol-join>` |br|:ref:`IPROTO_BEGIN <box_protocol-begin>` |br|:ref:`IPROTO_COMMIT <box_protocol-commit>` |br|:ref:`IPROTO_ROLLBACK <box_protocol-rollback>`

source: Body of a request
ru: Тело запроса

source: :ref:`Responses if no error and no SQL <box_protocol-responses>`
ru: :ref:`Ответы на ошибки и запросы без SQL <box_protocol-responses>`

source: Responses for no SQL
ru: Ответы на запросы без SQL

source: :ref:`Responses for errors <box_protocol-responses_error>`
ru: :ref:`Ответы на ошибки <box_protocol-responses_error>`

source: Responses for errors
ru: Ответы на ошибки

source: :ref:`Responses for SQL <box_protocol-sql_protocol>`
ru: :ref:`Ответы на запросы с SQL <box_protocol-sql_protocol>`

source: Responses for SQL
ru: Ответы на запросы с SQL

source: :ref:`Authentication <box_protocol-authentication>`
ru: :ref:`Аутентификация <box_protocol-authentication>`

source: Authentication after connection
ru: Аутентификация после установления соединения

source: :ref:`Replication <box_protocol-replication>`
ru: :ref:`Репликация <box_protocol-replication>`

source: Replication request
ru: Запрос репликации

source: :ref:`Illustration <box_protocol-illustration>`
ru: :ref:`Примеры <box_protocol-illustration>`

source: Illustration of use
ru: Примеры использования

source: Format of .xlog and .snap files
ru: Формат файлов .xlog и .snap

source: Binary protocol -- symbols and terms
ru: Бинарный протокол — обозначения и термины

source: Words that start with **MP_** mean: a `MessagePack <http://MessagePack.org>`_ type or a range of MessagePack types, including the signal and possibly including a value, with slight modification:
ru: Если слово начинается с **MP_**, это указывает на тип `MessagePack <http://MessagePack.org>`_ или ряд типов MessagePack, включая сигнал и, возможно, включая значение, с небольшими изменениями:

source: **MP_INT** either integer or unsigned integer
ru: **MP_INT** integer или unsigned integer

source: **MP_EXT** extension (including the :ref:`DECIMAL type <msgpack_ext-decimal>` and UUID type)
ru: **MP_EXT** extension (включая :ref:`тип DECIMAL <msgpack_ext-decimal>` и тип UUID)

source: **MP_OBJECT** any MessagePack object
ru: **MP_OBJECT** любой объект формата MessagePack

source: Short descriptions are in MessagePack's `"spec" page <https://github.com/msgpack/msgpack/blob/master/spec.md>`_.
ru: Краткое описание приводится на `странице "спецификации" <https://github.com/msgpack/msgpack/blob/master/spec.md>`_ MessagePack.

source: And words that start with **IPROTO_** mean: a Tarantool constant which is either defined or mentioned in the `iproto_constants.h file <https://github.com/tarantool/tarantool/blob/master/src/box/iproto_constants.h>`_.
ru: Если же слово начинается с **IPROTO_**, это указывает на константу Tarantool, которая либо определена, либо упоминается в `файле iproto_constants.h <https://github.com/tarantool/tarantool/blob/master/src/box/iproto_constants.h>`_.

source: The IPROTO constants that identify requests that we will mention in this section are:
ru: В этом разделе мы будем упоминать следующие константы IPROTO, которые идентифицируют запросы:

source: The IPROTO constants that appear within requests or responses that we will describe in this section are:
ru: В этом разделе мы опишем такие константы IPROTO, которые встречаются в запросах или ответах:

source: To denote message descriptions we will say ``msgpack(...)`` and within it we will use modified `YAML <https://en.wikipedia.org/wiki/YAML>`_ so: |br|
ru: Для обозначения описаний сообщений мы будем вызывать ``msgpack(...)``, а внутри него будем использовать модифицированный ``YAML <https://en.wikipedia.org/wiki/YAML>`_ таким образом: |br|

source: :code:`{...}` braces enclose an associative array, also called map, which in MsgPack is MP_MAP, |br| :samp:`{k}: {v}` is a key-value pair, also called map-item, in this section k is always an unsigned-integer value = one of the IPROTO constants, |br| :samp:`{italics}` are for replaceable text, which is the convention throughout this manual. Usually this is a data type but we do not show types of IPROTO constants which happen to always be unsigned 8-bit integers, |br| :code:`[...]` is for non-associative arrays, |br| :code:`#` starts a comment, especially for the beginning of a section, |br| everything else is "as is". |br| Map-items may appear in any order but in examples we usually use the order that net_box.c happens to use.
ru: :code:`{...}` в фигурные скобки заключают ассоциативный массив, в MsgPack это MP_MAP, |br| :samp:`{k}: {v}` — это пара "ключ-значение", также называемая элементом ассоциативного массива, в этом разделе k всегда является беззнаковым целым = одной из констант IPROTO, |br| :samp:`{italics}` используются для обозначения заменяемого текста в этом руководстве. Обычно это тип данных, но мы не показываем типы констант IPROTO, которые всегда будут беззнаковыми 8-битными целыми числами, |br| :code:`[...]` — для неассоциативных массивов, |br| :code:`#` начинает комментарий, особенно в начале раздела, |br| все остальное приводится "как есть". |br| Элементы ассоциативного массива могут появляться в любом порядке, но в примерах мы обычно используем тот порядок, который используется в net_box.c.

source: Binary protocol -- header and body
ru: Бинарный протокол — заголовок и тело сообщения

source: Except during connection (which involves a greeting from the server and optional :ref:`authentication <box_protocol-authentication>` that we will discuss later in this section), the protocol is pure request/response (the client requests and the server responds). It is legal to put more than one request in a packet.
ru: Кроме как во время соединения (что включает в себя приветствие сервера и необязательную :ref:`аутентификацию <box_protocol-authentication>`, которую мы обсудим далее в этом разделе), протокол идет по схеме "запрос-ответ" (клиент запрашивает, сервер отвечает). Пакет может содержать более одного запроса.

source: Almost all requests and responses contain three sections: size, header, and body. The size is an (MP_UINT) unsigned integer, usually a 32-bit unsigned integer. The header and body are (MP_MAP) maps.
ru: Почти все запросы и ответы состоят из трех частей: размер, заголовок и тело. Размер — это unsigned integer (MP_UINT), обычно 32-битное беззнаковое целое число. Заголовок и тело — это ассоциативные массивы (MP_MAP).

source: ``<size>`` is the size of the header plus the size of the body. It may be useful to compare it with the number of bytes remaining in the packet.
ru: ``<size>`` — это размер заголовка плюс размер тела сообщения. Есть смысл сравнивать его с количеством байтов, оставшихся в пакете.

source: ``<header>`` may contain, in any order:
ru: Заголовок ``<header>`` может содержать такие данные в любом порядке:

source: **IPROTO_REQUEST_TYPE** or Response-Code-Indicator = 0x00. An unsigned number that indicates what will be in the ``<body>``. In requests IPROTO_REQUEST_TYPE will be followed by IPROTO_SELECT etc. In responses Response-Code-Indicator will be followed by IPROTO_OK etc.
ru: **IPROTO_REQUEST_TYPE** или индикатор кода ответа (Response-Code-Indicator) = 0x00. Это беззнаковое число, которое указывает на то, что будет находиться в теле сообщения ``<body>``. В запросах за IPROTO_REQUEST_TYPE будет следовать IPROTO_SELECT и т. д. В ответах за Response-Code-Indicator будет следовать IPROTO_OK и т. д.

source: **IPROTO_SYNC** = 0x01. An unsigned integer that should be incremented so that it is unique in every request. This integer is also returned from :doc:`/reference/reference_lua/box_session/sync`. The IPROTO_SYNC value of a response should be the same as the IPROTO_SYNC value of a request.
ru: **IPROTO_SYNC** = 0x01. Это беззнаковое целое число должно увеличиваться так, чтобы оно было уникальным в каждом запросе. Это целое число также возвращается в результате :doc:`/reference/reference_lua/box_session/sync`. Значение IPROTO_SYNC в ответе должно быть таким же, как значение IPROTO_SYNC в запросе.

source: **IPROTO_SCHEMA_VERSION** = 0x05. An unsigned number, sometimes called SCHEMA_ID, that goes up when there is a major change. In a request header IPROTO_SCHEMA_VERSION is optional, so the version will not be checked if it is absent. In a response header IPROTO_SCHEMA_VERSION is always present, and it is up to the client to check if it has changed.
ru: **IPROTO_SCHEMA_VERSION** = 0x05. Беззнаковое число, иногда называемое SCHEMA_ID, которое увеличивается при значительных изменениях. В заголовке запроса IPROTO_SCHEMA_VERSION указываеть необязательно, поэтому версия не будет проверяться, если она отсутствует. В заголовке ответа IPROTO_SCHEMA_VERSION присутствует всегда, и клиент должен сам проверить, не изменилась ли версия.

source: **IPROTO_STREAM_ID** = 0x0a. An unsigned number that should be unique in every stream. In requests IPROTO_STREAM_ID is optional and is useful for two things: ensuring that requests within transactions are done in separate groups, and ensuring strictly consistent execution of requests (whether or not they are within transactions). In responses IPROTO_STREAM_ID does not appear. See :ref:`Binary protocol -- streams <box_protocol-streams>`.
ru: **IPROTO_STREAM_ID** = 0x0a. Беззнаковое число, которое должно быть уникально для каждого стрима. В запросах указывать значение IPROTO_STREAM_ID необязательно. Однако оно может понадобиться, если необходимо обрабатывать запросы внутри транзакций отдельными группами или выполнять запросы строго последовательно независимо от того, входят ли они в ту или иную транзакцию. В ответах IPROTO_STREAM_ID отсутствует. См. :ref:`Бинарный протокол -- стримы<box_protocol-streams>`.

source: Have a look at file `xrow.c <https://github.com/tarantool/tarantool/blob/master/src/box/xrow.c>`_ function ``xrow_header_encode``, to see how Tarantool encodes the header. Have a look at file net_box.c, function ``netbox_decode_data``, to see how Tarantool decodes the header. For example, in a successful response to ``box.space:select()``, the Response-Code-Indicator value will be 0 = IPROTO_OK and the array will have all the tuples of the result.
ru: Чтобы понять, как Tarantool кодирует заголовок, обратите внимание на функцию ``xrow_header_encode`` в файле `xrow.c <https://github.com/tarantool/tarantool/blob/master/src/box/xrow.c>`_. Чтобы увидеть, как Tarantool декодирует заголовок, посмотрите функцию ``netbox_decode_data`` в файле net_box.c. Например, при успешном ответе на ``box.space:select()`` значение индикатора кода ответа будет 0 = IPROTO_OK, а массив будет содержать все кортежи из результата.

source: The ``<body>`` has the details of the request or response. In a request, it can also be absent or be an empty map. Both these states will be interpreted equally. Responses will contain the ``<body>`` anyway even for an :ref:`IPROTO_PING <box_protocol-ping>` request.
ru: Тело сообщения ``<body>`` содержит детали запроса или ответа. В запросе оно может отсутствовать или представлять собой пустой ассоциативный массив. И то, и другое будет интерпретироваться одинаково. Ответы будут содержать ``<body>`` в любом случае, даже после запроса :ref:`IPROTO_PING <box_protocol-ping>`.

source: Binary protocol -- requests
ru: Бинарный протокол — запросы

source: A request has a size, a :ref:`header <box_protocol-header>` that contains the IPROTO key, and a body as described here.
ru: Запрос содержит размер, :ref:`заголовок <box_protocol-header>`, который содержит ключ IPROTO, и тело сообщения, как описано в этом разделе.

source: See :ref:`space_object:select() <box_space-select>`. The body is a 6-item map.
ru: См. :ref:`space_object:select() <box_space-select>`. Тело сообщения представляет собой ассоциативный массив из 6 элементов.

source: Example: if the id of 'tspace' is 512 and this is the fifth message, |br| :samp:`{conn}.`:code:`space.tspace:select({0},{iterator='GT',offset=1,limit=2})` will cause:
ru: Пример: если ID спейса 'tspace' = 512 и это пятое сообщение, |br| :samp:`{conn}.`:code:`space.tspace:select({0},{iterator='GT',offset=1,limit=2})` вызовет:

source: Later in :ref:`Binary protocol -- illustration <box_protocol-illustration>` we will show actual byte codes of an IPROTO_SELECT message.
ru: Далее, в разделе :ref:`Бинарный протокол — примеры <box_protocol-illustration>`, мы покажем фактические байт-коды сообщения IPROTO_SELECT.

source: See :ref:`space_object:insert() <box_space-insert>`. The body is a 2-item map:
ru: См. :ref:`space_object:insert() <box_space-insert>`. Тело сообщения представляет собой ассоциативный массив из 2 элементов:

source: Example: if the id of 'tspace' is 512 and this is the fifth message, |br| :samp:`{conn}.`:code:`space.tspace:insert{1, 'AAA'}` will cause:
ru: Пример: если ID спейса 'tspace' = 512 и это пятое сообщение, |br| :samp:`{conn}.`:code:`space.tspace:insert{1, 'AAA'}` вызовет:

source: **IPROTO_REPLACE** = 0x03, See :ref:`space_object:replace() <box_space-replace>`. The body is a 2-item map, the same as for IPROTO_INSERT:
ru: **IPROTO_REPLACE** = 0x03, см. :ref:`space_object:replace() <box_space-replace>`. Тело сообщения представляет собой ассоциативный массив из 2 элементов, как для IPROTO_INSERT:

source: See :ref:`space_object:update() <box_space-update>`.
ru: См. :ref:`space_object:update() <box_space-update>`.

source: The body is usually a 4-item map:
ru: Тело сообщения обычно представляет собой ассоциативный массив из 4 элементов:

source: If the operation specifies no values, then IPROTO_TUPLE is a 2-item array: |br| :samp:`[{MP_STR OPERATOR = '#', {MP_INT FIELD_NO = field number starting with 1}]`. Normally field numbers start with 1.
ru: Если в операции не указаны значения, то IPROTO_TUPLE — это массив из 2 элементов: |br| :samp:`[{MP_STR OPERATOR = '#', {MP_INT FIELD_NO = номер поля, начиная с 1}]`. Обычно номера полей начинаются с 1.

source: If the operation specifies one value, then IPROTO_TUPLE is a 3-item array: |br| :samp:`[{MP_STR string OPERATOR = '+' or '-' or '^' or '^' or '|' or '!' or '='}, {MP_INT FIELD_NO}, {MP_OBJECT VALUE}]`. |br|
ru: Если в операции задано одно значение, то IPROTO_TUPLE — это массив из трех элементов: |br| :samp:`[{MP_STR string OPERATOR = '+' or '-' or '^' or '^' or '|' or '!' or '='}, {MP_INT FIELD_NO}, {MP_OBJECT VALUE}]`. |br|

source: Otherwise IPROTO_TUPLE is a 5-item array: |br| :samp:`[{MP_STR string OPERATOR = ':'}, {MP_INT integer FIELD_NO}, {MP_INT POSITION}, {MP_INT OFFSET}, {MP_STR VALUE}]`. |br|
ru: В остальных случаях IPROTO_TUPLE — это массив из 5 элементов: |br| :samp:`[{MP_STR string OPERATOR = ':'}, {MP_INT integer FIELD_NO}, {MP_INT POSITION}, {MP_INT OFFSET}, {MP_STR VALUE}]`. |br|

source: Example: if the id of 'tspace' is 512 and this is the fifth message, |br| :samp:`{conn}.`:code:`space.tspace:update(999, {{'=', 2, 'B'}})` will cause:
ru: Пример: если ID спейса 'tspace' = 512 и это пятое сообщение, br| :samp:`{conn}.`:code:`space.tspace:update(999, {{'=', 2, 'B'}})` вызовет:

source: Later in :ref:`Binary protocol -- illustration <box_protocol-illustration>` we will show actual byte codes of an IPROTO_UPDATE message.
ru: Далее, в разделе :ref:`Бинарный протокол — примеры <box_protocol-illustration>`, мы покажем фактические байт-коды сообщения IPROTO_UPDATE.

source: See :ref:`space_object:delete() <box_space-delete>`. The body is a 3-item map:
ru: См. :ref:`space_object:delete() <box_space-delete>`. Тело сообщения представляет собой ассоциативный массив из 3 элементов:

source: See :ref:`conn:call() <net_box-call>`. The suffix ``_16`` is a hint that this is for the ``call()`` until Tarantool 1.6. It is deprecated. Use :ref:`IPROTO_CALL <box_protocol-call>` instead. The body is a 2-item map:
ru: См. :ref:`conn:call() <net_box-call>`. ``_16`` в конце подсказывает, что константа используется для ``call()`` до версии Tarantool 1.6. Эта константа объявлена устаревшей. Вместо нее используйте :ref:`IPROTO_CALL <box_protocol-call>`. Тело сообщения представляет собой ассоциативный массив из 2 элементов:

source: The return value is an array of tuples.
ru: Возвращается массив кортежей.

source: See :ref:`authentication <authentication-users>`. See the later section :ref:`Binary protocol -- authentication <box_protocol-authentication>`.
ru: См. раздел :ref:`Аутентификация <authentication-users>`. См. раздел :ref:`Бинарный протокол — аутентификация <box_protocol-authentication>` ниже.

source: See :ref:`conn:eval() <net_box-eval>`. Since the argument is a Lua expression, this is Tarantool's way to handle non-binary with the binary protocol. Any request that does not have its own code, for example :samp:`box.space.{space-name}:drop()`, will be handled either with :ref:`IPROTO_CALL <box_protocol-call>` or IPROTO_EVAL. The :ref:`tarantoolctl <tarantoolctl>` administrative utility makes extensive use of ``eval``. The body is a 2-item map:
ru: См. :ref:`conn:eval() <net_box-eval>`. В качестве аргумента выступает выражение на Lua — так Tarantool обрабатывает небинарный код с помощью бинарного протокола. Любой запрос без собственного кода, например :samp:`box.space.{space-name}:drop()`, будет обработан с помощью либо :ref:`IPROTO_CALL <box_protocol-call>`, либо IPROTO_EVAL. Административная утилита :ref:`tarantoolctl <tarantoolctl>` активно использует ``eval``. Тело сообщения представляет собой ассоциативный массив из 2 элементов:

source: Example: if this is the fifth message, :samp:`conn:eval('return 5;')` will cause:
ru: Пример. Если это пятое сообщение, :samp:`conn:eval('return 5;')` приведет к следующему:

source: See :ref:`space_object:upsert() <box_space-upsert>`.
ru: См. :ref:`space_object:upsert() <box_space-upsert>`.

source: The IPROTO_OPS is the same as the IPROTO_TUPLE of :ref:`IPROTO_UPDATE <box_protocol-update>`.
ru: IPROTO_OPS — это то же самое, что и IPROTO_TUPLE в :ref:`IPROTO_UPDATE <box_protocol-update>`.

source: See :ref:`conn:call() <net_box-call>`. The body is a 2-item map:
ru: См. :ref:`conn:call() <net_box-call>`. Тело сообщения представляет собой ассоциативный массив из 2 элементов:

source: The response will be a list of values, similar to the :ref:`IPROTO_EVAL <box_protocol-eval>` response.
ru: Вернется список значений, наподобие ответа :ref:`IPROTO_EVAL <box_protocol-eval>`.

source: See :ref:`box.execute() <box-sql_box_execute>`, this is only for SQL. The body is a 3-item map:
ru: См. :ref:`box.execute() <box-sql_box_execute>`, используется только для SQL. Тело сообщения представляет собой ассоциативный массив из 3 элементов:

source: # <size> msgpack(:samp:`{{MP_UINT unsigned integer = size(<header>) + size(<body>)}}`) # <header> msgpack({ IPROTO_REQUEST_TYPE: IPROTO_EXECUTE, IPROTO_SYNC: :samp:`{{MP_UINT unsigned integer}}` }) # <body> msgpack({ IPROTO_STMT_ID: :samp:`{{MP_INT integer}}` or IPROTO_SQL_TEXT: :samp:`{{MP_STR string}}`, IPROTO_SQL_BIND: :samp:`{{MP_INT integer}}`, IPROTO_OPTIONS: :samp:`{{MP_ARRAY array}}` })
ru: # <size> msgpack(:samp:`{{MP_UINT unsigned integer = size(<header>) + size(<body>)}}`) # <header> msgpack({ IPROTO_REQUEST_TYPE: IPROTO_EXECUTE, IPROTO_SYNC: :samp:`{{MP_UINT unsigned integer}}` }) # <body> msgpack({ IPROTO_STMT_ID: :samp:`{{MP_INT integer}}` или IPROTO_SQL_TEXT: :samp:`{{MP_STR string}}`, IPROTO_SQL_BIND: :samp:`{{MP_INT integer}}`, IPROTO_OPTIONS: :samp:`{{MP_ARRAY array}}` })
