Repository: tarantool/doc
Catalog: locale/*/LC_MESSAGES/dev_guide/internals/msgpack_extensions.po
Languages: ru

source: MessagePack extensions
ru: Дополнительные типы MessagePack

source: Tarantool uses predefined MessagePack extension types to represent some of the special values. Extension types include ``MP_DECIMAL``, ``MP_UUID``, ``MP_ERROR``, ``MP_DATETIME``, and ``MP_INTERVAL``. These types require special attention from the connector developers, as they must be treated separately from the default MessagePack types, and correctly mapped to programming language types.
ru: Tarantool использует предопределенные дополнительные типы MessagePack для представления некоторых специальных значений. Дополнительные типы включают ``MP_DECIMAL``, ``MP_UUID``,``MP_ERROR``, ``MP_DATETIME``, and ``MP_INTERVAL``. Эти типы требуют особого внимания со стороны разработчиков коннекторов, так как должны рассматриваться отдельно от типов MessagePack по умолчанию и корректно приводиться к типам языков программирования.

source: The DECIMAL type
ru: Тип DECIMAL

source: The MessagePack EXT type ``MP_EXT`` together with the extension type ``MP_DECIMAL`` is a header for values of the DECIMAL type.
ru: Тип MessagePack EXT ``MP_EXT`` вместе с типом расширения ``MP_DECIMAL`` является заголовком для значений типа DECIMAL.

source: ``MP_DECIMAL`` type is 1.
ru: MP_DECIMAL -- это 1.

source: `MessagePack spec <https://github.com/msgpack/msgpack/blob/master/spec.md>`_ defines two kinds of types:
ru: `Спецификация MessagePack <https://github.com/msgpack/msgpack/blob/master/spec.md>`_ определяет два вида типов:

source: ``fixext 1/2/4/8/16`` types have fixed length so the length is not encoded explicitly.
ru: типы ``fixext 1/2/4/8/16`` имеют фиксированную длину, поэтому длина не кодируется явно;

source: ``ext 8/16/32`` types require the data length to be encoded.
ru: типы ``ext 8/16/32`` требуют кодирования длины данных.

source: ``MP_EXP`` + optional ``length`` imply using one of these types.
ru: ``MP_EXP`` + (не обязательно) ``length`` подразумевает использование одного из этих типов.

source: The decimal MessagePack representation looks like this:
ru: Десятичное представление MessagePack выглядит следующим образом:

source: Here ``length`` is the length of ``PackedDecimal`` field, and it is of type ``MP_UINT``, when encoded explicitly (i.e. when the type is ``ext 8/16/32``).
ru: Здесь ``length`` -- это длина поля ``PackedDecimal``, и оно имеет тип ``MP_UINT``, когда кодируется явно (т.е. когда тип -- ``ext 8/16/32``).

source: ``PackedDecimal`` has the following structure:
ru: ``PackedDecimal`` имеет следующую структуру:

source: <--- length bytes --> +-------+=============+ | scale | BCD | +-------+=============+
ru: <--- длина в байтах --> +-------+=============+ | scale | BCD | +-------+=============+

source: Here ``scale`` is either ``MP_INT`` or ``MP_UINT``. |br| ``scale`` = number of digits after the decimal point
ru: Здесь ``scale`` -- это либо ``MP_INT``, либо ``MP_UINT``. |br| ``scale`` = количество цифр после запятой.

source: ``BCD`` is a sequence of bytes representing decimal digits of the encoded number (each byte has two decimal digits each encoded using 4-bit ``nibbles``), so ``byte >> 4`` is the first digit and ``byte & 0x0f`` is the second digit. The leftmost digit in the array is the most significant. The rightmost digit in the array is the least significant.
ru: ``BCD`` - это последовательность байтов, обозначающая десятичные цифры кодируемого числа (каждый байт имеет две десятичные цифры, каждая из которых кодируется с использованием 4-битных ``nibbles``), поэтому ``byte >> 4`` - первая цифра, а ``byte & 0x0f`` - вторая цифра. Самая левая цифра в массиве - самая значимая. Самая правая цифра в массиве - наименее значимая.

source: The first byte of the ``BCD`` array contains the first digit of the number, represented as follows:
ru: Первый байт ``BCD``-массива содержит первую цифру числа, представленную следующим образом:

source: (The first ``nibble`` contains 0 if the decimal number has an even number of digits.) The last byte of the ``BCD`` array contains the last digit of the number and the final ``nibble``, represented as follows:
ru: (Первый ``nibble`` содержит 0, если десятичное число имеет четное число цифр). Последний байт BCD-массива содержит последнюю цифру числа и последний ``nibble``, представленный следующим образом:

source: The final ``nibble`` represents the number's sign:
ru: Последний ``nibble`` обозначает знак числа:

source: ``0x0a``, ``0x0c``, ``0x0e``, ``0x0f`` stand for plus,
ru: ``0x0a``, ``0x0c``, ``0x0e``, ``0x0f`` обозначают плюс,

source: ``0x0b`` and ``0x0d`` stand for minus.
ru: ``0x0b`` and ``0x0d`` обозначают минус.

source: **Examples**
ru: **Примеры**

source: The decimal ``-12.34`` will be encoded as ``0xd6,0x01,0x02,0x01,0x23,0x4d``:
ru: Десятичное число ``-12.34`` будет закодировано как ``0xd6,0x01,0x02,0x01,0x23,0x4d``:

source: The decimal 0.000000000000000000000000000000000010 will be encoded as ``0xc7,0x03,0x01,0x24,0x01,0x0c``:
ru: Десятичное число 0.000000000000000000000000000000000010 будет закодировано как ``0xc7,0x03,0x01,0x24,0x01,0x0c``:

source: The UUID type
ru: Тип UUID

source: ``MP_UUID`` type is 2.
ru: MP_UUID -- это 2.

source: The `MessagePack spec <https://github.com/msgpack/msgpack/blob/master/spec.md>`_ defines ``d8`` to mean ``fixext`` with size 16, and a UUID's size is always 16. So the UUID MessagePack representation looks like this:
ru: `Спецификация MessagePack <https://github.com/msgpack/msgpack/blob/master/spec.md>`_ определяет ``d8`` как ``fixext`` с размером 16, а размер ``UUID`` всегда равен 16. Таким образом, представление ``UUID`` в MessagePack выглядит следующим образом:

source: The 16-byte value has 2 digits per byte. Typically, it consists of 11 fields, which are encoded as big-endian unsigned integers in the following order:
ru: 16-байтовое значение имеет 2 цифры на байт. Обычно оно состоит из 11 полей, которые кодируются от большего к меньшему беззнаковыми целыми числами в следующем порядке:

source: time_low (4 bytes)
ru: time_low (4 байта)

source: time_mid (2 bytes)
ru: time_mid (2 байта)

source: time_hi_and_version (2 bytes)
ru: time_hi_and_version (2 байта)

source: clock_seq_hi_and_reserved (1 byte)
ru: clock_seq_hi_and_reserved (1 байт)

source: clock_seq_low (1 byte)
ru: clock_seq_low (1 байт)

source: node[0], ..., node[5] (1 byte each)
ru: node[0], ..., node[5] (по 1 байту)

source: Some of the functions in :ref:`Module uuid <uuid-module>` can produce values which are compatible with the UUID data type. For example, after
ru: Некоторые функции в :ref:`модуле UUID <uuid-module>` могут выдавать значения, совместимые с типом данных UUID. Например, после

source: a peek at the server response packet will show that it contains
ru: пакет ответа сервера покажет, что он содержит

source: The ERROR type
ru: Тип ERROR

source: Since version :doc:`2.4.1 </release/2.4.1>`, responses for errors have extra information following what was described in :ref:`Box protocol -- responses for errors <box_protocol-responses_error>`. This is a "compatible" enhancement, because clients that expect old-style server responses should ignore map components that they do not recognize. Notice, however, that there has been a renaming of a constant: formerly ``IPROTO_ERROR`` in :file:`./box/iproto_constants.h` was ``0x31``, now ``IPROTO_ERROR`` is ``0x52`` and ``IPROTO_ERROR_24`` is ``0x31``.
ru: Начиная с версии :doc:`2.4.1 </release/2.4.1>`, в ответах на ошибки содержится дополнительная информация, соответствующая описанию в разделе :ref:`Бинарный протокол — ответы на ошибки <box_protocol-responses_error>`. Это "совместимое" улучшение, потому что клиенты, которые ожидают ответы сервера старого образца, должны игнорировать компоненты ассоциативного массива, которые они не распознают. Обратите внимание, что константа ``IPROTO_ERROR`` в :file:`./box/iproto_constants.h` была ``0x31``, а теперь ``IPROTO_ERROR`` -- ``0x52``, а ``IPROTO_ERROR_24`` -- ``0x31``.

source: ``MP_ERROR`` type is 3.
ru: MP_ERROR -- это 3.

source: ++=========================+============================+ || | | || 0x31: IPROTO_ERROR_24 | 0x52: IPROTO_ERROR | || MP_INT: MP_STRING | MP_MAP: extra information | || | | ++=========================+============================+ MP_MAP
ru: ++=========================+============================+ || | | || 0x31: IPROTO_ERROR_24 | 0x52: IPROTO_ERROR | || MP_INT: MP_STRING | MP_MAP: дополнительная информация | || | | ++=========================+============================+ MP_MAP

source: The extra information, most of which is also in :doc:`error object </reference/reference_lua/box_error/new>` fields, is:
ru: Дополнительная информация, большая часть которой также хранится в полях :doc:`объекта ошибки </reference/reference_lua/box_error/new>`:

source: ``MP_ERROR_TYPE`` (0x00) (MP_STR) Type that implies source, as in :samp:`{error_object}.base_type`, for example "ClientError".
ru: ``MP_ERROR_TYPE`` (0x00) (MP_STR) Тип, подразумевающий источник, как в :samp:`{error_object}.base_type`, например "ClientError".

source: ``MP_ERROR_FILE`` (0x01) (MP_STR) Source code file where error was caught, as in :samp:`{error_object}.trace`.
ru: ``MP_ERROR_FILE`` (0x01) (MP_STR) Файл с исходным кодом, в котором была перехвачена ошибка, как в :samp:`{error_object}.trace`.

source: ``MP_ERROR_LINE`` (0x02) (MP_UINT) Line number in source code file, as in :samp:`{error_object}.trace`.
ru: ``MP_ERROR_LINE`` (0x02) (MP_UINT) Номер строки в файле исходных кодов, как в :samp:`{error_object}.trace`.

source: ``MP_ERROR_MESSAGE`` (0x03) (MP_STR) Text of reason, as in :samp:`{error_object}.message`. The value here will be the same as in the ``IPROTO_ERROR_24`` value.
ru: ``MP_ERROR_MESSAGE`` (0x03) (MP_STR) Текст причины, как в :samp:`{error_object}.message`. Значение здесь будет таким же, как и значение ``IPROTO_ERROR_24``

source: ``MP_ERROR_ERRNO`` (0x04) (MP_UINT) Ordinal number of the error, as in :samp:`{error_object}.errno`. Not to be confused with ``MP_ERROR_ERRCODE``.
ru: ``MP_ERROR_ERRNO`` (0x04) (MP_UINT) Порядковый номер ошибки, как в :samp:`{error_object}.errno`. Не путать с ``MP_ERROR_ERRCODE``.

source: ``MP_ERROR_ERRCODE`` (0x05) (MP_UINT) Number of the error as defined in errcode.h, as in :samp:`{error_object}.code`, which can also be retrieved with the C function :ref:`box_error_code() <capi-box_error_code_code>`. The value here will be the same as the lower part of the Response-Code-Indicator value.
ru: ``MP_ERROR_ERRCODE`` (0x05) (MP_UINT) Номер ошибки, как в файле errcode.h, как в :samp:`{error_object}.code`, который также можно получить функцией C :ref:`box_error_code() <capi-box_error_code_code>`. Значение здесь будет таким же, как и в нижней части значения Response-Code-Indicator.

source: ``MP_ERROR_FIELDS`` (0x06) (MP_MAPs) Additional fields depending on error type. For example, if ``MP_ERROR_TYPE`` is "AccessDeniedError", then ``MP_ERROR_FIELDS`` will include "object_type", "object_name", "access_type". This field will be omitted from the response body if there are no additional fields available.
ru: ``MP_ERROR_FIELDS`` (0x06) (MP_MAPs) Дополнительные поля в зависимости от типа ошибки. Например, если ``MP_ERROR_TYPE`` имеет значение "AccessDeniedError", то ``MP_ERROR_FIELDS`` будет включать "object_type", "object_name", "access_type". При отсутствии дополнительных полей это поле будет пропущено в теле ответа.

source: Client and connector programmers should ensure that unknown map keys are ignored, and should check for addition of new keys in the Tarantool source code file where error object creation is defined. In version 2.4.1 the name of this source code file is mp_error.cc.
ru: Разработчики клиента и коннекторов должны убедиться, что неизвестные ключи ассоциативных массивов игнорируются, а также проверить наличие новых ключей в файле исходного кода Tarantool, в котором определено создание объекта ошибки. В версии 2.4.1 имя этого файла с исходным кодом mp_error.cc.

source: For example, in version 2.4.1 or later, if we try to create a duplicate space with |br| ``conn:eval([[box.schema.space.create('_space');]])`` |br| the server response will look like this:
ru: Например, в версии 2.4.1 или более поздней, если мы попытаемся создать дубликат пробела с помощью команды |br| ``conn:eval([[box.schema.space.create('_space');]))``, |br| ответ сервера будет выглядеть так:
