Repository: tarantool/doc
Catalog: locale/*/LC_MESSAGES/release/2.8.1.po
Languages: ru

source: Released on 2021-04-21.
ru: Дата выхода: 2021-04-21.

source: Release :tarantool-release:`2.8.1`.
ru: Версия: :tarantool-release:`2.8.1`.

source: Tagged ``2.8.1-0-ge2a1ec0``.
ru: Тег версии: ``2.8.1-0-ge2a1ec0``.

source: Overview
ru: Общие сведения

source: 2.8.1 is the :doc:`beta </release/policy>` version of the 2.8 release series.
ru: 2.8.1 — :doc:`бета-версия </release/policy>`, входящая в серию 2.8.

source: This release introduces 28 new features and resolves 31 bugs since version :doc:`2.7.2 </release/2.7.2>`. There can be bugs in less common areas. If you find any, feel free to `report an issue <https://github.com/tarantool/tarantool/issues>`__ on GitHub.
ru: Эта версия содержит 28 новых функций и 31 исправление по сравнению с версией :doc:`2.7.2 </release/2.7.2>`. Возможны ошибки в менее распространенных функциях. Если вы обнаружили проблему, `сообщите о ней <https://github.com/tarantool/tarantool/issues>`__ на GitHub.

source: Notable changes are:
ru: Важные изменения:

source: Tarantool is now able to set multiple iproto threads.
ru: Теперь в Tarantool можно задавать несколько потоков (threads) IPROTO.

source: The new ``box.ctl.promote()`` function and the concept of manual elections.
ru: Введена новая функция ``box.ctl.promote()`` и механизм ручных выборов лидера.

source: Enhancements in the Lua memory profiler.
ru: Улучшен профилировщик памяти Lua.

source: Compatibility
ru: Совместимость

source: Tarantool 2.x is backward compatible with Tarantool 1.10.x in the binary data layout, client-server protocol, and replication protocol.
ru: Любая версия Tarantool 2.x обратно совместима с версиями Tarantool 1.10.x. Это касается структур двоичных данных, клиент-серверного протокола и протокола репликации.

source: Please `upgrade <https://www.tarantool.io/en/doc/latest/book/admin/upgrades/>`__ using the ``box.schema.upgrade()`` procedure to unlock all the new features of the 2.x series.
ru: Чтобы получить доступ ко всем новым функциям серии 2.x, `обновите Tarantool <https://www.tarantool.io/en/doc/latest/book/admin/upgrades/>`__ с помощью ``box.schema.upgrade()``.

source: Functionality added or changed
ru: Обновления функциональности

source: Core
ru: Основные функции (Core)

source: The ``exclude_null`` option can now be used in the index part definition. With this option, the index filters and doesn't store tuples with "null" value of the corresponding part (:tarantool-issue:`4480`).
ru: При определении индексируемых полей теперь можно использовать параметр ``exclude_null``. Тогда в индексе не будут сохраняться кортежи, соответствующее поле которых имеет значение ``null`` (:tarantool-issue:`4480`).

source: For example, an index created with ``s:create_index('sk', {parts={{2, 'number', exclude_null=true}}})`` will ignore tuples ``{1, null}`` and ``{2, null}``, but will not ignore ``{null, 1}`` or ``{1, 1}``.
ru: Например, в индекс, созданный методом ``s:create_index('sk', {parts={{2, 'number', exclude_null=true}}})``, не войдут кортежи ``{1, null}`` и ``{2, null}``, но могут войти кортежи ``{null, 1}`` и ``{1, 1}``.

source: Added a ``slab_alloc_granularity`` option to ``box.cfg{}``. This option allows user to set multiplicity of memory allocation in a small allocator. The value of ``slab_alloc_granularity`` must be exponent of two and >= 4 (:tarantool-issue:`5518`).
ru: В ``box.cfg{}`` добавлен параметр ``slab_alloc_granularity``, позволяющий настроить гранулярность выделения памяти для аллокатора `small <https://github.com/tarantool/small>`_. Значение ``slab_alloc_granularity`` должно быть степенью двойки, но не менее 4 (:tarantool-issue:`5518`).

source: Previously, Lua `on_shutdown` triggers started sequentially. Now each trigger starts in a separate fiber. By default, Tarantool waits for the triggers to finish for 3.0 seconds. User has the option to change this value using the new ``box.ctl.set_on_shutdown_timeout`` function.
ru: В предыдущих версиях триггеры Lua `on_shutdown` запускались последовательно. Теперь каждый триггер запускается в отдельном файбере. По умолчанию Tarantool в течение 3 секунд ожидает, когда завершится обработка триггеров. Пользователь может изменить этот временной промежуток с помощью новой функции ``box.ctl.set_on_shutdown_timeout``.

source: When the timeout expires, Tarantool stops immediately without waiting for the other triggers to finish.
ru: Когда время истечёт, Tarantool немедленно завершит работу, не дожидаясь окончания обработки оставшихся триггеров.

source: Tarantool module developers can now register functions to call when Tarantool stops with the new ``on_shutdown`` API, (:tarantool-issue:`5723`). Read more: :doc:`/dev_guide/reference_capi/on_shutdown`.
ru: С помощью нового API ``on_shutdown`` (:tarantool-issue:`5723`) разработчики модулей Tarantool могут указывать функции, которые будут вызываться при остановке Tarantool. Подробнее: :doc:`/dev_guide/reference_capi/on_shutdown`.

source: Introduced the concept of WAL queue and the new configuration option ``wal_queue_max_size``, measured in bytes. The default value is 16 Mb. The option helps limit the pace at which replica submits new transactions to the WAL. The limit is checked every time a transaction from the master is submitted to the replica’s WAL. The space taken by the transaction is considered empty once it’s successfully written (:tarantool-issue:`5536`).
ru: Введена очередь журнала упреждающей записи (WAL). Размер очереди в байтах определяется новым параметром конфигурации ``wal_queue_max_size``. Его значение по умолчанию — 16 МБ. Параметр позволяет ограничить объем транзакций, которые реплика заносит в WAL. Проверка ограничения происходит каждый раз, когда транзакция с мастера заносится в WAL на реплике. Как только транзакция будет успешно записана, ее место в очереди освободится (:tarantool-issue:`5536`).

source: The information about the state of synchronous replication is now available via the ``box.info.synchro`` interface (:tarantool-issue:`5191`).
ru: Информацию о состоянии синхронной репликации теперь можно получить через интерфейс ``box.info.synchro`` (:tarantool-issue:`5191`).

source: Tarantool can now :ref:`run multiple iproto threads <cfg_networking-iproto_threads>`. It is useful in some specific workloads where iproto thread is the bottleneck of throughput (:tarantool-issue:`5645`).
ru: Теперь Tarantool позволяет :ref:`запускать несколько потоков (threads) IPROTO <cfg_networking-iproto_threads>`. Это полезно в ситуациях, когда единственный поток IPROTO становится узким местом производительности (:tarantool-issue:`5645`).

source: Update operations can’t insert with gaps. This patch changes the behavior so that the update operation fills the missing fields with nulls (:tarantool-issue:`3378`).
ru: При операции обновления кортежей (update) пропуск полей не поддерживается. Пропущенные поля теперь заменяются нулевыми значениями (:tarantool-issue:`3378`).

source: The new ``box.lib`` module allows loading and executing C stored procedures on read-only nodes (:tarantool-issue:`4642`).
ru: Новый модуль ``box.lib`` позволяет загружать и выполнять хранимые процедуры на языке C на узлах, доступных только для чтения (:tarantool-issue:`4642`).

source: The priority of sources of configuration options is the following, from higher to lower:
ru: Применяются параметры конфигурации из следующих источников в порядке приоритета:

source: environment variables,
ru: переменные окружения;

source: ``tarantoolctl`` options,
ru: параметры ``tarantoolctl``;

source: default values,
ru: значения по умолчанию.

source: Replication
ru: Репликация

source: Introduced the ``box.ctl.promote()`` function and the concept of manual elections (enabled with ``election_mode='manual'``) (:tarantool-issue:`3055`).
ru: Добавлена функция ``box.ctl.promote()``, введены ручные выборы лидера. Чтобы их включить, укажите параметр ``election_mode='manual'`` (:tarantool-issue:`3055`).

source: Once the instance is in the ``manual`` election mode, it acts like a ``voter`` most of the time, but may trigger elections and become a leader when ``box.ctl.promote()`` is called. When ``election_mode ~= 'manual'``, ``box.ctl.promote()`` replaces ``box.ctl.clear_synchro_queue()``, which is now deprecated.
ru: Экземпляр, находящийся в ручном (``manual``) режиме выборов, большую часть времени имеет роль ``voter``, но при вызове ``box.ctl.promote()`` может начать выборы и стать лидером. Если ``election_mode ~= 'manual'``, метод ``box.ctl.promote()`` делает то же, что устаревший метод ``box.ctl.clear_synchro_queue()``.

source: The output of LuaJIT memory profiler parser has become more user-friendly (:tarantool-issue:`5811`). Now the source line definition where the event occurs is much clearer: it only shows the source file name and allocation-related line, and omits the line number of the function definition. Moreover, event-related statistics are now indicated with units.
ru: Отчет профилировщика памяти LuaJIT стал удобнее для чтения (:tarantool-issue:`5811`). Теперь проще понять, в какой строке кода происходит событие. Пользователь видит имя исходного файла и строку, где выделяется память, а также количество событий и статистику памяти в байтах. Номер строки с определением функции не отображается.

source: **Breaking change**: Line info of the line function definition is now saved in symbol info table by field ``linedefined``. The field ``name`` has been renamed to ``source`` with respect to the Lua Debug API.
ru: **Критическое изменение**: информация о строке, в которой определяется функция, теперь сохраняется в поле ``linedefined`` таблицы символов. Поле ``name`` теперь называется ``source`` в соответствии с Lua API для отладки.

source: A number of improvements in the memory profiler parser:
ru: Ряд изменений в парсере профилировщика памяти:

source: The parser now reports heap difference which occurs during the measurement interval (:tarantool-issue:`5812`).
ru: Теперь отчет парсера включает информацию об изменениях в состоянии динамической памяти, возникших за период работы профилировщика (:tarantool-issue:`5812`).

source: Use the option ``--leak-only`` to show only the heap difference.
ru: Чтобы посмотреть только эти изменения, используйте параметр ``--leak-only``.

source: New built-in module ``memprof.process`` performs post-processing and aggregation of memory events.
ru: Новый встроенный модуль ``memprof.process`` производит постобработку и агрегацию событий, связанных с выделением памяти.

source: Run the memory profiler with the following command:
ru: Чтобы запустить профилировщик памяти, используйте следующую команду:

source: Tools
ru: Инструменты

source: New tooling for collecting crash artefacts and postmortem analysis (:tarantool-issue:`5569`).
ru: Реализованы новые инструменты для анализа инцидентов и сбора соответствующих артефактов (:tarantool-issue:`5569`).

source: Build
ru: Сборка

source: Tarantool build infrastructure now requires CMake version 3.2 or later.
ru: Инфраструктура сборки Tarantool теперь требует использования CMake версии 3.2 или более поздней.

source: Binary packages for Fedora 33 are now available (:tarantool-issue:`5502`).
ru: Доступны бинарные пакеты для Fedora 33 (:tarantool-issue:`5502`).

source: Binary packages for CentOS 6 and Debian Jessie won't be published since this version.
ru: Начиная с этой версии, бинарные пакеты для CentOS 6 и Debian Jessie не публикуются.

source: RPM and DEB packages no longer have the ``autotools`` dependency (follows up :tarantool-issue:`4968`).
ru: Среди зависимостей для RPM- и DEB-пакетов больше нет ``autotools`` (следствие :tarantool-issue:`4968`).

source: Regular testing on MacOS 10.13 has been disabled, effectively stopping the support of this version.
ru: Регулярное тестирование на MacOs 10.13 больше не проводится. Поддержка Tarantool для этой версии MacOS прекращена.

source: The built-in ``zstd`` is upgraded from v1.3.3 to v1.4.8 (part of :tarantool-issue:`5502`).
ru: Встроенный модуль ``zstd`` обновлён с версии 1.3.3 до версии 1.4.8 (в рамках :tarantool-issue:`5502`).

source: SMTP and SMTPS protocols are now enabled in the bundled ``libcurl`` (:tarantool-issue:`4559`).
ru: Библиотека ``libcurl``, входящая в сборку, теперь поддерживает протоколы SMTP и SMTPS (:tarantool-issue:`4559`).

source: The ``libcurl`` headers are now shipped to system path ``${PREFIX}/include/tarantool`` when ``libcurl`` is included as a bundled library or in a static build (:tarantool-issue:`4559`).
ru: Файлы заголовков библиотеки ``libcurl``, входящей в сборку, устанавливаются в системный каталог ``${PREFIX}/include/tarantool`` (:tarantool-issue:`4559`).

source: Testing
ru: Тестирование

source: Tarantool CI/CD has migrated to GitHub Actions (:tarantool-issue:`5662`).
ru: CI/CD Tarantool теперь проводится посредством GitHub Actions (:tarantool-issue:`5662`).

source: Single node Jepsen testing now runs on per-push basis (:tarantool-issue:`5736`).
ru: Тестирование с помощью Jepsen на отдельных узлах теперь происходит каждый раз, когда выполняется push новых тегов, а также по cron каждые 3 часа (:tarantool-issue:`5736`).

source: Fuzzing tests now continuously run on per-push basis (:tarantool-issue:`1809`).
ru: Фаззинг-тесты запускаются каждый раз, когда выполняется push (:tarantool-issue:`1809`).

source: A self-sufficient LuaJIT testing environment has been implemented. As a result, LuaJIT build system is now partially ported to CMake and all testing machinery is enclosed within the `tarantool/luajit <https://github.com/tarantool/luajit/>`__ repository (:tarantool-issue:`4862`, :tarantool-issue:`5470`).
ru: Реализовано независимое окружение для тестирования LuaJIT. Система сборки LuaJIT частично портирована на CMake. Инструменты для тестирования теперь находятся в репозитории `tarantool/luajit <https://github.com/tarantool/luajit/>`__ (:tarantool-issue:`4862`, :tarantool-issue:`5470`).

source: Python 3 is now the default in the test infrastructure (:tarantool-issue:`5652`).
ru: Теперь в инфраструктуре тестирования по умолчанию установлен Python 3 (:tarantool-issue:`5652`).

source: Bugs fixed
ru: Исправленные ошибки

source: The index part options are no longer skipped when the field type is not specified (:tarantool-issue:`5674`).
ru: Параметры индексируемых полей больше не пропускаются в случаях, когда тип поля не определён (:tarantool-issue:`5674`).

source: The ``lbox_ctl_is_recovery_finished()`` function no longer returns ``true`` when recovery is still in progress.
ru: Функция ``lbox_ctl_is_recovery_finished()`` больше не возвращает значение ``true`` в случае, если процесс восстановления ещё не завершён.

source: A memory corruption bug has been fixed in netbox. The memory of a struct error which is still used will no longer be freed prematurely because of the wrong order of ``ffi.gc`` and ``ffi.cast`` calls.
ru: Устранена ошибка повреждения памяти в модуле ``net.box``. До этого исправления область памяти, занятая структурой ``error``, освобождалась преждевременно, поскольку методы ``ffi.gc`` и ``ffi.cast`` вызывались не в том порядке.

source: Relay can no longer time out while a replica is joining or syncing with the master. (:tarantool-issue:`5762`).
ru: При передаче данных на реплику, которая присоединяется к кластеру или синхронизируется с мастером, больше не может истечь время ожидания (:tarantool-issue:`5762`).

source: An issue with missing "path" value of index schema fetched by netbox has been fixed (:tarantool-issue:`5451`).
ru: Устранена проблема, из-за которой модуль ``net.box`` получал схему индекса, в которой не содержится значение ``path`` (:tarantool-issue:`5451`).

source: Extensive usage of ``uri`` and ``uuid`` modules with debug log level no longer leads to crashes or corrupted results of the functions from these modules. Same problem is resolved for using these modules from the callbacks passed to ``ffi.gc()``, and for some functions from the modules ``fio``, ``box.tuple``, and ``iconv`` (:tarantool-issue:`5632`).
ru: Раньше интенсивное использование модулей ``uri`` и ``uuid`` при уровне логирования DEBUG приводило к сбоям, а результаты выполнения функций, входящих в эти модули, могли быть повреждены. Теперь эта проблема решена. Та же проблема устранена для случаев, когда модули ``uri`` и ``uuid`` используются в callback-функциях, передаваемых в метод ``ffi.gc()``, а также для некоторых функций, входящих в модули ``fio``, ``box.tuple`` и ``iconv`` (:tarantool-issue:`5632`).

source: The new ``wal_cleanup_delay`` option can prevent early cleanup of ``*.xlog`` files, needed by replicas. Such cleanup used to result in a ``XlogGapError`` (:tarantool-issue:`5806`).
ru: Новый параметр ``wal_cleanup_delay`` предотвращает преждевременное удаление файлов ``*.xlog``, необходимых репликам. Ранее при удалении возникала ошибка ``XlogGapError`` (:tarantool-issue:`5806`).

source: Appliers will no longer cause errors with ``Unknown request type 40`` during a final join when the master has synchronous spaces (:tarantool-issue:`5566`).
ru: Когда на мастере есть синхронные спейсы, во время стадии join на реплике больше не возникают ошибки ``Unknown request type 40`` (:tarantool-issue:`5566`).

source: Fixed a crash which occurred when reloading a compiled module when the new module lacked some of the functions which were present in the former code. This event triggered a fallback procedure where Tarantool restored old functions, but instead of restoring each function it only processed a sole entry, leading to a crash later when these restored functions were called (:tarantool-issue:`5968`).
ru: Исправлена ошибка при перезагрузке скомпилированного модуля, возникавшая, если обновлённый модуль не содержал части функций, которые были в прежнем коде. Раньше событие запускало процедуру восстановления удалённых функций. Однако вместо того, чтобы восстанавливать каждую функцию по отдельности, Tarantool ошибочно обрабатывал единственную запись, что приводило к сбою при вызове любой из этих функций (:tarantool-issue:`5968`).

source: Added memtx MVCC tracking of read gaps which fixes the problem of phantom reads (:tarantool-issue:`5628`).
ru: Решена проблема фантомных чтений: теперь механизм MVCC движка memtx отслеживает интервалы чтения (:tarantool-issue:`5628`).

source: Fixed the wrong result of using ``space:count()`` with memtx MVCC (:tarantool-issue:`5972`).
ru: Функция ``space:count()``, используемая с механизмом MVCC движка memtx, больше не выдаёт ошибочный результат (:tarantool-issue:`5972`).

source: Fixed the dirty read after restart while using MVCC with synchronous replication (:tarantool-issue:`5973`).
ru: Исправлена проблема "грязного чтения" после перезапуска, возникающая при использовании механизма MVCC и синхронной репликации (:tarantool-issue:`5973`).

source: Fixed an issue with an applier hanging on a replica after failing to process a ``CONFIRM`` or ``ROLLBACK`` message coming from a master.
ru: Устранена проблема, из-за которой applier не обрабатывал сообщения ``CONFIRM`` или ``ROLLBACK`` от мастера и не давал ответа реплике.

source: Fixed the issue where master did not send some rows to an anonymous replica which had fallen behind and was trying to register.
ru: Устранена проблема, из-за которой некоторые кортежи не отправлялись с мастера на анонимную реплику, отставшую от него и пытающуюся зарегистрироваться в кластере.

source: Fixed the bug when a synchronous transaction could be confirmed and visible on a replica, but then not confirmed or invisible again after restart. It was more likely to happen on memtx spaces with ``memtx_use_mvcc_engine`` enabled (:tarantool-issue:`5213`).
ru: Исправлена ошибка, из-за которой синхронная транзакция подтверждалась и отображалась на реплике, а после перезагрузки исчезала вновь. Чаще всего это происходило в спейсах memtx при включённом механизме ``memtx_use_mvcc_engine`` (:tarantool-issue:`5213`).

source: Fixed the recovery of a rolled back multi-statement synchronous transaction which could lead to the transaction being applied partially, and to recovery errors. It happened in case the transaction worked with non-sync spaces (:tarantool-issue:`5874`).
ru: Устранены проблемы с восстановлением отмененной синхронной транзакции, состоящей из нескольких инструкций. Если такая транзакция относилась к асинхронным спейсам, она могла быть частично применена или восстановлена с ошибками (:tarantool-issue:`5874`).

source: Fixed a bug in synchronous replication when rolled back transactions could reappear after reconnecting a sufficiently old instance (:tarantool-issue:`5445`).
ru: Исправлена ошибка синхронной репликации, из-за которой при подключении достаточно старого экземпляра отменённые транзакции могли быть применены вновь (:tarantool-issue:`5445`).

source: Swim
ru: Модуль swim

source: Fixed an issue where ``<swim_instance>:broadcast()`` did not work on non-local addresses and spammed "Permission denied" errors to the log. After instance termination it could return a non-0 exit code even if there were no errors in the script, and then spam the same error again (:tarantool-issue:`5864`).
ru: Исправлена ошибка, из-за которой метод ``<swim_instance>:broadcast()`` не работал на нелокальных адресах и постоянно заносил в журнал сообщения об ошибке "Permission denied". Если работа экземпляра прекращалась, метод мог вернуть ненулевой код завершения даже при отсутствии ошибок в скрипте, а затем снова начать массово логировать сообщения о той же ошибке (:tarantool-issue:`5864`).

source: Fixed the crash on attempts to call ``swim:member_by_uuid()`` with no arguments or with ``nil``/``box.NULL`` (:tarantool-issue:`5951`).
ru: Устранён сбой, возникавший при вызове ``swim:member_by_uuid()`` с аргументом ``nil``/``box.NULL`` или без аргументов (:tarantool-issue:`5951`).

source: Fixed the crash on attempts to pass an object of a wrong type to ``__serialize`` method of a swim member in Lua (:tarantool-issue:`5952`).
ru: Устранён сбой, возникавший при попытке передать объект неподходящего типа в метод ``__serialize`` реплики-участника swim в Lua (:tarantool-issue:`5952`).

source: Lua stack resizing no longer results in a wrong behaviour of the memory profiler (:tarantool-issue:`5842`).
ru: Изменение размера стека Lua больше не приводит к ошибочному поведению профилировщика памяти (:tarantool-issue:`5842`).

source: Fixed a double ``gc_cdatanum`` decrementing in LuaJIT platform metrics which occurred when a finalizer was set for a ``GCсdata`` object (:tarantool-issue:`5820`).
ru: Исправлена ошибка, из-за которой значение ``gc_cdatanum`` в метриках платформы LuaJIT уменьшалось на две единицы. Ошибка возникала в случаях, когда финализатор был назначен для объекта типа ``GCсdata`` (:tarantool-issue:`5820`).

source: Fixed the `-e` option, when ``tarantool`` used to enter the interactive mode when stdin is a TTY. Now, ``tarantool -e "print('Hello')")`` doesn't enter the interactive mode, but just prints "Hello" and exits (:tarantool-issue:`5040`).
ru: Устранена проблема с параметром ``-e``. Ранее, если в качестве стандартного устройства ввода был установлен терминал, команда ``tarantool`` запускала интерактивный режим. Теперь команда ``tarantool -e "print('Hello')")`` просто выводит слово ``Hello`` и завершает работу (:tarantool-issue:`5040`).

source: Fixed a leak of a tuple object in ``key_def:compare_with_key(tuple, key)``, which had occurred when the serialization of the key failed (:tarantool-issue:`5388`).
ru: Устранена утечка кортежа, возникавшая при ошибке сериализации ключа во время выполнения ``key_def:compare_with_key(кортеж, ключ)`` (:tarantool-issue:`5388`).
