Repository: tarantool/doc
Catalog: locale/*/LC_MESSAGES/release/2.8.1.po
Languages: ru

source: The string received by a user-defined C or Lua function will no longer be different from the string passed to the function. This could happen when the string passed from SQL had contained ``\\0`` (:tarantool-issue:`5938`).
ru: Пользовательские C- или Lua-функции теперь получают ровно те же строки, что в них передаются посредством SQL. Различия могли возникать, если строка содержала ``\\0`` (:tarantool-issue:`5938`).

source: ``SQL SELECT`` or ``SQL UPDATE`` on ``UUID`` or ``DECIMAL`` field will not cause a SEGMENTATION FAULT anymore (:tarantool-issue:`5011`, :tarantool-issue:`5704`, :tarantool-issue:`5913`).
ru: Инструкции ``SQL SELECT`` и ``SQL UPDATE`` в отношении полей ``UUID`` и ``DECIMAL`` больше не вызывают ошибок сегментации (:tarantool-issue:`5011`, :tarantool-issue:`5704`, :tarantool-issue:`5913`).

source: Fixed an issue with wrong results of ``SELECT`` with ``GROUP BY`` which occurred when one of the selected values was ``VARBINARY`` and not directly obtained from the space (:tarantool-issue:`5890`).
ru: Устранена проблема, из-за которой инструкции ``SELECT`` и ``GROUP BY``, выполняемые в рамках одной транзакции, приводили к неверным результатам. Проблема возникала, когда одно из обрабатываемых значений имело тип ``VARBINARY``, а обращение к нему не происходило с помощью инструкции SELECT напрямую (:tarantool-issue:`5890`).

source: Fix building on FreeBSD (incomplete definition of type ``struct sockaddr``) (:tarantool-issue:`5748`).
ru: Устранена проблема сборки на FreeBSD, связанная с неполным определением типа ``struct sockaddr`` (:tarantool-issue:`5748`).

source: The already downloaded static build dependencies will not be fetched repeatedly (:tarantool-issue:`5761`).
ru: Уже скачанные зависимости статической сборки не будут скачиваться повторно (:tarantool-issue:`5761`).

source: Recovering with ``force_recovery`` option now deletes vylog files which are newer than the snapshot. It helps an instance recover after incidents during a checkpoint (:tarantool-issue:`5823`).
ru: В ходе восстановления с помощью параметра ``force_recovery`` теперь удаляются файлы ``.vylog``, созданные позднее, чем снимок данных. Благодаря этому экземпляр может восстанавливаться после инцидентов, возникающих во время сохранения контрольной точки (:tarantool-issue:`5823`).

source: Fixed the ``libcurl`` configuring when Tarantool itself has been configured with ``cmake3`` command and there was no ``cmake`` command in the ``PATH`` (:tarantool-issue:`5955`).
ru: Устранены проблемы с конфигурацией ``libcurl``, возникавшие, когда для сборки Tarantool использовалась команда ``cmake3``, а в переменной ``PATH`` отсутствовал путь к ``cmake`` (:tarantool-issue:`5955`).

source: This affects building Tarantool from sources with bundled ``libcurl`` (it is the default mode).
ru: Это исправление влияет на сборку Tarantool со встроенной библиотекой ``libcurl`` (стандартный тип сборки).
