Repository: tarantool/doc
Catalog: locale/*/LC_MESSAGES/release/2021-08-releases.po
Languages: ru

source: **[Breaking change]** The argument types of SQL built-in functions are now checked in most cases during parsing. In addition, the number of arguments is now always checked during parsing (:tarantool-release:`2.10.0-beta1`, :tarantool-issue:`6105`).
ru: **[Критическое изменение]** Проверка типов аргументов встроенных функций SQL теперь обычно проходит во время синтаксического анализа. Кроме того, в это время всегда проверяется количество аргументов (:tarantool-release:`2.10.0-beta1`, :tarantool-issue:`6105`).

source: **[Breaking change]** for the ``NUMBER`` data type (:tarantool-release:`2.10.0-beta1`). Arithmetic (``+ * - / % & | ~``) operations and bit-shift operations (``>> <<``) are now illegal.
ru: **[Критическое изменение]** Для типа данных ``NUMBER`` теперь недопустимы ни арифметические операции (``+ * - / % & | ~``), ни операции сдвига (``>> <<``) (:tarantool-release:`2.10.0-beta1`).

source: SELECT number_column + 1 was legal in version 2.8. Now it will cause an error.
ru: В версии 2.8 запрос ``SELECT number_column + 1`` мог выполниться. Теперь он вызывает ошибку.

source: **[Breaking change]** for the ``SCALAR`` data type (:tarantool-release:`2.10.0-beta1`). Arithmetic (``+ * - / % & | ~``) operations and bit-shift operations (``>> <<``) are now illegal. Concatenation (``||``) operations are now illegal. Values in ``SCALAR`` columns now have data type ``SCALAR``, not the value's data type.
ru: **[Критическое изменение]** Для типа данных ``SCALAR`` теперь недопустимы ни арифметические операции (``+ * - / % & | ~``), ни операции сдвига (``>> <<``), ни конкатенация (``||``). В столбцах типа ``SCALAR`` теперь содержатся значения только этого типа, а не исходных типов (:tarantool-release:`2.10.0-beta1`).

source: TYPEOF(CAST(1 AS SCALAR)) was INTEGER in version 2.8. Now it will be SCALAR.
ru: В версии 2.8 результат ``TYPEOF(CAST(1 AS SCALAR))`` был ``INTEGER``. Теперь это ``SCALAR``.

source: **[Breaking change]**: Arithmetic operators must now have numeric operands. String operands are illegal.
ru: **[Критическое изменение]** Арифметические операции теперь требуют числовых операндов. Строковые операнды недопустимы.

source: SELECT 1 + '1' was 2 in version 2.8. Now it will cause an error.
ru: В версии 2.8 запрос ``SELECT 1 + '1'`` выполнялся с результатом ``2``. Теперь такой запрос вызывает ошибку.

source: **[Breaking change]** in operations on SCALAR columns. Since the type of a value no longer determines whether an operation is valid, comparisons and functions that require a specific type no longer work.
ru: **[Критическое изменение]** Для столбцов типа ``SCALAR`` операции сравнения и функции, требующие определенного типа, больше не работают. Тип значения больше не определяет, является ли операция допустимой.

source: if table T has only one row with a scalar column containing 'a': UPPER(scalar_column) was 'A' in version 2.8. Now it will cause an error.
ru: Запрос ``UPPER(scalar_column)`` к таблице ``T`` с одной строкой со скалярным столбцом, содержащим символ ``'a'``, в версии Tarantool 2.8 выполнялся с результатом ``'А'``. Теперь такой запрос вызывает ошибку.

source: **[Breaking change]** for the ``HEX()`` function (:tarantool-release:`2.10.0-beta1`). ``STRING`` arguments are no longer acceptable; only ``VARBINARY`` arguments are allowed.
ru: **[Критическое изменение]** Аргументы типа ``STRING`` для функции ``HEX()`` больше не поддерживаются. Разрешены только аргументы типа ``VARBINARY`` (:tarantool-release:`2.10.0-beta1`).

source: HEX('a') was '41' in version 2.8. Now it will cause an error.
ru: В версии 2.8 значение выражения ``HEX('a')`` было ``'41'``. Теперь это выражение вызывает ошибку.

source: **[Breaking change]** for the ``POSITION()`` function (:tarantool-release:`2.10.0-beta1`). ``VARBINARY`` arguments are no longer acceptable; only ``STRING`` arguments are allowed.
ru: **[Критическое изменение]** Для функции ``POSITION()`` аргументы типа ``VARBINARY`` больше не допускаются. Разрешены только аргументы типа ``STRING`` (:tarantool-release:`2.10.0-beta1`).

source: POSITION(X'41',X'41') was 1 in version 2.8. Now it will cause an error.
ru: В версии 2.8 значение выражения ``POSITION(X'41',X'41')`` было ``1``. Теперь это выражение вызывает ошибку.

source: Set ``FORCE_CONFIG=false`` for luarocks config to allow loading project-side ``.rocks/config-5.1.lua`` (:tarantool-release:`2.10.0-beta1`).
ru: Установлен параметр ``FORCE_CONFIG=false``, чтобы конфигурация luarocks могла загружать файл ``.rocks/config-5.1.lua`` на стороне проекта (:tarantool-release:`2.10.0-beta1`).

source: Build
ru: Сборка

source: Fedora 34 builds are now supported (:tarantool-release:`2.8.2`, :tarantool-release:`2.10.0-beta1`, :tarantool-issue:`6074`).
ru: Теперь поддерживаются сборки для Fedora 34 (:tarantool-release:`2.8.2`, :tarantool-release:`2.10.0-beta1`, :tarantool-issue:`6074`).

source: Fedora 28 and 29 builds are no longer supported.
ru: Сборки для Fedora 28 и 29 больше не поддерживаются.

source: Bugs fixed
ru: Исправленные ошибки

source: **[Breaking change]** ``fiber.wakeup()`` in Lua and ``fiber_wakeup()`` in C became NOP on the currently running fiber. Previously they allowed “ignoring” the next yield or sleep, which resulted in unexpected erroneous wake-ups. Calling these functions right before ``fiber.create()`` in Lua or ``fiber_start()`` in C could lead to a crash (in debug build) or undefined behaviour (in release build) (:tarantool-issue:`6043`).
ru: **[Критическое изменение]** Запуск функций ``fiber.wakeup()`` в Lua и ``fiber_wakeup()`` в C больше не срабатывает в текущем файбере. Ранее эти функции позволяли игнорировать следующий переход в спящий режим или передачу управления с помощью ``yield``, что приводило к неожиданным ошибочным пробуждениям. Вызов функций непосредственно перед ``fiber.create()`` в коде на Lua или ``fiber_start()`` в коде на C в отладочной сборке мог привести к сбою, а в релизной --- к неопределенному поведению (:tarantool-issue:`6043`).

source: There was a single use case for the previous behaviour: rescheduling in the same event loop iteration, which is not the same as ``fiber.sleep(0)`` in Lua and ``fiber_sleep(0)`` in C. It could be done in the following way:
ru: Прежнее поведение отличалось от ``fiber.sleep(0)`` в Lua и ``fiber_sleep(0)`` в C и было полезно в единственном случае --- когда требовалось запланировать дальнейшее выполнение файбера на конец текущей итерации событийного цикла. Ниже показано, как это можно было сделать.

source: in C:
ru: На C:

source: and in Lua:
ru: На Lua:

source: To get the same effect in C, one can now use ``fiber_reschedule()``. In Lua, it is now impossible to reschedule the current fiber directly in the same event loop iteration. One can reschedule self through a second fiber, but it is strongly discouraged:
ru: Чтобы добиться того же результата в C, можно использовать ``fiber_reschedule()``. В Lua теперь невозможно перепланировать выполнение файбера на конец текущей итерации событийного цикла. Файбер может изменить свое место в цикле через другой файбер, но это категорически не рекомендуется:

source: -- do not use this code local self = fiber.self() fiber.new(function() self:wakeup() end) fiber.sleep(0)
ru: -- не используйте этот код local self = fiber.self() fiber.new(function() self:wakeup() end) fiber.sleep(0)

source: Fixed memory leak on ``box.on_commit()`` and ``box.on_rollback()`` (:tarantool-issue:`6025`).
ru: Исправлена утечка памяти в функциях ``box.on_commit()`` и ``box.on_rollback()`` (:tarantool-issue:`6025`).

source: ``fiber_join()`` now checks if the argument is a joinable fiber. The absence of this check could lead to unpredictable results. Note that the change affects the C level only; in the Lua interface, ``fiber:join()`` protection is already enabled (:tarantool-release:`2.8.2`, :tarantool-release:`2.10.0-beta1`, :tarantool-release:`2.7.3`).
ru: Функция ``fiber_join()`` теперь проверяет, является ли ее аргумент файбером, который можно присоединить. Отсутствие этой проверки могло бы привести к непредсказуемым результатам. Обратите внимание, что изменение затрагивает только уровень C. В интерфейсе Lua защита функции ``fiber:join()`` уже включена (:tarantool-release:`2.8.2`, :tarantool-release:`2.10.0-beta1`, :tarantool-release:`2.7.3`).

source: Now Tarantool yields when it scans ``.xlog`` files for the latest applied vclock and finds the right place to start recovering from. It means that the instance becomes responsive right after the ``box.cfg`` call even if an empty ``.xlog`` was not created on the previous exit.
ru: Теперь Tarantool выполняет yield, когда сканирует файлы ``.xlog`` в поиске последних примененных векторных часов (vclock) и точки восстановления. Это означает, что экземпляр начинает реагировать сразу после вызова ``box.cfg``, даже если пустой ``.xlog`` не был создан при предыдущем завершении работы.

source: This fix also prevents the relay from timing out when a freshly subscribed replica needs rows from the end of a relatively long (hundreds of MBs) ``.xlog`` file (:tarantool-release:`2.8.2`, :tarantool-release:`2.7.3`, :tarantool-release:`2.10.0-beta1`, :tarantool-issue:`5979`).
ru: Это исправление также предотвращает тайм-аут потока relay в случае, когда только что подписанной реплике требуются строки из конца относительно длинного (сотни мегабайт) файла ``.xlog`` (:tarantool-release:`2.8.2`, :tarantool-release:`2.7.3`, :tarantool-release:`2.10.0-beta1`, :tarantool-issue:`5979`).

source: The counter in ``N rows processed`` log messages no longer resets on each newly recovered ``xlog`` (:tarantool-release:`2.8.2`, :tarantool-release:`2.7.3`, :tarantool-release:`2.10.0-beta1`).
ru: Счетчик в сообщениях журнала ``N rows processed`` (обработано N строк) больше не сбрасывается при каждом вновь восстановленном файле ``xlog`` (:tarantool-release:`2.8.2`, :tarantool-release:`2.7.3`, :tarantool-release:`2.10.0-beta1`).

source: Fixed wrong type specification when printing fiber state change. It could lead to negative fiber IDs in the logs (:tarantool-release:`2.10.0-beta1`, :tarantool-issue:`5846`).
ru: Изменения состояния файбера теперь печатаются без ошибок. Неправильная спецификация типа раньше приводила к тому, что в журнал записывались отрицательные идентификаторы файберов (:tarantool-release:`2.10.0-beta1`, :tarantool-issue:`5846`).

source: For example,
ru: Например,

source: instead of proper
ru: вместо правильного варианта:

source: Fiber IDs are now to monotonically increasing unsigned 8-byte integers, so there is no ID wrapping anymore. It allows detecting fiber precedence by ID (:tarantool-release:`2.10.0-beta1`, :tarantool-issue:`5846`).
ru: Идентификаторы файберов теперь представляют собой монотонно увеличивающиеся 8-байтовые беззнаковые целые, поэтому больше нет перехода ID через ноль. Так что теперь можно определять порядок запуска файберов по их идентификаторам (:tarantool-release:`2.10.0-beta1`, :tarantool-issue:`5846`).

source: Fixed a crash in JSON update on tuple/space, where the update included two or more operations that accessed fields in reversed order and these fields didn’t exist. Example: ``box.tuple.new({1}):update({{'=', 4, 4}, {'=', 3, 3}})`` (:tarantool-release:`2.8.2`, :tarantool-release:`2.10.0-beta1`, :tarantool-issue:`6069`).
ru: Исправлена ошибка обновления JSON в кортеже/спейсе, которая возникала, когда две или более операции обращались к несуществующим полям в обратном порядке. Пример: ``box.tuple.new({1}):update({{'=', 4, 4}, {'=', 3, 3}})`` (:tarantool-release:`2.8.2`, :tarantool-release:`2.10.0-beta1`, :tarantool-issue:`6069`).

source: Fixed invalid results of the ``json`` module’s ``encode`` function when it was used from the Lua garbage collector. For example, this could happen in functions used as ``ffi.gc()`` (:tarantool-issue:`6050`).
ru: Исправлена ошибка, из-за которой функция ``encode`` модуля ``json`` возвращала некорректные результаты, когда вызывалась из сборщика мусора Lua --- например, через функцию-финализатор, установленную на объект с помощью ``ffi.gc()`` (:tarantool-issue:`6050`).

source: Added a check for user input of the number of iproto threads: value must be greater than zero and less than or equal to 1000 (:tarantool-release:`2.8.2`, :tarantool-release:`2.10.0-beta1`, :tarantool-issue:`6005`).
ru: Теперь количество введенных пользователем потоков iproto проверяется: значение должно быть больше нуля и не больше 1000 (:tarantool-release:`2.8.2`, :tarantool-release:`2.10.0-beta1`, :tarantool-issue:`6005`).

source: Changing a listed address can no longer cause iproto threads to close the same socket several times (:tarantool-release:`2.8.2`, :tarantool-release:`2.10.0-beta1`)
ru: Изменение адреса из списка больше не может привести к тому, что потоки iproto будут закрывать один и тот же сокет несколько раз (:tarantool-release:`2.8.2`, :tarantool-release:`2.10.0-beta1`)

source: Tarantool now always removes the Unix socket correctly when it exits (:tarantool-release:`2.8.2`).
ru: Tarantool теперь всегда корректно удаляет Unix-сокет при завершении работы (:tarantool-release:`2.8.2`).

source: Simultaneously updating a key in different transactions does not longer result in a MVCC crash (:tarantool-release:`2.8.2`, :tarantool-release:`2.7.3`, :tarantool-release:`2.10.0-beta1`, :tarantool-issue:`6131`).
ru: Одновременное обновление ключа в разных транзакциях больше не приводит к сбою механизма MVCC (:tarantool-release:`2.8.2`, :tarantool-release:`2.7.3`, :tarantool-release:`2.10.0-beta1`, :tarantool-issue:`6131`).

source: Fixed a bug where memtx MVCC crashed during reading uncommitted DDL (:tarantool-release:`2.8.2`, :tarantool-release:`2.7.3`, :tarantool-release:`2.10.0-beta1`, :tarantool-issue:`5515`).
ru: Исправлена ошибка, из-за которой механизм MVCC движка memtx аварийно завершал работу при чтении не прошедшего коммит DDL-запроса (:tarantool-release:`2.8.2`, :tarantool-release:`2.7.3`, :tarantool-release:`2.10.0-beta1`, :tarantool-issue:`5515`).

source: Fixed a bug where memtx MVCC crashed if an index was created in the transaction thread (:tarantool-release:`2.8.2`, :tarantool-release:`2.7.3`, :tarantool-release:`2.10.0-beta1`, :tarantool-issue:`6137`).
ru: Исправлена ошибка, из-за которой механизм MVCC движка memtx аварийно завершал работу, если в потоке обработчика транзакций создавался индекс (:tarantool-release:`2.8.2`, :tarantool-release:`2.7.3`, :tarantool-release:`2.10.0-beta1`, :tarantool-issue:`6137`).

source: Fixed a MVCC segmentation fault that arose when updating the entire space concurrently (:tarantool-release:`2.8.2`, :tarantool-release:`2.7.3`, :tarantool-release:`2.10.0-beta1`, :tarantool-issue:`5892`).
ru: Исправлена ошибка сегментации в механизме MVCC, возникавшая, когда спейс целиком обновлялся посредством нескольких параллельных транзакций (:tarantool-release:`2.8.2`, :tarantool-release:`2.7.3`, :tarantool-release:`2.10.0-beta1`, :tarantool-issue:`5892`).

source: Fixed a bug with failed assertion after a stress update of the same key (:tarantool-release:`2.8.2`, :tarantool-release:`2.7.3`, :tarantool-release:`2.10.0-beta1`, :tarantool-issue:`6193`).
ru: Исправлена ошибка, приводившая к сбою проверочного утверждения после стресс-обновления одного и того же ключа (:tarantool-release:`2.8.2`, :tarantool-release:`2.7.3`, :tarantool-release:`2.10.0-beta1`, :tarantool-issue:`6193`).

source: Fixed a crash where ``box.snapshot`` could be called during an incomplete transaction (:tarantool-release:`2.8.2`, :tarantool-release:`2.7.3`, :tarantool-release:`2.10.0-beta1`, :tarantool-issue:`6229`).
ru: Исправлен сбой, из-за которого команду ``box.snapshot`` можно было вызвать до завершения транзакции (:tarantool-release:`2.8.2`, :tarantool-release:`2.7.3`, :tarantool-release:`2.10.0-beta1`, :tarantool-issue:`6229`).

source: Fixed console client connection failure in case of request timeout (:tarantool-issue:`6249`).
ru: Исправлен сбой подключения консольного клиента, возникавший при тайм-ауте запроса (:tarantool-issue:`6249`).

source: Added a missing broadcast to ``net.box.future:discard()`` so that now fibers waiting for a request result wake up when the request is discarded (:tarantool-issue:`6250`).
ru: В функцию ``net.box.future:discard()`` добавлена отправка широковещательного сообщения. Теперь файберы, ожидающие результата запроса, просыпаются, когда запрос отбрасывается (:tarantool-issue:`6250`).

source: ``box.info.uuid``, ``box.info.cluster.uuid``, and ``tostring(decimal)`` with any decimal number in Lua could sometimes return garbage if there were ``__gc`` handlers in the user’s code (:tarantool-release:`2.8.2`, :tarantool-release:`2.7.3`, :tarantool-issue:`6259`).
ru: Раньше, если в коде пользователя были обработчики ``__gc``, то функции ``box.info.uuid``, ``box.info.cluster.uuid`` и ``tostring(decimal)`` с любым десятичным числом в Lua иногда могли возвращать мусор. Эта ошибка исправлена (:tarantool-release:`2.8.2`, :tarantool-release:`2.7.3`, :tarantool-issue:`6259`).

source: Fixed an error message that appeared in a particular case during MVCC operation (:tarantool-issue:`6247`).
ru: Исправлено сообщение об ошибке, которое могло приводить к сбою в конкретном случае во время работы MVCC (:tarantool-issue:`6247`).

source: Fixed a repeatable read violation after delete (:tarantool-release:`2.8.2`, :tarantool-release:`2.7.3`, :tarantool-release:`2.10.0-beta1`, :tarantool-issue:`6206`).
ru: Исправлено нарушение повторяющегося чтения, возникавшее после операции удаления (:tarantool-release:`2.8.2`, :tarantool-release:`2.7.3`, :tarantool-release:`2.10.0-beta1`, :tarantool-issue:`6206`).

source: Fixed a bug where the MVCC engine didn't track the ``select{}`` hash (:tarantool-release:`2.8.2`, :tarantool-release:`2.7.3`, :tarantool-release:`2.10.0-beta1`, :tarantool-issue:`6040`).
ru: Исправлена ошибка, из-за которой движок MVCC не отслеживал хэш ``select{}`` (:tarantool-release:`2.8.2`, :tarantool-release:`2.7.3`, :tarantool-release:`2.10.0-beta1`, :tarantool-issue:`6040`).

source: Fixed a crash in MVCC after a drop of space with several indexes (:tarantool-release:`2.8.2`, :tarantool-release:`2.7.3`, :tarantool-release:`2.10.0-beta1`, :tarantool-issue:`6274`).
ru: Исправлен сбой в MVCC, возникавший после удаления спейса с несколькими индексами (:tarantool-release:`2.8.2`, :tarantool-release:`2.7.3`, :tarantool-release:`2.10.0-beta1`, :tarantool-issue:`6274`).

source: Fixed a bug where the GC could leave tuples in secondary indexes (:tarantool-release:`2.8.2`, :tarantool-release:`2.7.3`, :tarantool-release:`2.10.0-beta1`, :tarantool-issue:`6234`).
ru: Исправлена ошибка, из-за которой сборщик мусора мог оставлять кортежи во вторичных индексах (:tarantool-release:`2.8.2`, :tarantool-release:`2.7.3`, :tarantool-release:`2.10.0-beta1`, :tarantool-issue:`6234`).

source: Disallow yields after DDL operations in MVCC mode. It fixes a crash that took place when several transactions referred to system spaces (:tarantool-release:`2.8.2`, :tarantool-release:`2.7.3`, :tarantool-release:`2.10.0-beta1`, :tarantool-issue:`5998`).
ru: Запрещена передача управления через yield после DDL-операций в режиме MVCC. Это исправило сбой, который происходил, когда несколько транзакций ссылались на системные спейсы (:tarantool-release:`2.8.2`, :tarantool-release:`2.7.3`, :tarantool-release:`2.10.0-beta1`, :tarantool-issue:`5998`).

source: Fixed a bug in MVCC that happened on rollback after a DDL operation (:tarantool-release:`2.8.2`, :tarantool-release:`2.7.3`, :tarantool-release:`2.10.0-beta1`, :tarantool-issue:`5998`).
ru: Исправлена ошибка в механизме MVCC, возникавшая при отмене операции DDL (:tarantool-release:`2.8.2`, :tarantool-release:`2.7.3`, :tarantool-release:`2.10.0-beta1`, :tarantool-issue:`5998`).

source: Fixed a bug where rollback resulted in unserializable behavior (:tarantool-release:`2.8.2`, :tarantool-release:`2.7.3`, :tarantool-release:`2.10.0-beta1`, :tarantool-issue:`6325`).
ru: Исправлена ошибка, из-за которой отмена транзакции приводила к несериализуемому поведению (:tarantool-release:`2.8.2`, :tarantool-release:`2.7.3`, :tarantool-release:`2.10.0-beta1`, :tarantool-issue:`6325`).

source: Fixed possible keys divergence during secondary index build, which might lead to missing tuples (:tarantool-release:`2.8.2`, :tarantool-release:`2.7.3`, :tarantool-release:`2.10.0-beta1`, :tarantool-issue:`6045`).
ru: Ранее при построении вторичного индекса могли расходиться ключи, что иногда приводило к потере кортежей. Эта ошибка исправлена (:tarantool-release:`2.8.2`, :tarantool-release:`2.7.3`, :tarantool-release:`2.10.0-beta1`, :tarantool-issue:`6045`).

source: Fixed the race between Vinyl garbage collection and compaction that resulted in a broken vylog and recovery failure (:tarantool-release:`2.8.2`, :tarantool-release:`2.7.3`, :tarantool-release:`2.10.0-beta1`, :tarantool-issue:`5436`).
ru: Ликвидирована гонка в Vinyl между сборкой мусора и слиянием, приводившая к повреждению vylog и сбою восстановления (:tarantool-release:`2.8.2`, :tarantool-release:`2.7.3`, :tarantool-release:`2.10.0-beta1`, :tarantool-issue:`5436`).

source: Fixed the use after free in the relay thread when using elections (:tarantool-release:`2.8.2`, :tarantool-release:`2.7.3`, :tarantool-release:`2.10.0-beta1`, :tarantool-issue:`6031`).
ru: Исправлен cбой обращения к памяти в потоке relay при включенных выборах лидера (:tarantool-release:`2.8.2`, :tarantool-release:`2.7.3`, :tarantool-release:`2.10.0-beta1`, :tarantool-issue:`6031`).

source: Fixed a possible crash when a synchronous transaction was followed by an asynchronous transaction right when its confirmation was being written (:tarantool-release:`2.8.2`, :tarantool-release:`2.7.3`, :tarantool-release:`2.10.0-beta1`, :tarantool-issue:`6057`).
ru: Устранена вероятность сбоя в момент, когда за синхронной транзакцией следует асинхронная, а подтверждение первой еще записывается (:tarantool-release:`2.8.2`, :tarantool-release:`2.7.3`, :tarantool-release:`2.10.0-beta1`, :tarantool-issue:`6057`).

source: Fixed an error where a replica, while attempting to subscribe to a foreign cluster with a different replicaset UUID, didn’t notice it is impossible and instead became stuck in an infinite retry loop printing a ``TOO_EARLY_SUBSCRIBE`` error (:tarantool-release:`2.8.2`, :tarantool-release:`2.7.3`, :tarantool-release:`2.10.0-beta1`, :tarantool-issue:`6094`).
ru: Исправлена ошибка, из-за которой реплика при попытке подписаться на внешний кластер с другим UUID набора реплик не замечала, что это невозможно, и вместо этого попадала в бесконечный цикл повторных попыток, выводя ошибку ``TOO_EARLY_SUBSCRIBE`` (:tarantool-release:`2.8.2`, :tarantool-release:`2.7.3`, :tarantool-release:`2.10.0-beta1`, :tarantool-issue:`6094`).

source: Fixed an error where a replica, while attempting to join a cluster with exclusively read-only replicas available, just booted its own replicaset, instead of failing or retrying. Now it fails with an error about the other nodes being read-only so they can’t register the new replica (:tarantool-release:`2.8.2`, :tarantool-release:`2.7.3`, :tarantool-release:`2.10.0-beta1`, :tarantool-issue:`5613`).
ru: Исправлена ошибка, из-за которой реплика при попытке присоединиться к кластеру с репликами, доступными только для чтения, просто использовала собственный набор реплик, вместо того чтобы сообщить о сбое или повторить попытку. Теперь такая ситуация приводит к сбою с сообщением об ошибке, объясняющим, что другие узлы доступны только для чтения и поэтому не могут зарегистрировать новую реплику (:tarantool-release:`2.8.2`, :tarantool-release:`2.7.3`, :tarantool-release:`2.10.0-beta1`, :tarantool-issue:`5613`).
