Repository: tarantool/doc
Catalog: locale/*/LC_MESSAGES/release/2021-08-releases.po
Languages: ru

source: Fixed error reporting associated with transactions received from remote instances via replication. Any error raised while such a transaction was being applied was always reported as ``Failed to write to disk`` regardless of what really happened. Now the correct error is shown. For example, ``Out of memory``, or ``Transaction has been aborted by conflict``, and so on (:tarantool-release:`2.8.2`, :tarantool-release:`2.7.3`, :tarantool-release:`2.10.0-beta1`, :tarantool-issue:`6027`).
ru: Исправлены сообщения об ошибках, связанных с транзакциями, которые были получены от удаленных экземпляров через репликацию. Любая ошибка, возникавшая во время применения такой транзакции, всегда сопровождалась сообщением "Не удалось записать на диск" (``Failed to write to disk``), независимо от того, что произошло на самом деле. Теперь ошибка отображается правильно. Например: "Не хватает памяти" (``Out of memory``) или "Транзакция прервана из-за конфликта" (``Transaction has been aborted by conflict``) (:tarantool-release:`2.8.2`, :tarantool-release:`2.7.3`, :tarantool-release:`2.10.0-beta1`, :tarantool-issue:`6027`).

source: Fixed replication occasionally stopping with ``ER_INVALID_MSGPACK`` when the replica is under high load (:tarantool-issue:`4040`).
ru: Исправлен сбой, из-за которого репликация иногда останавливалась с ошибкой ``ER_INVALID_MSGPACK``, когда реплика была под высокой нагрузкой (:tarantool-issue:`4040`).

source: Fixed a cluster sometimes being unable to bootstrap if it contains nodes with ``election_mode`` set to ``manual`` or ``voter`` (:tarantool-release:`2.8.2`, :tarantool-release:`2.7.3`, :tarantool-release:`2.10.0-beta1`, :tarantool-issue:`6018`).
ru: Исправлена ошибка, из-за которой кластер иногда не мог загрузиться, если содержал узлы, у которых для параметра ``election_mode`` установлено значение ``manual`` или ``voter`` (:tarantool-release:`2.8.2`, :tarantool-release:`2.7.3`, :tarantool-release:`2.10.0-beta1`, :tarantool-issue:`6018`).

source: Fixed a possible crash when ``box.ctl.promote()`` was called in a cluster with more than three instances. The crash happened in the debug build. In the release build, it could lead to undefined behaviour. It was likely to happen if a new node was added shortly before the promotion (:tarantool-release:`2.8.2`, :tarantool-release:`2.7.3`, :tarantool-release:`2.10.0-beta1`, :tarantool-issue:`5430`).
ru: Исправлен сбой, иногда происходивший при вызове функции ``box.ctl.promote()`` в кластере с более чем тремя экземплярами. Сбой возникал в отладочной сборке и мог приводить к неопределенному поведению в релизной сборке. Эта проблема обычно проявлялась, если незадолго до вызова ``box.ctl.promote()`` добавлялся новый узел (:tarantool-release:`2.8.2`, :tarantool-release:`2.7.3`, :tarantool-release:`2.10.0-beta1`, :tarantool-issue:`5430`).

source: Fixed a rare error appearing when MVCC (``box.cfg.memtx_use_mvcc_engine``) was enabled and more than one replica joined the cluster. The join could fail with the error ``"ER_TUPLE_FOUND: Duplicate key exists in unique index 'primary' in space '_cluster'"``. The same could happen at the bootstrap of a cluster having more than three nodes (:tarantool-release:`2.8.2`, :tarantool-release:`2.7.3`, :tarantool-release:`2.10.0-beta1`, :tarantool-issue:`5601`).
ru: Исправлена редкая ошибка, возникавшая, когда более чем одна реплика присоединялась к кластеру при включенном механизме MVCC (``box.cfg.memtx_use_mvcc_engine = true``). Ранее присоединение могло завершаться с ошибкой ``ER_TUPLE_FOUND: Duplicate key exists in unique index 'primary' in space '_cluster'``. То же самое могло происходить при инициализации кластера с более чем тремя узлами (:tarantool-release:`2.8.2`, :tarantool-release:`2.7.3`, :tarantool-release:`2.10.0-beta1`, :tarantool-issue:`5601`).

source: Fixed a rare crash with leader election enabled (any mode except ``off``), which could happen if a leader resigned from its role while another node was writing something elections-related to WAL. The crash was in the debug build, and in the release build it would lead to undefined behaviour (:tarantool-release:`2.8.2`, :tarantool-release:`2.7.3`, :tarantool-release:`2.10.0-beta1`, :tarantool-issue:`6129`).
ru: Исправлен редкий сбой, возникавший при включенных выборах лидера (значение параметра ``election_mode`` --- любое, кроме ``off``). Этот сбой мог произойти, если лидер отказался от своей роли, а другой узел в это время записывал в WAL что-то, связанное с выборами. Сбой происходил в отладочной сборке, а в релизной сборке наблюдалось неопределенное поведение (:tarantool-release:`2.8.2`, :tarantool-release:`2.7.3`, :tarantool-release:`2.10.0-beta1`, :tarantool-issue:`6129`).

source: Fixed an error where a new replica in a Raft cluster tried to join from a follower instead of a leader and failed with the error ``ER_READONLY`` (:tarantool-release:`2.8.2`, :tarantool-release:`2.7.3`, :tarantool-release:`2.10.0-beta1`, :tarantool-issue:`6127`).
ru: Исправлен сбой, из-за которого новая реплика в кластере Raft пыталась присоединиться не от лидера, а от другой реплики, что приводило к ошибке ``ER_READONLY`` (:tarantool-release:`2.8.2`, :tarantool-release:`2.7.3`, :tarantool-release:`2.10.0-beta1`, :tarantool-issue:`6127`).

source: Fixed optimization for single-char strings in the ``IR_BUFPUT`` assembly routine.
ru: Исправлена оптимизация для односимвольных строк в процедуре сборки ``IR_BUFPUT``.

source: Fixed slots alignment in the ``lj-stack`` command output when ``LJ_GC64`` is enabled (:tarantool-issue:`5876`).
ru: Исправлено выравнивание в выводе команды ``lj-stack`` при включенном параметре ``LJ_GC64`` (:tarantool-issue:`5876`).

source: Fixed dummy frame unwinding in the ``lj-stack`` command.
ru: В выводе команды ``lj-stack`` исправлено отображение стека Lua без вызванных функций.

source: Fixed detection of inconsistent renames even in the presence of sunk values (:tarantool-issue:`4252`, :tarantool-issue:`5049`, :tarantool-issue:`5118`).
ru: Исправлено обнаружение несогласованных переименований. Теперь оно также работает при наличии слотов, не предполагающих аллокацию памяти под объекты (sunk values) (:tarantool-issue:`4252`, :tarantool-issue:`5049`, :tarantool-issue:`5118`).

source: Fixed the VM register allocation order provided by LuaJIT frontend in case of ``BC_ISGE`` and ``BC_ISGT`` (:tarantool-issue:`6227`).
ru: Исправлен порядок аллокации регистров виртуальных машин, обеспечиваемый интерфейсом LuaJIT в случае ``BC_ISGE`` и ``BC_ISGT`` (:tarantool-issue:`6227`).

source: Fixed a bug where multibyte characters broke ``space:fselect()`` output (:tarantool-release:`2.10.0-beta1`).
ru: Исправлена ошибка, из-за которой многобайтовые символы нарушали вывод команды ``space:fselect()`` (:tarantool-release:`2.10.0-beta1`).

source: When an error occurs during encoding call results, the auxiliary lightuserdata value is not removed from the main Lua coroutine stack. Before the fix, it led to undefined behaviour during the next usage of this Lua coroutine (:tarantool-issue:`4617`).
ru: Когда во время кодирования результатов вызова возникала ошибка, вспомогательное значение lightuserdata не удалялось из стека главной корутины Lua. До исправления это приводило к неопределенному поведению при следующем использовании этой корутины (:tarantool-issue:`4617`).

source: Fixed a Lua C API misuse when the error is raised during call results encoding in an unprotected coroutine and expected to be caught in a different, protected coroutine (:tarantool-issue:`6248`).
ru: Исправлен сбой, из-за которого API для языка C в Lua использовался некорректно. Ранее об ошибке в незащищенной корутине объявлялось во время кодирования результатов вызова, а затем ожидалось, что эта ошибка будет обработана в другой, защищенной корутине (:tarantool-issue:`6248`).

source: Triggers
ru: Триггеры

source: Fixed a possible crash in case trigger removes itself. Fixed a possible crash in case someone destroys a trigger when it yields (:tarantool-issue:`6266`).
ru: Исправлен сбой, связанный с тем, что триггер удалял сам себя. Исправлен также сбой, возникавший при удалении триггера в момент, когда тот передавал управление с помощью yield (:tarantool-issue:`6266`).

source: User-defined functions can now return a VARBINARY result to SQL (:tarantool-release:`2.8.2`, :tarantool-release:`2.7.3`, :tarantool-release:`2.10.0-beta1`, :tarantool-issue:`6024`).
ru: Пользовательские функции теперь могут возвращать в SQL результат типа VARBINARY (:tarantool-release:`2.8.2`, :tarantool-release:`2.7.3`, :tarantool-release:`2.10.0-beta1`, :tarantool-issue:`6024`).

source: Fixed assert when a DOUBLE value greater than -1.0 and less than 0.0 is cast to INTEGER and UNSIGNED (:tarantool-release:`2.8.2`, :tarantool-release:`2.7.3`, :tarantool-release:`2.10.0-beta1`, :tarantool-issue:`6225`).
ru: Устранен сбой, возникавший, когда значение типа DOUBLE больше -1.0 и меньше 0.0 приводилось к типу INTEGER или UNSIGNED (:tarantool-release:`2.8.2`, :tarantool-release:`2.7.3`, :tarantool-release:`2.10.0-beta1`, :tarantool-issue:`6225`).

source: Removed spontaneous conversion from INTEGER to DOUBLE in a field of the NUMBER type (:tarantool-release:`2.8.2`, :tarantool-release:`2.7.3`, :tarantool-release:`2.10.0-beta1`, :tarantool-issue:`5335`).
ru: Устранено самопроизвольное преобразование из INTEGER в DOUBLE в поле типа NUMBER (:tarantool-release:`2.8.2`, :tarantool-release:`2.7.3`, :tarantool-release:`2.10.0-beta1`, :tarantool-issue:`5335`).

source: All arithmetic operations can now accept numeric values only (:tarantool-release:`2.8.2`, :tarantool-release:`2.7.3`, :tarantool-release:`2.10.0-beta1`, :tarantool-issue:`5756`).
ru: Все арифметические операции теперь принимают только числовые значения (:tarantool-release:`2.8.2`, :tarantool-release:`2.7.3`, :tarantool-release:`2.10.0-beta1`, :tarantool-issue:`5756`).

source: Now ``QUOTE()`` returns the argument if the argument is DOUBLE, which is the same behavior as with other numeric types. For types different from numeric, the function returns a STRING (:tarantool-release:`2.10.0-beta1`, :tarantool-issue:`6239`).
ru: Теперь функция ``QUOTE()`` возвращает свой аргумент, если его тип --- ``DOUBLE``. Это соответствует ее поведению для других числовых типов. Для нечисловых типов функция возвращает результат типа ``STRING`` (:tarantool-release:`2.10.0-beta1`, :tarantool-issue:`6239`).

source: The ``TRIM()`` function now does not lose collation when executed with the keywords BOTH, LEADING, or TRAILING (:tarantool-release:`2.10.0-beta1`, :tarantool-issue:`6299`).
ru: Функция ``TRIM()`` теперь не теряет настройки сравнения символов, когда выполняется с ключевыми словами ``BOTH``, ``LEADING`` или ``TRAILING`` (:tarantool-release:`2.10.0-beta1`, :tarantool-issue:`6299`).

source: Fixed MVCC interaction with ephemeral spaces: TX manager now ignores them (:tarantool-release:`2.8.2`, :tarantool-release:`2.10.0-beta1`, :tarantool-issue:`6095`).
ru: Исправлена ошибка, возникавшая во время исполнения SQL-запроса при включенном механизме MVCC (:tarantool-release:`2.8.2`, :tarantool-release:`2.10.0-beta1`, :tarantool-issue:`6095`).

source: Fixed loss of tuples after a conflict exception (:tarantool-release:`2.8.2`, :tarantool-release:`2.10.0-beta1`, :tarantool-issue:`6132`).
ru: После конфликта кортежи больше не теряются (:tarantool-release:`2.8.2`, :tarantool-release:`2.10.0-beta1`, :tarantool-issue:`6132`).

source: Fixed a segfault during update/delete of the same tuple (:tarantool-release:`2.8.2`, :tarantool-release:`2.10.0-beta1`, :tarantool-issue:`6021`).
ru: Исправлена ошибка сегментации, возникавшая при обновлении/удалении одного и того же кортежа (:tarantool-release:`2.8.2`, :tarantool-release:`2.10.0-beta1`, :tarantool-issue:`6021`).
