Repository: tarantool/doc
Catalog: locale/*/LC_MESSAGES/release/2021-08-releases.po
Languages: ru

source: Tarantool Releases in August 2021
ru: Релизы Tarantool в августе 2021

source: Date: 2021-08-19
ru: Дата: 2021-08-19

source: Introduction
ru: Общие сведения

source: Meet the new Tarantool releases of August 2021: :tarantool-release:`2.8.2`, :tarantool-release:`2.7.3`, :tarantool-release:`1.10.11`.
ru: В августе 2021 года вышли новые релизы Tarantool: :tarantool-release:`2.8.2`, :tarantool-release:`2.7.3` и :tarantool-release:`1.10.11`.

source: Also, check the new Tarantool beta release of August 2021: :tarantool-release:`2.10.0-beta1`.
ru: Кроме того, выпущен бета-релиз Tarantool :tarantool-release:`2.10.0-beta1`.

source: Automated Raft-based failover out of the box
ru: Основанное на Raft автоматизированное восстановление после сбоев работает "из коробки"

source: The Raft-based failover algorithm is now a part of Tarantool, available out of the box. Use it to improve data safety and reliability of Tarantool applications.
ru: Алгоритм восстановления после сбоев, основанный на Raft, теперь входит в состав сборки Tarantool. Используйте этот алгоритм, чтобы повысить безопасность данных и надежность приложений Tarantool.

source: Using interactive transactions with any programming language
ru: Использование интерактивных транзакций с любым языком программирования

source: Write applications with interactive transactions in the programming language of your choice.
ru: Пишите приложения с интерактивными транзакциями на любом языке программирования по вашему выбору.

source: Interactive transactions are now part of iproto and can be used by applications in any programming language.
ru: Эти транзакции теперь поддерживает протокол iproto, и их могут использовать приложения на любом языке.

source: Compatibility
ru: Совместимость

source: Tarantool 2.x is backward compatible with Tarantool 1.10.x regarding the binary data layout, client-server protocol, and replication protocol.
ru: Tarantool 2.x обратно совместим с Tarantool 1.10.x в отношении структуры двоичных данных, клиент-серверного протокола и протокола репликации.

source: `Upgrade <https://www.tarantool.io/en/doc/latest/book/admin/upgrades/>`__ using the ``box.schema.upgrade()`` procedure to unlock all the new features of the 2.x series.
ru: Чтобы получить доступ ко всем новым функциям серии 2.x, `обновите Tarantool <https://www.tarantool.io/en/doc/latest/book/admin/upgrades/>`__ с помощью ``box.schema.upgrade()``.

source: Some changes are labeled as **[Breaking change]**. It means that the old behavior was considered error-prone and therefore changed to protect users from unintended mistakes. However, there is a small probability that someone can rely on the old behavior, and this label is to bring attention to the things that have been changed.
ru: Некоторые изменения помечены как **[Критическое изменение]**. Это означает, что старое поведение, вызывавшее сбои, было изменено, чтобы защитить пользователей от непреднамеренных ошибок. Тем не менее есть небольшая вероятность, что кто-то из пользователей будет полагаться на старое поведение. Поэтому, чтобы привлечь внимание к изменениям, была добавлена особая пометка.

source: New and updated features
ru: Новые и обновленные функциональные возможности

source: Core
ru: Основные функции (Core)

source: The information about the state of synchronous replication is now available via the ``box.info.synchro`` interface (:tarantool-release:`2.7.3`, :tarantool-release:`2.10.0-beta1`, :tarantool-issue:`5191`).
ru: Информацию о состоянии синхронной репликации теперь можно получить через интерфейс ``box.info.synchro`` (:tarantool-release:`2.7.3`, :tarantool-release:`2.10.0-beta1`, :tarantool-issue:`5191`).

source: The UUID field type is now part of the ``SCALAR`` field type (:tarantool-release:`2.10.0-beta1`, :tarantool-issue:`6042`).
ru: Тип поля ``UUID`` теперь входит в тип ``SCALAR`` (:tarantool-release:`2.10.0-beta1`, :tarantool-issue:`6042`).

source: The ``UUID`` field type is now available in SQL. A new UUID can be generated using the new SQL built-in function ``UUID()`` (:tarantool-release:`2.10.0-beta1`, :tarantool-issue:`5886`).
ru: В SQL теперь есть поля типа ``UUID``. Чтобы создать UUID-значение, можно использовать новую встроенную функцию ``UUID()`` (:tarantool-release:`2.10.0-beta1`, :tarantool-issue:`5886`).

source: **[Breaking change]** The ``timeout()`` method of the ``net.box`` connection, marked deprecated more than four years ago (in ``1.7.4``), has been dropped. It negatively affected the performance of hot ``net.box`` methods, such as ``call()`` and ``select()`` if they were called without a specified timeout (:tarantool-release:`2.10.0-beta1`, :tarantool-issue:`6242`).
ru: **[Критическое изменение]** Метод ``timeout()`` соединения ``net.box``, объявленный устаревшим более четырех лет назад (в релизе ``1.7.4``), теперь удален. Он ухудшал производительность часто используемых методов ``net.box``, например ``call()`` и ``select()``, если их вызывали, не указывая тайм-аут (:tarantool-release:`2.10.0-beta1`, :tarantool-issue:`6242`).

source: Improved ``net.box`` performance by up to 70% by rewriting hot code paths in C (:tarantool-release:`2.10.0-beta1`, :tarantool-issue:`6241`).
ru: Переписали на языке C часто используемые участки кода ``net.box``, что улучшило производительность этого модуля в пределах 70% (:tarantool-release:`2.10.0-beta1`, :tarantool-issue:`6241`).

source: Introduced compact tuples that allow saving 4 bytes per tuple in case of small userdata (:tarantool-release:`2.10.0-beta1`, :tarantool-issue:`5385`)
ru: Добавлены компактные кортежи для небольших пользовательских данных. За счёт более коротких полей размера и смещения каждый кортеж занимает на 4 байта меньше (:tarantool-release:`2.10.0-beta1`, :tarantool-issue:`5385`)

source: Now streams and interactive transactions over streams are implemented in iproto. Every stream is associated with its ID, which is unique within one connection. All requests with the same non-zero stream ID belong to the same stream. All requests in the stream are processed synchronously. The next request will not start executing until the previous one is completed. If a request's stream ID is ``0``, it does not belong to any stream and is processed in the old way.
ru: Теперь в протоколе iproto реализованы стримы (streams), где совершаются интерактивные транзакции. У каждого стрима есть идентификатор ID, уникальный внутри соединения. Все запросы с одним и тем же ненулевым ID относятся к одному стриму и обрабатываются синхронно: следующий запрос не начинает выполняться, пока не завершен предыдущий. Запросы с ID, равным ``0``, не привязаны к конкретному стриму и обрабатываются по-старому.

source: In ``net.box``, a stream is an object above the connection that has the same methods but allows executing requests sequentially. The ID is generated on the client side automatically. If a user writes their own connector and wants to use streams, they must transmit the ``stream_id`` over the iproto protocol.
ru: В модуле ``net.box`` стрим (stream) — это объект-обертка вокруг соединения. Он обладает теми же методами, но может выполнять запросы последовательно. ID потока создается на стороне клиента автоматически. Чтобы задействовать стримы с пользовательскими коннекторами, необходимо передавать ``stream_id`` по протоколу iproto.

source: The primary purpose of streams is transactions via iproto. As each stream can start a transaction, several transactions can be multiplexed over one connection. There are multiple ways to begin, commit, and rollback a transaction. One can do that using the appropriate stream methods, ``call``, ``eval``, or ``execute`` with the SQL transaction syntax. Users can mix these methods. For example, one might start a transaction using ``stream:begin()``, and commit it with ``stream:call('box.commit')`` or ``stream:execute('COMMIT')``. If any request fails during the transaction, it will not affect the other requests in the transaction. If a disconnect occurs while there is an active transaction in the stream, that transaction will be rolled back if it hasn't been committed before the connection failure.
ru: Основное предназначение стримов --- выполнение транзакций через протокол iproto. Поскольку каждый стрим может запустить транзакцию, одно соединение способно мультиплексировать несколько транзакций. Начать транзакцию, сделать ее коммит и отменить ее можно, используя с синтаксисом транзакции SQL различные методы стрима: ``call``, ``eval`` или ``execute``. Пользователь может смешивать эти методы. Например, можно начать транзакцию с помощью ``stream:begin()``, а коммит провести, используя ``stream:call('box.commit')`` или ``stream:execute('COMMIT')``. Если какой-либо запрос завершится ошибкой во время транзакции, это не повлияет на остальные запросы. Если во время активной транзакции в стриме произойдет сбой подключения, эта транзакция будет отменена, если она не прошла коммит до сбоя.

source: Added the new ``memtx_allocator`` option to ``box.cfg{}``. It allows selecting an appropriate allocator for memtx tuples if necessary. The possible values are ``system`` for the malloc allocator and ``small`` for the default small allocator.
ru: В ``box.cfg{}`` добавили настройку ``memtx_allocator``. Она позволяет при необходимости выбрать подходящий аллокатор для кортежей memtx. Возможные значения: ``system`` для аллокатора malloc и ``small`` для аллокатора по умолчанию.

source: Implemented the system allocator based on malloc. The slab allocator, which is used for tuple allocation, has a particular disadvantage---it is prone to unresolvable fragmentation on specific workloads (size migration). In this case, the user should be able to choose another allocator. The system allocator is based on the malloc function but restricted by the same quota as the slab allocator. The system allocator does not alloc all the memory at the start. Instead, it allocates memory as needed, checking that the quota is not exceeded (:tarantool-release:`2.10.0-beta1`, :tarantool-issue:`5419`).
ru: Реализован системный аллокатор на основе malloc. У аллокатора slab, который используется для кортежей, есть особый недостаток: он может приводить к неразрешимой фрагментации при определенных рабочих нагрузках (миграция размера). В этом случае пользователю нужна возможность выбрать другой аллокатор. Системный аллокатор основан на функции malloc, но ограничен той же квотой, что и slab-аллокатор. Системный аллокатор не распределяет всю память в начале, а выделяет ее по мере необходимости, проверяя, не превышена ли квота (:tarantool-release:`2.10.0-beta1`, :tarantool-issue:`5419`).

source: Replication
ru: Репликация

source: Introduced the ``box.info.replication[n].downstream.lag`` field to monitor the state of replication. This represents the lag between the moment when the main node writes a certain transaction to its WAL and the moment it receives an ack for this transaction from the replica (:tarantool-release:`2.10.0-beta1`, :tarantool-issue:`5447`).
ru: Добавлено поле ``box.info.replication[n].downstream.lag``, позволяющее отслеживать состояние репликации. Значение этого поля --- временной промежуток между моментом, когда основной узел записывает транзакцию в WAL-файл, и моментом, когда приходит подтверждение для этой транзакции от реплики. (:tarantool-release:`2.10.0-beta1`, :tarantool-issue:`5447`).

source: Introduced ``on_election`` triggers. The triggers can be registered via the ``box.ctl.on_election()`` interface and run asynchronously each time ``box.info.election`` changes (:tarantool-release:`2.10.0-beta1`, :tarantool-issue:`5819`).
ru: Добавлены триггеры ``on_election``. Их можно зарегистрировать через интерфейс ``box.ctl.on_election()`` и запускать асинхронно при каждом изменении ``box.info.election`` (:tarantool-release:`2.10.0-beta1`, :tarantool-issue:`5819`).

source: Introduced support for ``LJ_DUALNUM`` mode in ``luajit-gdb.py`` (:tarantool-release:`2.8.2`, :tarantool-release:`2.7.3`, :tarantool-release:`2.10.0-beta1`, :tarantool-issue:`6224`).
ru: Добавлена поддержка режима ``LJ_DUALNUM`` в файле ``luajit-gdb.py`` (:tarantool-release:`2.8.2`, :tarantool-release:`2.7.3`, :tarantool-release:`2.10.0-beta1`, :tarantool-issue:`6224`).

source: Introduced preliminary support of GNU/Linux ARM64 and MacOS M1 (:tarantool-release:`2.10.0-beta1`). In the scope of this activity, the following issues have been resolved:
ru: Добавлена предварительная поддержка GNU/Linux ARM64 и MacOS M1 (:tarantool-release:`2.10.0-beta1`). При этом были решены следующие проблемы:

source: Introduced support for the full 64-bit range of lightuserdata values (:tarantool-issue:`2712`).
ru: Добавлена поддержка всего 64-битного интервала значений lightuserdata (:tarantool-issue:`2712`).

source: Fixed memory remapping issue when the page left 47-bit segments (:tarantool-issue:`2712`).
ru: Исправлена проблема с переназначением памяти, когда страница оставляла 47-битные сегменты (:tarantool-issue:`2712`).

source: Fixed M1 architecture detection (:tarantool-issue:`6065`).
ru: Исправлено распознавание архитектуры M1 (:tarantool-issue:`6065`).

source: Fixed variadic arguments handling in FFI on M1 (:tarantool-issue:`6066`).
ru: Исправлена обработка переменного количества аргументов в библиотеке FFI для архитектуры M1 (:tarantool-issue:`6066`).

source: Fixed ``table.move`` misbehaviour in case of table reallocation (:tarantool-issue:`6084`).
ru: Исправлено поведение ``table.move`` при реаллокации таблицы (:tarantool-issue:`6084`).

source: Fixed Lua stack inconsistency when ``xpcall`` is called on ARM64 with the invalid second argument (:tarantool-issue:`6093`).
ru: Исправлена несогласованность стека Lua, возникавшая, когда функция ``xpcall`` на ARM64 вызывалась с недопустимым вторым аргументом (:tarantool-issue:`6093`).

source: Fixed ``BC_USETS`` bytecode semantics for closed upvalues and gray strings.
ru: Исправлена семантика байт-кода ``BC_USETS`` для закрытых значений и серых строк.

source: Fixed side exit jump target patching with regard to the range values of a particular instruction (:tarantool-issue:`6098`).
ru: Исправлен патчинг инструкции безусловного перехода (jump) на сторонний выход из трассы с учетом допустимых диапазонов прыжков для архитектуры ARM64. (:tarantool-issue:`6098`).

source: Fixed the issue on ARM64 where the current Lua coroutine wasn't restored on the exception path (:tarantool-issue:`6189`).
ru: Ранее на архитектуре ARM64 текущая Lua-корутина не восстанавливалась на пути исключения. Теперь эта ошибка исправлена (:tarantool-issue:`6189`).

source: Introduced the new method ``table.equals``. It compares two tables by value with respect to the ``__eq`` metamethod (:tarantool-release:`2.8.2`, :tarantool-release:`2.7.3`, :tarantool-release:`2.10.0-beta1`).
ru: Добавлен новый метод ``table.equals``. Он сравнивает значения двух таблиц с помощью метаметода ``__eq`` (:tarantool-release:`2.8.2`, :tarantool-release:`2.7.3`, :tarantool-release:`2.10.0-beta1`).

source: Digest
ru: Модуль digest

source: Introduced new hash types---``xxhash32`` and ``xxhash64``---in the digest module. (:tarantool-release:`2.10.0-beta1`, :tarantool-issue:`2003`).
ru: В модуль digest добавлены новые типы хэш-сумм: ``xxhash32`` и ``xxhash64`` (:tarantool-release:`2.10.0-beta1`, :tarantool-issue:`2003`).

source: Fiber
ru: Модуль fiber

source: Introduced ``fiber_object:info()`` to get info from a fiber. Works as ``require(fiber).info()`` but only for one fiber (:tarantool-release:`2.10.0-beta1`).
ru: Новая функция ``fiber_object:info()`` позволяет получать информацию от файбера. Функция работает аналогично ``require(fiber).info()``, но только для одного файбера (:tarantool-release:`2.10.0-beta1`).

source: Introduced ``fiber_object:csw()`` to get ``csw`` from a fiber. Also, now ``csw`` (Context SWitch) of the new fiber is always equal to zero. Previously, it could be greater than zero (:tarantool-release:`2.10.0-beta1`, :tarantool-issue:`5799`).
ru: Новая функция ``fiber_object:csw()`` позволяет получать от файбера значение ``csw`` (Context SWitch, переключение контекста). Также теперь значение ``csw`` нового файбера всегда равно нулю. Раньше оно могло быть положительным (:tarantool-release:`2.10.0-beta1`, :tarantool-issue:`5799`).

source: Changed ``fiber.info()`` to hide backtraces of idle fibers (:tarantool-release:`2.10.0-beta1`, :tarantool-issue:`4235`).
ru: Изменен вывод функции ``fiber.info()``. Из него исключена обратная трассировка файберов в состоянии idle (:tarantool-release:`2.10.0-beta1`, :tarantool-issue:`4235`).

source: Logging
ru: Запись в журнал

source: The ``log`` module now supports symbolic representation of log levels. Now it is possible to specify levels the same way as in the ``box.cfg{}`` call (:tarantool-release:`2.8.2`, :tarantool-release:`2.10.0-beta1`, :tarantool-issue:`5882`).
ru: Модуль ``log`` теперь поддерживает символьное представление уровней журналирования: можно указывать уровни так же, как при вызове ``box.cfg{}`` (:tarantool-release:`2.8.2`, :tarantool-release:`2.10.0-beta1`, :tarantool-issue:`5882`).

source: For example, instead of
ru: Например, вместо

source: it is possible to use
ru: можно использовать

source: Descriptions of type mismatch error and inconsistent type error have become more informative (:tarantool-release:`2.8.2`, :tarantool-release:`2.7.3`, :tarantool-release:`2.10.0-beta1`, :tarantool-issue:`6176`).
ru: Описание ошибок несоответствия и несовместимости типов стало более информативным (:tarantool-release:`2.8.2`, :tarantool-release:`2.7.3`, :tarantool-release:`2.10.0-beta1`, :tarantool-issue:`6176`).

source: Removed explicit cast from ``BOOLEAN`` to numeric types and vice versa (:tarantool-release:`2.8.2`, :tarantool-release:`2.7.3`, :tarantool-release:`2.10.0-beta1`, :tarantool-issue:`4770`).
ru: Удалено явное приведение ``BOOLEAN`` к числовым типам, а числовых типов --- к значениям ``BOOLEAN`` (:tarantool-release:`2.8.2`, :tarantool-release:`2.7.3`, :tarantool-release:`2.10.0-beta1`, :tarantool-issue:`4770`).

source: Example:
ru: Пример:

source: CAST(FALSE AS INTEGER) was 0 in version 2.8. Now it will cause an error.
ru: В версии 2.8 преобразование CAST(FALSE AS INTEGER) давало результат 0. Теперь оно вызывает ошибку.

source: Removed explicit cast from ``VARBINARY`` to numeric types and vice versa (:tarantool-release:`2.8.2`, :tarantool-release:`2.7.3`, :tarantool-release:`2.10.0-beta1`, :tarantool-issue:`4772`, :tarantool-issue:`5852`).
ru: Удалено явное приведение ``VARBINARY`` к числовым типам, а числовых типов --- к значениям ``VARBINARY`` (:tarantool-release:`2.8.2`, :tarantool-release:`2.7.3`, :tarantool-release:`2.10.0-beta1`, :tarantool-issue:`4772`, :tarantool-issue:`5852`).

source: Fixed a bug where a string that is not ``NULL``-terminated could not be cast to ``BOOLEAN``, even if the conversion would be successful according to the rules (:tarantool-release:`2.8.2`, :tarantool-release:`2.10.0-beta1`, :tarantool-release:`2.7.3`).
ru: Исправлена ошибка, из-за которой строку, не заканчивающуюся ``NULL``, нельзя было перевести в ``BOOLEAN``, даже если по правилам преобразование было бы успешным (:tarantool-release:`2.8.2`, :tarantool-release:`2.10.0-beta1`, :tarantool-release:`2.7.3`).

source: Now a numeric value can be cast to another numeric type only if the cast is precise. In addition, a ``UUID`` value cannot be implicitly cast to ``STRING/VARBINARY``. Also, a ``STRING/VARBINARY`` value cannot be implicitly cast to a ``UUID`` (:tarantool-release:`2.10.0-beta1`, :tarantool-issue:`4470`).
ru: Теперь числовое значение может приводиться к другому числовому типу, только если приведение точное. Кроме того, значение ``UUID`` не может быть неявно преобразовано в ``STRING/VARBINARY``, а ``STRING/VARBINARY`` --- в ``UUID`` (:tarantool-release:`2.10.0-beta1`, :tarantool-issue:`4470`).

source: Now any number can be compared to any other number, and values of any scalar type can be compared to any other value of the same type. A value of a non-numeric scalar type cannot be compared with a value of any other scalar type (:tarantool-release:`2.10.0-beta1`, :tarantool-issue:`4230`).
ru: Теперь любое число можно сравнивать с любым числом, а значения любого скалярного типа --- с любым значением того же типа. Значение нечислового скалярного типа нельзя сравнивать со значениями других скалярных типов (:tarantool-release:`2.10.0-beta1`, :tarantool-issue:`4230`).

source: Removed SQL built-in functions from the ``_func`` system space (:tarantool-release:`2.10.0-beta1`, :tarantool-issue:`6106`).
ru: Из системного спейса ``_func`` удалены встроенные функции SQL (:tarantool-release:`2.10.0-beta1`, :tarantool-issue:`6106`).

source: The function is now looked up first in SQL built-in functions and then in user-defined functions (:tarantool-release:`2.10.0-beta1`).
ru: Функция теперь ищется сначала среди встроенных функций SQL, а затем в пользовательских функциях (:tarantool-release:`2.10.0-beta1`).

source: Fixed incorrect error message in case of misuse of the function setting the default value (:tarantool-release:`2.10.0-beta1`).
ru: Когда неправильно используется функция, устанавливающая значение по умолчанию, появляется сообщение об ошибке. Теперь оно исправлено (:tarantool-release:`2.10.0-beta1`).

source: The ``TYPEOF()`` function with ``NULL`` as an argument now returns ``NULL`` if the type cannot be determined from context. (:tarantool-release:`2.10.0-beta1`, :tarantool-issue:`5956`).
ru: Если функции ``TYPEOF()`` передано значение ``NULL`` и она не может определить тип из контекста, то она возвращает ``NULL`` (:tarantool-release:`2.10.0-beta1`, :tarantool-issue:`5956`).

source: Also, ``TYPEOF(-NaN)`` will now return ``DOUBLE``, and ``TYPEOF(map_column)`` will now return ``VARBINARY`` instead of ``map``.
ru: Также ``TYPEOF(-NaN)`` теперь возвращает ``DOUBLE``, а ``TYPEOF(map_column)`` --- ``VARBINARY``, а не ``map``, как раньше.

source: SELECT TYPEOF(NULL); was BOOLEAN in version 2.8. Now it will be NULL.
ru: В версии 2.8 результат запроса ``SELECT TYPEOF(NULL);`` был ``BOOLEAN``. Теперь он будет ``NULL``.

source: Reworked the ``SCALAR`` and ``NUMBER`` types in SQL. Removed the implicit cast from ``SCALAR`` to any other scalar type. Also, removed the implicit cast from ``NUMBER`` values to any other numeric type. It means that arithmetic and bitwise operations and concatenation are no longer allowed for ``SCALAR`` and ``NUMBER`` values. In addition, any ``SCALAR`` value can now be compared with values of any other scalar type using the ``SCALAR`` rules (:tarantool-release:`2.10.0-beta1`, :tarantool-issue:`6221`).
ru: В SQL переработаны типы ``SCALAR`` и ``NUMBER``. Удалено неявное приведение значений ``SCALAR`` к другим скалярным типам, а значений ``NUMBER`` — к другим числовым типам. Это означает, что для значений ``SCALAR`` и ``NUMBER`` больше не разрешены ни арифметические, ни побитовые операции, а также не поддерживается конкатенация. Кроме того, любое значение ``SCALAR`` теперь можно сравнивать по правилам этого типа со значениями любого другого скалярного типа (:tarantool-release:`2.10.0-beta1`, :tarantool-issue:`6221`).

source: The field type ``DECIMAL`` is now available in SQL. Added an implicit cast from ``INTEGER`` and ``DOUBLE`` to ``DECIMAL`` and vice versa. ``DECIMAL`` can participate in arithmetic operations and comparisons with other defined numeric types (:tarantool-release:`2.10.0-beta1`, :tarantool-issue:`4415`).
ru: Теперь в SQL есть поля типа ``DECIMAL``. Добавлено неявное преобразование как из ``INTEGER`` и ``DOUBLE`` в ``DECIMAL``, так и в обратном направлении. Значения типа ``DECIMAL`` можно использовать в арифметических операциях и сравнениях вместе со значениями других определенных числовых типов (:tarantool-release:`2.10.0-beta1`, :tarantool-issue:`4415`).
