Repository: tarantool/doc
Catalog: locale/*/LC_MESSAGES/release/legacy-policy.po
Languages: ru

source: A Tarantool release is identified by three digits, for example, 2.6.2 or 1.10.9:
ru: Версия Tarantool состоит из трех чисел, например 2.6.2 или 1.10.9:

source: The first digit stands for a MAJOR release series that introduces some *major changes*. Up to now, there has been only one major release jump when we delivered the 2.x release series with the SQL support.
ru: Первое число обозначает серию ОСНОВНЫХ версий, в которой вводятся некоторые *значительные изменения*. Пока был только один переход на новую серию, когда мы выпустили серию 2.x с поддержкой SQL.

source: The second digit stands for a MINOR release series that is used for introducing new *features*. :ref:`Backward incompatible changes <backward-incompatible>` are possible between these release series.
ru: Второе число обозначает серию ПРОМЕЖУТОЧНЫХ версий, которые используются для введения новых *функций*. Эти версии могут быть :ref:`обратно несовместимы <backward-incompatible>` между собой.

source: The third digit is for PATCH releases by which we reflect how stable the MINOR release series is:
ru: Третье число используется для обозначения ПАТЧ-версий, которые отражают стабильность ПРОМЕЖУТОЧНЫХ версий:

source: ``0`` meaning **alpha**
ru: ``0`` — **альфа**

source: ``1`` meaning **beta**
ru: ``1`` — **бета**

source: ``2`` and above meaning **release** (earlier known as **stable**).
ru: ``2`` и выше — **релизная версия** (раньше называлась **стабильная**).

source: So, each MINOR release series goes through a development-maturity life cycle as follows:
ru: Таким образом, разработка каждой ПРОМЕЖУТОЧНОЙ версии проходит жизненный цикл следующим образом:

source: **Alpha**. Once a quarter, we start off with a new alpha version, such as 2.3.0, 2.4.0, and so on. This is not what an alpha release usually means in the typical software release life cycle but rather the current trunk version which is under heavy development and can be unstable. The current alpha version always lives in the master branch.
ru: **Альфа-версия**. Раз в квартал мы начинаем разработку новой альфа-версии, например 2.3.0, 2.4.0 и так далее. Это не совсем альфа-версия, как в типичном жизненном цикле выпуска программного обеспечения, а скорее текущая основная версия, которая находится в процессе интенсивной разработки и может быть нестабильной. Текущая альфа-версия всегда живет в основной ветви разработки.

source: **Beta**. When all the features planned are implemented, we fork a new branch from the master branch and tag it as a new beta version. It contains ``1`` for the PATCH digit, e.g., 2.3.1, 2.4.1, and so on. This version cannot be called stable yet (feature freeze has just been done) although there are no known critical regressions in it since the last stable release.
ru: **Бета-версия**. Когда все запланированные функции реализованы, мы отделяем новую ветвь от основной и помечаем ее как новую бета-версию с ``1`` в конце для обозначения ПАТЧА, например, 2.3.1, 2.4.1 и так далее. Эту версию пока нельзя назвать стабильной (только что перестали добавлять функциональные возможности), хотя с момента последнего стабильного выпуска в ней нет известных критических регрессионных ошибок.

source: **Release** (earlier known as **stable**). Finally, after we see our beta version runs successfully in a production or development environment during another quarter while we fix incoming bugs, we declare this version stable. It is tagged with ``2`` for the PATCH digit, e.g., 2.3.2, 2.4.2, and so on.
ru: **Релизная версия** (раньше называлась **стабильная**). Когда мы видим, что бета-версия успешно работает в течение еще одного квартала в рабочей среде или в среде разработки, пока мы исправляем обнаруженные ошибки, мы объявляем эту версию стабильной. ПАТЧ помечается цифрой ``2``, например, 2.3.2, 2.4.2 и так далее.

source: We support such version for 3 months while making another stable release by fixing all bugs found. We release it in a quarter. This last tag contains ``3`` for the PATCH digit, e.g., 2.3.3, 2.4.3, and so on. After the tag is set, no new changes are allowed to the release branch, and it is declared deprecated and superseded by a newer MINOR version.
ru: Мы поддерживаем такую версию в течение 3 месяцев, параллельно работая над еще одной стабильной версией, в которой исправляем все найденные ошибки. Через три месяца мы выпускаем ее, обозначая ПАТЧ цифрой ``3``, например, 2.3.3, 2.4.3 и так далее. После установки этого тега никакие новые изменения в релизную ветвь не вносим, объявляем ее устаревшей и заменяем ее новой ПРОМЕЖУТОЧНОЙ версией.

source: Release versions don't receive any new features and only get backward compatible fixes.
ru: В релизные версии мы не добавляем никакие новые функциональные возможности, а только обратно совместимые исправления.

source: Like Ubuntu, in terms of support, we distinguish between two kinds of stable release series:
ru: Как в Ubuntu, у нас есть две категории стабильных версий в плане поддержки:

source: **LTS (Long Term Support)** is a release series that is supported for 3 years (community) and up to 5 years (paying customers). Current LTS release series is 1.10, and it receives only PATCH level releases.
ru: **LTS-версии (долгосрочная поддержка, long term support)** — это выпуски, которые поддерживаются 3 года для сообщества и 5 лет для платящих клиентов. Текущая серия LTS-версий — 1.10, для нее выпускаются только версии уровня ПАТЧ.

source: **Standard** is a release series that is supported only for a few months until the next release series enters the stable state.
ru: **Обычные версии** — это серия выпусков, которая поддерживается только в течение нескольких месяцев до выхода следующей стабильной серии.

source: Below is a diagram that illustrates the release sequence issuing described above by an example of some latest releases and release series:
ru: Ниже представлена схема, которая иллюстрирует вышеописанную последовательность выпуска версий на примере некоторых последних версий и серий:

source: 1.10 series -- 1.10.4 -- 1.10.5 -- 1.10.6 -- 1.10.7 (LTS) .... 2.2 series --- 2.2.1 --- 2.2.2 --- 2.2.3 (end of support) | V 2.3 series ... 2.3.0 --- 2.3.1 --- 2.3.2 --- 2.3.3 (end of support) | V 2.4 series ............. 2.4.0 --- 2.4.1 --- 2.4.2 | V 2.5 series ....................... 2.5.0 --- 2.5.1 | V 2.6 series ................................. 2.6.0 -----------------|---------|---------|---------|------> (time) 1/4 yr. 1/4 yr. 1/4 yr.
ru: серия 1.10 -- 1.10.4 -- 1.10.5 -- 1.10.6 -- 1.10.7 (LTS) .... серия 2.2 --- 2.2.1 --- 2.2.2 --- 2.2.3 (окончание поддержки) | V серия 2.3 ... 2.3.0 --- 2.3.1 --- 2.3.2 --- 2.3.3 (окончание поддержки) | V серия 2.4 ............. 2.4.0 --- 2.4.1 --- 2.4.2 | V серия 2.5 ....................... 2.5.0 --- 2.5.1 | V серия 2.6 ................................. 2.6.0 -----------------|---------|---------|---------|------> (время) 1/4 г. 1/4 г. 1/4 г.

source: *Support* means that we continue fixing bugs. We add bug fixes simultaneously into the following release series: LTS, last stable, beta, and alpha. If we look at the release diagram above, it means that the bug fixes are to be added into 1.10, 2.4, 2.5, and 2.6 release series.
ru: *Поддержка* означает, что мы продолжаем исправлять ошибки. Мы также добавляем исправления ошибок в следующие серии версий: LTS, последнюю стабильную, бета и альфа. Если посмотреть на схему выпуска версий выше, — это означает, что исправления ошибок будут добавлены в серии 1.10, 2.4, 2.5 и 2.6.

source: To sum it up, once a quarter we release (see the release diagram above for reference):
ru: Итак, раз в квартал выходят (см. вышеприведенную схему выпуска версий):

source: next LTS release, e.g., 1.10.9
ru: очередная LTS-версия, например 1.10.9

source: two stable releases, e.g., 2.5.3 and 2.6.2
ru: две стабильные версии, например 2.5.3 и 2.6.2

source: beta version of the next release series, e.g., 2.7.1.
ru: бета-версия следующей серии, например 2.7.1.

source: In all supported releases, when we find and fix an outstanding CVE/vulnerability, we deliver a patch for that but do not tag a new PATCH level version. Users will be informed about such critical patches via the official Tarantool news channel (`tarantool_news <https://t.me/tarantool_news>`_).
ru: Когда мы находим и исправляем известную уязвимость (CVE) в любой поддерживаемой версии, мы выпускаем для этого патч, но не проставляем тег уровня ПАТЧ. Пользователи узнают о таких критических патчах из официального новостного канала Tarantool (`tarantool_news <https://t.me/tarantool_news>`_).

source: We also publish nightly builds, and use the fourth slot in the version identifier to designate the nightly build number.
ru: Мы также публикуем ночные сборки и используем четвертый слот в идентификаторе версии для обозначения номера ночной сборки.

source: A release series may introduce backward incompatible changes in a sense that existing Lua, SQL or C code that are run on a current release series may not be run with the same effect on a future series. However, we don't exploit this rule and don't make incompatible changes without appropriate reason. We usually deliver information how mature a functionality is via release notes.
ru: В новой серии релизов могут быть обратно несовместимые изменения — это значит, что код на Lua, SQL или C, выполняемый в текущей серии версий, может не выполняться в следующей серии версий. Тем не менее, мы не злоупотребляем этим правилом и не вносим несовместимые изменения без причины. Обычно мы предоставляем информацию о том, насколько сформирована функциональность, в примечаниях к версии.

source: Please note that binary data layout is always compatible with the previous series as well as with the LTS series (an instance of ``X.Y`` version can be started on top of ``X.(Y+1)`` or ``1.10.z`` data); binary protocol is compatible too (client-server as well as replication protocol).
ru: Обратите внимание, что структура бинарных данных всегда совместима с предыдущими сериями, а также с сериями LTS (экземпляр версии ``X.Y`` может быть запущен на основе данных ``X.(Y+1)`` или ``1.10.z``). Бинарный протокол также обратно совместим (как клиент-серверный протокол, так и протокол репликации).
