Repository: tarantool/doc
Catalog: locale/*/LC_MESSAGES/release/major-features.po
Languages: ru

source: Major features
ru: Основные изменения

source: Every released version of Tarantool brings some notable features and fixes, which are all listed in the :doc:`release notes </release/index>`.
ru: С каждым выпуском очередной версии Tarantool мы добавляем новые функции и исправления ошибок. Полные списки изменений для каждой версии можно найти в :doc:`примечаниях к версиям </release/index>`. В этой таблице перечислены наиболее значимые изменения с номерами версий, в которых они были добавлены.

source: Since version
ru: Номер версии

source: Feature
ru: Характеристика

source: :ref:`Multiple iproto threads <cfg_networking-iproto_threads>` (:tarantool-issue:`5645`)
ru: :ref:`Возможность запускать несколько потоков IPROTO <cfg_networking-iproto_threads>` (:tarantool-issue:`5645`)

source: Set :doc:`box.cfg </reference/reference_lua/box_cfg>` options with environment variables (:tarantool-issue:`5602`)
ru: Возможность задавать параметры вложенного модуля :doc:`box.cfg </reference/reference_lua/box_cfg>` с помощью переменных окружения (:tarantool-issue:`5602`)

source: Friendly :ref:`LuaJIT memory profiler report <profiler_analysis>` (:tarantool-issue:`5811`)
ru: Удобный для чтения :ref:`отчет профилировщика памяти LuaJIT<profiler_analysis>` (:tarantool-issue:`5811`)

source: ``--leak-only`` LuaJIT memory profiler option (:tarantool-issue:`5812`)
ru: Параметр ``--leak-only`` парсера профилировщика памяти LuaJIT (:tarantool-issue:`5812`)

source: :ref:`LuaJIT memory profiler <luajit_memprof>` (:tarantool-issue:`5442`)
ru: :ref:`Профилировщик памяти LuaJIT <luajit_memprof>` (:tarantool-issue:`5442`)

source: SQL :doc:`ALTER TABLE ADD COLUMN </reference/reference_sql/sql_statements_and_clauses>` statement support for empty tables (:tarantool-issue:`2349`, :tarantool-issue:`3075`)
ru: Поддержка инструкции SQL :doc:`ALTER TABLE ADD COLUMN </reference/reference_sql/sql_statements_and_clauses>` для пустых таблиц (:tarantool-issue:`2349`, :tarantool-issue:`3075`)

source: The concept of WAL queue (:tarantool-issue:`5536`)
ru: Очередь упреждающей журнализации (:tarantool-issue:`5536`)

source: :doc:`box.ctl.promote() </reference/reference_lua/box_ctl/promote>` and the concept of manual elections (:tarantool-issue:`3055`)
ru: Функция :doc:`box.ctl.promote() </reference/reference_lua/box_ctl/promote>` и финализация выборов вручную (:tarantool-issue:`3055`)

source: :ref:`LuaJIT platform metrics <metrics-luajit>` (:tarantool-issue:`5187`)
ru: :ref:`Метрики платформы LuaJIT <metrics-luajit>` (:tarantool-issue:`5187`)

source: :ref:`Automated leader election <repl_leader_elect>` based on Raft algorithm (:tarantool-issue:`1146`)
ru: :ref:`Автоматические выборы лидера <repl_leader_elect>` на основе алгоритма Raft (:tarantool-issue:`1146`)

source: :ref:`Transactional manager <atomic-transactional-manager>` for memtx engine (:tarantool-issue:`4897`)
ru: :ref:`Менеджер транзакций <atomic-transactional-manager>` для движка memtx (:tarantool-issue:`4897`)

source: Expression evaluation for :ref:`replication_synchro_quorum <cfg_replication-replication_synchro_quorum>` (:tarantool-issue:`5446`)
ru: Возможность задать :ref:`replication_synchro_quorum <cfg_replication-replication_synchro_quorum>` в виде символьного выражения (:tarantool-issue:`5446`)

source: :doc:`box.ctl.is_recovery_finished() </reference/reference_lua/box_ctl/is_recovery_finished>` for memtx engine (:tarantool-issue:`5187`)
ru: Функция :doc:`box.ctl.is_recovery_finished() </reference/reference_lua/box_ctl/is_recovery_finished>` для движка memtx (:tarantool-issue:`5187`)

source: :ref:`Synchronous replication <repl_sync>` (beta) (:tarantool-issue:`4842`)
ru: :ref:`Синхронная репликация <repl_sync>` (бета) (:tarantool-issue:`4842`)

source: Allow an :doc:`anonymous replica </reference/reference_lua/box_info/replication_anon>` to follow another anonymous replica (:tarantool-issue:`4696`)
ru: Репликация данных между :doc:`анонимными репликами </reference/reference_lua/box_info/replication_anon>` (:tarantool-issue:`4696`)

source: :doc:`popen </reference/reference_lua/popen>` built-in module (:tarantool-issue:`4031`)
ru: Встроенный модуль :doc:`popen </reference/reference_lua/popen>` (:tarantool-issue:`4031`)

source: Ability to create :doc:`custom error types </reference/reference_lua/box_error/custom_type>` (:tarantool-issue:`4398`)
ru: Возможность создавать :doc:`пользовательские типы ошибок </reference/reference_lua/box_error/custom_type>` (:tarantool-issue:`4398`)

source: :doc:`Transparent marshalling </reference/reference_lua/box_error/new>` through ``net.box`` (:tarantool-issue:`4398`)
ru: :doc:`Прозрачный маршалинг ошибок </reference/reference_lua/box_error/new>` с помощью ``net.box`` (:tarantool-issue:`4398`)

source: :doc:`Stacked diagnostic area </reference/reference_lua/box_error/error_object>` (:tarantool-issue:`1148`)
ru: :doc:`Списки ошибок </reference/reference_lua/box_error/error_object>` (:tarantool-issue:`1148`)

source: :doc:`Field name and JSON path updates </reference/reference_lua/json_paths>` (:tarantool-issue:`1261`)
ru: :doc:`Обновление по имени поля и с помощью JSON-пути </reference/reference_lua/json_paths>` (:tarantool-issue:`1261`)

source: :ref:`Anonymous replica <cfg_replication-replication_anon>` type (:tarantool-issue:`3186`)
ru: :ref:`Анонимные реплики <cfg_replication-replication_anon>` (:tarantool-issue:`3186`)

source: :doc:`DOUBLE </reference/reference_sql/sql_user_guide>` type in SQL (:tarantool-issue:`3812`)
ru: Тип :doc:`DOUBLE </reference/reference_sql/sql_user_guide>` в SQL (:tarantool-issue:`3812`)

source: Support of :ref:`decimals <index-box_data-types>` in spaces, ``decimal`` field type (:tarantool-issue:`4333`)
ru: Поддержка типа данных :ref:`decimal <index-box_data-types>` в спейсах, тип поля ``decimal`` (:tarantool-issue:`4333`)

source: :ref:`fiber.top() <fiber-top>` function in Lua (:tarantool-issue:`2694`)
ru: Функция :ref:`fiber.top() <fiber-top>` в Lua (:tarantool-issue:`2694`)

source: Feed data from memory during replica initial join (:tarantool-issue:`1271`)
ru: Чтение данных из памяти при первом подключении реплики (:tarantool-issue:`1271`)

source: SQL prepared statements support and cache (:tarantool-issue:`2592`, :tarantool-issue:`3292`)
ru: Поддержка и кэширование подготовленных инструкций SQL (:tarantool-issue:`2592`, :tarantool-issue:`3292`)

source: :doc:`_session_settings </reference/reference_lua/box_space/_session_settings>` service space (:tarantool-issue:`4511`)
ru: Системный спейс :doc:`_session_settings </reference/reference_lua/box_space/_session_settings>` (:tarantool-issue:`4511`)
