Repository: tarantool/doc
Catalog: locale/*/LC_MESSAGES/release/policy.po
Languages: ru

source: Summary
ru: Введение

source: The Tarantool release policy is changing to become more clear and intuitive. The new policy uses a `SemVer-like <https://semver.org/>`__ versioning format, and introduces a new version lifecycle with more long-time support series. This document explains the new release policy, versioning rules, and :term:`release series` lifecycle.
ru: Релизная политика Tarantool меняется, чтобы стать более понятной. Вводится новый формат версионирования, похожий на `семантическое версионирование (SemVer) <https://semver.org/lang/ru/>`__, а также новый жизненный цикл версий, предполагающий больше серий с долгосрочной поддержкой. В этом документе подробно рассказано о новой релизной политике, правилах версионирования и жизненном цикле :term:`релизных серий <release series>`.

source: The new release policy replaces :doc:`the legacy policy </release/legacy-policy>` for:
ru: Новая релизная политика заменяет :doc:`старую </release/legacy-policy>` для следующих серий:

source: The ``2.x.y`` series since the ``2.10.0`` release. Development for this new release starts with version ``2.10.0-beta1``.
ru: ``2.x.y``, начиная с ``2.10.0``. Первая версия в этой серии --- ``2.10.0-beta1``.

source: The future ``3.0.0`` series.
ru: В будущем --- ``3.0.0``.

source: Here are the most significant changes from the legacy release policy:
ru: Вот самые важные нововведения:

source: The third number in the version label doesn't distinguish between pre-release (alpha and beta) and release versions. Instead, it is used for patch (bugfix-only) releases. Pre-release versions have suffixes, like ``3.0.0-alpha1``.
ru: Третья часть номера версии больше не указывает на тип версии (альфа-, бета- или релизная). Если это число отлично от нуля, то версия является патчем и содержит только исправление ошибок. На конце номеров предварительных версий теперь есть соответствующие суффиксы, например: ``3.0.0-alpha1``.

source: In the legacy release policy, ``1.10`` was a long-term support (LTS) series, while ``2.x.y`` had stable releases, but wasn't an LTS series. Now both series are long-term supported.
ru: Согласно старой релизной политике ``1.10`` была серией с долгосрочной поддержкой (long-term support, LTS), а серия ``2.x.y`` — нет, хоть и содержала стабильные релизы. Теперь долгосрочной поддержкой пользуются обе серии.

source: The topics below describe the new versioning policy in more detail.
ru: Ниже вы найдете подробные сведения о новой политике версионирования.

source: Versioning policy
ru: Политика версионирования

source: Release series and versions
ru: Релизные серии и версии

source: The new Tarantool release policy is based on having several release series, each with its own lifecycle, pre-release and release versions.
ru: В основе новой релизной политики Tarantool лежит поддержка нескольких релизных серий. У каждой серии свой жизненный цикл, и в нее входят как предварительные, так и релизные версии.

source: Release series
ru: Что такое релизная серия?

source: Release series is a sequence of development and production-ready versions with linear evolution toward a defined roadmap. A series has a distinct lifecycle and certain compatibility guarantees within itself and with other series. The intended support time for each series is at least two years since the first release.
ru: Релизная серия — это ряд версий для разработки и производственной эксплуатации. Эта последовательность версий линейно развивается по определенному плану. У каждой серии свой жизненный цикл, а версии в ней обладают некоторой гарантией совместимости друг с другом и с версиями других серий. Срок поддержки каждой серии — минимум два года с выхода первого релиза.

source: At the moment when this document is published, there are two release series: series ``1.10`` and series ``2``.
ru: На момент публикации этого документа существует две релизных серии Tarantool: ``1.10`` и ``2``.

source: Release version
ru: Что такое релизная версия?

source: Release version is a Tarantool distribution which is thoroughly tested and ready for production usage. It is bound to a certain commit. Release version label consists of three numbers:
ru: Релизная версия, или релиз — это тщательно протестированный и готовый к производственной эксплуатации дистрибутив Tarantool, привязанный к определенному коммиту. Номер релиза состоит из трех частей:

source: These numbers correspond to the three types of release versions:
ru: Каждое число соответствует одному из трех типов релизных версий, о чем подробно рассказано ниже.

source: Major release
ru: Мажорный релиз

source: Major release is the first :term:`release version <release version>` of its own :term:`release series <release series>`. It introduces new features and can have a few backward-incompatible changes. Such release changes the first version number:
ru: Мажорная релизная версия — это первый :term:`релиз <release version>` в своей :term:`релизной серии <release series>`. Релиз включает в себя новую функциональность и может нарушать обратную совместимость с прежними версиями. Каждый следующий мажорный релиз получает номер, в котором изменено первое число:

source: Minor release
ru: Минорный релиз

source: Minor release introduces a few new features, but guarantees backward compatibility. There can be a few bugs fixed as well. Such release changes the second version number:
ru: В минорном релизе могут вводиться новые функциональные возможности. Тем не менее он гарантированно будет совместим с более ранними версиями серии. Могут быть также исправлены ошибки. Каждый следующий минорный релиз получает номер, в котором изменено второе число:

source: Patch release
ru: Патч

source: Patch release fixes bugs from an earlier release, but doesn't introduce new features. Such release changes the third version number:
ru: Патч (patch release) исправляет ошибки предыдущих версий, но не добавляет новую функциональность. Каждый следующий патч получает номер, в котором изменено третье число:

source: Release versions conform to a set of requirements:
ru: Релизы отвечают ряду требований:

source: The release has gone through pre-release testing and adoption in the internal projects until there were no doubts regarding its stability.
ru: Каждый релиз предварительно тестировался и обкатывался во внутренних проектах, пока не исчезли все сомнения в его стабильности.

source: There are no known bugs in the typical usage scenarios.
ru: Исправлены все обнаруженные ошибки в стандартных сценариях использования.

source: There are no degradations from the previous release or release series, in case of a major release.
ru: Нет регрессии, то есть нет новых ошибок в функциональности из прошлых релизов. В случае мажорного релиза, нет регрессии в функциональности из предыдущей серии.

source: Pre-release versions
ru: Предварительные версии

source: Pre-release version
ru: Что такое предварительная версия?

source: Pre-release versions are the ones published for testing and evaluation, and not intended for production use. Such versions use the same pattern with an additional suffix:
ru: Предварительными называются версии, опубликованные для тестирования и обкатки, но не предназначенные для производственной эксплуатации. Эти версии нумеруются по тому же принципу, что и релизы, но имеют суффикс:

source: There are a few types of pre-release versions:
ru: Ниже подробно рассказывается о четырех типах предварительных версий.

source: Development build
ru: Dev-сборка

source: Development builds reflect the state of current development process. They're used entirely for development and testing, and not intended for any external use.
ru: Dev-сборка (development build) отражает определенный этап разработки продукта. Такие сборки используются только в процессе разработки и внутреннего тестирования.

source: Development builds have suffixes made with ``$(git describe --always --long)-dev``:
ru: Dev-сборки обозначаются суффиксом, полученным командой ``$(git describe --always --long)-dev``:

source: Alpha version
ru: Альфа-версия

source: Alpha version has some of the features planned in the release series. It can be incomplete or unstable, and can break the backwards compatibility with the previous release series.
ru: В альфа-версию (alpha version) включена часть функциональных возможностей, запланированных в релизной серии. Альфа-версия может быть неполной или нестабильной, а также не обладать обратной совместимостью с предыдущей серией.

source: Alpha versions are published for early adopters and developers of dependent components, such as connectors and modules.
ru: Альфа-версии предназначены для пользователей, готовых попробовать новую серию на раннем этапе, а также для тех, кто разрабатывает зависимые компоненты — коннекторы и модули.

source: Beta version
ru: Бета-версия

source: Beta version has all the features which are planned for the release series. It is a good choice to start developing a new application.
ru: В бета-версию (beta version) включены все функциональные возможности, запланированные в релизной серии. Бета-версия подходит, чтобы начать разработку нового приложения.

source: Readiness of a feature can be checked in a beta version to decide whether to remove the feature, finish it later, or replace it with something else. A beta version can still have a known bug in the new functionality, or a known degradation since the previous release series that affects a common use case.
ru: Бета-версия позволяет проверить, насколько готова к выпуску та или иная функциональная возможность. На основании этого принимается решение, доработать ли эту возможность, удалить или заменить. Бета-версия может содержать известные ошибки новой функциональности, а также регрессионные ошибки в распространенных сценариях использования.

source: Release candidate
ru: Релиз-кандидат

source: Release candidate is used to fix bugs, mature the functionality, and collect feedback before an upcoming release. Release candidate has the same feature set as the preceding beta version and doesn't have known bugs in typical usage scenarios or degradations from the previous release series.
ru: В релиз-кандидате (release candidate, RC) исправляются ошибки и совершенствуется функциональность. Он также помогает собирать отзывы перед публикацией релиза. Набор функциональных возможностей в релиз-кандидате такой же, как в бета-версии. Известные ошибки в типичных сценариях использования устранены, регрессионных ошибок нет.

source: Release candidate is a good choice to set up a staging server.
ru: Релиз-кандидат подходит для использования в предпроизводственной среде (staging).

source: Release series lifecycle
ru: Жизненный цикл релизной серии

source: Every release series goes through the following stages:
ru: Каждая релизная серия проходит три стадии:

source: Early development
ru: Ранняя разработка

source: The early development stage goes on until the first :term:`major release <major release>`. Alpha, beta, and release candidate versions are published at this stage.
ru: Стадия ранней разработки (early development) продолжается до выхода :term:`мажорного релиза <major release>`. На этой стадии публикуются альфа- и бета-версии, а также релиз-кандидаты.

source: The stage splits into two phases:
ru: Стадия разделена на два этапа:

source: Development of a new functionality through alpha and beta versions. Features can be added and, sometimes, removed in this phase.
ru: Разработка и проверка новой функциональности в альфа- и бета-версиях. На этом этапе функциональные возможности могут добавляться и в некоторых случаях удаляться.

source: Stabilization starts with the first release candidate version. Feature set doesn't change in this phase.
ru: Стабилизация. С момента выхода первого релиз-кандидата набор функциональных возможностей не меняется.

source: Support
ru: Поддержка

source: The stage starts when the first release is published. The release series now is an object of only backward compatible changes.
ru: Эта стадия начинается, когда выходит первый релиз. Теперь в релизной серии могут появляться только изменения, не нарушающие обратную совместимость.

source: At this stage, all known security problems and all found degradations since the previous series are being fixed.
ru: На этой стадии устраняются известные проблемы безопасности и исправляются регрессионные ошибки, возникшие в серии.

source: The series receives degradation fixes and other bugfixes during the support stage and until the series transitions into the end of life (EOL) stage.
ru: Патчи для регрессионных и других ошибок выпускаются, пока серия не перейдет со стадии поддержки на стадию прекращения поддержки (end of life, EOL).

source: The decision of whether to fix a particular problem in a particular release series depends on the impact of the problem, risks around backward compatibility, and the complexity of backporting a fix.
ru: Решение о том, исправить ли конкретную ошибку в релизной серии, принимается в зависимости от того, насколько проблема серьезна, сложно ли будет ее устранить в предыдущих версиях и нарушит ли исправление обратную совместимость.

source: The release series might receive new features at this stage, but only in a backward compatible manner. Also, a release candidate may be published to collect feedback before the release version.
ru: На этой стадии в релизной серии могут выпускаться новые функциональные возможности, но все они будут обратно совместимы с предыдущими версиями. Кроме того, может быть выпущен релиз-кандидат, чтобы собрать отзывы пользователей перед выходом релиза.

source: During the support period a release series receives new versions of supported Linux distributives to build infrastructure.
ru: В течение периода поддержки в релизной серии выпускаются обновления для новых версий дистрибутивов Linux.

source: The intended duration of the support period for each series is at least two years.
ru: Срок поддержки для каждой серии — как минимум два года.

source: End of life
ru: Прекращение поддержки

source: A series reaches the end of life (EOL) when the last release in the series is published. The series will not receive updates anymore.
ru: Стадия прекращения поддержки (end of life, EOL) для серии наступает, когда опубликован последний релиз в этой серии. После этого серия прекращает обновляться.

source: In modules, connectors and tools, we don't guarantee support of any release series that reaches EOL.
ru: Для серий, достигших этой стадии, поддержка не гарантируется. Скорее всего, для них не будут выходить обновления, связанные с работой модулей, коннекторов и инструментов.

source: A release series cannot reach EOL until the vast majority of production environments, for which we have commitments and SLAs, is updated to a newer series.
ru: Стадия прекращения поддержки для релизной серии может наступить только тогда, когда большинство производственных сред, с которыми Tarantool работает по SLA и другим соглашениям, обновится до более новой серии.

source: Versions per lifecycle stage
ru: Версии по стадиям жизненного цикла

source: Stage
ru: Стадия

source: Version types
ru: Типы версий

source: Examples
ru: Примеры

source: Alpha, beta, release candidate
ru: Альфа, бета, релиз-кандидат

source: Release candidate, release
ru: Релиз-кандидат, релиз

source: Example of a release series
ru: Пример релизной серии

source: A release series in an early development stage can have the following version sequence:
ru: На стадии ранней разработки последовательность версий в релизной серии может быть такой:

source: 3.0.0-alpha1 3.0.0-alpha2 ... 3.0.0-alpha7 3.0.0-beta1 ... 3.0.0-beta5 3.0.0-rc1 ... 3.0.0-rc4 3.0.0 (release)
ru: 3.0.0-alpha1 3.0.0-alpha2 ... 3.0.0-alpha7 3.0.0-beta1 ... 3.0.0-beta5 3.0.0-rc1 ... 3.0.0-rc4 3.0.0 (релиз)

source: Since the first release version, the series comes into a support stage. Then it can proceed with a version sequence like the following:
ru: Как только выпущен первый релиз, серия переходит на стадию поддержки. Дальнейшие версии могут быть опубликованы в такой последовательности:

source: 3.0.0 (release of a new major version) 3.0.1-rc1 ... 3.0.1-rc4 3.0.1 (release with some bugs fixed but no new features) 3.1.0-rc1 ... 3.1.0-rc6 3.1.0 (release with new features and, possibly, extra fixed bugs)
ru: 3.0.0 (релиз новой основной версии) 3.0.1-rc1 ... 3.0.1-rc4 3.0.1 (релиз с исправлением ошибок, но без функциональных изменений) 3.1.0-rc1 ... 3.1.0-rc6 3.1.0 (релиз с новыми функциональными возможностями и, вероятно, дополнительными исправлениями)

source: Eventually, the support stage stops and the release series comes to the end of life (EOL) stage. No new versions are released since then.
ru: Со временем стадия поддержки подходит к концу, и релизная серия выходит на стадию прекращения поддержки (end of life, EOL). С этого момента новые версии не выпускаются.
