Repository: tarantool/doc
Catalog: locale/*/LC_MESSAGES/book/app_server/luajit_memprof.po
Languages: ru

source: LuaJIT memory profiler
ru: Профилировщик памяти LuaJIT

source: Starting from version :doc:`2.7.1 </release/2.7.1>`, Tarantool has a built‑in module called ``misc.memprof`` that implements a LuaJIT memory profiler (which we will just call *the profiler* in this section). The profiler provides a memory allocation report that helps analyze Lua code and find the places that put the most pressure on the Lua garbage collector (GC).
ru: В Tarantool, начиная с версии :doc:`2.7.1 </release/2.7.1>`, есть встроенный модуль ``misc.memprof``, реализующий профилировщик памяти LuaJIT (далее в разделе — *профилировщик*). Профилировщик предоставляет отчет об аллокации памяти, который помогает проанализовать Lua-код и выявить области наибольшей нагрузки на сборщик мусора на Lua.

source: Working with the profiler
ru: Использование профилировщика

source: Usage of the profiler involves two steps:
ru: Работа с профилировщиком состоит из двух этапов:

source: :ref:`Collecting <profiler_usage_get>` a binary profile of allocations, reallocations, and deallocations in memory related to Lua (further, *binary memory profile* or *binary profile* for short).
ru: События аллокации, реаллокации и деаллокации в Lua :ref:`собираются <profiler_usage_get>` в бинарный профиль (далее по тексту — *бинарный профиль памяти* или просто *бинарный профиль*).

source: :ref:`Parsing <profiler_usage_parse>` the collected binary profile to get a human-readable profiling report.
ru: Выполняется :ref:`парсинг <profiler_usage_parse>` собранного бинарного профиля. В результате формируется отчет о профилировании в удобном для чтения формате.

source: Collecting binary profile
ru: Сбор бинарного профиля

source: To collect a binary profile for a particular part of the Lua code, you need to place this part between two ``misc.memprof`` functions, namely, ``misc.memprof.start()`` and ``misc.memprof.stop()``, and then execute the code under Tarantool.
ru: Чтобы сформировать бинарный профиль для определенного участка кода на Lua, вставьте этот участок кода между функциями ``misc.memprof.start()`` и ``misc.memprof.stop()``, а затем выполните его в Tarantool.

source: Below is a chunk of simple Lua code named ``test.lua`` to illustrate this.
ru: Для наглядности ниже приведен фрагмент кода на Lua под названием ``test.lua``.

source: -- Prevent allocations on traces. jit.off() local str, err = misc.memprof.start("memprof_new.bin") -- Lua doesn't create a new frame to call string.rep, and all allocations -- are attributed not to the append() function but to the parent scope. local function append(str, rep) return string.rep(str, rep) end local t = {} for i = 1, 1e4 do -- table.insert is the built-in function and all corresponding -- allocations are reported in the scope of the main chunk. table.insert(t, append('q', i) ) end local stp, err = misc.memprof.stop()
ru: -- Отключение аллокации на трассах jit.off() local str, err = misc.memprof.start("memprof_new.bin") -- Lua не создает стековый фрейм для вызова string.rep, -- поэтому все события аллокации -- приписываются не функции append(), а родительской области local function append(str, rep) return string.rep(str, rep) end local t = {} for i = 1, 1e4 do -- table.insert — встроенная функция, -- так что профилировщик включает все соответствующие ей -- события аллокации в отчет по основной части кода table.insert(t, append('q', i) ) end local stp, err = misc.memprof.stop()

source: The Lua code for starting the profiler -- as in line 3 in the test.lua example above -- is:
ru: В примере test.lua код для запуска профилировщика находится на строке 3:

source: local str, err = misc.memprof.start(FILENAME)
ru: local str, err = misc.memprof.start(ИМЯ_ФАЙЛА)

source: where ``FILENAME`` is the name of the binary file where profiling events are written.
ru: ``ИМЯ_ФАЙЛА`` — имя бинарного файла, куда записываются профилируемые события.

source: If the operation fails, for example if it is not possible to open a file for writing or if the profiler is already running, ``misc.memprof.start()`` returns ``nil`` as the first result, an error-message string as the second result, and a system-dependent error code number as the third result. If the operation succeeds, ``misc.memprof.start()`` returns ``true``.
ru: Если операция завершается ошибкой, функция ``misc.memprof.start()`` возвращает результат, состоящий из трех частей: ``nil``; строка с сообщением об ошибке; код ошибки в зависимости от системы. Ошибка может возникнуть, например, когда не открывается файл для записи или профилировщик уже запущен. Если операция выполняется успешно, ``misc.memprof.start()`` возвращает ``true``.

source: The Lua code for stopping the profiler -- as in line 18 in the test.lua example above -- is:
ru: В примере test.lua код для остановки профилировщика находится на строке 18:

source: If the operation fails, for example if there is an error when the file descriptor is being closed or if there is a failure during reporting, ``misc.memprof.stop()`` returns ``nil`` as the first result, an error-message string as the second result, and a system-dependent error code number as the third result. If the operation succeeds, ``misc.memprof.stop()`` returns ``true``.
ru: Если операция завершается ошибкой, функция ``misc.memprof.stop()`` возвращает результат, состоящий из трех частей: ``nil``; строка с сообщением об ошибке; код ошибки в зависимости от системы. Ошибка может возникнуть, например, когда закрыт файловый дескриптор или во время составления отчета происходит сбой. Если операция выполняется успешно, ``misc.memprof.stop()`` возвращает ``true``.

source: To generate the file with memory profile in binary format (in the :ref:`test.lua code example above <profiler_usage_example01>` the file name is ``memprof_new.bin``), execute the code under Tarantool:
ru: Теперь нужно сгенерировать файл с профилем памяти в бинарном формате. В :ref:`примере test.lua <profiler_usage_example01>` имя файла — ``memprof_new.bin``. Выполните код в Tarantool:

source: Tarantool collects the allocation events in ``memprof_new.bin``, puts the file in its :ref:`working directory <cfg_basic-work_dir>`, and closes the session.
ru: Tarantool собирает события аллокации в файл ``memprof_new.bin``, помещает его в :ref:`рабочую директорию <cfg_basic-work_dir>` и завершает сеанс.

source: The :ref:`test.lua code example <profiler_usage_example01>` above also illustrates the memory allocation logic in some cases that are important to understand for :ref:`reading <profiler_usage_parse>` and :ref:`analyzing <profiler_analysis>` a profiling report:
ru: :ref:`Пример test.lua <profiler_usage_example01>` также иллюстрирует логику, по которой в некоторых случаях происходит аллокация памяти. Важно понимать эту логику, чтобы :ref:`читать <profiler_usage_parse>` и :ref:`анализировать <profiler_analysis>` отчеты о профилировании.

source: Line 2: It is recommended to switch the JIT compilation off by calling ``jit.off()`` before the profiler start. Refer to the following :ref:`note about jitoff <profiler_usage_internal_jitoff>` for more details.
ru: Строка 2: Рекомендуется отключать JIT-компиляцию, вызывая ``jit.off()`` перед запуском профилировщика. За дополнительными сведениями обратитесь к :ref:`примечанию о jitoff <profiler_usage_internal_jitoff>`.

source: Lines 6-8: Tail call optimization doesn't create a new call frame, so all allocations inside the function called via the ``CALLT/CALLMT`` `bytecodes <http://wiki.luajit.org/Bytecode-2.0#calls-and-vararg-handling>`_ are attributed to the function's caller. See also the comments preceding these lines.
ru: Строки 6–8: Оптимизация хвостового вызова не создает новый фрейм стека вызовов, поэтому все события аллокации в `байт-коде <http://wiki.luajit.org/Bytecode-2.0#calls-and-vararg-handling>`_ ``CALLT/CALLMT`` относятся на счет кода, вызывающего эту функцию. Обратите внимание на комментарии перед этими строками.

source: Lines 14-16: Usually the information about allocations inside Lua built‑ins is not really useful for developers. That's why if a Lua built‑in function is called from a Lua function, the profiler attributes all allocations to the Lua function. Otherwise, this event is attributed to a C function. See also the comments preceding these lines.
ru: Строки 14–16: Как правило, разработчиков несильно интересует информация об аллокации во встроенных функциях LuaJIT. Поэтому если встроенная функция вызывается из функции на Lua, профилировщик собирает все события аллокации для функции на Lua. В противном случае событие относится к функции на C. Обратите внимание на комментарии перед этими строками.

source: Parsing binary profile and generating profiling report
ru: Парсинг бинарного профиля и формирование отчета о профилировании

source: After getting the memory profile in binary format, the next step is to parse it to get a human-readable profiling report. You can do this via Tarantool by using the following command (mind the hyphen ``-`` prior to the file name):
ru: Получив профиль памяти в двоичном формате, нужно выполнить парсинг, чтобы отчет было удобно читать. Парсинг можно выполнить в Tarantool, воспользовавшись следующей командой (обратите внимание на дефис ``-`` перед именем файла):

source: where ``memprof_new.bin`` is the binary profile :ref:`generated earlier <profiler_usage_generate>` by ``tarantool test.lua``. (Warning: there is a slight behavior change here, the ``tarantool -e ...`` command was slightly different in Tarantool versions prior to Tarantool 2.8.1.)
ru: Здесь ``memprof_new.bin`` — бинарный профиль, :ref:`ранее сгенерированный <profiler_usage_generate>` командой ``tarantool test.lua``. (Внимание: в версии Tarantool 2.8.1 поведение команды ``tarantool -e`` немного изменилось.)

source: Tarantool generates a profiling report and displays it on the console before closing the session:
ru: Tarantool генерирует отчет о профилировании и выводит его в консоль перед закрытием сеанса:

source: On MacOS, a report will be different for the same chunk of code because Tarantool and LuaJIT are built with the GC64 mode enabled for MacOS.
ru: В macOS отчет по той же части кода выглядит по-другому, поскольку Tarantool и LuaJIT собраны с поддержкой режима GC64 для macOS.

source: Let's examine the report structure. A report has four sections:
ru: Рассмотрим структуру отчета. Он состоит из четырех разделов:

source: ALLOCATIONS
ru: ALLOCATIONS (аллокация)

source: REALLOCATIONS
ru: REALLOCATIONS (реаллокация)

source: DEALLOCATIONS
ru: DEALLOCATIONS (деаллокация)

source: HEAP SUMMARY (described later in :ref:`The heap summary and the --leak-only option<luajit_memprof_leak_only>`)
ru: HEAP SUMMARY (cводка изменений в динамической памяти, раздел описан :ref:`ниже <luajit_memprof_leak_only>`)

source: Each section contains event records that are sorted from the most frequent to the least frequent.
ru: Записи в каждом разделе отсортированы в порядке от наиболее до наименее частых событий.

source: An event record has the following format:
ru: Запись о событии регистрируется в следующем формате:

source: @<filename>:<line_number>: <number_of_events> events +<allocated> bytes -<freed> bytes
ru: @<имя_файла>:<номер_строки>: <количество_событий> events +<выделенные_байты> bytes -<освобожденные_байты> bytes

source: <filename>—a name of the file containing Lua code.
ru: <имя_файла> — имя файла, содержащего код на Lua.

source: <line_number>—the line number where the event is detected.
ru: <номер_строки> — номер строки, в которой обнаружено событие.

source: <number_of_events>—a number of events for this code line.
ru: <количество_событий> — количество событий для этой строки кода.

source: +<allocated> bytes—amount of memory allocated during all the events on this line.
ru: +<выделенная_память_в_байтах> bytes — объем выделенной памяти для всех событий в этой строке.

source: -<freed> bytes—amount of memory freed during all the events on this line.
ru: +<освобожденная_память_в_байтах> bytes — объем освобожденной памяти для всех событий в этой строке.

source: The ``Overrides`` label shows what allocation has been overridden.
ru: Метка ``Overrides`` на событии показывает, какое событие аллокации оно замещает.

source: See the :ref:`test.lua chunk above <profiler_usage_example01>` with the explanation in the comments for some examples.
ru: См. :ref:`код примера test.lua выше <profiler_usage_example01>` и пояснения в комментариях к нему.

source: The ``INTERNAL`` label indicates that this event is caused by internal LuaJIT structures.
ru: Метка ``INTERNAL`` показывает, что событие произошло во внутренних структурах LuaJIT.

source: Important note regarding the ``INTERNAL`` label and the recommendation of switching the JIT compilation off (``jit.off()``): this version of the profiler doesn't support verbose reporting for allocations on `traces <https://en.wikipedia.org/wiki/Tracing_just-in-time_compilation#Technical_details>`_. If memory allocations are made on a trace, the profiler can't associate the allocations with the part of Lua code that generated the trace. In this case, the profiler labels such allocations as ``INTERNAL``.
ru: Важное примечание о метке ``INTERNAL`` и рекомендации отключать компиляцию JIT (``jit.off()``). В текущей версии профилировщика не поддерживается подробное (verbose) описание событий аллокации при `трассировке <https://en.wikipedia.org/wiki/Tracing_just-in-time_compilation#Technical_details>`_. Если память выделяется во время трассировки, профилировщик не может соотнести события аллокации с соответствующей частью кода. В этом случае профилировщик помечает такие события как ``INTERNAL``.

source: So, if the JIT compilation is on, new traces will be generated and there will be a mixture of events labeled ``INTERNAL`` in the profiling report: some of them are really caused by internal LuaJIT structures, but some of them are caused by allocations on traces.
ru: Когда компиляция JIT включена, выполняется несколько процессов трассировки. В результате пометку ``INTERNAL`` в отчете о профилировании получают самые разные события: некоторые из них действительно возникают во внутренних структурах LuaJIT, а другие вызваны аллокацией при трассировке.

source: If you want to have a more definite report without JIT compiler allocations, :ref:`call jit.off() <profiler_usage_example01>` before starting the profiling. And if you want to completely exclude the trace allocations from the report, remove also the old traces by additionally calling ``jit.flush()`` after ``jit.off()``.
ru: Вы можете получить более конкретный отчет, в который не входят события аллокации, вызванные JIT-компилятором. Для этого до запуска профилировщика :ref:`вызовите jit.off() <profiler_usage_example01>`. Чтобы полностью исключить из отчета аллокацию на трассах, удалите предыдущие трассы, вызвав после ``jit.off()`` функцию ``jit.flush()``.

source: Nevertheless, switching the JIT compilation off before the profiling is not "a must". It is rather a recommendation, and in some cases, for example in a production environment, you may need to keep JIT compilation on to see the full picture of all the memory allocations. In this case, the majority of the ``INTERNAL`` events are most probably caused by traces.
ru: Отключать компиляцию JIT перед запуском профилировщика рекомендуется, но это не обязательно. Например, в производственной среде без компиляции JIT полное представление об аллокациях памяти получить невозможно. В подобных случаях большая часть событий ``INTERNAL``, вероятнее всего, происходит при трассировках.

source: As for investigating the Lua code with the help of profiling reports, it is always code-dependent and there can't be hundred per cent definite recommendations in this regard. Nevertheless, you can see some of the things in the :ref:`Profiling report analysis example <profiler_analysis>` later.
ru: Иногда отчет о профилировании помогает исследовать код на Lua. Однако этот метод подходит не для любого кода, так что рекомендаций на этот счет нет. Посмотрите :ref:`пример анализа отчета о профилировании <profiler_analysis>`, чтобы узнать, как можно использовать отчет для исследования кода.

source: Also, below is the :ref:`FAQ <profiler_faq>` section with the questions that most probably can arise while using profiler.
ru: Больше информации о том, как использовать профилировщик, вы найдете ниже в разделе :ref:`Вопросы и ответы <profiler_faq>`.

source: FAQ
ru: Вопросы и ответы

source: In this section, some profiler-related points are discussed in a Q&A format.
ru: В этом разделе даются ответы на часто задаваемые вопросы о работе профилировщика.

source: **Question (Q)**: Is the profiler suitable for C allocations or allocations inside C code?
ru: **Вопрос (В)**: Проверяет ли профилировщик аллокацию в C и коде на C?

source: **Answer (A)**: The profiler reports only allocation events caused by the Lua allocator. All Lua-related allocations, like table or string creation are reported. But the profiler doesn't report allocations made by ``malloc()`` or other non-Lua allocators. You can use ``valgrind`` to debug them.
ru: **Ответ (A)**: Профилировщик включает в отчет только события выделения памяти Lua-аллокатором. Отчет содержит все события аллокации в Lua, например создание таблиц и строк. Однако профилировщик не отслеживает выделение памяти с помощью ``malloc()`` или действия аллокаторов, не связанных с Lua. Чтобы фиксировать такие события, для отладки можно использовать ``valgrind``.

source: **Q**: Why are there so many ``INTERNAL`` allocations in my profiling report? What does it mean?
ru: **В**: Почему у меня в отчете о профилировании столько событий аллокации ``INTERNAL``? Что это значит?

source: **A**: ``INTERNAL`` means that these allocations/reallocations/deallocations are related to the internal LuaJIT structures or are made on traces. Currently, the profiler doesn't verbosely report allocations of objects that are made during trace execution. Try :ref:`adding jit.off() <profiler_usage_internal_jitoff>` before the profiler start.
ru: **О**: Пометка ``INTERNAL`` означает, что событие аллокации/реаллокации/деаллокации связано с внутренними структурами LuaJIT или трассами. Сейчас профилировщик не включает в отчет подробное описание событий аллокации для объектов, создаваемых на трассах. Попробуйте перед запуском профилировщика :ref:`добавить jit.off() <profiler_usage_internal_jitoff>`.

source: **Q**: Why are there some reallocations/deallocations without an ``Overrides`` section?
ru: **В**: Почему на некоторых событиях аллокации/деаллокации нет метки ``Overrides``?

source: **A**: These objects can be created before the profiler starts. Adding ``collectgarbage()`` before the profiler's start enables collecting all previously allocated objects that are dead when the profiler starts.
ru: **О**: Вероятно, события связаны с объектами, созданными до запуска профилировщика. Если перед запуском профилировщика добавить вызов ``collectgarbage()``, то будут учитываться и события, связанные с "мертвыми" объектами: под такие объекты ранее была выделена память, но на момент запуска профилировщика они уже недоступны.

source: **Q**: Why are some objects not collected during profiling? Is it a memory leak?
ru: **В**: Почему некоторые объекты не учитываются при профилировании? Это связано с утечкой памяти?

source: **A**: LuaJIT uses incremental Garbage Collector (GC). A GC cycle may not be finished at the moment the profiler stops. Add ``collectgarbage()`` before stopping the profiler to collect all the dead objects for sure.
ru: **О**: LuaJIT использует инкрементальный сборщик мусора. Когда профилировщик завершает работу, цикл сборки мусора может все еще выполняться. Чтобы обеспечить профилирование "мертвых" объектов, добавьте ``collectgarbage()`` перед командой остановки профилировщика.

source: **Q**: Can I profile not just a current chunk but the entire running application? Can I start the profiler when the application is already running?
ru: **В**: Можно ли профилировать не только часть кода, а все приложение? Можно ли запустить профилировщик во время работы приложения?

source: **A**: Yes. Here is an example of code that can be inserted in the Tarantool console for a running instance.
ru: **О**: Да. Вот пример кода, который можно вставить в консоль Tarantool, когда приложение уже запущено:

source: local fiber = require "fiber" local log = require "log" fiber.create(function() fiber.name("memprof") collectgarbage() -- Collect all objects already dead log.warn("start of profile") local st, err = misc.memprof.start(FILENAME) if not st then log.error("failed to start profiler: %s", err) end fiber.sleep(TIME) collectgarbage() st, err = misc.memprof.stop() if not st then log.error("profiler on stop error: %s", err) end log.warn("end of profile") end)
ru: local fiber = require "fiber" local log = require "log" fiber.create(function() fiber.name("memprof") collectgarbage() -- Сбор мертвых объектов log.warn("start of profile") local st, err = misc.memprof.start(ИМЯ_ФАЙЛА) if not st then log.error("failed to start profiler: %s", err) end fiber.sleep(ВРЕМЯ) collectgarbage() st, err = misc.memprof.stop() if not st then log.error("profiler on stop error: %s", err) end log.warn("end of profile") end)

source: where
ru: Пояснения:

source: ``FILENAME``—the name of the binary file where profiling events are written
ru: ``ИМЯ_ФАЙЛА`` — имя бинарного файла, куда записываются профилируемые события.

source: ``TIME``—duration of profiling, in seconds.
ru: ``ВРЕМЯ`` — продолжительность профилирования в секундах.

source: Also, you can directly call ``misc.memprof.start()`` and ``misc.memprof.stop()`` from a console.
ru: Кроме того, вызывать ``misc.memprof.start()`` и ``misc.memprof.stop()`` можно напрямую из консоли.

source: Profiling report analysis example
ru: Пример анализа отчета о профилировании

source: In the example below, the following Lua code named ``format_concat.lua`` is investigated with the help of the memory profiler reports.
ru: Ниже приведен код на Lua --- файл ``format_concat.lua``. Этот код будет исследован с применением отчетов о профилировании памяти.

source: -- Prevent allocations on new traces. jit.off() local function concat(a) local nstr = a.."a" return nstr end local function format(a) local nstr = string.format("%sa", a) return nstr end collectgarbage() local binfile = "/tmp/memprof_"..(arg[0]):match("([^/]*).lua")..".bin" local st, err = misc.memprof.start(binfile) assert(st, err) -- Payload. for i = 1, 10000 do local f = format(i) local c = concat(i) end collectgarbage() local st, err = misc.memprof.stop() assert(st, err) os.exit()
ru: -- Отключение аллокации на новых трассах jit.off() local function concat(a) local nstr = a.."a" return nstr end local function format(a) local nstr = string.format("%sa", a) return nstr end collectgarbage() local binfile = "/tmp/memprof_"..(arg[0]):match("([^/]*).lua")..".bin" local st, err = misc.memprof.start(binfile) assert(st, err) -- Нагрузка for i = 1, 10000 do local f = format(i) local c = concat(i) end collectgarbage() local st, err = misc.memprof.stop() assert(st, err) os.exit()

source: When you run this code :ref:`under Tarantool <profiler_usage_generate>` and then :ref:`parse <profiler_usage_parse_command>` the binary memory profile in /tmp/memprof_format_concat.bin, you will get the following profiling report:
ru: Запустив этот код :ref:`в Tarantool <profiler_usage_generate>` и выполнив последующий :ref:`парсинг <profiler_usage_parse_command>` бинарного профиля в /tmp/memprof_format_concat.bin, вы получите такой отчет о профилировании:

source: Reasonable questions regarding the report can be:
ru: Отчет может вызвать такие вопросы:

source: Why are there no allocations related to the ``concat()`` function?
ru: Почему нет событий по функции ``concat()``?
