Repository: tarantool/doc
Catalog: locale/*/LC_MESSAGES/book/app_server/luajit_memprof.po
Languages: ru

source: Why is the number of allocations not a round number?
ru: Почему количество событий — это не целое число?

source: Why are there approximately 20K allocations instead of 10K?
ru: Почему в отчете не 10 тысяч событий, а около 20 тысяч?

source: First of all, LuaJIT doesn't create a new string if the string with the same payload exists (see details on `lua-users.org/wiki <http://lua-users.org/wiki/ImmutableObjects>`_). This is called `string interning <https://en.wikipedia.org/wiki/String_interning>`_. So, when a string is created via the ``format()`` function, there is no need to create the same string via the ``concat()`` function, and LuaJIT just uses the previous one.
ru: Во-первых, LuaJIT не создает новую строку, если уже есть строка с такой же нагрузкой (подробнее на сайте `lua-users.org/wiki <http://lua-users.org/wiki/ImmutableObjects>`_). Это называется `интернированием строк <https://en.wikipedia.org/wiki/String_interning>`_. Иными словами, если строка создана с помощью функции ``format()``, нет необходимости создавать такую же строку с помощью функции ``concat()`` — LuaJIT будет использовать предыдущую.

source: That is also the reason why the number of allocations is not a round number as could be expected from the cycle operator ``for i = 1, 10000...``: Tarantool creates some strings for internal needs and built‑in modules, so some strings already exist.
ru: По этой же причине количество событий аллокации — это не целое число, как можно было бы ожидать при использовании оператора цикла ``for i = 1, 10000...``. Некоторые строки Tarantool создает для внутренних нужд и встроенных модулей, поэтому часть строк уже существует.

source: But why are there so many allocations? It's almost twice as big as the expected amount. This is because the ``string.format()`` built‑in function creates another string necessary for the ``%s`` identifier, so there are two allocations for each iteration: for ``tostring(i)`` and for ``string.format("%sa", string_i_value)``. You can see the difference in behavior by adding the line ``local _ = tostring(i)`` between lines 22 and 23.
ru: Но откуда столько событий аллокации? Их почти в 2 раза больше, чем можно было бы ожидать. Это происходит потому, что встроенная функция ``string.format()`` каждый раз создает дополнительную строку для идентификатора ``%s``. То есть в каждой итерации регистрируются два события аллокации: для ``tostring(i)`` и для ``string.format("%sa", string_i_value)``. Добавив строку ``local _ = tostring(i)`` между строками 22 и 23, вы увидите разницу в поведении.

source: To profile only the ``concat()`` function, comment out line 23 (which is ``local f = format(i)``) and run the profiler. Now the output will look like this:
ru: Чтобы профилировать только функцию ``concat()``, закомментируйте строку 23 (``local f = format(i)``) и запустите профилировщик. Теперь результат будет такой:

source: **Q**: But what will change if JIT compilation is enabled?
ru: **В**: Что изменится, если включить компиляцию JIT?

source: **A**: In the :ref:`code <profiler_usage_example03>`, comment out line 2 (which is ``jit.off()``) and run the profiler . Now there are only 56 allocations in the report, and all other allocations are JIT-related (see also the related `dev issue <https://github.com/tarantool/tarantool/issues/5679>`_):
ru: **О**: Закомментируйте вторую строку (``jit.off()``) в :ref:`коде <profiler_usage_example03>` и запустите профилировщик. Теперь в отчете только 56 событий. Остальные события связаны с JIT (см. также соответствующую `задачу на GitHub <https://github.com/tarantool/tarantool/issues/5679>`_):

source: This happens because a trace has been compiled after 56 iterations (the default value of the ``hotloop`` compiler parameter). Then, the JIT-compiler removed the unused variable ``c`` from the trace, and, therefore, the dead code of the ``concat()`` function is eliminated.
ru: Так произошло потому, что трассировка была скомпилирована после 56 итераций (это значение параметра компилятора ``hotloop`` по умолчанию). Затем JIT-компилятор удалил из трассировки неиспользуемую переменную ``c``, а вместе с ней и неиспользуемый код функции ``concat()``.

source: Next, let's profile only the ``format()`` function with JIT enabled. For that, comment out lines 2 and 24 (``jit.off()`` and ``local c = concat(i)``), do not comment out line 23 (``local f = format(i)``), and run the profiler. Now the output will look like this:
ru: Теперь включите компиляцию JIT и запустите профилирование только для функции ``format()``. Для этого закомментируйте строки 2 и 24 (``jit.off()`` и ``local c = concat(i)``), раскомментируйте строку 23 (``local f = format(i)``) и вызовите профилировщик. Результат будет такой:

source: **Q**: Why are there so many allocations in comparison to the ``concat()`` function?
ru: **В**: Откуда так много событий аллокации по сравнению с ``concat()``?

source: **A**: The answer is simple: the ``string.format()`` function with the ``%s`` identifier is not yet compiled via LuaJIT. So, a trace can't be recorded and the compiler doesn't perform the corresponding optimizations.
ru: **О**: Ответ прост: LuaJIT еще не скомпилировал функцию ``string.format()`` с идентификатором ``%s``. Поэтому трассировка не регистрируется, а компилятор не выполняет соответствующую оптимизацию.

source: If we change the ``format()`` function in lines 9-12 of the :ref:`Profiling report analysis example <profiler_usage_example03>` in the following way
ru: Изменим функцию ``format`` в строках 9--12 :ref:`примера для анализа отчета о профилировании <profiler_usage_example03>` следующим образом:

source: the profiling report becomes much prettier:
ru: Теперь отчет о профилировании будет выглядеть намного лучше:

source: The heap summary and the --leak-only option
ru: Сводка изменений в динамической памяти и параметр --leak-only

source: This feature was added in version :doc:`2.8.1 </release/2.8.1>`.
ru: Эта функциональная возможность появилась в версии :doc:`2.8.1 </release/2.8.1>`.

source: The end of each display is a HEAP SUMMARY section which looks like this:
ru: В конце каждого отчета приводится раздел HEAP SUMMARY (сводка изменений в динамической памяти). Этот раздел выглядит так:

source: @<filename>:<line number> holds <number of still reachable bytes> bytes: <number of allocation events> allocs, <number of deallocation events> frees
ru: @<имя_файла>:<номер_строки> holds <количество_доступных_байтов> bytes: <количество_событий_аллокации> allocs, <количество_событий_деаллокации> frees

source: Sometimes a program can cause many deallocations, so the DEALLOCATION section can become large, so the display is not easy to read. To minimize output, start the parsing with an extra flag: ``--leak-only``, for example
ru: Иногда программа может вызывать множество событий деаллокации. В этом случае раздел DEALLOCATION сильно увеличится и отчет будет сложно читать. Чтобы уменьшить количество выводимых данных, запустите парсинг с дополнительным параметром ``--leak-only``. Например, так:

source: When `--leak-only`` is used, only the HEAP SUMMARY section is displayed.
ru: При использовании параметра ``--leak-only`` выводится только раздел HEAP SUMMARY.
