Repository: tarantool/doc
Catalog: locale/*/LC_MESSAGES/reference/reference_lua/box_error/error.po
Languages: ru

source: ``box.error`` throws an object that has the cdata type and contain the following fields:
ru: ``box.error`` выдает объект, который относится к типу cdata и содержит следующие поля:

source: "type" (string) error's C++ class,
ru: "type" (строка) класс ошибки C++,

source: "code" (number) error's number,
ru: "code" (число) номер ошибки,

source: "message" (string) error's message,
ru: "message" (строка) сообщение ошибки,

source: "file" (string) Tarantool source file,
ru: "file" (строка) исходный файл Tarantool'а,

source: "line" (number) line number in the Tarantool source file,
ru: "line" (число) номер строки в исходном файле Tarantool'а,

source: "errno" (number) C standard error number; this field is added only if the error is a system error (for example, due to a failure in a socket or file i/o).
ru: "errno" (число) стандартный номер ошибки в C; это поле добавляется только в случае системной ошибки (например, по причине ошибки сокета или файлового ввода-вывода).

source: When called with a Lua-table argument, the code and reason have any user-desired values. The result will be those values.
ru: При вызове с аргументом из Lua-таблицы значения параметров code и reason будут любыми по желанию пользователя. Результатом будут эти значения.

source: Parameters
ru: Параметры

source: description of an error, defined by user
ru: (строка) описание ошибки, задается пользователем

source: numeric code for this error, defined by user
ru: (целое число) числовой код ошибки, задается пользователем

source: When called without arguments, ``box.error()`` re-throws whatever the last error was.
ru: При вызове без аргументов ``box.error()`` повторно вызывает последнюю ошибку.

source: Emulate a request error, with text based on one of the pre-defined Tarantool errors defined in the file `errcode.h <https://github.com/tarantool/tarantool/blob/1.10/src/box/errcode.h>`_ in the source tree. Lua constants which correspond to those Tarantool errors are defined as members of ``box.error``, for example ``box.error.NO_SUCH_USER == 45``.
ru: Моделирование ошибки запроса с текстом на основе одной из ошибок Tarantool'а, заданных в файле `errcode.h <https://github.com/tarantool/tarantool/blob/1.10/src/box/errcode.h>`_ в исходном дереве. Lua-постоянные, которые соответствуют этим ошибкам в Tarantool'е, определяются как элементы ``box.error``, например ``box.error.NO_SUCH_USER == 45``.

source: number of a pre-defined error
ru: номер предварительно заданной ошибки

source: part of the message which will accompany the error
ru: часть сообщения, которое сопровождает ошибку

source: For example:
ru: Пример:

source: the ``NO_SUCH_USER`` message is "``User '%s' is not found``" -- it includes one "``%s``" component which will be replaced with errtext. Thus a call to ``box.error(box.error.NO_SUCH_USER, 'joe')`` or ``box.error(45, 'joe')`` will result in an error with the accompanying message "``User 'joe' is not found``".
ru: сообщение ``NO_SUCH_USER`` = "``User '%s' is not found``" (пользователь не найден) -- оно включает в себя компонент "``%s``", который будет заменен значением параметра errtext. Таким образом, вызов ``box.error(box.error.NO_SUCH_USER, 'joe')`` или ``box.error(45, 'joe')`` приведет к ошибке с сообщением "``User 'joe' is not found``" (пользователь 'joe' не найден).

source: except
ru: Исключение:

source: whatever is specified in errcode-number.
ru: то, что указано в номере errcode.

source: **Example:**
ru: **Пример:**
