Repository: tarantool/doc
Catalog: locale/*/LC_MESSAGES/reference/reference_lua/box_error/last.po
Languages: ru_ru

source: Return a description of the last error, as a Lua table with four members:
ru_ru: Получение описания последней ошибки в виде Lua-таблицы с 4 компонентами:

source: "code" (number) error’s number
ru_ru: "code" (number) номер ошибки

source: "type" (string) error’s C++ class
ru_ru: "type" (string) C++ класс ошибки

source: "message" (string) error’s message
ru_ru: "message" (string) сообщение ошибки

source: "trace" (table) with 2 members:
ru_ru: "trace" (table) с 2 компонентами:

source: "line" (number) Tarantool source file line number
ru_ru: "line" (number) номер строки в исходном файле Tarantool

source: "file" (string) Tarantool source file
ru_ru: "file" (string) исходный файл Tarantool

source: Additionally, if the error is a system error (for example due to a failure in socket or file io), there may be a fifth member: "errno" (number) C standard error number.
ru_ru: Также, если ошибка является системной (например, из-за сбоя в сокете или в файловых операциях ввода/вывода),может добавиться пятый компонент: "errno" (number) номер ошибки в стандарте C.

source: rtype
ru_ru: тип возвращаемого значения

source: table
ru_ru: таблица

source: To show the table, use ``unpack()``:
ru_ru: Для вывода таблицы используйте ``unpack()``:
