Repository: tarantool/doc
Catalog: locale/*/LC_MESSAGES/how-to/replication/repl_remove_instances.po
Languages: ru

source: Removing instances
ru: Удаление экземпляров

source: Let's assume that we have the following configured replica set with 3 instances (*instance1*, *instance2* and *intance3*) and we want to remove *instance2*.
ru: Предположим, что у нас настроен следующий набор реплик с 3 экземплярами (*instance1*, *instance2* и *instance3*), и мы хотим удалить *instance2*.

source: To remove it politely, follow these steps:
ru: Чтобы правильно удалить экземпляр из набора реплик, выполните следующие шаги:

source: Disconnect *instance2* from the cluster.
ru: Отключите *instance2* от кластера.

source: Disconnect the cluster from *instance2*.
ru: Отключите кластер от *instance2*.

source: Remove *instance2* from the ``_cluster`` space.
ru: Исключите *instance2* из системного спейса ``_cluster``.

source: **Step 1: disconnecting an instance from the cluster**
ru: **Шаг 1: отключение экземпляра от кластера**

source: On the disconnecting instance *instance2*, run ``box.cfg{}`` with a blank replication source:
ru: На отключаемом *instance2* выполните ``box.cfg{}`` с пустым источником репликации:

source: Then check that it was disconnected. Take a look at ``box.info.replication`` on *instance2* (notice that ``replication.{1,3}.upstream`` is absent):
ru: Теперь проверьте, что экземпляр был отсоединен. Взгляните на ``box.info.replication`` на *instance2* (заметьте, что строки для ``replication.{1,3}.upstream`` отсутствуют):

source: Check *instance1* and *instance3* as well (notice that the status of ``replication.2.downstream`` is ``stopped``):
ru: Проверьте также *instance1* и *instance3* (заметьте, что статус ``replication.2.downstream`` поменялся на ``stopped``):

source: **Step 2: disconnecting the cluster from the decommissioned instance**
ru: **Шаг 2: отключение кластера от удаляемого экземпляра**

source: On every other instance in the cluster remove *instance2* from the ``box.cfg{ replication }`` list and call an appropriate ``box.cfg{ replication = {instance1, instance3} }``:
ru: На всех остальных экземплярах в кластере уберите *instance2* из списка ``box.cfg{ replication }`` и вызовите актуальный список ``box.cfg{ replication = {instance1, instance3} }``:

source: Take a look at ``box.info.replication`` on *instance2* to check that *instance1* and *instance3* were disconnected (notice that the status of ``replication.{1,3}.downstream`` is ``stopped``):
ru: Взгляните на ``box.info.replication`` на *instance2*, чтобы убедиться, что ``instance1`` и ``instance3`` были отсоединены (заметьте, что статус ``replication.2.downstream`` поменялся на ``stopped``):

source: Check *instance1* and *instance3* as well (notice that the status of ``replication.2.upstream`` is ``stopped``):
ru: Проверьте также *instance1* и *instance3* (заметьте, что статус ``replication.2.upstream`` поменялся на ``stopped``):

source: **Step 3: persistent removal**
ru: **Шаг 3: окончательное удаление**

source: If a removed instance rejoins later, it will receive all the updates made by the other instances while it was disconnected.
ru: Если выбывший экземпляр снова вернется в кластер, то он получит информацию обо всех изменениях, которые произошли на остальных экземплярах за время его отсутствия.

source: If an instance is decommissioned forever, we should clean up the ``_cluster`` space. First, discover the ``id`` and ``uuid`` of the instance. On *instance2*, call ``return box.info.id, box.info.uuid``:
ru: Если экземпляр нужно вывести из эксплуатации навсегда, то нужно очистить ``cluster`` спейс. Для этого сначала узнайте ``id`` и ``uuid`` удаляемого экземпляра. На *instance2* вызовите ``return box.info.id, box.info.uuid``:

source: Take a note of ``id`` and ``uuid``.
ru: Запомните ``id`` and ``uuid``.

source: Now choose any master from the remaining cluster and perform the following actions on it (let's assume that we chose *instance1*):
ru: Теперь выберите любой мастер из оставшегося кластера и выполните на нем следующие действия (предположим, это будет *instance1*):

source: Select all records from the ``_cluster`` space:
ru: Запросите все записи из спейса ``_cluster``:

source: 2. Check if the ``id`` and ``uuid`` of *instance2* are correct and remove them from the cluster:
ru: 2.Проверьте корректность ``id`` и ``uuid`` *instance2* и удалите их из кластера:

source: After all modifications, say ``box.info.replication`` to check the health status.
ru: После всех модификаций выполните ``box.info.replication``, чтобы проверить, что состояние кластера теперь корректное.
