Repository: tarantool/doc
Catalog: locale/*/LC_MESSAGES/book/box/atomic.po
Languages: ru

source: Another important thing to mention is that the transaction manager provides non-classic snapshot isolation level. It means that a transaction can get a consistent snapshot of the database (that is common) but this snapshot is not necessarily bound to the moment of the beginning of the transaction (that is not common). The conflict manager makes decisions on whether and when each transaction gets which snapshot. That allows to avoid some conflicts comparing with classical snapshot isolation approach.
ru: Еще стоит отметить, что менеджер транзакций обеспечивает нестандартный уровень изоляции с помощью снимков. Это означает, что транзакция может видеть снимок состояния базы данных (в этом нет ничего необычного), но этот снимок не обязательно привязан к моменту начала транзакции (вот это уже необычно). Менеджер конфликтов принимает решение о том, видит ли транзакция снимок, какой именно и когда. Это позволяет избежать некоторых конфликтов в сравнении с классическим подходом к изоляции с помощью снимков.

source: The transactional manager can be switched on and off by the ``box.cfg`` option :ref:`memtx_use_mvcc_engine <cfg_basic-memtx_use_mvcc_engine>`.
ru: Менеджер транзакций можно включать и отключать с помощью параметра :ref:`memtx_use_mvcc_engine <cfg_basic-memtx_use_mvcc_engine>` в ``box.cfg``.
