Repository: tarantool/doc
Catalog: locale/*/LC_MESSAGES/book/box/data_model.po
Languages: ru

source: Effect
ru: Эффект

source: Index size
ru: Размер индекса

source: The number of index keys is the same as the number of tuples in the data set. For a TREE index, if there are more keys, then the lookup time will be greater, although, of course, the effect is not linear. For a HASH index, if there are more keys, then there is more RAM used, but the number of low-level steps tends to remain constant.
ru: Количество ключей в индексе равно количеству кортежей в наборе данных. Для TREE-индекса: чем больше ключей, тем больше время поиска, хотя зависимость здесь, конечно же, нелинейная. Для HASH-индекса: чем больше ключей, тем больше нужно оперативной памяти, но количество низкоуровневых шагов остается примерно тем же.

source: Typically, a HASH index is faster than a TREE index if the number of tuples in the space is greater than one.
ru: Как правило, поиск по HASH-индексу работает быстрее, чем по TREE-индексу, если в спейсе более одного кортежа.

source: Number of indexes accessed
ru: Количество обращений к индексам

source: Ordinarily, only one index is accessed to retrieve one tuple. But to update the tuple, there must be N accesses if the space has N different indexes.
ru: Обычно для выборки значений одного кортежа используется только один индекс. Но при обновлении значений в кортеже требуется N обращений, если в спейсе N индексов.

source: Note regarding storage engine: Vinyl optimizes away such accesses if secondary index fields are unchanged by the update. So, this complexity factor applies only to memtx, since it always makes a full-tuple copy on every update.
ru: Примечание по движку базы данных: если обновление не затрагивает поля вторичного индекса, vinyl не производит эти обращения. Таким образом, этот фактор сложности влияет только на memtx, который создает копию всего кортежа при каждом обновлении.

source: Number of tuples accessed
ru: Количество обращений к кортежам

source: A few requests, for example, SELECT, can retrieve multiple tuples. This factor is usually less important than the others.
ru: Некоторые запросы, например SELECT, могут возвращать несколько кортежей. Обычно этот фактор менее важен, чем другие.

source: WAL settings
ru: Настройки WAL

source: The important setting for the write-ahead log is :ref:`wal_mode <cfg_binary_logging_snapshots-wal_mode>`. If the setting causes no writing or delayed writing, this factor is unimportant. If the setting causes every data-change request to wait for writing to finish on a slow device, this factor is more important than all the others.
ru: Важным параметром для записи в WAL является :ref:`wal_mode <cfg_binary_logging_snapshots-wal_mode>`. Если запись в WAL отключена или задана запись с задержкой, но этот фактор не так важен. Если же запись в WAL производится при каждом запросе на изменение данных, то при каждом таком запросе приходится ждать, пока отработает обращение к более медленному диску, и данный фактор становится важнее всех остальных.

source: Data schema description
ru: Описание схемы данных

source: In Tarantool, the use of a data schema is optional.
ru: В Tarantool использование схемы данных опционально.

source: When creating a :term:`space <space>`, you do not have to define a data schema. In this case, the tuples store random data. This rule does not apply to indexed fields. Such fields must contain data of the same type.
ru: При создании :term:`спейса <space>` схему можно не задавать и тогда в кортежах могут лежать произвольные данные. Это правило не распространяется на поля, по которым построены индексы. У таких полей данные должны быть одного типа.

source: You can define a data schema when creating a space. Read more in the description of the :doc:`/reference/reference_lua/box_schema/space_create` function. If you have already created a space without specifying a data schema, you can do it later using :doc:`/reference/reference_lua/box_space/format`.
ru: Схему можно задать при создании спейса. Читайте подробнее в описании функции :doc:`/reference/reference_lua/box_schema/space_create`. Если вы создали спейс без схемы, ее можно добавить позже с помощью метода :doc:`/reference/reference_lua/box_space/format`.

source: After the data schema is defined, all the data is validated by type. Before any insert or update, you will get an error if the data types do not match.
ru: После указания схемы данные начинают валидироваться по типам. Перед каждой операцией вставки или обновления они проверяются, и в случае несоответствия типов вы получите ошибку.

source: We recommend using a data schema because it helps avoid mistakes.
ru: Мы рекомендуем использовать подход со схемой, потому что он помогает избежать ошибок.

source: In Tarantool, you can define a data schema in two different ways.
ru: Схему в Tarantool можно задавать двумя разными способами.

source: Data schema description in a code file
ru: Описание схемы в файле с кодом

source: The code file is usually called ``init.lua`` and contains the following schema description:
ru: Обычно файл с кодом называется ``init.lua`` и имеет следующее описание схемы:

source: This is quite simple: when you run tarantool, it executes this code and creates a data schema. To run this file, use:
ru: Этот подход довольно простой. Когда вы запустите tarantool, этот код исполнится и создаст схему. Чтобы запустить файл, используйте следующую команду:

source: However, it may seem complicated if you do not plan to dive deep into the Lua language and its syntax.
ru: Но это может показаться слишком сложным, если вы не собираетесь глубоко разбираться с языком Lua и его синтаксисом.

source: Possible difficulty: the snippet above has a function call with a colon: ``users:format``. It is used to pass the ``users`` variable as the first argument of the ``format`` function. This is similar to ``self`` in object-based languages.
ru: Пример возможной сложности: в фрагменте выше есть вызов функций с двоеточием: ``users:format``. Он используется, чтобы передать переменную ``users`` в качестве первого аргумента функции ``format``. Это аналог ``self`` в объектно-ориентированных языках.

source: So it might be more convenient for you to describe the data schema with YAML.
ru: Поэтому вам может быть удобно описать схему через YAML.

source: Data schema description using the DDL module
ru: Описание через модуль DDL

source: The `DDL module <https://github.com/tarantool/ddl>`_ allows you to describe a data schema in the YAML format in a declarative way.
ru: `Модуль DDL <https://github.com/tarantool/ddl>`_ позволяет декларативно описывать схему данных в YAML формате.

source: The schema would look something like this:
ru: Схема будет выглядеть примерно вот так:

source: This alternative is simpler to use, and you do not have to dive deep into Lua.
ru: Этот вариант проще для старта: его проще использовать и не нужно вникать в язык Lua.

source: ``DDL`` is a built-in :doc:`Cartridge </book/cartridge/index>` module. Cartridge is a cluster solution for Tarantool. In its WebUI, there is a separate tab called "Schema". On this tab, you can define the schema, check its correctness, and apply it to the whole cluster.
ru: Модуль ``DDL`` встроен по умолчанию в :doc:`Cartridge </book/cartridge/index>`. Cartridge — это кластерное решение для Tarantool. В его веб-интерфейсе есть отдельная вкладка "Schema". Там можно написать схему, проверить ее корректность и применить на всем кластере.

source: If you do not use Cartridge, you can still use the DDL module: put the following Lua code into the file that you use to run Tarantool. This file is usually called ``init.lua``.
ru: Если вы не используете Cartridge, то чтобы использовать модуль DDL, нужно вставить нижеприведенный код на Lua в файл, с которым вы запускаете Tarantool. Обычно это ``init.lua``.

source: It is forbidden to modify the data schema in DDL after it has been applied. For migration, there are different scenarios described below.
ru: Менять схему в самом DDL после ее применения нельзя. Для миграций есть несколько подходов — они описаны ниже.

source: Migrations
ru: Миграции

source: **Migration** refers to any change in a data schema: adding/removing a field, creating/dropping an index, changing a field format, etc.
ru: **Миграцией** называется любое изменение схемы данных: добавление/удаление поля, добавление/удаление индекса, изменение формата поля и т. д.

source: In Tarantool, there are two types of schema migration that do not require data migration:
ru: В Tarantool есть только два вида миграции схемы, при которых не нужно мигрировать данные:

source: adding a field to the end of a space
ru: добавление поля в конец спейса

source: creating an index
ru: добавление индекса

source: Adding a field to the end of a space
ru: Добавление поля в конец спейса

source: You can add a field as follows:
ru: Добавление поля происходит следующим образом:

source: Note that the field must have the ``is_nullable`` parameter. Otherwise, an error will occur.
ru: Обратите внимание: поле обязательно должно иметь параметр ``is_nullable``. Иначе произойдет ошибка.

source: After creating a new field, you probably want to fill it with data. The `tarantool/moonwalker <https://github.com/tarantool/moonwalker>`_ module is useful for this task. The README file describes how to work with this module.
ru: После создания нового поля, вы, вероятно, захотите заполнить его данными. Для этой задачи удобно использовать модуль `tarantool/moonwalker <https://github.com/tarantool/moonwalker>`_. В README есть описание того, как начать его использовать.

source: Creating an index
ru: Добавление индекса

source: Index creation is described in the :doc:`/reference/reference_lua/box_space/create_index` method.
ru: Про добавление индекса рассказывается в описании метода :doc:`/reference/reference_lua/box_space/create_index`.

source: Other types of migrations
ru: Остальные виды миграций

source: Other types of migrations are also allowed, but it would be more difficult to maintain data consistency.
ru: Остальные виды миграций также возможны, однако поддерживать консистентность данных при этом сложнее.

source: Migrations are possible in two cases:
ru: Миграции можно выполнять в двух случаях:

source: When Tarantool starts, and no client uses the database yet
ru: при старте Tarantool, пока ни один клиент еще не использует БД

source: During request processing, when active clients are already using the database
ru: в процессе обработки запросов, когда у БД уже есть активные клиенты

source: For the first case, it is enough to write and test the migration code. The most difficult task is to migrate data when there are active clients. You should keep it in mind when you initially design the data schema.
ru: Для первого случая достаточно кода миграции, который будет написан и оттестирован. Самая сложная задача — это провести миграцию данных при наличии активных клиентов. Это необходимо иметь в виду при начальном проектировании схемы данных.

source: We identify the following problems if there are active clients:
ru: Мы выделяем следующие проблемы при наличии активных клиентов:

source: Associated data can change atomically.
ru: Связанные данные могут атомарно изменяться.

source: The system should be able to transfer data using both the new schema and the old one.
ru: Нужно уметь отдавать данные как по новой схеме, так и по старой.

source: When data is being transferred to a new space, data access should consider that the data might be in one space or another.
ru: Когда данные перемещают в новый спейс, доступ к данным должен учитывать, что данные могут быть как в одном спейсе, так и в другом.

source: Write requests must not interfere with the migration. A common approach is to write according to the new data schema.
ru: Запросы на запись не должны мешать корректной миграции. Типичный подход: всегда писать по новой схеме.

source: These issues may or may not be relevant depending on your application and its availability requirements.
ru: Эти проблемы могут быть или не быть релевантными в зависимости от вашего приложения и требований к его доступности.

source: What you need to know when writing complex migrations
ru: Что нужно знать при написании сложных миграций

source: Tarantool has a transaction mechanism. It is useful when writing a migration, because it allows you to work with the data atomically. But before using the transaction mechanism, you should explore its limitations.
ru: В Tarantool есть механизм транзакций. Он полезен при написании миграции, так как позволяет атомарно работать с данными. Но перед использованием механизма транзакций нужно знать об ограничениях.

source: For details, see the section about :doc:`transactions </book/box/atomic>`.
ru: Подробнее о них описано в разделе про :doc:`транзакции </book/box/atomic>`.

source: How you can apply migration
ru: Как применять миграции

source: The migration code is executed on a running Tarantool instance. Important: no method guarantees you transactional application of migrations on the whole cluster.
ru: Код миграций исполняется на запущенном инстансе Tarantool. Важно: ни один способ не гарантирует вам транзакционное применение миграций на всем кластере.

source: **Method 1**: include migrations in the application code
ru: **Способ 1**: написать миграции в коде основного приложения

source: This is quite simple: when you reload the code, the data is migrated at the right moment, and the database schema is updated. However, this method may not work for everyone. You may not be able to restart Tarantool or update the code using the hot-reload mechanism.
ru: Это довольно просто: когда вы перезагружаете код, в нужный момент происходит миграция данных и схема базы данных обновляется. Однако такой способ может подойти не всем. У вас может не быть возможности перезапустить Tarantool или обновить код через механизм горячей перезагрузки (hot reload).

source: **Method 2**: tarantool/migrations (only for a Tarantool Cartridge cluster)
ru: **Способ 2**: tarantool/migrations (только для кластера на Tarantool Cartridge)

source: This method is described in the README file of the `tarantool/migrations <https://github.com/tarantool/migrations>`_ module.
ru: Про этот способ подробнее написано в README самого модуля `tarantool/migrations <https://github.com/tarantool/migrations>`_.

source: There are also two other methods that we **do not recommend**, but you may find them useful for one reason or another.
ru: Есть также два способа, которые мы **не рекомендуем использовать**, но вы можете найти их полезными по тем или иным причинам.

source: **Method 3**: the ``tarantoolctl`` utility
ru: **Cпособ 3**: утилита ``tarantoolctl``

source: The ``tarantoolctl`` utility ships with Tarantool. Connect to the necessary instance using ``tarantoolctl connect``.
ru: Утилита ``tarantoolctl`` поставляется вместе с Tarantool. Подключитесь к нужному инстансу через команду ``tarantoolctl connect``.

source: If your migration is written in a Lua file, you can execute it using ``dofile()``. Call this function and specify the path to the migration file as the first argument. It looks like this:
ru: Если ваша миграция написана в Lua файле, вы можете исполнить его с помощью функции ``dofile()``. Вызовите ее и первым аргументом укажите путь до файла с миграцией. Выглядит это вот так:

source: (or) Copy the migration script code, paste it into the console, and run it.
ru: (или) можно скопировать код скрипта миграции, вставить его в консоль и применить.

source: **Method 4**: applying migration with Ansible
ru: **Способ 4**: применение миграции с помощью Ansible

source: If you use the `Ansible role <https://github.com/tarantool/ansible-cartridge>`_ to deploy a Tarantool cluster, you can use ``eval``. You can find more information about it `in the Ansible role documentation <https://github.com/tarantool/ansible-cartridge/blob/master/doc/eval.md>`_.
ru: Если вы используете `Ansible-роль для развёртывания кластера Tarantool <https://github.com/tarantool/ansible-cartridge>`_, то вы можете применить ``eval``. Прочитать подробнее про ``eval`` можно `в документации по Ansible-роли <https://github.com/tarantool/ansible-cartridge/blob/master/doc/eval.md>`_.
