Repository: tarantool/doc
Catalog: locale/*/LC_MESSAGES/book/box/data_model.po
Languages: ru

source: Data model
ru: Модель данных

source: This section describes how Tarantool stores values and what operations with data it supports.
ru: В этом разделе описывается то, как в Tarantool организовано хранение данных и какие операции с данными он поддерживает.

source: If you tried to create a database as suggested in our :ref:`"Getting started" exercises <getting_started_db>`, then your test database now looks like this:
ru: Если вы пробовали создать базу данных, как предлагается в упражнениях в :ref:`"Руководстве для начинающих" <getting_started_db>`, то ваша тестовая база данных выглядит следующим образом:

source: Tuples
ru: Кортежи

source: Tarantool operates data in the form of tuples.
ru: Tarantool обрабатывает данные в виде кортежей.

source: tuple
ru: кортеж

source: A tuple is a group of data values in Tarantool's memory. Think of it as a "database record" or a "row". The data values in the tuple are called :term:`fields <field>`.
ru: Кортеж — это группа значений данных в памяти Tarantool. По сути, это "запись в базе данных" или "строка". Значения данных в кортеже называются :term:`полями <field>`.

source: When Tarantool returns a tuple value in the console, by default, it uses :ref:`YAML <interactive_console>` format, for example: ``[3, 'Ace of Base', 1993]``.
ru: Когда Tarantool выводит значение кортежа в консоль, по умолчанию используется формат :ref:`YAML <interactive_console>`, например: ``[3, 'Ace of Base', 1993]``.

source: Internally, Tarantool stores tuples as `MsgPack <https://en.wikipedia.org/wiki/MessagePack>`_ arrays.
ru: В Tarantool кортежи хранятся в виде массивов в формате `MsgPack <https://en.wikipedia.org/wiki/MessagePack>`_.

source: field
ru: поле

source: Fields are distinct data values, contained in a tuple. They play the same role as "row columns" or "record fields" in relational databases, with a few improvements:
ru: Поля — это отдельные значения данных, которые содержатся в кортеже. Они играют ту же роль, что и "столбцы" или "поля записи" в реляционных базах данных, но несколько усовершенствованы:

source: fields can be composite structures, such as arrays or maps,
ru: поля могут представлять собой композитные структуры, такие как таблицы типа массива или ассоциативного массива,

source: fields don't need to have names.
ru: полям не нужны имена.

source: A given tuple may have any number of fields, and the fields may be of different :ref:`types <index-box_data-types>`.
ru: В кортеже может быть любое количество полей, и это могут быть поля разных :ref:`типов <index-box_data-types>`.

source: The field's number is the identifier of the field. Numbers are counted from base 1 in Lua and other 1-based languages, or from base 0 in languages like PHP or C/C++. So, ``1`` or ``0`` can be used in some contexts to refer to the first field of a tuple.
ru: Номер поля служит его идентификатором. В Lua и некоторых других языках нумерация начинается с 1, в других — с 0 (например, в PHP или C/C++). Таким образом, в некоторых контекстах у первого поля кортежа будет индекс ``1`` или ``0``.

source: Spaces
ru: Спейсы

source: Tarantool stores tuples in containers called spaces. In the example above, there's a space called ``tester``.
ru: Tarantool хранит кортежи в контейнерах, называемых спейсами (space). Спейс в примере выше называется ``tester``.

source: space
ru: спейс

source: In Tarantool, a space is a primary container that stores data. It is analogous to tables in relational databases. Spaces contain :term:`tuples <tuple>` -- the Tarantool name for database records. The number of tuples in a space is unlimited.
ru: В Tarantool спейс — это первичный контейнер, хранящий данные. Он похож на таблицы в реляционных базах данных. Спейсы содержат :term:`кортежи <tuple>` — так в Tarantool называются записи в базе данных. Количество кортежей в спейсе не ограничено.

source: At least one space is required to store data with Tarantool. Each space has the following attributes:
ru: Для хранения данных с помощью Tarantool требуется хотя бы один спейс. У каждого спейса есть следующие атрибуты:

source: a unique **name** specified by the user,
ru: уникальное **имя**, указанное пользователем;

source: a unique **numeric identifier** which can be specified by the user, but usually is assigned automatically by Tarantool,
ru: уникальный **числовой идентификатор**, обычно Tarantool назначает его автоматически, но пользователь может его указать сам, если посчитает нужным;

source: an **engine**: *memtx* (default) --- in-memory engine, fast but limited in size, or *vinyl* --- on-disk engine for huge data sets.
ru: **движок**: *memtx* (по умолчанию) — движок «in-memory», быстрый, но ограниченный в размере, или *vinyl* — дисковый движок для огромных наборов данных.

source: To be functional, a space also needs to have a :ref:`primary index <index-box_index>`. It can also have secondary indexes.
ru: Для работы спейсу нужен :ref:`первичный индекс <index-box_index>`. Также он может использовать вторичные индексы.

source: Indexes
ru: Индексы

source: Read the full information about indexes on page :doc:`Indexes </book/box/indexes>`.
ru: Всю информацию про индексы можно найти на странице :doc:`Индексы </book/box/indexes>`.

source: An **index** is a group of key values and pointers.
ru: **Индекс** — это совокупность значений ключей и указателей.

source: As with spaces, you should specify the index **name** and let Tarantool come up with a unique **numeric identifier** ("index id").
ru: Как и для спейсов, для индексов следует указать **имена**, а Tarantool определит уникальный **числовой идентификатор** ("ID индекса").

source: An index always has a **type**. The default index type is :ref:`TREE <indexes-tree>`. TREE indexes are provided by all Tarantool engines, can index unique and non-unique values, support partial key searches, comparisons, and ordered results. Additionally, the memtx engine supports :ref:`HASH <indexes-hash>`, :ref:`RTREE <indexes-rtree>` and :ref:`BITSET <indexes-bitset>` indexes.
ru: У индекса всегда есть определенный **тип**. Тип индекса по умолчанию — :ref:`TREE <indexes-tree>`. TREE-индексы поддерживаются обоими движками Tarantool, могут индексировать уникальные и неуникальные значения, поддерживают поиск по компонентам ключа, сравнение ключей и упорядочивание результатов. Движок memtx поддерживает и другие типы индексов: :ref:`HASH <indexes-hash>`, :ref:`RTREE <indexes-rtree>` и :ref:`BITSET <indexes-bitset>`.

source: An index may be **multi-part**, that is, you can declare that an index key value is composed of two or more fields in the tuple, in any order. For example, for an ordinary TREE index, the maximum number of parts is 255.
ru: Индекс может быть **многокомпонентным**, то есть можно объявить, что ключ индекса состоит из двух или более полей в кортеже в любом порядке. Например, для обычного TREE-индекса максимальное количество частей равно 255.

source: An index may be **unique**, that is, you can declare that it would be illegal to have the same key value twice.
ru: Индекс может быть **уникальным**, то есть можно объявить, что недопустимо дважды задавать одно значение ключа.

source: The first index defined on a space is called the **primary key index**, and it must be unique. All other indexes are called **secondary indexes**, and they may be non-unique.
ru: Первый индекс, определенный для спейса, называется **первичный индекс**. Он должен быть уникальным. Все остальные индексы называются **вторичными индексами**, они могут строиться по неуникальным значениям.

source: Data types
ru: Типы данных

source: Tarantool is both a database manager and an application server. Therefore a developer often deals with two type sets: the types of the programming language (such as Lua) and the types of the Tarantool storage format (MsgPack).
ru: Tarantool представляет собой систему управления базой данных и сервер приложений одновременно. Поэтому разработчику часто приходится работать с двумя системами типов данных: типы языка программирования (например, Lua) и типы формата хранения данных Tarantool (MsgPack).

source: Lua versus MsgPack
ru: Lua в сравнении с MsgPack

source: Scalar / compound
ru: Скалярный / составной

source: MsgPack |nbsp| type
ru: MsgPack-тип |nbsp|

source: Lua type
ru: Lua-тип

source: Example value
ru: Пример значения

source: scalar
ru: скалярный

source: "`boolean`_"
ru: "`boolean`_" (логическое значение)

source: ext (for Tarantool decimal)
ru: ext (для decimal в Tarantool)

source: ext (for Tarantool uuid)
ru: ext (для uuid в Tarantool)

source: compound
ru: составной

source: map
ru: map (ассоциативный массив)

source: "`table`_" (with string keys)
ru: "`table`_" (таблица со строковыми ключами)

source: array
ru: array (массив)

source: "`table`_" (with integer keys)
ru: "`table`_" (таблица с целочисленными ключами)

source: tuple ("`cdata`_")
ru: tuple ("`cdata`_") (кортеж)

source: MsgPack values have variable lengths. So, for example, the smallest number requires only one byte, but the largest number requires nine bytes.
ru: Данные в формате MsgPack имеют переменный размер. Так, например, для наименьшего значения number потребуется только один байт, a для наибольшего потребуется девять байтов.

source: Field type details
ru: Описание типов полей

source: **nil**. In Lua, the nil type has only one possible value, also called ``nil``. Tarantool displays it as ``null`` when using the default :ref:`YAML <interactive_console>` format. Nil may be compared to values of any types with == (is-equal) or ~= (is-not-equal), but other comparison operations will not work. Nil may not be used in Lua tables; the workaround is to use :ref:`box.NULL <box-null>` because ``nil == box.NULL`` is true. Example: ``nil``.
ru: **nil**. В языке Lua у типа nil есть только одно значение, также называемое ``nil``. Tarantool отображает его как ``null`` при использовании формата по умолчанию :ref:`YAML <interactive_console>`. Значение nil можно сравнивать со значениями любых типов данных с помощью операторов == (равно) или ~= (не равно), но никакие другие операции сравнения к nil не применимы. Значение nil также нельзя использовать в Lua-таблицах — в качестве обходного пути вместо nil в таком случае можно указать :ref:`box.NULL <box-null>`, поскольку условие ``nil == box.NULL`` является истинным. Пример: ``nil``.

source: **boolean**. A boolean is either ``true`` or ``false``. Example: ``true``.
ru: **boolean**. Логический тип данных boolean принимает значения ``true`` или ``false``. Пример: ``true``.

source: **integer**. The Tarantool integer type is for integers between -9223372036854775808 and 18446744073709551615, which is about 18 quintillion. This type corresponds to the number type in Lua and to the integer type in MsgPack. Example: ``-2^63``.
ru: **integer**. В Tarantool тип полей integer используется для целых чисел от −9 223 372 036 854 775 808 до 18 446 744 073 709 551 615, то есть до примерно 18 квинтиллионов. Такой тип данных соответствует типам number в Lua и integer в MsgPack. Пример: ``-2^63``.

source: **unsigned**. The Tarantool unsigned type is for integers between 0 and 18446744073709551615. So it is a subset of integer. Example: ``123456``.
ru: **unsigned**. Тип unsigned в Tarantool используется для целых чисел от 0 до 18 446 744 073 709 551 615. Он представляет собой подмножество типа integer. Пример: ``123456``.

source: **double**. The double field type exists mainly to be equivalent to Tarantool/SQL's :ref:`DOUBLE data type <sql_data_type_double>`. In `msgpuck.h <https://github.com/rtsisyk/msgpuck>`_ (Tarantool's interface to MsgPack), the storage type is ``MP_DOUBLE`` and the size of the encoded value is always 9 bytes. In Lua, fields of the double type can only contain non-integer numeric values and cdata values with double floating-point numbers. Examples: ``1.234``, ``-44``, ``1.447e+44``.
ru: **double**. Поле типа double существует главным образом для соответствия типу :ref:`DOUBLE data type <sql_data_type_double>` в Tarantool/SQL . В `msgpuck.h <https://github.com/rtsisyk/msgpuck>`_ (интерфейс Tarantool к MsgPack) тип в хранилище — ``MP_DOUBLE``, а размер закодированного значения всегда составляет 9 байтов. В Lua поля типа double могут содержать только не целые числовые значения и значения cdata с числами с плавающей точкой двойной точности (double). Примеры: ``1.234``, ``-44``, ``1.447e+44``.

source: To avoid using the wrong kind of values inadvertently, use ``ffi.cast()`` when searching or changing ``double`` fields. For example, instead of :samp:`{space_object}:insert`:code:`{`:samp:`{value}`:code:`}` use ``ffi = require('ffi') ...`` :samp:`{space_object}:insert`:code:`({ffi.cast('double',`:samp:`{value}`:code:`)})`. Example:
ru: Чтобы избежать случайного использования неправильного типа значений, используйте явное преобразование типа ``ffi.cast()``, когда вы ищете или изменяете поля типа ``double``. Например, вместо :samp:`{space_object}:insert`:code:`{`:samp:`{value}`:code:`}` используйте ``ffi = require('ffi') ...`` :samp:`{space_object}:insert`:code:`({ffi.cast('double',`:samp:`{value}`:code:`)})`. Пример:

source: Arithmetic with cdata ``double`` will not work reliably, so for Lua, it is better to use the ``number`` type. This warning does not apply for Tarantool/SQL because Tarantool/SQL does :ref:`implicit casting <sql_data_type_conversion>`.
ru: Арифметические операции с cdata формата ``double`` работают ненадёжно, поэтому для Lua лучше использовать тип ``number``. Это не относится к Tarantool/SQL, так как Tarantool/SQL применяет :ref:`неявное приведение типов <sql_data_type_conversion>`.

source: **number**. The Tarantool number field may have both integer and floating-point values, although in Lua a ``number`` is a double-precision floating-point.
ru: **number**. Поле number в Tarantool может содержать значения как целые, так и с плавающей точкой, хотя в Lua тип ``number`` означает число с плавающей точкой двойной точности.

source: Tarantool will try to store a Lua number as floating-point if the value contains a decimal point or is very large (greater than 100 trillion = 1e14), otherwise Tarantool will store it as an integer. To ensure that even very large numbers are stored as integers, use the :ref:`tonumber64 <other-tonumber64>` function, or the LL (Long Long) suffix, or the ULL (Unsigned Long Long) suffix. Here are examples of numbers using regular notation, exponential notation, the ULL suffix and the ``tonumber64`` function: ``-55``, ``-2.7e+20``, ``100000000000000ULL``, ``tonumber64('18446744073709551615')``.
ru: Tarantool по возможности сохраняет числа языка Lua в виде чисел с плавающей запятой, если числовое значение содержит десятичную запятую или если оно очень велико (более 100 триллионов = 1e14). В противном случае Tarantool сохраняет такое значение в виде целого числа. Чтобы даже очень большие величины гарантированно сохранялись как целые числа, используйте функцию :ref:`tonumber64 <other-tonumber64>` или приписывайте в конце суффикс LL (Long Long) или ULL (Unsigned Long Long). Вот примеры записи чисел в обычном представлении, экспоненциальном, с суффиксом ULL и с использованием функции ``tonumber64``: ``−55``, ``−2.7e+20``, ``100000000000000ULL``, ``tonumber64('18446744073709551615')``.

source: **decimal**. The Tarantool decimal type is stored as a MsgPack ext (Extension). Values with the decimal type are not floating-point values although they may contain decimal points. They are exact with up to 38 digits of precision. Example: a value returned by a function in the :ref:`decimal <decimal>` module.
ru: **decimal**. Тип данных decimal в Tarantool хранится в формате MsgPack ext (Extension). Значения с типом decimal не являются числами с плавающей запятой, хотя могут содержать десятичную запятую. Они представляют собой числа с точностью до 38 знаков. Пример: значение, которое возвращает функция в модуле :ref:`decimal <decimal>`.

source: **string**. A string is a variable-length sequence of bytes, usually represented with alphanumeric characters inside single quotes. In both Lua and MsgPack, strings are treated as binary data, with no attempts to determine a string's character set or to perform any string conversion -- unless there is an optional :ref:`collation <index-collation>`. So, usually, string sorting and comparison are done byte-by-byte, without any special collation rules applied. For example, numbers are ordered by their point on the number line, so 2345 is greater than 500; meanwhile, strings are ordered by the encoding of the first byte, then the encoding of the second byte, and so on, so ``'2345'`` is less than ``'500'``. Example: ``'A, B, C'``.
ru: **string**. Строка (string) представляет собой последовательность байтов переменной длины. Обычно она записывается буквенно-цифровыми символами в одинарных кавычках. Как Lua, так и MsgPack рассматривают строки как двоичные данные, не пытаясь определить кодировку строки или как-то её преобразовать, кроме случаев, когда указаны необязательные :ref:`правила сравнения символов <index-collation>`. Таким образом, обычно сортировка и сравнение строк выполняются побайтово, а дополнительные правила сравнения символов не применяются. Например, числа упорядочены по их положению на числовой прямой, поэтому 2345 больше, чем 500. Строки же упорядочены сначала по кодировке первого байта, затем по кодировке второго байта и так далее, так что ``'2345'`` меньше ``'500'``. Пример: ``'A, B, C'``.

source: **bin**. A bin (binary) value is not directly supported by Lua but there is a Tarantool type ``varbinary`` which is encoded as MsgPack binary. For an (advanced) example showing how to insert varbinary into a database, see the Cookbook Recipe for :ref:`ffi_varbinary_insert <cookbook-ffi_varbinary_insert>`. Example: ``"\65 \66 \67"``.
ru: **bin**. Значения типа bin (двоичные значения) не поддерживаются непосредственно в Lua, но в Tarantool есть тип ``varbinary``, который кодируется в тип binary из MsgPack. Пример вставки varbinary в базу данных см. в рекомендациях по разработке :ref:`ffi_varbinary_insert <cookbook-ffi_varbinary_insert>` (продвинутого уровня). Пример: ``"\65 \66 \67"``.

source: **uuid**. The Tarantool uuid type is used for :ref:`Universally Unique Identifiers <uuid-module>`. Since version :doc:`2.4.1 </release/2.4.1>` Tarantool stores ``uuid`` values as a :ref:`MsgPack ext <msgpack_ext-uuid>` (Extension).
ru: **uuid**. Тип uuid в Tarantool используется для :ref:`универсальных уникальных идентификаторов (UUID) <uuid-module>`. Начиная с версии :doc:`2.4.1 </release/2.4.1>`, Tarantool хранит значения ``uuid`` в формате :ref:`MsgPack ext <msgpack_ext-uuid>` (Extension).

source: Example: ``64d22e4d-ac92-4a23-899a-e5934af5479``.
ru: Пример: ``64d22e4d-ac92-4a23-899a-e5934af5479``.

source: **array**. An array is represented in Lua with ``{...}`` (`braces <https://www.lua.org/pil/11.1.html>`_). Examples: lists of numbers representing points in geometric figures: ``{10, 11}``, ``{3, 5, 9, 10}``.
ru: **array**. В Lua массив (array) обозначается ``{...}`` (`фигурными скобками <https://www.lua.org/pil/11.1.html>`_). Примеры: списки чисел, которые обозначают точки геометрической фигуры: ``{10, 11}``, ``{3, 5, 9, 10}``.

source: **table**. Lua tables with string keys are stored as MsgPack maps; Lua tables with integer keys starting with 1 are stored as MsgPack arrays. Nils may not be used in Lua tables; the workaround is to use :ref:`box.NULL <box-null>`. Example: a ``box.space.tester:select()`` request will return a Lua table.
ru: **table**. Lua-таблицы со строковыми ключами хранятся в виде ассоциативных массивов MsgPack map. Lua-таблицы с целочисленными ключами, начиная с 1, хранятся в виде массивов MsgPack array. В Lua-таблицах нельзя использовать nil; вместо этого можно использовать :ref:`box.NULL <box-null>`. Пример: запрос ``box.space.tester:select()`` вернет Lua-таблицу.

source: **tuple**. A tuple is a light reference to a MsgPack array stored in the database. It is a special type (cdata) to avoid conversion to a Lua table on retrieval. A few functions may return tables with multiple tuples. For tuple examples, see :ref:`box.tuple <box_tuple>`.
ru: **tuple**. Кортеж (tuple) представляет собой легкую ссылку на массив типа MsgPack array, который хранится в базе данных. Это особый тип (cdata), который создан во избежание конвертации в Lua-таблицу при выборке данных. Некоторые функции могут возвращать таблицы с множеством кортежей. Примеры с кортежами см. в разделе :ref:`box.tuple <box_tuple>`.

source: **scalar**. Values in a scalar field can be boolean, integer, unsigned, double, number, decimal, string, uuid, or varbinary; but not array, map, or tuple. Examples: ``true``, ``1``, ``'xxx'``.
ru: **scalar**. Значения в поле типа scalar могут быть следующих типов: boolean, integer, unsigned, double, number, decimal, string, uuid, varbinary. Они не могут иметь тип array, map или tuple. Примеры: ``true``, ``1``, ``'xxx'``.

source: **any**. Values in a field of this type can be boolean, integer, unsigned, double, number, decimal, string, uuid, varbinary, array, map, or tuple. Examples: ``true``, ``1``, ``'xxx'``, ``{box.NULL, 0}``.
ru: **any**. Значения в поле типа any могут быть следующих типов: boolean, integer, unsigned, double, number, decimal, string, uuid, varbinary, array, map, tuple. Примеры: ``true``, ``1``, ``'xxx'``, ``{box.NULL, 0}``.

source: Examples of insert requests with different field types:
ru: Примеры запросов вставки с разными типами полей:

source: Indexed field types
ru: Типы индексированных полей

source: Indexes restrict values that Tarantool can store with MsgPack. This is why, for example, ``'unsigned'`` and ``'integer'`` are different field types, although in MsgPack they are both stored as integer values. An ``'unsigned'`` index contains only *non-negative* integer values, while an ``‘integer’`` index contains *any* integer values.
ru: Индексы ограничивают значения, которые Tarantool может хранить в формате MsgPack. Вот почему, например, есть отдельные типы полей ``'unsigned'`` (число без знака) и ``'integer'`` (целое число), хотя в MsgPack они оба хранятся как целочисленные значения. Индекс типа ``'unsigned'`` содержит только *неотрицательные* целочисленные значения, а индекс типа ``'integer'`` содержит *любые* целочисленные значения.

source: Here again are the field types described in :ref:`Field Type Details <index_box_field_type_details>`, and the index types they can fit in. The default field type is ``'unsigned'`` and the default index type is TREE. Although ``'nil'`` is not a legal indexed field type, indexes may contain `nil` :ref:`as a non-default option <box_space-is_nullable>`. Full information is in section :ref:`Details about index field types <details_about_index_field_types>`.
ru: Здесь снова приводятся типы полей, описанные в :ref:`Описании типов полей <index_box_field_type_details>`, а также типы индексов, где их можно использовать. По умолчанию, тип поля — ``'unsigned'``, тип индекса — TREE. Хотя в качестве типа индексированого поля ``'nil'`` использовать нельзя, индексы могут содержать `nil` как :ref:`опцию, которая не используется по умолчанию <box_space-is_nullable>`. Более подробную информацию см. в разделе :ref:`Описание типов индексированных полей <details_about_index_field_types>`.

source: Field type name string
ru: Имя типа поля

source: Field type |br|
ru: Тип поля |br|

source: Index type
ru: Тип индекса

source: :ref:`TREE or HASH <box_index-type>`
ru: :ref:`TREE или HASH <box_index-type>`

source: ``'integer'`` (may also be called ``‘int’``)
ru: ``'integer'`` (также может называться ``‘int’``)

source: :ref:`integer <index-box_integer>`, which may include unsigned values
ru: :ref:`integer <index-box_integer>`, может включать в себя значения unsigned (без знака)

source: TREE or HASH
ru: TREE или HASH
