Repository: tarantool/doc
Catalog: locale/*/LC_MESSAGES/book/box/data_model.po
Languages: ru

source: ``'unsigned'`` (may also be called ``'uint'`` or ``'num'``, but ``'num'`` is deprecated)
ru: ``'unsigned'`` (без знака, также может называться ``'uint'`` или ``'num'``, но ``'num'`` объявлен устаревшим)

source: TREE, BITSET, or HASH
ru: TREE, BITSET или HASH

source: :ref:`number <index-box_number>`, which may include :ref:`integer <index-box_integer>`, :ref:`double <index-box_double>`, or :ref:`decimal <index-box_decimal>` values
ru: :ref:`number <index-box_number>`, может включать в себя значения типа :ref:`integer <index-box_integer>`, :ref:`double <index-box_double>` или :ref:`decimal <index-box_decimal>`

source: ``'string'`` (may also be called ``'str'``)
ru: ``'string'`` (строка, также может называться ``'str'``)

source: TREE, HASH, or BITSET (since version 2.7)
ru: TREE, HASH или BITSET (с версии 2.7)

source: may include :ref:`nil <index-box_nil>`, :ref:`boolean <index-box_boolean>`, :ref:`integer <index-box_integer>`, :ref:`unsigned <index-box_unsigned>`, :ref:`number <index-box_number>`, :ref:`decimal <index-box_decimal>`, :ref:`string <index-box_string>`, :ref:`varbinary <index-box_bin>`, or :ref:`uuid <index-box_uuid>` values
ru: может содержать значения :ref:`nil <index-box_nil>`, :ref:`boolean <index-box_boolean>`, :ref:`integer <index-box_integer>`, :ref:`unsigned <index-box_unsigned>`, :ref:`number <index-box_number>`, :ref:`decimal <index-box_decimal>`, :ref:`string <index-box_string>` или :ref:`varbinary <index-box_bin>`

source: When a scalar field contains values of different underlying types, the key order is: nils, then booleans, then numbers, then strings, then varbinaries, then uuids.
ru: Когда поле типа scalar содержит значения различных базовых типов, то порядок ключей следующий: nil, затем boolean, затем number, затем string, затем varbinary, затем uuid.

source: Collations
ru: Сортировка

source: By default, when Tarantool compares strings, it uses the so-called **binary collation**. It only considers the numeric value of each byte in a string. For example, the encoding of ``'A'`` (what used to be called the "ASCII value") is 65, the encoding of ``'B'`` is 66, and the encoding of ``'a'`` is 98. Therefore, if the string is encoded with ASCII or UTF-8, then ``'A' < 'B' < 'a'``.
ru: Когда Tarantool сравнивает строки, по умолчанию он использует **двоичные параметры сортировки** (**binary collation**). При этом он учитывает только числовое значение каждого байта в строке. Например, код символа ``'A'`` (раньше называлась "значение ASCII") — число 65, код ``'B'`` — число 66, а код ``'a'`` -- число 98. Поэтому ``'A' < 'B' < 'a'``, если строка закодирована в ASCII или UTF-8.

source: Binary collation is the best choice for fast deterministic simple maintenance and searching with Tarantool indexes.
ru: Двоичная сортировка — лучший выбор для быстрого детерминированного простого обслуживания и поиска с использованием индексов Tarantool.

source: But if you want the ordering that you see in phone books and dictionaries, then you need Tarantool's optional collations, such as ``unicode`` and ``unicode_ci``, which allow for ``'a' < 'A' < 'B'`` and ``'a' == 'A' < 'B'`` respectively.
ru: Но если вы хотите такое упорядочение, как в телефонных справочниках и словарях, то вам нужна одна из дополнительных сортировок Tarantool: ``unicode`` или ``unicode_ci``. Они обеспечивают ``'a' < 'A' < 'B'`` и ``'a' == 'A' < 'B'`` соответственно.

source: **The unicode and unicode_ci optional collations** use the ordering according to the `Default Unicode Collation Element Table (DUCET) <http://unicode.org/reports/tr10/#Default_Unicode_Collation_Element_Table>`_ and the rules described in `Unicode® Technical Standard #10 Unicode Collation Algorithm (UTS #10 UCA) <http://unicode.org/reports/tr10>`_. The only difference between the two collations is about `weights <https://unicode.org/reports/tr10/#Weight_Level_Defn>`_:
ru: Дополнительные виды сортировки **unicode и unicode_ci** обеспечивают упорядочение в соответствии с `Таблицей сортировки символов Юникода по умолчанию (DUCET) <http://unicode.org/reports/tr10/#Default_Unicode_Collation_Element_Table>`_ и правилами, указанными в `Техническом стандарте Юникода №10 -- Алгоритм сортировки по Юникоду (Unicode® Technical Standard #10 Unicode Collation Algorithm (UTS #10 UCA)) <http://unicode.org/reports/tr10>`_. Единственное отличие между двумя видами сортировки — `вес <https://unicode.org/reports/tr10/#Weight_Level_Defn>`_:

source: ``unicode`` collation observes L1, L2, and L3 weights (strength = 'tertiary');
ru: сортировка ``unicode`` принимает во внимание уровни веса L1, L2 и L3 (уровень = 'tertiary', третичный);

source: ``unicode_ci`` collation observes only L1 weights (strength = 'primary'), so for example ``'a' == 'A' == 'á' == 'Á'``.
ru: сортировка ``unicode_ci`` принимает во внимание только вес L1 (уровень = 'primary', первичный), поэтому, например, ``'a' == 'A' == 'á' == 'Á'``.

source: As an example, take some Russian words:
ru: Для примера возьмем некоторые русские слова:

source: ...and show the difference in ordering and selecting by index:
ru: ...и покажем разницу в упорядочении и выборке по индексу:

source: with ``unicode`` collation:
ru: с сортировкой по ``unicode``:

source: with ``unicode_ci`` collation:
ru: с сортировкой по ``unicode_ci``:

source: In all, collation involves much more than these simple examples of upper case / lower case and accented / unaccented equivalence in alphabets. We also consider variations of the same character, non-alphabetic writing systems, and special rules that apply for combinations of characters.
ru: Сортировка включает в себя ещё множество аспектов, кроме показанного в этом примере сопоставления букв верхнего и нижнего регистра, с диакритическими знаками и без них, и с учётом алфавита. Учитываются также вариации одного и того же символа, системы неалфавитного письма и применяются специальные правила для комбинаций символов.

source: For English, Russian, and most other languages and use cases, use the "unicode" and "unicode_ci" collations. If you need Cyrillic letters 'Е' and 'Ё' to have the same level-1 weights, try the Kyrgyz collation.
ru: Для английского, русского и большинства других языков используйте "unicode" и "unicode_ci". Если вам нужно, чтобы у кириллических букв 'Е' и 'Ё' веса 1 уровня были одинаковыми, попробуйте киргизскую сортировку.

source: **The tailored optional collations**: for other languages, Tarantool supplies tailored collations for every modern language that has more than a million native speakers, and for specialized situations such as the difference between dictionary order and telephone book order. Run ``box.space._collation:select()`` to see the complete list.
ru: **Специализированные дополнительные виды сортировки**: Для других языков Tarantool предлагает специализированные виды сортировки для любого современного языка, на котором говорят более миллиона человек. Кроме того, специализированные дополнительные виды сортировки возможны для особых случаев, когда слова в словаре упорядочиваются не так, как в телефонном справочнике. Чтобы увидеть полный список, выполните команду ``box.space._collation:select()``.

source: The tailored collation names have the form ``unicode_[language code]_[strength]``, where language code is a standard 2-character or 3-character language abbreviation, and strength is ``s1`` for "primary strength" (level-1 weights), ``s2`` for "secondary", ``s3`` for "tertiary". Tarantool uses the same language codes as the ones in the "list of tailorable locales" on man pages of `Ubuntu <http://manpages.ubuntu.com/manpages/bionic/man3/Unicode::Collate::Locale.3perl.html>`_ and `Fedora <http://www.polarhome.com/service/man/?qf=Unicode%3A%3ACollate%3A%3ALocale&af=0&tf=2&of=Fedora>`_. Charts explaining the precise differences from DUCET order are in the `Common Language Data Repository <https://unicode.org/cldr/charts/30/collation>`_.
ru: Названия специализированных видов сортировки имеют вид ``unicode_[language code]_[strength]``], где language code — это стандартный код языка из 2 или 3 символов, а значение strength может быть ``s1`` для уровня "primary" (вес уровня 1), ``s2`` для уровня "secondary", ``s3`` для уровня "tertiary". Tarantool использует те же коды языков, что указаны в списке специализированных вариантов языковых настроек на страницах руководств по `Ubuntu <http://manpages.ubuntu.com/manpages/bionic/man3/Unicode::Collate::Locale.3perl.html>`_ и `Fedora <http://www.polarhome.com/service/man/?qf=Unicode%3A%3ACollate%3A%3ALocale&af=0&tf=2&of=Fedora>`_. Схемы, в деталях объясняющие отличия от упорядочения по DUCET, можно найти в `Общем репозитории языковых данных (Common Language Data Repository) <https://unicode.org/cldr/charts/30/collation>`_.

source: Sequences
ru: Последовательности

source: A **sequence** is a generator of ordered integer values.
ru: **Последовательность** -- это генератор упорядоченных значений целых чисел.

source: As with spaces and indexes, you should specify the sequence **name** and let Tarantool generate a unique numeric identifier (sequence ID).
ru: Как и для спейсов и индексов, для последовательности вы должны указать **имя**, а Tarantool создаст уникальный для неё числовой идентификатор ("ID последовательности).

source: As well, you can specify several options when creating a new sequence. The options determine what value will be generated whenever the sequence is used.
ru: Кроме того, можно указать несколько параметров при создании новой последовательности. Параметры определяют, какое значение будет генерироваться при использовании последовательности.

source: Options for box.schema.sequence.create()
ru: Параметры для box.schema.sequence.create()

source: Option name
ru: Имя параметра

source: Type and meaning
ru: Тип и значение

source: Default
ru: Значение по умолчанию

source: Examples
ru: Примеры

source: Integer. The value to generate the first time a sequence is used
ru: Integer. Значение генерируется, когда последовательность используется впервые

source: Integer. Values smaller than this cannot be generated
ru: Integer. Значения, ниже указанного, генерироваться не могут

source: Integer. Values larger than this cannot be generated
ru: Integer. Значения, выше указанного, генерироваться не могут

source: Boolean. Whether to start again when values cannot be generated
ru: Логическое значение. Если значения не могут быть сгенерированы, начинать ли заново

source: Integer. The number of values to store in a cache
ru: Integer. Количество значений, которые будут храниться в кэше

source: Integer. What to add to the previous generated value, when generating a new value
ru: Integer. Что добавить к предыдущему сгенерированному значению, когда генерируется новое значение

source: **if_not_exists**
ru: **if_not_exists** (если отсутствует)

source: Boolean. If this is true and a sequence with this name exists already, ignore other options and use the existing values
ru: Логическое значение. Если выставлено в true (истина) и существует последовательность с таким именем, то игнорировать другие опции и использовать текущие значения

source: Once a sequence exists, it can be altered, dropped, reset, forced to generate the next value, or associated with an index.
ru: Существующую последовательность можно изменять, удалять, сбрасывать, заставить сгенерировать новое значение или ассоциировать с индексом.

source: For an initial example, we generate a sequence named 'S'.
ru: Для первоначального примера сгенерируем последовательность под названием 'S'.

source: The result shows that the new sequence has all default values, except for the two that were specified, ``min`` and ``start``.
ru: В результате видим, что в новой последовательность есть все значения по умолчанию, за исключением указанных ``min`` и ``start``.

source: Then we get the next value, with the ``next()`` function.
ru: Затем получаем следующее значение с помощью функции ``next()``.

source: The result is the same as the start value. If we called ``next()`` again, we would get 6 (because the previous value plus the step value is 6), and so on.
ru: Результат точно такой же, как и начальное значение. Если мы снова вызовем ``next()``, то получим 6 (потому что предыдущее значение плюс значение шага составит 6) и так далее.

source: Then we create a new table and specify that its primary key should be generated from the sequence.
ru: Затем мы создаём новую таблицу и определяем, что ее первичный ключ должен быть получен из последовательности.

source: Then we insert a tuple without specifying a value for the primary key.
ru: Затем вставляем кортеж, не указывая значение первичного ключа.

source: The result is a new tuple where the first field has a value of 6. This arrangement, where the system automatically generates the values for a primary key, is sometimes called "auto-incrementing" or "identity".
ru: В результате имеем новый кортеж со значением 6 в первом поле. Такой способ организации данных, когда система автоматически генерирует значения для первичного ключа, иногда называется "автоинкрементным" (т.е. с автоматическим увеличением) или "по идентификатору".

source: For syntax and implementation details, see the reference for :doc:`box.schema.sequence </reference/reference_lua/box_schema_sequence>`.
ru: Для получения подробной информации о синтаксисе и методах реализации см. справочник по :doc:`box.schema.sequence </reference/reference_lua/box_schema_sequence>`.

source: Persistence
ru: Персистентность

source: To ensure data persistence, Tarantool records updates to the database in the so-called :ref:`write-ahead log (WAL) <internals-wal>` files. When a power outage occurs or the Tarantool instance is killed incidentally, the in-memory database is lost. In such case, Tarantool restores the data from WAL files by reading them and redoing the requests. This is called the "recovery process". You can change the timing of the WAL writer or turn it off by setting the :ref:`wal_mode <cfg_binary_logging_snapshots-wal_mode>`.
ru: Чтобы обеспечить персистентность данных, Tarantool записывает обновления базы данных в так называемые :ref:`файлы журнала упреждающей записи (write-ahead log, WAL) <internals-wal>`. При отключении электроэнергии или случайном завершении работы экземпляра Tarantool данные в оперативной памяти теряются. В таком случае Tarantool восстанавливает данные из WAL-файлов, повторно выполняя запросы, записанные в них. Это называется "процесс восстановления". Можно настроить, как часто данные записываются в WAL-файлы, или отключить запись совсем с помощью :ref:`wal_mode <cfg_binary_logging_snapshots-wal_mode>`.

source: Tarantool also maintains a set of :ref:`snapshot files <internals-snapshot>`. These files contain an on-disk copy of the entire data set for a given moment. Instead of reading every WAL file since the databases were created, the recovery process can load the latest snapshot file and then read the WAL files, produced after the snapshot file was made. After creating a new snapshot, the earlier WAL files can be removed to free up space.
ru: Tarantool также сохраняет набор файлов со статическими снимками данных (:ref:`snapshots <internals-snapshot>`). Файл со снимком — это дисковая копия всех данных в базе на какой-то момент. Вместо того, чтобы перечитывать все WAL-файлы с момента создания базы, Tarantool в процессе восстановления может загрузить самый свежий снимок и затем прочитать только те WAL-файлы, которые были созданы начиная с момента сохранения снимка. После создания новых снимков более ранние WAL-файлы могут быть удалены, чтобы освободить место на диске.

source: To force immediate creation of a snapshot file, use the :doc:`box.snapshot() </reference/reference_lua/box_snapshot>` function. To enable the automatic creation of snapshot files, use Tarantool's :ref:`checkpoint daemon <book_cfg_checkpoint_daemon>`. The checkpoint daemon sets intervals for forced checkpoints. It makes sure that the states of both memtx and vinyl storage engines are synchronized and saved to disk, and automatically removes earlier WAL files.
ru: Чтобы принудительно создать файл снимка, используйте в Tarantool функцию :doc:`box.snapshot() </reference/reference_lua/box_snapshot>`. Чтобы включить автоматическое создание файлов снимков, используйте :ref:`демон создания контрольных точек (checkpoint daemon) <book_cfg_checkpoint_daemon>` Tarantool. Этот демон определяет интервалы для принудительного создания контрольных точек. Он обеспечивает синхронизацию и сохранение на диск образов движков базы данных (как memtx, так и vinyl), а также автоматически удаляет более ранние WAL-файлы.

source: Snapshot files can be created even if there is no WAL file.
ru: Файлы со снимками можно создавать, даже если WAL-файлы отсутствуют.

source: The memtx engine makes only regular checkpoints with the interval set in :ref:`checkpoint daemon <book_cfg_checkpoint_daemon>` configuration.
ru: Движок memtx регулярно создает контрольные точки с интервалом, указанным в настройках :ref:`демона создания контрольных точек <book_cfg_checkpoint_daemon>`.

source: The vinyl engine runs checkpointing in the background at all times.
ru: Движок vinyl постоянно сохраняет состояние в контрольной точке в фоновом режиме.

source: See the :ref:`Internals <internals-data_persistence>` section for more details about the WAL writer and the recovery process.
ru: Для получения более подробной информации о методе записи WAL-файлов и процессе восстановления см. раздел :ref:`Внутренняя реализация <internals-data_persistence>`.

source: Operations
ru: Операции

source: Data operations
ru: Операции с данными

source: The basic data operations supported in Tarantool are:
ru: Tarantool поддерживает следующие основные операции с данными:

source: five data-manipulation operations (INSERT, UPDATE, UPSERT, DELETE, REPLACE), and
ru: пять операций по изменению данных (INSERT, UPDATE, UPSERT, DELETE, REPLACE) и

source: one data-retrieval operation (SELECT).
ru: одну операцию по выборке данных (SELECT).

source: All of them are implemented as functions in :ref:`box.space <box_space>` submodule.
ru: Все они реализованы в виде функций во вложенном модуле :ref:`box.space <box_space>`.

source: **Examples:**
ru: **Примеры:**

source: :ref:`INSERT <box_space-insert>`: Add a new tuple to space 'tester'.
ru: :ref:`INSERT <box_space-insert>`: добавить новый кортеж к спейсу 'tester'.

source: The first field, field[1], will be 999 (MsgPack type is `integer`).
ru: Первое поле, field[1], будет 999 (тип MsgPack -- `integer`, целое число).

source: The second field, field[2], will be 'Taranto' (MsgPack type is `string`).
ru: Второе поле, field[2], будет 'Taranto' (тип MsgPack -- `string`, строка).

source: :ref:`UPDATE <box_space-update>`: Update the tuple, changing field field[2].
ru: :ref:`UPDATE <box_space-update>`: обновить кортеж, изменяя поле field[2].

source: The clause "{999}", which has the value to look up in the index of the tuple's primary-key field, is mandatory, because ``update()`` requests must always have a clause that specifies a unique key, which in this case is field[1].
ru: Оператор "{999}" со значением, которое используется для поиска поля, соответствующего ключу в первичном индексе, является обязательным, поскольку в запросе ``update()`` должен быть оператор, который указывает уникальный ключ, в данном случае -- field[1].

source: The clause "{{'=', 2, 'Tarantino'}}" specifies that assignment will happen to field[2] with the new value.
ru: Оператор "{{'=', 2, 'Tarantino'}}" указывает, что назначение нового значения относится к field[2].

source: :ref:`UPSERT <box_space-upsert>`: Upsert the tuple, changing field field[2] again.
ru: :ref:`UPSERT <box_space-upsert>`: обновить или вставить кортеж, снова изменяя поле field[2].

source: The syntax of ``upsert()`` is similar to the syntax of ``update()``. However, the execution logic of these two requests is different. UPSERT is either UPDATE or INSERT, depending on the database's state. Also, UPSERT execution is postponed until after transaction commit, so, unlike ``update()``, ``upsert()`` doesn't return data back.
ru: Синтаксис ``upsert()`` похож на синтаксис ``update()``. Однако логика выполнения двух запросов отличается. UPSERT означает UPDATE или INSERT, в зависимости от состояния базы данных. Кроме того, выполнение UPSERT откладывается до коммита транзакции, поэтому в отличие от ``update()``, ``upsert()`` не возвращает данные.

source: :ref:`REPLACE <box_space-replace>`: Replace the tuple, adding a new field.
ru: :ref:`REPLACE <box_space-replace>`: заменить кортеж, добавляя новое поле.

source: This is also possible with the ``update()`` request, but the ``update()`` request is usually more complicated.
ru: Это действие также можно выполнить с помощью запроса ``update()``, но обычно запрос ``update()`` более сложен.

source: :ref:`SELECT <box_space-select>`: Retrieve the tuple.
ru: :ref:`SELECT <box_space-select>`: провести выборку кортежа.

source: The clause "{999}" is still mandatory, although it does not have to mention the primary key.
ru: Оператор "{999}" все еще обязателен, хотя в нем не должен упоминаться первичный ключ.

source: :ref:`DELETE <box_space-delete>`: Delete the tuple.
ru: :ref:`DELETE <box_space-delete>`: удалить кортеж.

source: In this example, we identify the primary-key field.
ru: В этом примере мы определяем поле, соответствующее ключу в первичном индексе.

source: Summarizing the examples:
ru: Подводя итоги по примерам:

source: Functions ``insert`` and ``replace`` accept a tuple (where a primary key comes as part of the tuple).
ru: Функции ``insert`` и ``replace`` принимают кортеж (где первичный ключ -- это часть кортежа).

source: Function ``upsert`` accepts a tuple (where a primary key comes as part of the tuple), and also the update operations to execute.
ru: Функция ``upsert`` принимает кортеж (где первичный ключ -- это часть кортежа), а также операции по обновлению.

source: Function ``delete`` accepts a full key of any unique index (primary or secondary).
ru: Функция ``delete`` принимает полный ключ любого уникального индекса (первичный или вторичный).

source: Function ``update`` accepts a full key of any unique index (primary or secondary), and also the operations to execute.
ru: Функция ``update`` принимает полный ключ любого уникального индекса (первичный или вторичный), а также операции к выполнению.

source: Function ``select`` accepts any key: primary/secondary, unique/non-unique, full/partial.
ru: Функция ``select`` принимает любой ключ: первичный/вторичный, уникальный/неуникальный, полный/часть.

source: See reference on ``box.space`` for more :ref:`details on using data operations <box_space-operations-detailed-examples>`.
ru: Для получения более :ref:`подробной информации по использованию операций с данными <box_space-operations-detailed-examples>` см. справочник по ``box.space``.

source: Besides Lua, you can use :ref:`Perl, PHP, Python or other programming language connectors <index-box_connectors>`. The client server protocol is open and documented. See this :ref:`annotated BNF <box_protocol-iproto_protocol>`.
ru: Помимо Lua можно использовать :ref:`коннекторы к Perl, PHP, Python или другому языку программирования <index-box_connectors>`. Клиент-серверный протокол открыт и задокументирован. См. :ref:`БНФ с комментариями <box_protocol-iproto_protocol>`.

source: Complexity factors
ru: Факторы сложности

source: In reference for :ref:`box.space <box_space>` and :doc:`/reference/reference_lua/box_index` submodules, there are notes about which complexity factors might affect the resource usage of each function.
ru: Во вложенных модулях :ref:`box.space <box_space>` и :doc:`/reference/reference_lua/box_index` содержится информация о том, как факторы сложности могут повлиять на использование каждой функции.

source: Complexity factor
ru: Фактор сложности
