Repository: tarantool/doc
Catalog: locale/*/LC_MESSAGES/book/box/indexes.po
Languages: ru

source: Indexes
ru: Индексы

source: An **index** is a special data structure that stores a group of key values and pointers. It is used for efficient manipulations with data.
ru: **Индекс** — это специальная структура данных, которая хранит группу ключевых значений и указателей. Индекс используется для эффективного управления данными.

source: As with spaces, you should specify the index **name**, and let Tarantool come up with a unique **numeric identifier** ("index id").
ru: Как и для спейсов, индексам следует указать **имена**, а Tarantool определит уникальный **числовой идентификатор** ("ID индекса").

source: An index may be **multi-part**, that is, you can declare that an index key value is composed of two or more fields in the tuple, in any order. For example, for an ordinary TREE index, the maximum number of parts is 255.
ru: Индекс может быть **составным** (multi-part), то есть можно объявить, что ключ индекса состоит из двух или более полей в кортеже в любом порядке. Например, для обычного TREE-индекса максимальное количество частей равно 255.

source: An index may be **unique**, that is, you can declare that it would be illegal to have the same key value twice.
ru: Индекс может быть **уникальным**, то есть можно объявить, что недопустимо дважды задавать одно значение ключа.

source: The first index defined on a space is called the **primary key index**, and it must be unique. All other indexes are called **secondary indexes**, and they may be non-unique.
ru: Первый индекс, определенный для спейса, называется **первичный индекс** (primary key). Он должен быть уникальным. Все остальные индексы называются **вторичными индексами** (secondary), они могут строиться по неуникальным значениям.

source: Indexes have certain limitations. See details on page :doc:`Limitations </book/box/limitations>`.
ru: На индексы распространяются определенные ограничения. Более подробную информацию см. на странице :doc:`Ограничения </book/box/limitations>`.

source: Creating an index
ru: Создание индекса

source: It is mandatory to create an index for a space before trying to insert tuples into the space, or select tuples from the space.
ru: Перед тем, как вставлять кортежи в спейс или выбирать из него кортежи, нужно обязательно создать индекс для этого спейса.

source: The simple :doc:`index-creation </reference/reference_lua/box_space/create_index>` operation is:
ru: Простая операция по :doc:`созданию индекса </reference/reference_lua/box_space/create_index>` выглядит следующим образом:

source: This creates a unique :ref:`TREE <indexes-tree>` index on the first field of all tuples (often called "Field#1"), which is assumed to be numeric.
ru: При этом создается уникальный :ref:`TREE-индекс <indexes-tree>` по первому полю всех кортежей (обычно его называют "Field#1"). Предполагается, что индексируемое поле является числовым.

source: A recommended design pattern for a data model is to base primary keys on the first fields of a tuple. This speeds up tuple comparison due to the specifics of data storage and the way comparisons are arranged in Tarantool.
ru: Рекомендуется проектировать модель данных так, чтобы первичные ключи были первыми полями в кортеже. Это позволяет быстрее сравнивать кортежи, учитывая специфику хранения данных и способ организации сравнений в Tarantool.

source: The simple :doc:`SELECT </reference/reference_lua/box_index/select>` request is:
ru: Вот простой запрос :doc:`SELECT </reference/reference_lua/box_index/select>`:

source: This looks for a single tuple via the first index. Since the first index is always unique, the maximum number of returned tuples will be 1. You can call ``select()`` without arguments, and it will return all tuples. Be careful! Using ``select()`` for huge spaces hangs your instance.
ru: Такой запрос ищет отдельный кортеж, используя первичный индекс. Поскольку первичный индекс всегда уникален, то данный запрос вернет не более одного кортежа. Можно также вызвать ``select()`` без аргументов, чтобы вернуть все кортежи. Осторожно! Если вызвать ``select()`` без аргументов в огромном спейсе, ваш экземпляр зависнет.

source: An index definition may also include identifiers of tuple fields and their expected **types**. See allowed indexed field types in section :ref:`Details about indexed field types <details_about_index_field_types>`:
ru: Определение индекса может также содержать идентификаторы полей кортежа и их предполагаемые **типы**. См. допустимые типы полей в разделе :ref:`Описание типов индексируемых полей <details_about_index_field_types>`:

source: Space definitions and index definitions are stored permanently in Tarantool's system spaces :ref:`_space <box_space-space>` and :ref:`_index <box_space-index>`.
ru: Определения спейса и определения индексов хранятся в системных спейсах Tarantool :ref:`_space <box_space-space>` и :ref:`_index <box_space-index>` соответственно.

source: Tip
ru: Примечание

source: See full information about creating indexes, such as how to create a multikey index, an index using the ``path`` option, or how to create a functional index in our reference for :doc:`/reference/reference_lua/box_space/create_index`.
ru: Полную информацию о создании индексов, например о создании индексов по массиву (multikey), индексов с использованием пути ``path`` или функциональных индексов см. в справочнике :doc:`/reference/reference_lua/box_space/create_index`.

source: Index operations
ru: Операции с индексами

source: Index operations are automatic: if a data manipulation request changes a tuple, then it also changes the index keys defined for the tuple.
ru: Операции с индексами производятся автоматически. Если запрос на изменение данных меняет данные в кортеже, то изменятся и ключи индекса для данного кортежа.

source: For further demonstrations let's create a sample space named ``tester`` and put it in a variable ``my_space``:
ru: Для примера создадим спейс с именем ``tester`` и поместим его в переменную ``my_space``:

source: Format the created space by specifying field names and types:
ru: Отформатируем созданный спейс, указав имена и типы полей:

source: Create the **primary** index (named ``primary``):
ru: Создадим **первичный** индекс с именем ``primary``:

source: This is a primary index based on the ``id`` field of each tuple.
ru: Это первичный индекс по полю ``id`` в каждом кортеже.

source: Insert some :ref:`tuples <index-box_tuple>` into the space:
ru: Вставим несколько :ref:`кортежей <index-box_tuple>` в спейс:

source: Create a **secondary index**:
ru: Создадим **вторичный индекс**:

source: Create a **multi-part index** with three parts:
ru: Создадим **составной индекс** (multi-part) из трех частей:

source: **There are the following SELECT variations:**
ru: **Можно использовать такие варианты SELECT:**

source: The search can use **comparisons** other than equality:
ru: Помимо условия равенства, при поиске могут использоваться и другие **условия сравнения**:

source: tarantool> box.space.tester:select(1, {iterator = 'GT'}) --- - - [2, 'Scorpions', 2015, 4] - [3, 'Ace of Base', 1993] - [4, 'Roxette', 2016, 3] ...
ru: tarantool&gt; box.space.tester:select(1, {iterator = 'GT'}) --- - - [2, 'Scorpions', 2015, 4] - [3, 'Ace of Base', 1993] - [4, 'Roxette', 2016, 3] ...

source: The :ref:`comparison operators <box_index-iterator-types>` are:
ru: Есть такие :ref:`операторы сравнения <box_index-iterator-types>`:

source: ``LT`` for "less than"
ru: ``LT`` — "меньше"

source: ``LE`` for "less than or equal"
ru: ``LE`` — "меньше или равно"

source: ``GT`` for "greater"
ru: ``GT`` — "больше"

source: ``GE`` for "greater than or equal" .
ru: ``GE`` — "больше или равно"

source: ``EQ`` for "equal",
ru: ``EQ`` — "равно",

source: ``REQ`` for "reversed equal"
ru: ``REQ`` — "равно, результаты отсортированы в порядке убывания по ключу"

source: Value comparisons make sense if and only if the index type is TREE. The iterator types for other types of indexes are slightly different and work differently. See details in section :ref:`Iterator types <box_index-iterator-types>`.
ru: Только для TREE-индексов есть смысл в сравнении значений. Итераторы для других типов индексов немного отличаются и работают по-другому. Более подробную информацию см. в разделе :ref:`Типы итераторов <box_index-iterator-types>`.

source: Note that we don't use the name of the index, which means we use primary index here.
ru: Обратите внимание, что мы не используем имя индекса — значит, здесь мы используем первичный индекс.

source: This type of search may return more than one tuple. The tuples will be sorted in descending order by key if the comparison operator is LT or LE or REQ. Otherwise they will be sorted in ascending order.
ru: Этот вариант поиска может вернуть более одного кортежа. Если используется оператор сравнения LT, LE или REQ, то кортежи будут отсортированы по ключу в порядке убывания. Во всех остальных случаях — в порядке возрастания.

source: The search can use a **secondary index**.
ru: Для поиска можно использовать **вторичный индекс**.

source: For a primary-key search, it is optional to specify an index name as was demonstrated above. For a secondary-key search, it is mandatory.
ru: При поиске по первичному ключу имя индекса можно не указывать, как показано выше. При поиске же по вторичному ключу имя индекса нужно указать обязательно.

source: **Partial key search:** The search may be for some key parts starting with the prefix of the key. Note that partial key searches are available only in TREE indexes.
ru: **Поиск по частям ключа:** Можно производить поиск по частям ключа, начиная с префикса ключа. Обратите внимание, что поиск по части ключа доступен только в TREE-индексах.

source: The search can be for all fields, using a table as the value:
ru: Поиск можно производить по всем полям через запись в виде таблицы:

source: or the search can be for one field, using a table or a scalar:
ru: либо же по одному полю, в этом случае используется таблица или скалярное значение:

source: You can also add, drop, or alter the definitions at runtime, with some restrictions. Read more about index operations in reference for :doc:`box.index submodule </reference/reference_lua/box_index>`.
ru: С некоторыми ограничениями можно добавлять, удалять или изменять определения во время исполнения кода. Более подробную информацию об операциях с индексами см. в справочнике по :doc:`вложенному модулю box.index </reference/reference_lua/box_index>`.

source: Index types
ru: Типы индексов

source: An index always has a **type**. Different types are intended for different usage scenarios.
ru: Индекс всегда относится к определенному **типу**. Для разных сценариев использования требуются разные типы индексов.

source: We give an overview of index features in the following table:
ru: Обзор характеристик индексов приведен в следующей таблице:

source: Feature
ru: Характеристика

source: unique
ru: уникальный

source: non-unique
ru: неуникальный

source: can be multi-part
ru: может быть составным (multi-part)

source: :ref:`multikey <box_space-path_multikey>`
ru: :ref:`индекс по массиву (multikey) <box_space-path_multikey>`

source: :ref:`partial-key search <partial_key_search>`
ru: :ref:`поиск по части ключа <partial_key_search>`

source: can be primary key
ru: может быть по первичному ключу

source: ``exclude_null`` (version 2.8+)
ru: ``exclude_null`` (версии 2.8+)

source: :doc:`iterator types </reference/reference_lua/box_index/pairs>`
ru: :doc:`типы итераторов </reference/reference_lua/box_index/pairs>`

source: TREE indexes
ru: TREE-индексы

source: The default index type is 'TREE'. TREE indexes are provided by memtx and vinyl engines, can index unique and non-unique values, support partial key searches, comparisons and ordered results.
ru: Тип индекса по умолчанию — 'TREE'. Движки memtx и vinyl предоставляют TREE-индексы, которые могут индексировать уникальные и неуникальные значения, поддерживают поиск по компонентам ключа, сравнение ключей и упорядоченные результаты.

source: This is a universal type of indexes, for most cases it will be the best choice.
ru: Это универсальный тип индексов, в большинстве случаев он подойдет лучше всего.

source: Additionally, memtx engine supports HASH, RTREE and BITSET indexes.
ru: Кроме того, движок memtx поддерживает следующие типы индексов: HASH, RTREE и BITSET.

source: HASH indexes
ru: HASH-индексы

source: HASH indexes require unique fields and loses to TREE in almost all respects. So we do not recommend to use it in the applications. HASH is now present in Tarantool mainly because of backward compatibility.
ru: HASH-индексы требуют уникальности полей и почти во всех отношениях проигрывают индексам типа TREE. Поэтому мы не рекомендуем использовать их в приложениях. В настоящее время Tarantool поддерживает HASH в основном для обратной совместимости.

source: Here are some tips. Do not use HASH index:
ru: Вот несколько советов. Не используйте HASH-индекс:

source: just if you want to
ru: если просто хочется

source: if you think that HASH is faster with no performance metering
ru: если вы думаете, что HASH быстрее, без измерения производительности

source: if you want to iterate over the data
ru: если вы хотите выполнять перебор данных

source: for primary key
ru: по первичному ключу

source: as an only index
ru: как единственный индекс

source: Use HASH index:
ru: Используйте HASH-индекс:

source: if it is a secondary key
ru: если это вторичный ключ

source: if you 100% won't need to make it non-unique
ru: если вы на сто процентов уверены, что его не придется делать неуникальным

source: if you have taken measurements on your data and you see an accountable increase in performance
ru: если вы обнаружили значимое увеличение производительности в ходе проведенных измерений

source: if you save every byte on tuples (HASH is a little more compact)
ru: если вы экономите каждый байт на кортежах (HASH немного компактнее)

source: RTREE indexes
ru: RTREE-индексы

source: RTREE is a multidimensional index supporting up to 20 dimensions. It is used especially for indexing spatial information, such as geographical objects. In :ref:`this example <box_index-rtree>` we demonstrate spatial searches via RTREE index.
ru: RTREE — это многомерный индекс, который поддерживает до 20 измерений. Он используется, в частности, для индексирования пространственной информации, такой как географические объекты. В :ref:`этом примере <box_index-rtree>` мы показываем, как использовать пространственный поиск с помощью RTREE-индекса.

source: RTREE index could not be primary, and could not be unique. The option list of this type of index may contain ``dimension`` and ``distance`` options. The ``parts`` definition must contain the one and only part with type ``array``. RTREE index can accept two types of ``distance`` functions: ``euclid`` and ``manhattan``.
ru: RTREE-индекс не может быть первичным и не может быть уникальным. Индекс такого типа может содержать параметры измерения и расстояния — ``dimension`` и ``distance`` соответственно. Определение ``parts`` должно включать только один компонент типа ``array``. RTREE-индекс может принимать два типа функции расстояния ``distance``: ``euclid``, то есть Евклидова метрика, или ``manhattan``, то есть расстояние городских кварталов.

source: **Example 1:**
ru: **Пример 1:**

source: Corresponding tuple field thus must be an array of 2 or 4 numbers. 2 numbers mean a point {x, y}; 4 numbers mean a rectangle {x1, y1, x2, y2}, where (x1, y1) and (x2, y2) - diagonal point of the rectangle.
ru: Таким образом, соответствующее поле кортежа может быть массивом типа array из 2 или 4 чисел. 2 числа обозначают точку {x, y}; 4 числа обозначают прямоугольник {x1, y1, x2, y2}, где (x1, y1) и (x2, y2) — диагональные точки прямоугольника.

source: Selection results depend on a chosen iterator. The default EQ iterator searches for an exact rectangle, a point is treated as zero width and height rectangle:
ru: Результаты выборки зависят от выбранного итератора. Итератор EQ, который используется по умолчанию, ищет точный прямоугольник, точка рассматривается как прямоугольник нулевой ширины и высоты:

source: Iterator ALL, which is the default when no key is specified, selects all tuples in arbitrary order:
ru: Итератор ALL, который используется по умолчанию, если не указан ключ, выбирает все кортежи в произвольном порядке:

source: Iterator LE (less or equal) searches for tuples with their rectangles within a specified rectangle:
ru: Итератор LE (меньше или равно) ищет кортежи с прямоугольниками, которые находятся в пределах заданного прямоугольника:

source: Iterator LT (less than, or strictly less) searches for tuples with their rectangles strictly within a specified rectangle:
ru: Итератор LT (меньше или строго меньше) ищет кортежи с прямоугольниками, которые находятся строго в пределах заданного прямоугольника:

source: Iterator GE searches for tuples with a specified rectangle within their rectangles:
ru: Итератор GE ищет кортежи с прямоугольниками, в пределах которых находится заданный прямоугольник:

source: Iterator GT searches for tuples with a specified rectangle strictly within their rectangles:
ru: Итератор GT ищет кортежи с прямоугольниками, строго в пределах которых находится заданный прямоугольник:

source: Iterator OVERLAPS searches for tuples with their rectangles overlapping specified rectangle:
ru: Итератор OVERLAPS ищет кортежи с прямоугольниками, перекрывающими указанный прямоугольник:

source: Iterator NEIGHBOR searches for all tuples and orders them by distance to the specified point:
ru: Итератор NEIGHBOR ищет все кортежи и упорядочивает их по расстоянию до заданной точки:

source: **Example 2:**
ru: **Пример 2:**

source: 3D, 4D and more dimensional RTREE indexes work in the same way as 2D except that user must specify more coordinates in requests. Here's short example of using 4D tree:
ru: 3-мерные, 4-мерные или многомерные RTREE индексы используются так же, как и для двумерные, только пользователь должен указать больше координат в запросах. Вот небольшой пример использования для 4-мерного дерева:

source: tarantool> my_space = box.schema.create_space("tester") tarantool> my_space:format{ { type = 'number', name = 'id' }, { type = 'array', name = 'content' } } tarantool> primary_index = my_space:create_index('primary', { type = 'TREE', parts = {'id'} }) tarantool> rtree_index = my_space:create_index('spatial', { type = 'RTREE', unique = false, dimension = 4, parts = {'content'} }) tarantool> my_space:insert{1, {1, 2, 3, 4}} -- insert 4D point tarantool> my_space:insert{2, {1, 1, 1, 1, 2, 2, 2, 2}} -- insert 4D box tarantool> rtree_index:select{1, 2, 3, 4} -- find exact point --- - - [1, [1, 2, 3, 4]] ... tarantool> rtree_index:select({0, 0, 0, 0, 3, 3, 3, 3}, {iterator = 'LE'}) -- select from 4D box --- - - [2, [1, 1, 1, 1, 2, 2, 2, 2]] ... tarantool> rtree_index:select({0, 0, 0, 0}, {iterator = 'neighbor'}) -- select neighbours --- - - [2, [1, 1, 1, 1, 2, 2, 2, 2]] - [1, [1, 2, 3, 4]] ...
ru: tarantool> my_space = box.schema.create_space("tester") tarantool> my_space:format{ { type = 'number', name = 'id' }, { type = 'array', name = 'content' } } tarantool> primary_index = my_space:create_index('primary', { type = 'TREE', parts = {'id'} }) tarantool> rtree_index = my_space:create_index('spatial', { type = 'RTREE', unique = false, dimension = 4, parts = {'content'} }) tarantool> my_space:insert{1, {1, 2, 3, 4}} -- вставка 4D-точки tarantool> my_space:insert{2, {1, 1, 1, 1, 2, 2, 2, 2}} -- вставка 4D-тела tarantool> rtree_index:select{1, 2, 3, 4} -- поиск определенной точки --- - - [1, [1, 2, 3, 4]] ... tarantool> rtree_index:select({0, 0, 0, 0, 3, 3, 3, 3}, {iterator = 'LE'}) -- выборка из 4D-тела --- - - [2, [1, 1, 1, 1, 2, 2, 2, 2]] ... tarantool> rtree_index:select({0, 0, 0, 0}, {iterator = 'neighbor'}) -- выборка соседей --- - - [2, [1, 1, 1, 1, 2, 2, 2, 2]] - [1, [1, 2, 3, 4]] ...

source: Keep in mind that select NEIGHBOR iterator with unset limits extracts the entire space in order of increasing distance. And there can be tons of data, and this can affect the performance.
ru: Не рекомендуется использовать с операцией select итератор NEIGHBOR без указанного значения ``limit``. В этом случае будет получен спейс целиком, упорядоченный по возрастанию расстояния. Это может отразиться на производительности, поскольку в спейсе может храниться огромное количество данных.

source: And another frequent mistake is to specify iterator type without quotes, in such way: ``rtree_index:select(rect, {iterator = LE})``. This leads to silent EQ select, because ``LE`` is undefined variable and treated as nil, so iterator is unset and default used.
ru: Другая типичная ошибка --- указать тип итератора без кавычек следующим образом: ``rtree_index:select(rect, {iterator = LE})``. В этом случае ``LE`` представляет собой неопределенную переменную и обрабатывается как nil, поэтому итератор считается незаданным, и будет использован итератор по умолчанию EQ.

source: BITSET indexes
ru: BITSET-индексы

source: Bitset is a bit mask. You should use it when you need to search by bit masks. This can be, for example, storing a vector of attributes and searching by these attributes.
ru: Bitset — это битовая маска. BITSET следует использовать для поиска по битовым маскам. Это может быть, например, сохранение вектора атрибутов и поиск по этим атрибутам.

source: The following script shows creating and searching with a BITSET index. Notice that BITSET cannot be unique, so first a primary-key index is created, and bit values are entered as hexadecimal literals for easier reading.
ru: Скрипт ниже показывает создание и поиск с помощью индекса BITSET. Обратите внимание, что BITSET не может быть уникальным, поэтому сначала создается индекс по первичному ключу, а битовые значения вводятся в шестнадцатеричном виде для удобства чтения.

source: The result will be:
ru: Получим следующий результат:

source: because (7 AND 2) is not equal to 0, and (3 AND 2) is not equal to 0.
ru: поскольку (7 AND 2) не равно 0, и (3 AND 2) не равно 0.

source: Additionally, there exist :doc:`index iterator operations </reference/reference_lua/box_index/pairs>`. They can only be used with code in Lua and C/C++. Index iterators are for traversing indexes one key at a time, taking advantage of features that are specific to an index type. For example, they can be used for evaluating Boolean expressions when traversing BITSET indexes, or for going in descending order when traversing TREE indexes.
ru: Кроме того, есть :doc:`операции с итераторами с индексом </reference/reference_lua/box_index/pairs>`. Их можно использовать только с кодом на языках Lua и C/C++. Итераторы с индексом предназначены для обхода индексов по одному ключу за раз, поскольку используют особенности каждого типа индекса. Например, их можно использовать для оценки логических выражений при обходе BITSET-индексов или при обходе TREE-индексов в порядке по убыванию.
