Repository: tarantool/doc
Catalog: locale/*/LC_MESSAGES/book/box/stream.po
Languages: ru

source: Streams and interactive transactions
ru: Стримы и интерактивные транзакции

source: Overview
ru: Общие сведения

source: Since :tarantool-release:`2.10.0`, iproto implements streams and interactive transactions.
ru: Начиная с версии :tarantool-release:`2.10.0`, в iproto реализованы стримы и интерактивные транзакции.

source: Stream
ru: Стрим

source: A stream supports multiplexing several transactions over one connection. All requests in the stream are executed strictly sequentially, which allows the implementation of :term:`interactive transactions <interactive transaction>`.
ru: Стрим поддерживает мультиплексирование нескольких транзакций в рамках одного соединения. Все запросы в стриме выполняются строго последовательно, что позволяет проводить :term:`интерактивные транзакции <interactive transaction>`.

source: Unlike a thread associated with multitasking and execution within a program, a stream transfers data via the protocol between a client and a server.
ru: Стрим передает данные по протоколу между клиентом и сервером. Это понятие не связано с потоками выполнения, реализующими многозадачность внутри программ.

source: Interactive transaction
ru: Интерактивная транзакция

source: An interactive transaction is a transaction that does not need to be sent in a single request. The ``begin``, ``commit``, and other TX statements can be sent and executed in different requests.
ru: Интерактивной называется транзакция, которую не обязательно отправлять целиком в рамках одного запроса. ``begin``, ``commit`` и другие TX-инструкции могут быть отправлены и выполнены в разных запросах.

source: Features
ru: Функциональные возможности

source: The primary purpose of :term:`streams <stream>` is to execute transactions via iproto. Every stream has its own identifier, which is unique within the connection. All requests with the same non-zero stream ID belong to the same stream. All requests in the stream are processed synchronously. The next request will not start executing until the previous one is completed. If a request's stream ID is ``0``, it does not belong to any stream and is processed in the old way.
ru: Основное предназначение :term:`стрима <stream>` --- выполнение транзакций внутри потока iproto. У каждого стрима есть идентификатор, уникальный в рамках соединения. Все запросы с одинаковым ненулевым идентификатором стрима относятся к одному стриму. Запросы в стриме выполняются синхронно. Следующий запрос не начинает выполняться, пока не завершится предыдущий. Если идентификатор стрима запроса равен ``0``, то этот запрос не привязан к какому-либо стриму и обрабатывается обычным способом.

source: In :doc:`net.box </reference/reference_lua/net_box>`, a stream is an object above the connection that has the same methods but allows executing requests sequentially. The ID is generated on the client side automatically. If a user writes their own connector and wants to use streams, they must transmit the ``stream_id`` over the iproto protocol.
ru: В :doc:`net.box </reference/reference_lua/net_box>` стрим представляет собой объект над соединением, который имеет те же методы, но позволяет выполнять запросы последовательно. Идентификатор генерируется автоматически на стороне клиента. Пользователь может также создать собственный коннектор с поддержкой стримов. Используя стримы с пользовательским коннектором, необходимо передавать ``stream_id`` через протокол iproto.

source: Interactive transactions over streams only work if the ``box.cfg{}`` option :ref:`memtx_use_mvcc_engine <cfg_basic-memtx_use_mvcc_engine>` is enabled on the server: ``memtx_use_mvcc_engine = true``.
ru: Чтобы в стримах работали интерактивные транзакции, необходимо включить параметр ``box.cfg{}`` :ref:`memtx_use_mvcc_engine <cfg_basic-memtx_use_mvcc_engine>` на сервере: ``memtx_use_mvcc_engine = true``.

source: Interaction between streams and transactions
ru: Взаимодействие между стримами и транзакциями

source: As each stream can start a transaction, several transactions can be multiplexed over one connection. There are multiple ways to begin, commit, and roll back a transaction. One can do that using the appropriate stream methods -- ``call``, ``eval``, or ``execute`` -- with the SQL transaction syntax. Users can mix these methods. For example, one might start a transaction using ``stream:begin()`` and commit it with ``stream:call('box.commit')`` or ``stream:execute('COMMIT')``. All the requests between ``stream:begin()`` and ``stream:commit()`` are executed within the same transaction. If any request fails during the transaction, it will not affect the other requests in the transaction. If a disconnect occurs while there is an active transaction in the stream, that transaction will be rolled back if it hasn't been committed before the connection failure.
ru: Поскольку каждый стрим может запустить транзакцию, одно соединение способно мультиплексировать несколько транзакций. Начать транзакцию, сделать ее коммит и отменить ее можно, используя с синтаксисом SQL-транзакций методы стрима: ``call``, ``eval``, ``execute``. Пользователь может комбинировать эти методы. Например, можно начать транзакцию с помощью ``stream:begin()``, а коммит провести, используя ``stream:call('box.commit')`` или ``stream:execute('COMMIT')``. Все запросы между ``stream:begin()`` и ``stream:commit()`` выполняются в рамках одной транзакции. Если один запрос во время транзакции завершится ошибкой, на остальные запросы это не повлияет. Если во время активной транзакции в стриме произойдет сбой подключения, эта транзакция будет отменена, если она не прошла коммит до сбоя.

source: Example:
ru: Пример:

source: local conn = net_box.connect(remote_server_addr) local conn_space = conn.space.test local stream = conn:new_stream() local stream_space = stream.space.test -- Begin transaction over an iproto stream: stream:begin() stream_space:replace({1}) -- Empty select, the transaction was not committed. -- You can't see it from the requests that do not belong to the -- transaction. conn_space:select{} -- Select returns the previously inserted tuple, -- because this select belongs to the transaction: stream_space:select({}) -- Commit transaction: stream:commit() -- Now this select also returns the tuple, because the transaction has been committed: conn_space:select{}
ru: local conn = net_box.connect(remote_server_addr) local conn_space = conn.space.test local stream = conn:new_stream() local stream_space = stream.space.test -- Начать транзакцию через поток iproto: stream:begin() stream_space:replace({1}) -- Пустой select, коммит транзакции не выполнен. -- Ее нельзя увидеть из запросов, не относящихся -- к транзакции. conn_space:select{} -- Метод select возвращает ранее вставленный кортеж, -- так как этот кортеж относится к транзакции: stream_space:select({}) -- Коммит транзакции: stream:commit() -- Теперь и этот select возвращает кортеж, так как транзакция прошла коммит: conn_space:select{}
