Repository: tarantool/doc
Catalog: locale/*/LC_MESSAGES/reference/reference_lua/box_info/replication.po
Languages: ru_ru

source: The **replication** section of ``box.info()`` is a table array with statistics for all instances in the replica set that the current instance belongs to (see also :ref:`"Monitoring a replica set" <replication-monitoring>`):
ru_ru: Раздел **replication** (репликация) во вложенном модуле ``box.info()`` содержит статистику по всем экземплярам в наборе реплик относительно текущего экземпляра (см. также :ref:`"Мониторинг набора реплик" <replication-monitoring>`):

source: In the following, *n* is the index number of one table item, for example :samp:`replication[1]`, which has data about server instance number 1, which may or may not be the same as the current instance (the "current instance" is what is responding to ``box.info``).
ru_ru: Далее *n* -- это индексный номер одного элемента таблицы, например, :samp:`replication[1]`, который содержит данные о экземпляре сервера номер 1, который может быть или не быть тем же самым, что и текущий экземпляр ("текущий экземпляр" -- это тот, что отвечает на ``box.info``).

source: :samp:`replication[{n}].id` is a short numeric identifier of instance *n* within the replica set. This value is stored in the :ref:`box.space._cluster <box_space-cluster>` system space.
ru_ru: :samp:`replication[{n}].id` -- это короткий числовой идентификатор экземпляра в наборе реплик. Данное значение хранится в системном спейсе :ref:`box.space._cluster <box_space-cluster>`.

source: :samp:`replication[{n}].uuid` is a globally unique identifier of instance *n*. This value is stored in the :ref:`box.space._cluster <box_space-cluster>` system space.
ru_ru: :samp:`replication[{n}].uuid` -- это глобально-уникальный идентификатор экземпляра. Данное значение хранится в системном спейсе :ref:`box.space._cluster <box_space-cluster>`.

source: :samp:`replication[{n}].lsn` is the :ref:`log sequence number <replication-mechanism>` (LSN) for the latest entry in instance *n*'s :ref:`write ahead log <index-box_persistence>` (WAL).
ru_ru: :samp:`replication[{n}].lsn` -- это :ref:`номер в журнале <replication-mechanism>` (LSN) для последней записи в :ref:`журнале упреждающей записи <index-box_persistence>` (WAL) экземпляра *n*.

source: :samp:`replication[{n}].upstream` appears (is not nil) if the current instance is following or intending to follow instance *n*, which ordinarily means :samp:`replication[{n}].upstream.status` = ``follow``, :samp:`replication[{n}].upstream.peer` = url of instance *n* which is being followed, :samp:`replication[{n}].lag and idle` = the instance's speed, described later. Another way to say this is: :samp:`replication[{n}].upstream` will appear when :samp:`replication[{n}].upstream.peer` is not of the current instance, and is not read-only, and was specified in ``box.cfg{replication={...}}``, so it is shown in :ref:`box.cfg.replication <cfg_replication-replication>`.
ru_ru: :samp:`replication[{n}].upstream` возникает (т.е. не nil), если текущий экземпляр принимает или готов принимать данные от экземпляра *n*, что обычно означает :samp:`replication[{n}].upstream.status` = ``follow``, :samp:`replication[{n}].upstream.peer` = url экземпляра *n*, который отдает данные, :samp:`replication[{n}].lag и idle` = скорость экземпляра, описанная позже. По-другому можно сказать, что :samp:`replication[{n}].upstream` возникает, когда :samp:`replication[{n}].upstream.peer` не принадлежит текущему экземпляру, не является доступным только для чтения и был указан в ``box.cfg{replication={...}}``, поэтому он показан в :ref:`box.cfg.replication <cfg_replication-replication>`.

source: :samp:`replication[{n}].upstream.status` is the replication status of the connection with instance *n*:
ru_ru: :samp:`replication[{n}].upstream.status` -- это репликационный статус экземпляра:

source: ``auth`` means that :ref:`authentication <authentication>` is happening.
ru_ru: ``auth`` означает, что экземпляр проходит :ref:`аутентификацию <authentication>`.

source: ``connecting`` means that connection is happening.
ru_ru: ``connecting`` означает, что происходит подключение.

source: ``disconnected`` means that it is not connected to the replica set (due to network problems, not replication errors).
ru_ru: ``disconnected`` означает, что экземпляр не подключен к набору реплик (по причине проблем в сети, а не ошибок репликации).

source: ``follow`` means that the current instance's role is "replica" (read-only, or not read-only but acting as a replica for this remote peer in a master-master configuration), and is receiving or able to receive data from instance *n*'s (upstream) master.
ru_ru: ``follow`` означает, что текущий экземпляр является репликой (только для чтения, или не только для чтения, но ведет себя как реплика для этого удаленного URI в конфигурации master-master) и получает или может получать данные от мастера экземпляра *n* (upstream).

source: ``stopped`` means that replication was stopped due to a replication error (for example :ref:`duplicate key <error_codes>`).
ru_ru: ``stopped`` означает, что репликация остановилась по причине ошибки репликации (например, :ref:`повторяющийся ключ <error_codes>`).

source: ``sync`` means that the master and replica are synchronizing to have the same data.
ru_ru: ``sync`` означает, что мастер и реплика в данный момент синхронизируются для получения одинакового набора данных.

source: :samp:`replication[{n}].upstream.idle` is the time (in seconds) since the last event was received. This is the primary indicator of replication health. See more in :ref:`Monitoring a replica set <replication-monitoring>`.
ru_ru: :samp:`replication[{n}].upstream.idle` -- это время (в секундах) с момента получения последнего события. Это основной индикатор работоспособности репликации. Подробности в :ref:`Monitoring a replica set <replication-monitoring>`.

source: :samp:`replication[{n}].upstream.peer` contains instance *n*'s :ref:`URI <index-uri>` for example 127.0.0.1:3302. See more in :ref:`Monitoring a replica set <replication-monitoring>`.
ru_ru: :samp:`replication[{n}].upstream.peer` содержит :ref:`URI <index-uri>` экземпляра *n*, например 127.0.0.1:3302. Более подробную информацию см. в разделе :ref:`Мониторинг набора реплик <replication-monitoring>`.

source: :samp:`replication[{n}].upstream.lag` is the time difference between the local time of instance *n*, recorded when the event was received, and the local time at another master recorded when the event was written to the :ref:`write ahead log <internals-wal>` on that master. See more in :ref:`Monitoring a replica set <replication-monitoring>`.
ru_ru: :samp:`replication[{n}].upstream.lag` -- это разница во времени между локальным временем на экземпляре *n*, зарегистрированным при получении события, и локальное время на другом мастере, зарегистрированное при записи события в :ref:`журнал упреждающей записи <internals-wal>` на этом мастере. Более подробную информацию см. в разделе :ref:`Мониторинг набора реплик <replication-monitoring>`.

source: :samp:`replication[{n}].upstream.message` contains an error message in case of a :ref:`degraded state <replication-recover>`, otherwise it is nil.
ru_ru: :samp:`replication[{n}].upstream.message` содержит сообщение об ошибке в случае :ref:`системного сбоя <replication-recover>`, в противном случае -- nil.

source: :samp:`replication[{n}].downstream` appears (is not nil) with data about an instance that is following instance *n* or is intending to follow it, which ordinarily means :samp:`replication[{n}].downstream.status` = ``follow``,
ru_ru: :samp:`replication[{n}].downstream` появляется (т.е. не nil), когда имеются данные об экземпляре, который принимает данные от экземпляра *n* или намеревается это делать,что обычно означает :samp:`replication[{n}].downstream.status` = ``follow``,

source: :samp:`replication[{n}].downstream.vclock` contains the :ref:`vector clock <replication-vector>`, which is a table of '**id**, **lsn**' pairs, for example :code:`vclock: {1: 3054773, 4: 8938827, 3: 285902018}`. (Notice that the table may have multiple pairs although ``vclock`` is a singular name).
ru_ru: :samp:`replication[{n}].downstream.vclock` содержит :ref:`векторные часы <replication-vector>`, которые представляют собой таблицу из пар '**id**, **lsn**', например :code:`vclock: {1: 3054773, 4: 8938827, 3: 285902018}` (Обратите внимание, что таблица может иметь несколько пар, хотя vclock - это единственное имя).

source: Even if instance *n* is :ref:`removed <replication-remove_instances>`, its values will still appear here; however, its values will be overridden if an instance joins later with the same UUID. Vector clock pairs will only appear if ``lsn > 0``.
ru_ru: Даже если экземпляр :ref:`удален <replication-remove_instances>`, его значения все равно появятся здесь; однако, его значения будут переопределены, если позже экземпляр присоединится с тем же UUID. Пары векторных часов будут появляться только если ``lsn > 0``.

source: :samp:`replication[{n}].downstream.vclock` may be the same as the current instance's vclock (``box.info.vclock``) because this is for all known vclock values of the cluster. A master will know what is in a replica's copy of vclock because, when the master makes a data change, it sends the change information to the replica (including the master's vector clock), and the replica replies with what is in its entire vector clock table.
ru_ru: :samp:`replication[{n}].downstream.vclock` может быть таким же, как и vclock текущего экземпляра (``box.info.vclock``), потому что все значения vclock в кластере известны. Мастер будет знать, что находится в копии vclock реплики, потому что, когда мастер делает изменение данных, он посылает информацию об изменении на реплику (включая векторные часы мастера), и реплика отвечает тем, что находится в ее таблице векторных часов.

source: Also the replica sends its entire vector clock table in response to a master's heartbeat message, see the heartbeat-message examples in section :ref:`Binary protocol -- replication <box_protocol-heartbeat>`.
ru_ru: Также реплика отправляет всю свою таблицу векторных часов в ответ на сообщение контрольного сигнала мастера (heartbeat message), их примеры можно найти в разделе :ref:`Бинарный протокол -- репликация <box_protocol-heartbeat>`.

source: :samp:`replication[{n}].downstream.idle` is the time (in seconds) since the last time that instance *n* sent events through the downstream replication.
ru_ru: :samp:`replication[{n}].downstream.idle` -- это время (в секундах) с момента последней отправки событий экземпляром *n* через downstream-репликацию.

source: :samp:`replication[{n}].downstream.status` is the replication status for downstream replications:
ru_ru: :samp:`replication[{n}].downstream.status` -- это статус для downstream-репликации:

source: ``stopped`` means that downstream replication has stopped,
ru_ru: ``stopped`` означает, что downstream-репликация остановлена,

source: ``follow`` means that downstream replication is in progress (instance *n* is ready to accept data from the master or is currently doing so).
ru_ru: ``follow`` означает, что downstream-репликация находится в процессе (экземпляр *n* готов принимать данные от мастера или уже делает это).

source: :samp:`replication[{n}].downstream.message` and :samp:`replication[{n}].downstream.system_message` will be nil unless a problem occurs with the connection. For example, if instance *n* goes down, then one may see ``status = 'stopped'``, ``message = 'unexpected EOF when reading from socket'``, and ``system_message = 'Broken pipe'``. See also :ref:`degraded state <replication-recover>`.
ru_ru: :samp:`replication[{n}].downstream.message` and :samp:`replication[{n}].downstream.system_message` не появятся, пока не возникнет проблем с соединением. Например, если экземпляр *n* даст сбой, то можно будет увидеть ``status = 'stopped'``, ``message = 'unexpected EOF when read from socket'``, и ``system_message = 'broken pipe'``. См. также :ref:`"сбой" <replication-recover>`.
