Repository: tarantool/doc
Catalog: locale/*/LC_MESSAGES/reference/reference_lua/box_schema/user_grant.po
Languages: ru_ru

source: Grant :ref:`privileges <authentication-owners_privileges>` to a user or to another role.
ru_ru: Выдача :ref:`прав <authentication-owners_privileges>` пользователю или другой роли.

source: Parameters
ru_ru: Параметры

source: the name of the user.
ru_ru: имя пользователя

source: 'read' or 'write' or 'execute' or 'create' or 'alter' or 'drop' or a combination.
ru_ru: 'read' или 'write' или 'execute' или 'create' или 'alter' или 'drop' или их комбинация.

source: 'space' or 'function' or 'sequence' or 'role'.
ru_ru: 'space' (спейс) или 'function' (функция), или 'sequence' (последовательность), или 'role' (роль).

source: name of object to grant permissions for.
ru_ru: имя объекта, для которого выдаются права.

source: name of role to grant to user.
ru_ru: имя роли, которая выдается пользователю.

source: If :samp:`'function','{object-name}'` is specified, then a _func tuple with that object-name must exist.
ru_ru: Если указана :samp:`'function','{object-name}'`, то должен существовать кортеж _func с этим именем объекта.

source: **Variation:** instead of ``object-type, object-name`` say 'universe' which means 'all object-types and all objects'. In this case, object name is omitted.
ru_ru: **Вариант:** вместо ``object-type, object-name`` введите 'universe', что означает 'все типы объектов и все объекты'. В этом случае имя объекта будет опущено.

source: **Variation:** instead of ``privilege, object-type, object-name`` say ``role-name`` (see section :ref:`Roles <authentication-roles>`).
ru_ru: **Вариант:** вместо ``privilege, object-type, object-name`` введите ``role-name`` (см. :ref:`Roles <authentication-roles>`)

source: **Variation:** instead of :samp:`box.schema.user.grant('{user-name}','usage,session','universe',nil,` :code:`{if_not_exists=true})` say :samp:`box.schema.user.enable('{user-name}')`.
ru_ru: **Вариант:** вместо :samp:`box.schema.user.grant('{user-name}','usage,session','universe',nil,` :code:`{if_not_exists=true})` введите :samp:`box.schema.user.enable('{user-name}')`.

source: The possible options are:
ru_ru: Возможны следующие опции:

source: ``grantor`` = *grantor_name_or_id* -- string or number, for custom grantor,
ru_ru: ``grantor`` = *grantor_name_or_id* -- строка или число, для пользователя, который выдает права,

source: ``if_not_exists`` = ``true|false`` (default = ``false``) - boolean; ``true`` means there should be no error if the user already has the privilege.
ru_ru: ``if_not_exists`` = ``true|false`` (default = ``false``) - boolean; ``true`` означает, что ошибки не должно быть, если пользователь уже имеет права.

source: **Example:**
ru_ru: **Пример:**
