Repository: tarantool/doc
Catalog: locale/*/LC_MESSAGES/getting_started/connecting_to_cluster.po
Languages: ru

source: Connecting to the cluster
ru: Подключаемся к кластеру

source: In the last section, we set up a cluster, created a schema, and wrote data through the HTTP API. Now we can connect to the cluster from code and work with data.
ru: В прошлом разделе мы подняли кластер, создали схему и записали данные через HTTP API. Теперь мы сможем подключиться к кластеру из кода и работать с данными.

source: If you are using Tarantool without Cartridge, go to the :ref:`Connecting from your favorite language <getting_started_connectors>` section. If you are undergoing training, read on.
ru: Если вы используете Tarantool без Cartridge, то переходите в раздел :ref:`о подключении к базе из разных языков программирования <getting_started_connectors>`. Если вы проходите обучение, то читайте дальше.

source: You may have noticed that we used the ``crud`` module in the HTTP handler code. The code looked something like this:
ru: Вы могли обратить внимание, что в коде HTTP обработчиков мы использовали модуль ``crud``. Код выглядел примерно вот так:

source: This module allows you to work with data in a cluster. The syntax here is similar to what the Tarantool ``box`` module offers. You will learn more about the ``box`` module in the following sections.
ru: Этот модуль позволяет работать с данными в кластере и имеет похожий синтаксис, что предлагает модуль ``box`` в Tarantool. Про модуль ``box`` вы узнаете в следующих разделах.

source: The ``crud`` module contains a set of stored procedures. To work with them, we must activate special roles on all routers and storages. We selected those roles in the previous section, so we don't need to do anything. The roles are named accordingly: "crud-router" and "crud-storage".
ru: Модуль ``crud`` содержит набор хранимых процедур. Чтобы он заработал, мы должны активировать на всех экземплярах router и storage специальные роли. В прошлом разделе мы их выбрали, так что нам делать ничего не нужно. Называются роли соответственно: "crud-router", "crud-storage".

source: To write and read data in the Tarantool cluster from code, we will call stored procedures of the ``crud`` module.
ru: Чтобы писать и читать данные в кластере Tarantool из кода, мы будем вызывать хранимые процедуры модуля ``crud``.

source: In Python, it looks like this:
ru: На языке Python это выглядит примерно вот так:

source: All functions of the ``crud`` module are described in the `README of our GitHub repository <https://github.com/tarantool/crud/#insert>`_.
ru: Список всех функций модуля ``crud`` можно найти в `репозитории на GitHub <https://github.com/tarantool/crud/#insert>`_.

source: Here is an incomplete list:
ru: В него входят:

source: To learn how to call stored procedures in your programming language, see the corresponding section:
ru: Чтобы узнать, как вызывать хранимые процедуры в вашем языке программирования, смотрите раздел:

source: :ref:`for Python <getting_started-python>`
ru: :ref:`для Python<getting_started-python>`

source: :ref:`for Go <getting_started-go>`
ru: :ref:`для Go <getting_started-go>`

source: :ref:`for PHP <getting_started-php>`
ru: :ref:`для PHP <getting_started-php>`

source: :doc:`for C++ </getting_started/getting_started_cxx>`
ru: :doc:`для C++ </getting_started/getting_started_cxx>`

source: For connectors to other languages, check the README for the connector of your choice `on GitHub <https://github.com/tarantool>`_.
ru: Информацию о подключении из других языков вы найдете в README к `соответствующим коннекторам на GitHub <https://github.com/tarantool>`_.
