Repository: tarantool/doc
Catalog: locale/*/LC_MESSAGES/getting_started/getting_started_imcp.po
Languages: ru

source: First steps
ru: Начало знакомства

source: This is the recommended guide for getting to know the product.
ru: Это рекомендованное руководство для знакомства с продуктом.

source: You also might want to check out our :ref:`basic Tarantool tutorial <getting_started_db>`. It shows how to launch one Tarantool instance, create a space, build an index, and write data.
ru: Вам может понадобиться ознакомиться с :ref:`базовым руководством по Tarantool <getting_started_db>`. В нем запускается один экземпляр Tarantool, создается спейс, индекс и записываются данные.

source: We recommend that beginners go through the current tutorial first and then see the basic tutorial to dive deeper into the product.
ru: Мы советуем новичкам сначала пройти текущее руководство, а затем вернуться к базовому для более глубокого погружения в продукт.

source: If you just want to run the complete tutorial code quickly, go to :ref:`Launching an application <app_server-launching_app>`.
ru: Если вы хотите быстро запустить готовый код, перейдите в раздел :ref:`Запуск приложения <app_server-launching_app>`.

source: Installation
ru: Установка

source: **Launch in the cloud**
ru: **Запуск в облаке**

source: This tutorial is also available in the cloud. It's free, and it's the fastest way to start. To follow this tutorial in the cloud, go to `try.tarantool.io <https://try.tarantool.io>`__.
ru: Данное руководство можно пройти в облаке. Это бесплатный и самый быстрый способ начать знакомство. Переходите на сайт `try.tarantool.io <https://try.tarantool.io>`__ и проходите этот туториал в облаке.

source: However, you will still need to install Tarantool if you want to get better acquainted with it.
ru: Однако для дальнейшего знакомства все же будет необходимо установить Tarantool.

source: **Run locally**
ru: **Локальный запуск**

source: **For Linux/macOS users:**
ru: **Для пользователей Linux/macOS:**

source: Install Tarantool from the `Download page <https://tarantool.io/download>`__.
ru: Установите Tarantool `со страницы установки <https://tarantool.io/download>`__.

source: Install the ``cartridge-cli`` utility through your package manager:
ru: Установите через ваш пакетный менеджер утилиту ``cartridge-cli``:

source: To learn more, check the ``cartridge-cli`` :doc:`installation guide </book/cartridge/cartridge_cli/installation/>`.
ru: Подробности о том, как установить ``cartridge-cli``, читайте в :doc:`руководстве по установке </book/cartridge/cartridge_cli/installation/>`.

source: Clone the `Getting Started tutorial repository <https://github.com/tarantool/getting-started>`__.
ru: Склонируйте `репозиторий пошагового руководства <https://github.com/tarantool/getting-started>`__.

source: Everything is ready and organized in this repository. In the cloned directory, run the following:
ru: В этом репозитории все готово к работе --- в папке со склонированным примером выполните:

source: You're all set! At http://localhost:8081, you will see the Tarantool Cartridge UI.
ru: Готово! По адресу http://localhost:8081 вы увидите UI Tarantool Cartridge.

source: **Running in Docker:**
ru: **Запуск в Docker:**

source: That's it! At http://localhost:8081, you will see the Tarantool Cartridge UI.
ru: Готово! По адресу http://localhost:8081 вы увидите UI Tarantool Cartridge.

source: **For Windows users:**
ru: **Для пользователей Windows:**

source: Use Docker to get started.
ru: Используйте Docker и читайте раздел выше.

source: Getting to know Tarantool
ru: С чего начнем знакомство

source: Today, we will solve a high-performance challenge for TikTok using Tarantool.
ru: Сегодня мы решим высоконагруженную задачку для сервиса TikTok с помощью Tarantool.

source: You will implement a counter of likes for videos. First, you will create base tables and search indexes. Then you will set up an HTTP API for mobile clients.
ru: У такого сервиса обычно самая нагруженная часть --- это сохранение лайков под видео. Нужно будет создать базовые таблицы, индексы для поиска и в конце поднять HTTP API для мобильных клиентов.

source: The challenge doesn't require you to write any additional code. Everything will be implemented on the Tarantool platform.
ru: Вам не потребуется писать дополнительный код. Все будет реализовано на платформе Tarantool.

source: If you accidentally do something wrong while following the instructions, there is a magic button to help you reset all changes. It is called **"Reset Configuration"**. You can find it at the top of the "Cluster" page.
ru: Если по ходу выполнения инструкции вы случайно сделали что-то не то, есть волшебная кнопка, которая поможет вам сбросить все изменения. Она называется **"Reset Configuration"** и находится на вкладке "Cluster" в верхней части страницы.

source: Configuring a cluster [1 minute]
ru: Конфигурируем кластер [1 мин]

source: **Everything you need to know to get started:**
ru: **Все, что нужно знать для старта:**

source: A Tarantool cluster has two service roles: router and storage.
ru: В кластере Tarantool есть две служебные роли: router, storage.

source: Storage is used to store data.
ru: Storage --- это хранилище данных.

source: Router is an intermediary between clients and storages. It accepts a client's request, takes data from the proper storage, and returns it to the client.
ru: Router --- это посредник между клиентами и storage. Он принимает запросы от клиентов, ходит к нужным экземплярам storage за данными и возвращает данные клиенту.

source: We see that we have 5 unconfigured instances on the "Cluster" tab.
ru: На вкладке "Cluster" мы видим, что в нашем распоряжении есть 5 несконфигурированных экземпляров.

source: List of all nodes
ru: Список всех узлов

source: Let's create one router and one storage for a start.
ru: Создадим для начала один router и один storage.

source: First, click the "Configure" button on the "router" instance and configure it as in the screenshot below:
ru: Сначала нажимаем кнопку "Configure" на экземпляре "router" и настраиваем его как на скриншоте ниже:

source: Configuring a router
ru: Настраиваем router

source: Next, we configure the "s1-master" instance:
ru: Далее настраиваем экземпляр "s1-master":

source: Configuring s1-master
ru: Настраиваем s1-master

source: It will look something like this:
ru: Получится примерно вот так:

source: Cluster view after first setup
ru: Вид кластера после первой настройки

source: Let's enable sharding in the cluster using the "Bootstrap vshard" button. It is located in the top right corner.
ru: Включим шардирование в кластере с помощью кнопки "Bootstrap vshard". Она находится справа сверху.

source: Creating a data schema [2 minutes]
ru: Создаем схему данных [2 мин]

source: Let's start with the data schema -- take a look at the "Code" tab on the left.
ru: Начнем со схемы данных: загляните на вкладку "Code". Она находится слева.

source: Here we can create a file called ``schema.yml``. In this file, you can describe the entire cluster's data schema, edit the current schema, validate its correctness, and apply it to the whole cluster.
ru: Здесь мы сможем создать файл под названием ``schema.yml``. В нем можно описать схему данных для всего кластера, отредактировать текущую схему, проверить ее на корректность и применить на всем кластере.

source: First, let's create the necessary tables. In Tarantool, they are called spaces.
ru: Создадим необходимые таблицы. В Tarantool они называются спейсами (space).

source: We need to store:
ru: Нам понадобится хранить:

source: Users
ru: пользователей;

source: Videos with descriptions
ru: видео с описаниями;

source: Likes for each video
ru: лайки для каждого видео.

source: Create a ``schema.yml`` file to load the schema into the cluster. Copy and paste schema to this file. Click the "Apply" button. After that, the data schema will be described in the cluster.
ru: Чтобы загрузить схему в кластер, создайте файл ``schema.yml``. Скопируйте и вставьте схему в этот файл. Нажмите на кнопку "Apply". После этого в кластере будет описана схема данных.

source: This is what our data schema will look like:
ru: Вот как будет выглядеть наша схема данных:

source: It's simple. Let's take a closer look at the essential points.
ru: Тут все просто. Рассмотрим важные моменты.

source: Tarantool has two built-in storage engines: memtx and vinyl. memtx stores all data in RAM while asynchronously writing to disk so that nothing gets lost.
ru: В Tarantool есть два встроенных движка хранения: memtx и vinyl. Первый хранит все данные в оперативной памяти, при этом асинхронно записывая на диск, чтобы ничего не потерялось.

source: Vinyl is a classic engine for storing data on the hard drive. It is optimized for write-intensive scenarios.
ru: Второй движок Vinyl --- это классический движок для хранения данных на жестком диске. Он оптимизирован для большого количества операций записи данных.

source: In TikTok, there are a lot of simultaneous readings and posts: users watch videos, like them, and comment on them. Therefore, let's use memtx.
ru: Для сервиса TikTok актуально большое количество одновременных чтений и записей: пользователи смотрят видео, ставят им лайки и комментируют их. Поэтому используем memtx.

source: The configuration above describes three memtx spaces (tables) and the necessary indexes for each of the spaces.
ru: Мы указали в конфигурации три спейса (таблицы) в memtx и для каждого из спейсов задали необходимые индексы.

source: Each space has two indexes:
ru: Их два для каждого спейса:

source: The primary key, which is required to read/write data.
ru: Первый --- это первичный ключ. Он необходим для того, чтобы читать/писать данные.

source: An index on the bucket_id field, which is a service field used for sharding.
ru: Второй --- это индекс для поля ``bucket_id``. Это поле служебное и используется при шардировании.

source: **Important:** The name ``bucket_id`` is reserved. If you choose another name, sharding won't work for this space. If you don't use sharding in your project, you can remove the second index.
ru: **Важно:** название ``bucket_id`` --- зарезервированное. Если вы выберите другое название, то шардирование для этого спейса работать не будет. Если в проекте шардирование не используется, то второй индекс можно убрать.

source: To understand which field to shard data by, Tarantool uses ``sharding_key``. ``sharding_key`` points to fields in the space by which database records will be sharded. There can be more than one such field, but in this example, we will only use one. When some data is inserted, Tarantool forms a hash from this field, calculates the bucket number, and selects the storage to record the data into.
ru: Чтобы понять, по какому полю шардировать данные, Tarantool использует ``sharding_key``. ``sharding_key`` указывает на поле в спейсе, по которому будут шардироваться записи. Таких полей может быть и несколько. В данном примере мы будем использовать только одно поле. Tarantool возьмет хеш от этого поля при вставке, вычислит номер бакета и подберет для записи нужный storage.

source: Yes, buckets can repeat, and each storage stores a specific range of buckets.
ru: Да, бакеты могут повторяться, а каждый storage хранит определенный диапазон бакетов.

source: Here are a couple more interesting facts:
ru: Еще пара мелочей для любопытных:

source: The ``parts`` field in the index description can contain several fields, which allows building a composite index. You won't need it in this tutorial.
ru: Поле ``parts`` в описании индекса может содержать несколько полей для того, чтобы построить составной индекс. В данной задаче он не требуется.

source: Tarantool does not support foreign keys, so you have to check manually upon insertion that ``video_id`` and ``user_id`` exist in the ``likes`` space.
ru: Tarantool не поддерживает Foreign key или "внешний ключ", поэтому в спейсе ``likes`` нужно при вставке вручную проверять, что такие ``video_id`` и ``user_id`` существуют.

source: Writing data [5 minutes]
ru: Записываем данные [5 мин]

source: We will write data to the Tarantool cluster using the CRUD module. You don't have to specify the shard you want to read from or write to -- the module does it for you.
ru: Записывать данные в кластер Tarantool будем с помощью модуля CRUD. Этот модуль сам определяет, с какого шарда читать и на какой шард записывать, и делает это за вас.

source: **Important:** All cluster operations must be performed only on the router and using the CRUD module.
ru: Важно: все операции по кластеру необходимо производить только на экземпляре router и с помощью модуля CRUD.

source: Let's connect the CRUD module in the code and write three procedures:
ru: Подключим модуль CRUD в коде и напишем три процедуры:

source: User creation
ru: создание пользователя;

source: Adding a video
ru: добавление видео;

source: Liking a video
ru: лайк видео.

source: The procedures must be described in a special file. To do this, go to the "Code" tab. Create a new directory called ``extensions``, and in this directory, create the file ``api.lua``.
ru: Процедуры нужно описать в специальном файле. Для этого перейдите на вкладку "Code". Создайте новую директорию под названием ``extensions``, а в ней создайте файл ``api.lua``.

source: Paste the code below into ``api.lua`` and click "Apply".
ru: Вставьте в этот файл следующий код, а затем нажмите "Apply".

source: Setting up HTTP API [2 minutes]
ru: Поднимаем HTTP API [2 мин]

source: Clients will visit the Tarantool cluster using the HTTP protocol. The cluster already has a built-in HTTP server.
ru: Клиенты будут ходить в кластер Tarantool по протоколу HTTP. В кластере уже есть свой встроенный HTTP-сервер.

source: To configure HTTP paths, you need to write a configuration file. Go to the "Code" tab. Create the file ``config.yml`` in the ``extensions`` directory, which you created on the last step.
ru: Чтобы сконфигурировать HTTP-пути, необходимо написать конфигурационный файл. Для этого перейдите на вкладку "Code". Создайте файл ``config.yml`` в директории ``extensions`` (вы ее создали на прошлом шаге).

source: Paste the configuration example below into ``config.yml`` and click "Apply".
ru: Вставьте в этот файл следующий пример конфигурации и нажмите на кнопку "Apply".

source: Done! Let's make test requests from the console:
ru: Готово! Сделаем тестовые запросы из консоли:

source: We've just created a user and got their UUID. Let's remember it.
ru: Создали пользователя и получили его UUID. Запомним его.

source: Let's say a user has added their first video with a description. The video clip also has a UUID. Let's remember it, too.
ru: Представим, что пользователь добавил свое первое видео с описанием. Мы также получили UUID видеоролика. Его тоже запомним.

source: In order to "like" the video, you need to specify the user UUID and the video UUID. Substitute the ellipses in the command below with the corresponding UUIDs:
ru: Чтобы "лайкнуть" видео, нужно указать UUID пользователя и UUID видео. Подставим эти данные, полученные за первые два шага, вместо многоточий ниже.

source: The result will be something like this:
ru: Получится примерно вот так:

source: Test queries in the console
ru: Тестовые запросы в консоли

source: In our example, you can "like" the video as many times as you want. It makes no sense in the real life, but it will help us understand how sharding works -- more precisely, the ``sharding_key`` parameter.
ru: В нашем примере "лайкать" видео можно сколько угодно раз. Хоть в реальной жизни это и лишено смысла, но это поможет нам понять, как работает шардирование --- а точнее, параметр ``sharding_key``.

source: Our ``sharding_key`` for the ``likes`` is ``video_id``. We also specified a ``sharding_key`` for the ``videos`` space. It means that likes will be stored on the same storage as videos. This ensures data locality with regard to storage and allows getting all the information you need in one network trip to Storage.
ru: Для спейса ``likes`` мы указали ``sharding_key`` --- ``video_id``. Такой же ``sharding_key`` мы указали и для спейса ``videos``. Это означает, что лайки будут храниться на том же storage, где и видео. Это обеспечивает локальность по данным при хранении и позволяет за один сетевой поход в storage получить необходимую информацию.

source: More details are described on the next step.
ru: Подробности описаны на следующем шаге.

source: Looking at the data [1 minute]
ru: Смотрим на данные [1 мин]

source: Go to the "Space-Explorer" tab to see all the nodes in the cluster. As we have only one storage and one router started so far, the data is stored on only one node.
ru: Переходим на вкладку "Space-Explorer" и видим все узлы в кластере. Так как у нас пока поднят всего один storage и один router, данные хранятся только на одном узле.

source: Let's go to the node ``s1-master``: click "Connect" and select the necessary space.
ru: Переходим в узел ``s1-master`` : нажимаем "Connect" и выбираем нужный нам спейс.

source: Check that everything is in place and move on.
ru: Смотрим, что все на месте, и переходим дальше.

source: Space Explorer, host list
ru: Space-Explorer, список хостов

source: Space Explorer, view likes
ru: Space-Explorer, просмотр лайков

source: Space Explorer, viewing likes
ru: Space-Explorer, просмотр лайков

source: Please note that the Space-Explorer tool is only available in the Enterprise version of the product and in the Try Tarantool cloud service. In the open-source version, use the console to view data.
ru: Обратите внимание: инструмент ``space-explorer`` доступен только в Enterprise-версии продукта и в облачном сервисе Try Tarantool. В open-source-версии данные можно посмотреть через консоль.

source: Check our documentation to learn more about :doc:`data viewing </reference/reference_lua/box_space/select/>`. To learn how to connect to a Tarantool instance, :ref:`read the basic Tarantool manual <getting_started_db>`.
ru: Подробности о просмотре данных читайте в нашей :doc:`документации </reference/reference_lua/box_space/select/>`. О том, как подключиться к экземпляру Tarantool, читайте в :ref:`базовом руководстве по Tarantool <getting_started_db>`.

source: Scaling the cluster [1 minute]
ru: Масштабируем кластер [1 мин]

source: Let's create a second shard. Click on the "Cluster" tab, select ``s2-master``, and click "Configure". Select the roles as shown in the picture:
ru: Создадим второй шард. Открываем вкладку "Cluster", выбираем ``s2-master`` и нажимаем "Configure". Выбираем роли так, как на картинке:

source: Cluster, new shard configuration screen
ru: Cluster, экран конфигурации нового шарда

source: Click on the necessary roles and create a shard (replica set).
ru: Щелкаем на нужные роли и создаем шард (набор реплик).

source: Checking how sharding works [1 minute]
ru: Смотрим, как работает шардирование [1 мин]

source: Now we have two shards -- two logical nodes that share data among themselves. The router decides what piece of data goes to what shard. By default, the router uses the hash function from the field ``sharding_key`` we've specified in the DDL.
ru: Теперь у нас есть два шарда --- два логических узла, которые будут разделять между собой данные. Роутер сам решает, какие данные на какой шард положить. По умолчанию, он просто использует хеш-функцию от поля ``sharding_key`` , которое мы указали в DDL.

source: To enable a new shard, you need to set its weight to one. Go back to the "Cluster" tab, open the ``s2-master`` settings, set the Replica set weight to 1, and apply.
ru: Чтобы задействовать новый шард, надо выставить для него вес 1. Заходим снова на вкладку "Cluster", переходим в настройки ``s2-master``, указываем для Replica set weight значение 1 и применяем.

source: Something has already happened. Let's go to Space-Explorer and check the node ``s2-master``. It turns out that some of the data from the first shard has already migrated here! The scaling is done automatically.
ru: Кое-что уже произошло. Зайдем в space-explorer и перейдем на узел ``s2-master``. Оказывается, часть данных с первого шарда переехала сюда автоматически! Масштабирование происходит автоматически.

source: Now let's try adding more data to the cluster via the HTTP API. We can check back later and make sure that the new data is also evenly distributed across the two shards.
ru: Теперь попробуем добавить еще данных в кластер через HTTP API. Можем проверить и убедиться, что новые данные также равномерно распределяются на два шарда.

source: Disconnecting a shard for a while [1 minute]
ru: Один шард надо на время выключить [1 мин]

source: In the ``s1-master`` settings, set Replica set weight to 0 and apply. Wait for a few seconds, then go to Space-Explorer and look at the data in ``s2-master``. You will see that all the data has been migrated to the remaining shard automatically.
ru: Выставляем в настройках ``s1-master`` значение 0 для Replica set weight и применяем. Ждем пару секунд, заходим в space-explorer и смотрим на данные в ``s2-master``: все данные автоматически мигрировали на оставшийся шард.

source: Now we can safely disable the first shard for maintenance.
ru: Теперь можно смело отключать первый шард, если вам понадобилось провести служебные работы.

source: See also
ru: Читайте также

source: README of the `DDL <https://github.com/tarantool/ddl>`__ module to create your own data schema.
ru: README модуля `DDL <https://github.com/tarantool/ddl>`__ для создания своей схемы данных

source: README of the `CRUD <https://github.com/tarantool/crud>`__ module to learn more about the API and create your own cluster queries.
ru: README модуля `CRUD <https://github.com/tarantool/crud>`__, чтобы узнать больше про API и реализовать собственные запросы по кластеру

source: To continue to the next steps of the tutorial, click the button in the bottom right corner or select the section in the table of contents on the left.
ru: Переходите к следующим шагам руководства, нажав кнопку справа внизу или выбрав нужный пункт оглавления слева.
