Repository: tarantool/doc
Catalog: locale/*/LC_MESSAGES/getting_started/getting_started_php.po
Languages: ru

source: Connecting from PHP
ru: Подключение из PHP

source: Pre-requisites
ru: Подготовка

source: Before we proceed:
ru: Перед тем как идти дальше, выполним следующие действия:

source: `Install <https://github.com/tarantool-php/client#installation>`__ the ``tarantool/client`` library.
ru: `Установим <https://github.com/tarantool-php/client#installation>`__ библиотеку ``tarantool/client``.

source: :ref:`Start <getting_started_db>` Tarantool (locally or in Docker) and make sure that you have created and populated a database as we suggested :ref:`earlier <creating-db-locally>`:
ru: :ref:`Запустим <getting_started_db>` Tarantool (локально или в Docker) и обязательно создадим базу данных с тестовыми данными, как показано в :ref:`предыдущем разделе <creating-db-locally>`:

source: Please do not close the terminal window where Tarantool is running -- you'll need it soon.
ru: Не закрывайте окно терминала с запущенным Tarantool -- оно пригодится нам позднее.

source: In order to connect to Tarantool as an administrator, reset the password for the ``admin`` user:
ru: Чтобы иметь возможность подключаться к Tarantool в качестве администратора, сменим пароль пользователя ``admin``:

source: Connecting to Tarantool
ru: Подключение к Tarantool

source: To configure a connection to the Tarantool server, say this:
ru: Для настройки подключения к серверу достаточно выполнить следующее:

source: The connection itself will be established at the first request. You can also specify the user name and password, if needed:
ru: Само подключение будет установлено при первом запросе. Также при необходимости можно указать имя пользователя и пароль:

source: The default user is ``guest``.
ru: По умолчанию используется пользователь ``guest``.

source: Manipulating the data
ru: Работа с данными

source: A :term:`space` is a container for :term:`tuples <tuple>`. To access a space as a named object, use ``getSpace``:
ru: :term:`Спейс` — это контейнер для :term:`кортежей <tuple>`. Чтобы обратиться к спейсу как к именованному объекту, воспользуйтесь функцией ``getSpace``:

source: Inserting data
ru: Вставка данных

source: To insert a tuple into a space, use ``insert``:
ru: Для вставки нового кортежа в спейс воспользуемся функцией ``insert``:

source: Querying data
ru: Получение данных

source: Let's start with selecting a tuple by the primary key (in our example, this is the index named ``primary``, based on the ``id`` field of each tuple). Use ``select``:
ru: Сначала выберем кортеж по первичному ключу (в нашем примере первичный индекс –--это индекс ``primary``, построенный по полю ``id`` в каждом кортеже). Воспользуемся функцией ``select``:

source: Next, select tuples by a secondary key. For this purpose, you need to specify the number *or* name of the index.
ru: Теперь поищем кортежи по вторичному ключу. Для этого нужно указать номер *или* имя вторичного индекса.

source: First off, select tuples using the index number:
ru: Сначала сделаем запрос по номеру индекса:

source: (We say ``index(1)`` because index numbers in Tarantool start with 0, and we're using our second index here.)
ru: (Мы указываем ``index(1)``, потому что индексы в Tarantool нумеруются с нуля, а в данном случае мы обращаемся к индексу, который создавали вторым.)

source: Now make a similar query by the index name and make sure that the result is the same:
ru: Теперь сделаем аналогичный запрос по имени индекса и получим тот же результат:

source: Finally, select all the tuples in a space via a ``select``:
ru: А чтобы выбрать все кортежи из спейса, вызовем ``select``:

source: Updating data
ru: Обновление данных

source: Update a :term:`field` value using ``update``:
ru: Обновите значение :term:`поля` с помощью ``update``:

source: This updates the value of field ``1`` and increases the value of field ``2`` in the tuple with ``id = 4``. If a tuple with this ``id`` doesn't exist, Tarantool will return an error.
ru: Здесь обновляется значение поля ``1`` и увеличивается значение поля ``2`` для кортежа с ``id = 4``. Если кортежа с таким ``id`` нет, то Tarantool вернет ошибку.

source: Now use ``replace`` to totally replace the tuple that matches the primary key. If a tuple with this primary key doesn't exist, Tarantool will do nothing.
ru: Теперь с помощью функции ``replace`` мы полностью заменим кортеж с совпадающим первичным ключом. Если кортежа с указанным первичным ключом не существует, то эта операция ни к чему не приведет.

source: You can also update the data using ``upsert`` that works similarly to ``update``, but creates a new tuple if the old one was not found.
ru: Также мы можем обновлять данные с помощью функции ``upsert``, которая работает аналогично ``update``, но создает новый кортеж, если старый не был найден.

source: This increases by 5 the value of field ``2`` in the tuple with ``id = 4``, or inserts the tuple ``(4, "Another band", 2000)`` if a tuple with this ``id`` doesn't exist.
ru: Здесь значение поля ``2`` в кортеже с ``id = 4`` увеличится на 5, — или же произойдет вставка кортежа ``(4, "Another band", 2000)``, если такого нет.

source: Deleting data
ru: Удаление данных

source: To delete a tuple, use ``delete(primary_key)``:
ru: Чтобы удалить кортеж, нужно использовать ``delete(primary_key)``:

source: To delete all tuples in a space (or to delete an entire space), use ``call``. We'll focus on this function in more detail in the :ref:`next <getting_started-php-stored-procs>` section.
ru: Для удаления всех кортежей в спейсе (или всего спейса целиком) нужно воспользоваться функцией ``call``. Мы поговорим о ней подробнее в :ref:`следующем разделе <getting_started-php-stored-procs>`.

source: To delete all tuples in a space, call ``space:truncate``:
ru: Чтобы удалить все кортежи в спейсе, нужно вызвать функцию ``space:truncate``:

source: To delete an entire space, call ``space:drop``. This requires connecting to Tarantool as the ``admin`` user:
ru: Чтобы удалить весь спейс, нужно вызвать функцию ``space:drop``. Для выполнения следующей команды необходимо подключиться из-под пользователя ``admin``:

source: Executing stored procedures
ru: Исполнение хранимых процедур

source: Switch to the terminal window where Tarantool is running.
ru: Перейдем в терминал с запущенным Tarantool.

source: If you don't have a terminal window with remote connection to Tarantool, check out these guides:
ru: О том, как установить удаленное подключение к Tarantool, можно прочитать здесь:

source: :ref:`connecting to a local Tarantool instance <connecting-remotely>`
ru: :ref:`как подключиться к Tarantool, запущенному локально <connecting-remotely>`

source: :ref:`attaching to a Tarantool instance that runs in a Docker container <getting_started-docker-attaching>`
ru: :ref:`как подключиться к Tarantool, запущенному в Docker-контейнере <getting_started-docker-attaching>`

source: Define a simple Lua function:
ru: Напишем простую функцию на Lua:

source: Now we have a Lua function defined in Tarantool. To invoke this function from ``php``, use ``call``:
ru: Итак, теперь у нас есть функция, описанная в Tarantool. Чтобы вызвать ее из ``php``, нам нужна функция ``call``:

source: To send bare Lua code for execution, use ``eval``:
ru: Также мы можем передать на выполнение любой Lua-код. Для этого воспользуемся функцией ``eval``:
