Repository: tarantool/doc
Catalog: locale/*/LC_MESSAGES/getting_started/getting_started_cartridge.po
Languages: ru

source: Creating your first Tarantool Cartridge application
ru: Создаем свое первое приложение на Tarantool Cartridge

source: Here we'll walk you through developing a simple cluster application.
ru: Здесь мы показываем, как сделать простое кластерное приложение.

source: First, :doc:`set up the development environment </book/cartridge/cartridge_cli/installation>`.
ru: Первым делом :doc:`настройте среду разработки </book/cartridge/cartridge_cli/installation>`.

source: Next, create an application named ``myapp``. Run:
ru: Затем создайте приложение с именем ``myapp``. Выполните:

source: This will create a Tarantool Cartridge application in the ``./myapp`` directory, with a handful of :doc:`template files and directories </book/cartridge/cartridge_cli/commands/create>` inside.
ru: Эта команда создает новое Tarantool Cartridge-приложение в директории ``./myapp``. Там теперь содержатся созданные по шаблону :doc:`файлы и директории </book/cartridge/cartridge_cli/commands/create>`.

source: Go inside and make a dry run:
ru: Войдите внутрь этой директории и запустите ваше приложение:

source: This will build the application locally, start 5 instances of Tarantool and a :ref:`stateboard <cartridge-stateful_failover>` (state provider), and run the application as it is, with no business logic yet.
ru: Эта команда собирает приложение локально, стартует 5 экземпляров Tarantool и :ref:`stateboard <cartridge-stateful_failover>` (провайдер состояния), а затем запускает приложение в том виде, как оно было создано -- без какой-либо интересной бизнес-логики.

source: Why 5 instances and a stateboard? See the ``instances.yml`` file in your application directory. It contains the :ref:`configuration <cartridge-deployment>` of all instances that you can use in the cluster. By default, it defines configuration for 5 Tarantool instances.
ru: Откуда взялись 5 экземпляров и stateboard? Загляните внутрь файла ``instances.yml``.Там задается :ref:`конфигурация <cartridge-deployment>` всех экземпляров, которые вы можете настроить внутри вашего кластера. По умолчанию там задана конфигурация 5 экземпляров.

source: You can already see these instances in the cluster management web interface at http://localhost:8081 (here 8081 is the HTTP port of the first instance specified in ``instances.yml``).
ru: Вы можете увидеть все эти экземпляры в веб-интерфейсе для управления кластером по адресу http://localhost:8081 (порт 8081 -- это HTTP-порт первого экземпляра из файла ``instances.yml``).

source: Okay, press ``Ctrl + C`` to stop the cluster for a while.
ru: Теперь временно остановите кластер с помощью ``Ctrl + C``.

source: Now it’s time to add some business logic to your application. This will be an evergreen "Hello world!"" -- just to keep things simple.
ru: Пора заняться написанием бизнес-логики для вашего приложения. Чтобы не слишком усложнять наш пример, возьмем канонический "Hello world!".

source: Rename the template file ``app/roles/custom.lua`` to ``hello-world.lua``.
ru: Переименуйте шаблонный файл ``app/roles/custom.lua`` в ``hello-world.lua``.

source: This will be your *role*. In Tarantool Cartridge, a role is a Lua module that implements some instance-specific functions and/or logic. Further on we'll show how to add code to a role, build it, enable and test.
ru: Это будет ваша *роль*. Роль в Tarantool Cartridge -- это Lua-модуль, в котором реализованы специфичные для экземпляра Tarantool функции и логика. Далее мы покажем, как добавлять в роль свой код, собирать ее, назначать и тестировать.

source: There is already some code in the role's ``init()`` function.
ru: У вашей роли уже есть некоторый код внутри функции ``init()``.

source: This exports an HTTP endpoint ``/hello``. For example, http://localhost:8081/hello if you address the first instance from the ``instances.yml`` file. If you open it in a browser after enabling the role (we'll do it here a bit later), you'll see "Hello world!" on the page.
ru: Этот код экспортирует конечную точку ``/hello`` для выполнения HTTP-запросов. Например, для первого экземпляра из файла ``instances.yml`` это будет http://localhost:8081/hello . Если вы зайдете по этому адресу в браузере после того, как роль будет назначена (чуть позже мы покажем, как это делается), то увидите на странице слова "Hello world!".

source: Let's add some more code there.
ru: Добавим сюда еще немного кода.

source: This writes "Hello, world!" to the console when the role gets enabled, so you'll have a chance to spot this. No rocket science.
ru: Здесь мы пишем "Hello, world!" в консоль в момент назначения роли, что даст вам возможность отследить данное событие. Пока ничего сложного.

source: Next, amend ``role_name`` in the "return" section of the ``hello-world.lua`` file. You'll see this section at the bottom of the file. This text will be displayed as a label for your role in the cluster management web interface.
ru: Далее изменим значение параметра ``role_name`` в "return"-блоке файла ``hello-world.lua``. Этот блок находится в конце файла. Введенное имя роли вы увидите в веб-интерфейсе для управления кластером.

source: The final thing to do before you can run the application is to add your role to the list of available cluster roles in the ``init.lua`` file in the project root directory.
ru: Последнее, что осталось сделать — это добавить вашу роль в список доступных ролей кластера в файле ``init.lua``, который находится в корневой директории проекта (``myapp``).

source: Now the cluster will be aware of your role.
ru: Теперь кластер будет знать про вашу роль.

source: Why ``app.roles.hello-world``? By default, the role name here should match the path from the application root (``./myapp``) to the role file (``app/roles/hello-world.lua``).
ru: Почему мы указали ``app.roles.hello-world``? По умолчанию, имя роли в данном файле должно включать в себя полный путь от корня приложения (``./myapp``) до файла роли (``app/roles/hello-world.lua``).

source: Great! Your role is ready. Re-build the application and re-start the cluster now:
ru: Отлично! Роль готова. Теперь заново соберите и запустите ваше приложение:

source: Now all instances are up, but idle, waiting for you to enable roles for them.
ru: Все экземпляры запущены, но они пока ничего не делают, а ждут, что им назначат роли.

source: Instances (replicas) in a Tarantool Cartridge cluster are organized into *replica sets*. Roles are enabled per replica set, so all instances in a replica set have the same roles enabled.
ru: Экземпляры (реплики) в кластере Tarantool Cartridge должны быть собраны в *наборы реплик*. Роли назначаются каждому набору, и любой экземпляр в наборе реплик видит все роли, которые назначены этому набору.

source: Let's create a replica set containing just one instance and enable your role:
ru: Давайте создадим набор реплик, в котором будет всего один экземпляр, и назначим этому набору вашу роль.

source: Open the cluster management web interface at http://localhost:8081.
ru: Откройте веб-интерфейс для управления кластером по адресу http://localhost:8081.

source: Next to the **router** instance, click **Configure**.
ru: Рядом с экземпляром **router** нажмите кнопку **Configure**.

source: Check the role ``Hello world!`` to enable it. Notice that the role name here matches the label text that you specified in the ``role_name`` parameter in the ``hello-world.lua`` file.
ru: Установите флажок напротив роли ``Hello world!``, чтобы назначить ее. Заметьте, что имя роли здесь совпадает с тем текстом, который вы задали в параметре ``role_name`` в файле ``hello-world.lua``.

source: (Optionally) Specify the replica set name, for example "hello-world-replica-set".
ru: (По желанию) Задайте имя набора реплик, например "hello-world-replica-set".

source: Click **Create replica set** and see the newly-created replica set in the web interface.
ru: Нажмите кнопку **Create replica set**. Информация о вашем наборе реплик появится в веб-интерфейсе.

source: Your custom role got enabled. Find the "Hello world!" message in console, like this:
ru: Итак, ваша роль назначена. В консоли вы можете увидеть такое сообщение:

source: Finally, open the HTTP endpoint of this instance at http://localhost:8081/hello and see the reply to your GET request.
ru: А если вы сейчас откроете в браузере страницу http://localhost:8081/hello , то увидите ответ вашей роли на HTTP GET-запрос.

source: Everything is up and running! What's next?
ru: Все работает! Что же дальше?

source: Follow :ref:`this guide <cartridge-deployment>` to set up the rest of the cluster and try some cool cluster management features.
ru: Загляните в :ref:`это руководство <cartridge-deployment>`, чтобы настроить оставшиеся наборы реплик и опробовать разные кластерные возможности.

source: Get inspired with `these examples <https://github.com/tarantool/examples/>`_ and implement more sophisticated business logic for your role.
ru: Посмотрите эти `примеры приложений <https://github.com/tarantool/examples/>`_ и реализуйте более сложную логику для вашей роли.

source: :doc:`Pack </book/cartridge/cartridge_cli/commands/pack>` your application for easy distribution. Choose what you like: a DEB or RPM package, a TGZ archive, or a Docker image.
ru: :doc:`Упакуйте </book/cartridge/cartridge_cli/commands/pack>` ваше приложение для дальнейшего распространения. Вы можете выбрать любой из поддерживаемых видов пакетов: DEB, RPM, архив TGZ или Docker-образ.

source: Read the :doc:`Cartridge documentation </book/cartridge/index>`.
ru: Ознакомьтесь с :doc:`документацией Cartridge </book/cartridge/index>`.
