Repository: tarantool/doc
Catalog: locale/*/LC_MESSAGES/reference/reference_lua/box_space/_func.po
Languages: ru_ru

source: ``_func`` is a system space with function tuples made by :ref:`box.schema.func.create() <box_schema-func_create>` or :ref:`box.schema.func.create(func-name [, {options-with-body}]) <box_schema-func_create_with-body>`.
ru_ru: ``_func`` -- это системный спейс, который содержит кортежи с функциями, созданными с помощью :ref:`box.schema.func.create() <box_schema-func_create>` или :ref:`box.schema.func.create(func-name [, {options-with-body}]) <box_schema-func_create_with-body>`.

source: Tuples in this space contain the following fields:
ru_ru: Кортежи в данном спейсе включают в себя следующие поля:

source: id (integer identifier),
ru_ru: id (идентификатор типа integer)

source: owner (integer identifier),
ru_ru: owner (идентификатор типа integer)

source: the function name,
ru_ru: имя функции

source: the setuid flag,
ru_ru: флаг ``setuid``

source: a language name (optional): 'LUA' (default) or 'C'.
ru_ru: название языка (необязательно): 'LUA' (по умолчанию) или 'C'

source: the body
ru_ru: body (тело функции)

source: the is_deterministic flag
ru_ru: флаг ``is_deterministic``

source: the is_sandboxed flag
ru_ru: флаг ``is_sandboxed``

source: options
ru_ru: опции

source: If the function tuple was made in the older way without specification of ``body``, then the ``_func`` space will contain default values for the body and the is_deterministic flag and the is_sandboxed flag. Such function tuples are called "not persistent". You continue to create Lua functions in the usual way, by saying ``function function_name () ... end``, without adding anything in the ``_func`` space. The ``_func`` space only exists for storing function tuples so that their names can be used within :ref:`grant/revoke <authentication-owners_privileges>` functions.
ru_ru: Если кортеж с функцией был создан старым способом без указания ``body``, то в спейсе ``_func`` будут указаны значения body, флага ``is_deterministic`` и флага ``is_sandboxed``, которые используются по умолчанию. Такие кортежи с функцией называются "непостоянными". Lua-функции по-прежнему создаются с помощью ``function function_name () ... end`` без каких-либо добавлений в спейс ``_func``. Спейс ``_func`` предназначен лишь для хранения кортежей с функциями так, чтобы их имена могли использоваться в функциях :ref:`выдачи / отмены прав <authentication-owners_privileges>`.

source: If the function tuple was made the newer way with specification of ``body``, then all the fields may contain non-default values. Such functions are called "persistent". They should be invoked with :samp:`box.func.{func-name}:call([parameters])`.
ru_ru: Если же кортеж с функцией был создан новым способом с указанием тела функции ``body``, то все поля могут содержать нестандартные значения. Такие функции называются "постоянными". Их следует вызывать, используя :samp:`box.func.{func-name}:call([parameters])`.

source: You can:
ru_ru: Доступны следующие операции:

source: Create a ``_func`` tuple with :doc:`/reference/reference_lua/box_schema/func_create`,
ru_ru: Создание кортежа в ``_func`` с помощью :doc:`/reference/reference_lua/box_schema/func_create`,

source: Drop a ``_func`` tuple with :doc:`/reference/reference_lua/box_schema/func_drop`,
ru_ru: Удаление кортежа в ``_func`` с помощью :doc:`/reference/reference_lua/box_schema/func_drop`,

source: Check whether a ``_func`` tuple exists with :doc:`/reference/reference_lua/box_schema/func_exists`.
ru_ru: Проверка наличия кортежа в ``_func`` с помощью :doc:`/reference/reference_lua/box_schema/func_exists`.

source: **Example:**
ru_ru: **Пример:**

source: In the following example, we create a function named ‘f7’, put it into Tarantool's ``_func`` space and grant 'execute' privilege for this function to 'guest' user.
ru_ru: В следующем примере создадим функцию с именем ‘f7’, поместим ее в спейс ``_func`` в Tarantool'е и выдадим права на 'выполнение' этой функции пользователю 'guest'.
