Repository: tarantool/doc
Catalog: locale/*/LC_MESSAGES/reference/reference_lua/box_space/create_index.po
Languages: ru

source: On this page:
ru: На этой странице:

source: :ref:`create_index() description <box_space-create_index>`
ru: :ref:`Описание create_index() <box_space-create_index>`

source: :ref:`Details about index field types <details_about_index_field_types>`
ru: :ref:`Описание типов индексируемых полей <details_about_index_field_types>`

source: :ref:`Allowing null for an indexed key <box_space-is_nullable>`
ru: :ref:`Использование null для индексируемого ключа <box_space-is_nullable>`

source: :ref:`Creating an index using field names instead of field numbers <box_space-field_names>`
ru: :ref:`Создание индекса с использованием имен полей вместо номеров полей <box_space-field_names>`

source: :ref:`Creating an index using the path option for map fields (JSON-path indexes) <box_space-path>`
ru: :ref:`Создание индекса с использованием пути для полей с ассоциативными массивами (индексы по пути JSON) <box_space-path>`

source: :ref:`Creating an multikey index using the path option with [*] <box_space-path_multikey>`
ru: :ref:`Создание индекса по массивам (multikey) с использованием опции path с символом [*] <box_space-path_multikey>`

source: :ref:`Creating a functional index <box_space-index_func>`
ru: :ref:`Создание функционального индекса <box_space-index_func>`

source: Create an :ref:`index <index-box_index>`.
ru: Создание :ref:`индекса <index-box_index>`.

source: It is mandatory to create an index for a space before trying to insert tuples into it or select tuples from it. The first created index will be used as the primary-key index, so it must be unique.
ru: Обязательным условием является создание индекса для спейса до вставки в спейс кортежей или выборки кортежей из него. Первый созданный индекс, который будет использоваться в качестве первичного индекса, должен быть уникальным.

source: Parameters
ru: Параметры

source: an :ref:`object reference <app_server-object_reference>`
ru: :ref:`ссылка на объект <app_server-object_reference>`

source: name of index, which should conform to the :ref:`rules for object names <app_server-names>`
ru: имя индекса, которое должно соответствовать :ref:`правилам именования объектов <app_server-names>`

source: see "Options for space_object:create_index()", below
ru: см. "Параметры для space_object:create_index()" ниже

source: return
ru: возвращает

source: index object
ru: объект индекса

source: rtype
ru: тип возвращаемого значения

source: **Possible errors:**
ru: **Возможные ошибки:**

source: too many parts;
ru: слишком много частей;

source: index '...' already exists;
ru: индекс '...' уже существует;

source: primary key must be unique.
ru: первичный ключ должен быть уникальным.

source: Building or rebuilding a large index will cause occasional :ref:`yields <atomic-cooperative_multitasking>` so that other requests will not be blocked. If the other requests cause an illegal situation such as a duplicate key in a unique index, building or rebuilding such index will fail.
ru: Сборка или пересборка большого индекса будет периодически вызывать :ref:`передачу управления <atomic-cooperative_multitasking>`, чтобы не блокировать другие запросы. А если другой запрос приведет к ошибке, например повторяющийся ключ в уникальном индексе, сборка или пересборка такого индекса не выполнится.

source: **Options for space_object:create_index()**
ru: **Параметры для space_object:create_index()**

source: Name
ru: Имя

source: Effect
ru: Описание

source: Type
ru: Тип

source: Default
ru: Значение по умолчанию

source: type of index
ru: тип индекса

source: string ('HASH' or 'TREE' or 'BITSET' or 'RTREE') Note re storage engine: vinyl only supports 'TREE'
ru: string ('HASH', или 'TREE', или 'BITSET', или 'RTREE') Примечание про движок базы данных: vinyl поддерживает только 'TREE'

source: unique identifier
ru: уникальный идентификатор

source: last index's id, +1
ru: идентификатор последнего индекса +1

source: index is unique
ru: индекс уникален

source: no error if duplicate name
ru: ошибки нет, если имя дублируется

source: field-numbers + types
ru: номера поля + типы

source: {field_no, ``'unsigned'`` or ``'string'`` or ``'integer'`` or ``'number'`` or ``'double'`` or ``'decimal'`` or ``'boolean'`` or ``'varbinary'`` or ``'uuid'`` or ``'array'`` or ``'scalar'``, and optional collation or is_nullable value or path}
ru: {field_no, ``'unsigned'``, или ``'string'``, или ``'integer'``, или ``'number'``, или ``'double'``, или ``'decimal'``, или ``'boolean'``, или ``'varbinary'``, или ``'uuid'``, или ``'array'``, или ``'scalar'``, и дополнительная сортировка, или значение is_nullable, или путь}

source: affects :ref:`RTREE <box_index-rtree>` only
ru: только для :ref:`RTREE <box_index-rtree>`

source: affects RTREE only
ru: только для RTREE

source: string ('euclid' or 'manhattan')
ru: строка ('euclid', то есть Евклидова метрика; или 'manhattan', то есть расстояние городских кварталов)

source: affects vinyl only
ru: только для vinyl

source: see section regarding :ref:`specifying a sequence in create_index() <box_schema-sequence_create_index>`
ru: см. раздел об :ref:`указании последовательности для create_index() <box_schema-sequence_create_index>`

source: string or number
ru: строка или число

source: not present
ru: отсутствует

source: :ref:`functional index <box_space-index_func>`
ru: :ref:`функциональный индекс <box_space-index_func>`

source: hint (since version :doc:`2.6.1 </release/2.6.1>`)
ru: hint (с версии :doc:`2.6.1 </release/2.6.1>`)

source: affects TREE only. ``true`` makes an index work faster, ``false`` -- an index size is reduced by half
ru: только для TREE. ``true`` заставит индекс работать быстрее, ``false`` — размер индекса будет уменьшен наполовину

source: The options in the above chart are also applicable for :doc:`/reference/reference_lua/box_index/alter`.
ru: Параметры из вышеприведенной таблицы также могут использоваться в :doc:`/reference/reference_lua/box_index/alter`.

source: **Note re storage engine:** vinyl has extra options which by default are based on configuration parameters :ref:`vinyl_bloom_fpr <cfg_storage-vinyl_bloom_fpr>`, :ref:`vinyl_page_size <cfg_storage-vinyl_page_size>`, :ref:`vinyl_range_size <cfg_storage-vinyl_range_size>`, :ref:`vinyl_run_count_per_level <cfg_storage-vinyl_run_count_per_level>`, and :ref:`vinyl_run_size_ratio <cfg_storage-vinyl_run_size_ratio>` -- see the description of those parameters. The current values can be seen by selecting from :doc:`/reference/reference_lua/box_space/_index`.
ru: **Примечание про движок базы данных:** в vinyl есть дополнительные параметры, которые по умолчанию основаны на конфигурационных параметрах :ref:`vinyl_bloom_fpr <cfg_storage-vinyl_bloom_fpr>`, :ref:`vinyl_page_size <cfg_storage-vinyl_page_size>`, :ref:`vinyl_range_size <cfg_storage-vinyl_range_size>`, :ref:`vinyl_run_count_per_level <cfg_storage-vinyl_run_count_per_level>` и :ref:`vinyl_run_size_ratio <cfg_storage-vinyl_run_size_ratio>`, см. описание этих параметров. Текущие значения можно увидеть, сделав выборку из :doc:`/reference/reference_lua/box_space/_index`.

source: **Example:**
ru: **Пример:**

source: **Alternative way to declare index parts**
ru: **Другой способ объявления оператора parts**

source: Before version :doc:`2.7.1 </release/2.7.1>`, if an index consisted of a single part and had some options like ``is_nullable`` or ``collation`` and its definition was written as
ru: Если раньше (до версии :doc:`2.7.1 </release/2.7.1>`) индекс состоял из одной части, содержал дополнительные параметры, например ``is_nullable`` или ``collation``, и был описан так:

source: (with the only brackets) then options were ignored by Tarantool.
ru: (с одинарными фигурными скобками), то Tarantool игнорировал эти параметры.

source: Since version :doc:`2.7.1 </release/2.7.1>` it is allowed to omit extra braces in an index definition and use both ways:
ru: Начиная с версии :doc:`2.7.1 </release/2.7.1>`, при описании индекса можно не указывать дополнительные фигурные скобки, но допускаются оба варианта:

source: -- with extra braces my_space:create_index('one_part_idx', {parts = {{1, 'unsigned', is_nullable=true}}}) -- without extra braces my_space:create_index('one_part_idx', {parts = {1, 'unsigned', is_nullable=true}})
ru: -- с дополнительными фигурными скобками my_space:create_index('one_part_idx', {parts = {{1, 'unsigned', is_nullable=true}}}) -- без дополнительных фигурных скобок my_space:create_index('one_part_idx', {parts = {1, 'unsigned', is_nullable=true}})

source: Details about index field types
ru: Описание типов индексируемых полей

source: Index field types differ depending on what values are allowed, and what index types are allowed.
ru: В зависимости от допустимых типов индексов и допустимых значений используются различные типы индексируемых полей.

source: Index field type
ru: Тип поля для индексирования

source: What can be in it
ru: Чем может быть

source: Where it is legal
ru: Где использовать

source: Examples
ru: Примеры

source: unsigned integers between 0 and 18446744073709551615, about 18 quintillion. May also be called 'uint' or 'num', but 'num' is deprecated
ru: беззнаковые целые числа от 0 до 18 446 744 073 709 551 615, то есть примерно 18 квинтиллионов. Также может называться 'uint' или 'num', но 'num' объявлен устаревшим

source: memtx TREE or HASH indexes;
ru: индексы типа TREE или HASH в memtx;

source: vinyl TREE indexes
ru: TREE-индексы в vinyl

source: any set of octets, up to the :ref:`maximum length <limitations_bytes_in_index_key>`. May also be called 'str'. A string may have a :ref:`collation <index-collation>`
ru: любая последовательность октетов до :ref:`максимальной длины <limitations_bytes_in_index_key>`. Также может называться 'str'. В строке может быть :ref:`сортировка <index-collation>`

source: memtx TREE or HASH or BITSET indexes;
ru: индексы типа TREE, HASH или BITSET в memtx;

source: any set of octets, up to the :ref:`maximum length <limitations_bytes_in_index_key>`. A varbinary byte sequence does not have a :ref:`collation <index-collation>` because its contents are not UTF-8 characters
ru: любая последовательность октетов до :ref:`максимальной длины <limitations_bytes_in_index_key>`. Последовательность байтов varbinary не содержит символы UTF-8, поэтому в ней нет :ref:`сортировки <index-collation>`

source: memtx TREE, HASH or BITSET (since version :doc:`2.7.1 </release/2.7.1>`) indexes;
ru: индексы типа TREE, HASH или BITSET в memtx (начиная с версии :doc:`2.7.1 </release/2.7.1>`);

source: integers between -9223372036854775808 and 18446744073709551615. May also be called 'int'
ru: целые числа от -9 223 372 036 854 775 808 до 18 446 744 073 709 551 615. Может также называться 'int'

source: integers between -9223372036854775808 and 18446744073709551615, single-precision floating point numbers, or double-precision floating point numbers, or exact numbers
ru: целые числа от -9 223 372 036 854 775 808 до 18 446 744 073 709 551 615, числа одинарной точности с плавающей запятой, числа двойной точности с плавающей запятой или точные числа

source: double-precision floating point numbers
ru: числа двойной точности с плавающей запятой

source: true or false
ru: true или false

source: exact number returned from a function in the :ref:`decimal <decimal>` module
ru: точное число, которая возвращает функция из модуля :ref:`decimal <decimal>`

source: ``uuid`` (since :doc:`2.4.1 </release/2.4.1>`)
ru: ``uuid`` (с версии :doc:`2.4.1 </release/2.4.1>`)

source: a 128-bit quantity sequence of lower-case hexadecimal digits, representing Universally Unique Identifiers (UUID)
ru: 128-разрядная последовательность шестнадцатеричных чисел нижнего регистра, которая представляет собой Универсальный уникальный идентификатор (UUID)

source: array of numbers
ru: массив чисел

source: memtx :ref:`RTREE <box_index-rtree>` indexes
ru: индексы типа :ref:`RTREE <box_index-rtree>` в memtx

source: null (input with ``msgpack.NULL`` or ``yaml.NULL`` or ``json.NULL``), booleans (true or false), or integers between -9223372036854775808 and 18446744073709551615, or single-precision floating point numbers, or double-precision floating point numbers, or exact numbers, or strings, or (varbinary) byte arrays, or uuids. When there is a mix of types, the key order is: null, then booleans, then numbers, then strings, then byte arrays, then uuids.
ru: null (вводится через ``msgpack.NULL``, ``yaml.NULL`` или ``json.NULL``), логические значения (``true`` или ``false``), целые числа от −9 223 372 036 854 775 808 до 18 446 744 073 709 551 615, числа одинарной и двойной точности с плавающей запятой, точные числа, строки, байтовые массивы (varbinary) или идентификаторы UUID. Если используется несколько типов, порядок ключей следующий: null, логические значения, числа, строки, байтовые массивы, идентификаторы UUID.

source: Additionally, `nil` is allowed with any index field type if :ref:`is_nullable=true <box_space-is_nullable>` is specified
ru: Кроме того, допускается использовать `nil` с любым типом индексируемого поля, если указать :ref:`is_nullable=true <box_space-is_nullable>`

source: Allowing null for an indexed key
ru: Использование null в ключе индекса

source: is_nullable parts option
ru: is_nullable в операторе parts

source: If the index type is TREE, and the index is not the primary index, then the ``parts={...}`` clause may include ``is_nullable=true`` or ``is_nullable=false`` (the default).
ru: Если тип индекса — TREE, а индекс не является первичным, то в оператор ``parts={...}`` можно включить ``is_nullable=true`` или ``is_nullable=false`` (по умолчанию).

source: If ``is_nullable`` is true, then it is legal to insert ``nil`` or an equivalent such as ``msgpack.NULL``. It is also legal to insert nothing at all when using trailing nullable fields. Within indexes, such null values are always treated as equal to other null values, and are always treated as less than non-null values. Nulls may appear multiple times even in a unique index. Example:
ru: Если ``is_nullable=true``, то можно вставить ``nil`` или его эквивалент, например ``msgpack.NULL``. Если завершающие поля допускают null, в них можно вообще ничего не вставлять. В индексах такие значения null всегда считают равными другим значениям null и они всегда меньше, чем отличные от null значения. Null может встречаться несколько раз даже в уникальном индексе. Пример:

source: It is legal to create multiple indexes for the same field with different ``is_nullable`` values, or to call :doc:`/reference/reference_lua/box_space/format` with a different ``is_nullable`` value from what is used for an index. When there is a contradiction, the rule is: null is illegal unless ``is_nullable=true`` for every index and for the space format.
ru: Можно создать несколько индексов для одного и того же поля с различными значениями ``is_nullable`` или вызвать :doc:`/reference/reference_lua/box_space/format` со значением ``is_nullable``, отличным от значения, которое используется для индекса. При наличии несоответствий правило такое: запрещается использовать null, кроме случаев, когда ``is_nullable=true`` для всех индексов и формата спейса.

source: exclude_null parts option
ru: exclude_null в операторе parts

source: Since version 2.8.2 an index part definition may include option ``exclude_null``, which allows an index to skip tuples with null at this part.
ru: Начиная с версии 2.8.2, при описании индекса можно указать параметр ``exclude_null``, чтобы индекс пропускал кортежи со значением null в этой части.

source: By default, the option is set to ``false``. When ``exclude_null`` is turned on, the ``is_nullable=true`` option will be set automatically. It can't be used for the primary key. This option can be changed dynamically: in this case the index is rebuilt.
ru: Значение этого параметра по умолчанию — ``false``. Если включить ``exclude_null``, то ``is_nullable=true`` будет указано автоматически. Для первичного ключа использовать этот параметр нельзя. Параметр можно изменять динамически, и в этом случае индекс будет перестроен.

source: Such indexes do not store filtered tuples at all, so indexing can be done faster.
ru: Такие индексы вообще не хранят отфильтрованные кортежи, поэтому индексирование будет выполняться быстрее.

source: ``exclude_null`` and ``is_nullable`` are connected, so this table describes the result of combining them:
ru: ``exclude_null`` и ``is_nullable`` взаимосвязаны, поэтому ниже приводится таблица допустимых сочетаний значений этих параметров:

source: ok
ru: допускается

source: not allowed
ru: не допускается

source: Creating an index using field names instead of field numbers
ru: Создание индекса с использованием имен полей вместо номеров полей

source: ``create_index()`` can use field names and/or field types described by the optional :doc:`/reference/reference_lua/box_space/format` clause.
ru: ``create_index()`` может использовать имена полей и / или номера полей, которые описаны в необязательном операторе :doc:`/reference/reference_lua/box_space/format`.

source: In the following example, we show ``format()`` for a space that has two columns named 'x' and 'y', and then we show five variations of the ``parts={}`` clause of ``create_index()``, first for the 'x' column, second for both the 'x' and 'y' columns. The variations include omitting the type, using numbers, and adding extra braces.
ru: В следующем примере мы покажем использование ``format()`` для спейса с двумя столбцами 'x' и 'y', а затем — пять вариантов использования оператора ``parts={}`` в ``create_index()`` сначала для столбца 'x', затем для столбцов 'x' и 'y'. Эти варианты включают в себя пропуск типа, использование чисел и дополнительных скобок.

source: Creating an index using the path option for map fields (JSON-path indexes)
ru: Создание индекса с использованием пути для полей с ассоциативными массивами (индексы по пути JSON)

source: To create an index for a field that is a map (a path string and a scalar value), specify the path string during index creation, like this:
ru: Чтобы создать индекс для поля, которое представляет собой ассоциативный массив (строка с путем и скалярное значение), укажите строку c путем во время создания индекса:

source: The index type must be TREE or HASH and the contents of the field must always be maps with the same path.
ru: Тип индекса должен быть TREE или HASH, а содержимое поля — всегда ассоциативный массив с одним и тем же путем.

source: **Example 1 -- The simplest use of path:**
ru: **Пример 1 — Простое использование пути:**

source: **Example 2 -- path plus format() plus JSON syntax to add clarity:**
ru: **Пример 2 — для большей наглядности используем path вместе с format() и JSON-синтаксисом:**

source: **Note re storage engine:** vinyl supports only the TREE index type, and vinyl secondary indexes must be created before tuples are inserted.
ru: **Примечание про движок базы данных:** vinyl поддерживает только TREE-индексы, и следует создать в vinyl'е вторичные индексы до вставки кортежей.

source: Creating a multikey index using the path option with [*]
ru: Создание индекса по массивам (multikey) с использованием опции path с символом [*]

source: The string in a path option can contain ``[*]`` which is called **an array index placeholder**. Indexes defined with this are useful for JSON documents that all have the same structure.
ru: Строка в параметре пути может содержать символ ``[*]``, который называется **заменителем индекса массива**. Описанные так индексы используются для JSON-документов, у которых одинаковая структура.

source: For example, when creating an index on field#2 for a string document that will start with ``{'data': [{'name': '...'}, {'name': '...'}]``, the parts section in the ``create_index`` request could look like:
ru: Например, при создании индекса по полю №2 для документа со строками, который будет начинаться с ``{'data': [{'name': '...'}, {'name': '...'}]``, раздел parts в запросе на создание индекса будет выглядеть так:

source: Then tuples containing names can be retrieved quickly with ``index_object:select({key-value})``.
ru: Тогда кортежи с именами можно быстро получить с помощью ``index_object:select({key-value})``.

source: In fact a single field can have multiple keys, as in this example which retrieves the same tuple twice because there are two keys 'A' and 'B' which both match the request:
ru: На самом деле в одном поле может быть несколько ключей, как в примере ниже, который выводит один и тот же кортеж дважды, потому что оба ключа 'A' и 'B' соответствуют запросу:

source: The result of the select request looks like this:
ru: Результат выборки будет выглядеть так:

source: Some restrictions exist:
ru: Есть некоторые ограничения:

source: ``[*]`` must be alone or must be at the end of a name in the path.
ru: символ ``[*]`` должен стоять отдельно или в конце имени в пути.

source: ``[*]`` must not appear twice in the path.
ru: символ ``[*]`` не должен повторяться в пути.

source: If an index has a path with ``x[*]``, then no other index can have a path with x.component.
ru: Если в индексе есть путь с ``x[*]``, то в никаком другом индексе не может быть пути с x.компонентом,

source: ``[*]`` must not appear in the path of a primary key.
ru: ``[*]`` нельзя указывать в пути первичного ключа.

source: If an index has ``unique=true`` and has a path with ``[*]``, then duplicate keys from different tuples are disallowed, but duplicate keys for the same tuple are allowed.
ru: Если индекс должен быть уникальным (``unique=true``) и в нем есть путь с символом ``[*]``, то запрещается использовать дублирующиеся ключи в разных кортежах, но в в одном кортеже можно использовать дублирующиеся ключи.

source: The field's value must have the same structure as in the path definition, or be nil (nil is not indexed).
ru: Структура значения поля должна соответствовать стуктуре, заданной в определении пути, или значение поля должно быть nil (nil не индексируется).

source: In a space with multikey indexes, any tuple cannot contain :ref:`more than ~8,000 elements <limitations_fields_in_tuple_multikey_index>` indexed that way.
ru: В спейсе с индексами по массивам можно хранить не более :ref:`~8000 элементов <limitations_fields_in_tuple_multikey_index>`, проиндексированных таким образом.

source: Creating a functional index
ru: Создание функционального индекса

source: Functional indexes are indexes that call a user-defined function for forming the index key, rather than depending entirely on the Tarantool default formation. Functional indexes are useful for condensing or truncating or reversing or any other way that users want to customize the index.
ru: Функциональные индексы — это индексы, которые вызывают пользовательскую функцию для формирования ключа индекса, в отличие от других типов индексов, где ключ формирует сам Tarantool. Функциональные индексы используют для сжатия, усечения или реверсирования или любого другого изменения индекса по желанию пользователя.

source: There are several recommendations for building functional indexes:
ru: Ниже приведены рекомендации по созданию функциональных индексов:

source: The function definition must expect a tuple, which has the contents of fields at the time a data-change request happens and must return a tuple, which has the contents that will actually be put in the index.
ru: Функция должна принимать кортеж с содержимым полей на момент запроса на изменение данных и возвращать кортеж с содержимым, которое будет фактически помещено в индекс.
