Repository: tarantool/doc
Catalog: locale/*/LC_MESSAGES/reference/reference_lua/box_space/create_index.po
Languages: ru

source: The ``create_index`` definition must include specification of all key parts, and the custom function must return a table which has the same number of key parts with the same types.
ru: Описание ``create_index`` должно включать в себя определение всех частей ключа, а пользовательская функция должна возвращать таблицу, которая содержит то же количество частей ключа с теми же типами.

source: The space must have a memtx engine.
ru: Спейс должен быть на движке memtx.

source: The function must be persistent and deterministic (see :ref:`Creating a function with body <box_schema-func_create_with-body>`).
ru: Функция должна быть персистентной и детерминированной (см. :ref:`Создание функции с телом <box_schema-func_create_with-body>`).

source: The key parts must not depend on JSON paths.
ru: Части ключа не должны зависеть от JSON-путей.

source: The function must access key-part values by index, not by field name.
ru: Функция должна получать доступ к значениям частей ключа по индексу, а не по имени поля.

source: Functional indexes must not be primary-key indexes.
ru: Функциональные индексы не должны быть по первичному ключу.

source: Functional indexes cannot be altered and the function cannot be changed if it is used for an index, so the only way to change them is to drop the index and create it again.
ru: Нельзя изменить ни функциональные индексы, ни функцию, если она используется для индекса, то есть единственный способ изменить их — это удалить индекс и создать его заново.

source: Only :ref:`sandboxed <box_schema-func_create_with-body>` functions are suitable for functional indexes.
ru: Только функции, :ref:`запущенные из песочницы <box_schema-func_create_with-body>`, могут использоваться в функциональных индексах.

source: A function could make a key using only the first letter of a string field.
ru: Функция может создать ключ, используя только первую букву строкового поля.

source: Create a space. The space needs a primary-key field, which is not the field that we will use for the functional index:
ru: Создайте спейс. В спейсе должно быть поле с первичным ключом, которое не будет полем для функционального индекса:

source: Create a function. The function expects a tuple. In this example, it will work on tuple[2] because the key source is field number 2 in what we will insert. Use ``string.sub()`` from the ``string`` module to get the first character:
ru: Создайте функцию. Функция принимает кортеж. В этом примере она работает на кортеже tuple[2], поскольку источник ключа — поле номер 2, в которое мы вставляем данные. Используйте ``string.sub()`` из модуля ``string``, чтобы получить первый символ:

source: Make the function persistent using the ``box.schema.func.create`` function:
ru: Сделайте функцию персистентной с помощью ``box.schema.create``:

source: Make a functional index. Specify the fields whose values will be passed to the function. Specify the function:
ru: Создайте функциональный индекс. Укажите поля, значения которых будут передаваться в функцию. Укажите функцию:

source: Test. Insert a few tuples. Select using only the first letter, it will work because that is the key. Or, select using the same function as was used for insertion:
ru: Проверьте, как это работает. Вставьте несколько кортежей. Сделайте выборку, используя только первую букву, — сработает, потому что это и есть ключ. Или выберите, используя ту же функцию, что была использована для вставки:

source: The results of the two ``select`` requests will look like this:
ru: Результаты двух запросов ``select`` будут выглядеть так:

source: Here is the full code of the example:
ru: Вот пример кода полностью:

source: Functions for functional indexes can return **multiple keys**. Such functions are called "multikey" functions.
ru: Функции для функциональных индексов могут возвращать **множество ключей**. Такие функции называют "мультиключевыми" (multikey).

source: The ``box.func.create`` options must include ``opts = {is_multikey = true}``. The return value must be a table of tuples. If a multikey function returns N tuples, then N keys will be added to the index.
ru: В таком случае в ``box.func.create`` надо включить ``opts = {is_multikey = true}``. Возвращается таблица с кортежами. Если мультиключевая функция возвращает N кортежей, то в индекс добавятся N ключей.

source: s = box.schema.space.create('withdata') s:format({{name = 'name', type = 'string'}, {name = 'address', type = 'string'}}) pk = s:create_index('name', {parts = {{field = 1, type = 'string'}}}) lua_code = [[function(tuple) local address = string.split(tuple[2]) local ret = {} for _, v in pairs(address) do table.insert(ret, {utf8.upper(v)}) end return ret end]] box.schema.func.create('address', {body = lua_code, is_deterministic = true, is_sandboxed = true, opts = {is_multikey = true}}) idx = s:create_index('addr', {unique = false, func = 'address', parts = {{field = 1, type = 'string', collation = 'unicode_ci'}}}) s:insert({"James", "SIS Building Lambeth London UK"}) s:insert({"Sherlock", "221B Baker St Marylebone London NW1 6XE UK"}) idx:select('Uk') -- Both tuples will be returned.
ru: s = box.schema.space.create('withdata') s:format({{name = 'name', type = 'string'}, {name = 'address', type = 'string'}}) pk = s:create_index('name', {parts = {{field = 1, type = 'string'}}}) lua_code = [[function(tuple) local address = string.split(tuple[2]) local ret = {} for _, v in pairs(address) do table.insert(ret, {utf8.upper(v)}) end return ret end]] box.schema.func.create('address', {body = lua_code, is_deterministic = true, is_sandboxed = true, opts = {is_multikey = true}}) idx = s:create_index('addr', {unique = false, func = 'address', parts = {{field = 1, type = 'string', collation = 'unicode_ci'}}}) s:insert({"James", "SIS Building Lambeth London UK"}) s:insert({"Sherlock", "221B Baker St Marylebone London NW1 6XE UK"}) idx:select('Uk') -- Вернутся оба кортежа.
