Repository: tarantool/doc
Catalog: locale/*/LC_MESSAGES/reference/reference_lua/box_space/system_views.po
Languages: ru

source: System space views
ru: Представления системных спейсов

source: A system space view, also called a 'sysview', is a restricted read-only copy of a system space.
ru: Представление системного спейса (или 'sysview') --- копия системного спейса с доступом только для чтения.

source: The system space views and the system spaces that they are associated with are: |br| ``_vcollation``, a view of :ref:`_collation <box_space-collation>`, |br| ``_vfunc``, a view of :ref:`_func <box_space-func>`, |br| ``_vindex``, a view of :ref:`_index <box_space-index>`, |br| ``_vpriv``, a view of :ref:`_priv <box_space-priv>`, |br| ``_vsequence``, a view of :ref:`_sequence <box_space-sequence>`, |br| ``_vspace``, a view of :ref:`_space <box_space-space>`, |br| ``_vuser``, a view of :ref:`_user <box_space-user>`.
ru: Представления системных спейсов и связанные с ними системные спейсы: |br| ``_vcollation`` --- представление спейса :ref:`_collation <box_space-collation>`; |br| ``_vfunc`` --- представление спейса :ref:`_func <box_space-func>`; |br| ``_vindex`` --- представление спейса :ref:`_index <box_space-index>`; |br| ``_vpriv`` --- представление спейса :ref:`_priv <box_space-priv>`; |br| ``_vsequence`` --- представление спейса :ref:`_sequence <box_space-sequence>`; |br| ``_vspace`` --- представление спейса :ref:`_space <box_space-space>`; |br| ``_vuser`` --- представление спейса :ref:`_user <box_space-user>`.

source: The structure of a system space view's tuples is identical to the structure of the associated space's tuples. However, the privileges for a system space view are usually different. By default, ordinary users do not have any privileges for most system spaces, but have a 'read' privilege for system space views.
ru: Структура кортежей в представлении системного спейса идентична структуре кортежам соответствующего спейса. Однако права там обычно отличаются. По умолчанию у обычных пользователей в большинстве системных спейсов нет никаких прав, однако в представлениях системных спейсов у них есть право чтения.

source: Typically this is the default situation: |br| * :ref:`The 'public' role <box_space-user>` has 'read' privilege on all system space views because that is the situation when the database is first created. |br| * All users have the 'public' role, because it is granted to them automatically during :ref:`box.schema.user.create() <box_schema-user_create>`. |br| * The system space view will contain the tuples in the associated system space, if and only if the user has a privilege for the object named in the tuple. |br| Unless administrators change the privileges, the effect is that non-administrator users cannot access the system space, but they can access the system space view, which shows only the objects that they can access.
ru: Ситуация по умолчанию: |br| * :ref:`У роли 'public' <box_space-user>` есть право 'read' во всех представлениях системных спейсов, потому что именно так обстоят дела при создании базы данных. |br| * У всех пользователей есть роль 'public', потому что она назначается им автоматически при выполнении :ref:`box.schema.user.create() <box_schema-user_create>`. |br| * В представлении системного спейса будут содержаться кортежи соответствующего системного спейса, только если у пользователя есть право, связанное с объектом, упомянутом в кортеже. |br| Как результат, если администраторы не изменят права, у остальных пользователей не будет доступа к системному спейсу, но будет доступ к представлению системного спейса, где видны только доступные им объекты.

source: For example, typically, the 'admin' user can do anything with ``_space`` and ``_vspace`` looks the same as ``_space``. But the 'guest' user can only read ``_vspace``, and ``_vspace`` contains fewer tuples than ``_space``. Therefore in most installations the 'guest' user should select from ``_vspace`` to get a list of spaces.
ru: Например, пользователь 'admin' обычно имеет полный доступ к спейсу ``_space``, поэтому и ``_vspace`` для него выглядит как ``_space``. А 'guest' имеет только право на чтение ``_vspace``, так что ``_vspace`` для него содержит меньше кортежей, чем ``_space``. Поэтому в большинстве систем пользователю 'guest' чтобы получить список спейсов, следует делать выборку из ``_vspace``.

source: **Example:**
ru: **Пример**

source: This example shows the difference between ``_vuser`` and ``_user``. We have explained that: If the user has the full set of privileges (like 'admin'), the contents of ``_vuser`` match the contents of ``_user``. If the user has limited access, ``_vuser`` contains only tuples accessible to this user.
ru: В этом примере рассмотрим разницу между ``_vuser`` и ``_user``. Представление ``_vuser`` содержит только кортежи, которые доступны текущему пользователю. Если же у пользователя есть полный набор прав (как у пользователя 'admin'), то содержимое ``_vuser`` совпадает с содержимым ``_user``.

source: To see how ``_vuser`` works, :ref:`connect to a Tarantool database remotely <connecting-remotely>` via ``net.box`` and select all tuples from the ``_user`` space, both when the 'guest' user *is* and *is not* allowed to read from the database.
ru: Чтобы проверить, как работает ``_vuser``, :ref:`удаленно подключитесь к базе данных Tarantool <connecting-remotely>` с помощью ``net.box`` и сделайте выборку кортежей из спейса ``_user`` в двух случаях: когда у пользователя 'guest' *есть* право на чтение данных из базы и когда его *нет* .

source: First, start Tarantool and grant read, write and execute privileges to the ``guest`` user:
ru: Запустите Tarantool и назначьте права read, write и execute пользователю ``guest``:

source: Switch to the other terminal, connect to the Tarantool instance and select all tuples from the ``_user`` space:
ru: Переключитесь на другой терминал, подключитесь к экземпляру Tarantool и выберите все кортежи из спейса ``_user``:

source: This result contains the same set of users as if you made the request from your Tarantool instance as 'admin'.
ru: Будут показаны те же пользователи, как если бы вы отправили запрос из своего экземпляра Tarantool как 'admin'.

source: Switch to the first terminal and revoke the read privileges from the 'guest' user:
ru: Переключитесь на первый терминал и отзовите право read у пользователя 'guest':

source: Switch to the other terminal, stop the session (to stop ``tarantool`` type Ctrl+C or Ctrl+D), start again, connect again, and repeat the ``conn.space._user:select{}`` request. The access is denied:
ru: Переключитесь на другой терминал, остановите сессию (чтобы остановить ``tarantool``, нажмите Ctrl+C или Ctrl+D), запустите и подключитесь снова, а затем повторите запрос ``conn.space._user:select{}``. Доступ будет запрещен:

source: However, if you select from ``_vuser`` instead, the users' data available for the 'guest' user is displayed:
ru: Однако если вместо этого сделать select из ``_vuser``, появятся данные пользователей, доступные пользователю 'guest':
